{"title": "rice vs cornell concerns", "comments": ["<b>Username: Modulation</b><br><br>I've been obsessed with Rice for a long time and was basically 90% sure I was going. But after visiting Cornell, I was quite impressed with their academics and am totally doubting my previous feelings toward Rice.<br><br>", "<b>Username: centimeters</b><br><br>Living on the East Coast, I'm used to people's blank stares and confused looks when I say I'm going to Rice. In terms of what other people are saying to you, they might just think that Cornell is the obvious choice because they don't know much/anything about Rice.<br><br>Academically, Rice and Cornell's engineering programs are equal (in my opinion), but you might get more opportunities at Rice because of its size. At Cornell, since there are basically billions of undergrads, you'd have to work much harder in order to stand out and take advantage of opportunities.<br><br>I've also heard that at Cornell there is really cutthroat competition over curved grades.<br><br>In terms of Rice feeling small to you after four years, I can't really relate because my high school is tiny, but if you start out \"loving the small campus feel\" I can't see why you would like Cornell's campus, which is completely the opposite.<br><br>Obviously I'm biased but these are just my opinions!<br><br>", "<b>Username: Senior0991</b><br><br>Cornell is good in engineering, and Rice is also good in engineering. Cornell is more regarded, but not by much. At both schools, you should learn similar material, be around equally qualified students, and have similarly good professors. I think at Rice classes will be smaller and you will have a great opportunity for research with the Century thing. Cornell has more engineering clubs, I think, if you're into that. I don't think its crazy to choose Rice over Cornell. I was going to choose Rice Engineering over Cal engineering.<br><br>Oh yeah, and about the competition thing, I heard Cornell has really tough cruves as well to weed out the weaker engineering students.<br><br>", "<b>Username: blackeyedsusan</b><br><br>Along the lines of centimeter's comments -- I agree that Rice engineering is on par with Cornell, those who count (as in grad schools and employers) are familiar with Rice, you have more of a chance to be connected and shine at Rice (especially if you are a Century scholar and can start research as a first semester freshman), and Rice's engineering is more collaborative and less cut-throat. My son is a sophomore at Rice and turned down Cornell. He's had incredible opportunities and is going to be published soon as a result of his research as a Century scholar. One of his professors used to teach at Cornell and she said that the students at Cornell care more about the grades, while students at Rice care more about learning.<br><br>", "<b>Username: sffhgoalie73</b><br><br>Everyone acted like it was crazy for me to choose Rice over Penn last year, but I did it anyway and love it here.<br><br>", "<b>Username: kate10662</b><br><br>Cornell has a higher ranked engineering program, but Rice is less competitive. In terms of research opportunties, they both have great opportunities. Cornell has an excellent co-op program, while Rice has more undergrad research. They're both great schools for grad school. If you want to go to an ivy grad school, Cornell would probably be better. Rice is really hot and humid and Cornell is really cold, but I don't think it's any colder than MN.<br><br>", "<b>Username: blackeyedsusan</b><br><br>I'd trade a January or February day in Houston for a January or February day in Ithaca any time! Houston isn't hot or humid then. Remember that the worst months for weather in Houston during the school year will be August and September. After that, it's really rather pleasant.<br><br>", "<b>Username: hotasice</b><br><br>Seriously, both are great schools and you'll be getting a fine education at either. But in the end, it's YOU who will be going to college so it's your decision that matters the most. If you truly like Rice more than Cornell, go to Rice. If you like Cornell better, go to Cornell.<br><br>Both institutions will give you a fantastic engineering experience either way.<br><br>This is a little anecdotal, but my friend at Cornell is an engineer and he hates it there because it's so competitive and he's planning to transfer out next year. I think overall Rice kids are happier than Cornell kids, but to each his own.<br><br>", "<b>Username: BaystateNutmeg</b><br><br>Here is a link to Rice's post graduate survey for the class of 2007.<br><url>http://cspd.rice.edu/emplibrary/Post%20Graduate%20Survey%202007.pdf</url><br>If you scroll through the information, you can find out where respondents went to work or grad school. They even break it down by major. Rice seems well respected in academics and in major companies.<br><br>", "<b>Username: TheFutureIsHere</b><br><br>I had the same concerns, and ended up picking Rice over 3 higher-ranked and better-known schools. The reputation (or lack thereof) shouldn't strongly affect your success after graduation. I know rice has a great rep amongst grad schools, as you can probably see by the link in the above post. They both have great engineering programs, and since Rice is small there won't be a million kids fighting you for research positions. I know Rice has a summer research thing that pays. Plus, Rice kids are happier than Cornell kids, from what I've heard. AND Rice gave you money... seems like an easy decision to me.<br><br><br>p.s.<br>\"I want to drink/have sex but meeting new people is fun too.\" --> hahaha, that's how I felt when I visited Duke<br><br>", "<b>Username: anxiousmom</b><br><br>Honestly, the differences in rankings between the top programs are not significant, and Rice grads do amazingly well with grad school placement. DS easily turned down UT-Austin honors engineering even though it is slightly higher ranked than Rice. He knew that he would get more attention, assistance, research opportunities, mentoring, plus have a great time at Rice. (And honestly, do you think employers or grad school departments look at your resume and say: \"Bobby here went to the 9th ranked Chem E program, so he will be a better employee than Joan, who went to the 14th ranked program\"? Heck no! They say, \"Joan has been researching amino acid clusters with Prof E. and presented a paper at this conference and has 3 years of summer lab experience and a semester internship with megachem corporation, great recs from my good friend Prof F, and her proposal would make her a strong candidate for our PHD department. --- likewise when evaluating Bobby. Rankings are not very meaningful. Experiences, research, network connections, etc are. BTW: DS is doing research full-time this summer with Environmental Eng. prof, in spite of not having any research experience, and he is being sent out-of-state for specialized training, too. There are so many opportunities at Rice and abroad. (Have you checked out Rice Engineers-without-borders?)<br><br>", "<b>Username: monydad</b><br><br>you might find Cornell engineering is more heavily recruited, based on posts I've read from Rice engineering alum aibarr on CC. And perhaps less regionally focused. On the other hand, grad school placement from Rice may not suffer at all.<br><br>Suggest check registrar's course listings to compare the breadth and depth of engineering, and other, course offerings available at each school. What you can learn someplace bears some relation to what they teach there.<br><br>", "<b>Username: blueducky</b><br><br>Modulation, we are in the same situation once again, except I have UCB's in-state tuition to think about too and I didn't get the Century thing from Rice. Tell me which school you decide!<br><br>", "<b>Username: NYSkins1</b><br><br>Re: the college system <br><br>Anyone who tells you that the college system is limiting socially is either really closed-minded, bitter, or lazy. The college system encourages you to get to know people that you wouldn't otherwise, and then it's your choice to branch beyond the college (and it's really easy to do so).<br><br>", "<b>Username: Hermes</b><br><br>It sounds like you really want to go to Rice, and I think you should go with your gut. Rice and Cornell are pretty much on par for undergraduate academics in almost every comparable department, including engineering. But you'll be happier at Rice. I think most people would be.<br><br>Something to keep in mind when everyone you know is telling you that going to Cornell over Rice is a no-brainer:<br><br>Sure Cornell may be ranked higher and have a stronger reputation in the north (incl. Minnesota), but keep in mind that Rice engineering is king in the south. I grew up in the south, and I wanted to be a ChemE for a while in high school. The only schools I looked at for engineering were Georgia Tech, Virginia Tech, Texas, Stanford, MIT, Duke, Caltech and Rice. Maybe [probably] I was naive, but I didn't know anything about Cornell being as good as those schools for engineering until I met some kids from the northeast at Rice! A lot of southerners don't even know that Cornell is in New York, let alone the fact that it's an Ivy--it's just one of those \"good northern schools\" that people hear about occasionally, but never really pay attention to. Rice in general, and engineering at GT or UT have better reputations down here. And if you're dreading 4 more years of snow and misery already, chances are you'll end up living in the south for a good chunk of your life after college. This whole reputation issue, of course, excludes the most important people: your future top-notch employers, grad schools, and highly educated peers. These people will know how great both Rice and Cornell are. So, in the end, it doesn't really matter, but just know your friends and parents and teachers probably have understandably skewed perspectives because you live in the north.<br><br>Plus, Cornell is really cut-throat and huge and cold and depressing. Ithaca is in the middle of nowhere... isn't there some infamous waterfall that students jump off to commit suicide? People at Rice are warm and happy. A friend of mine goes to Cornell and says, \"Cornell: Where Hell really does freeze over for 5 months of the year.\"<br><br>", "<b>Username: Modulation</b><br><br>Thanks for all the insights!! I THINK I'm going to go to Rice...<br><br>The big and cold campus at Cornell is a major turn off. I'm pretty sure I would have an equal chance of getting into Stanford or MIT for engineering grad school at either Rice or Cornell.<br><br>", "<b>Username: monydad</b><br><br>For those otherwise oriented, the campus should be a major turn -ON.<br><br><a href=\"http://en.wikipedia.org/wiki/File:Ithaca_Hemlock_Gorge.JPG\" rel=\"nofollow\">File:Ithaca Hemlock Gorge.JPG - Wikipedia, the free encyclopedia</a><br><a href=\"http://www.pbase.com/unexplained_bacon/ithaca_area\" rel=\"nofollow\">Around Ithaca, New York Photo Gallery by Unexplained Bacon at pbase.com</a><br><a href=\"http://www.cornell.edu/tours/scene308f.html\" rel=\"nofollow\">Explore Cornell - Natural Beauty - Introduction</a><br><br>The campus seems large initially only until you understand that there are whole large areas of it that you need never go or master, based on your areas of study. This process happens very quickly. However, these other areas provide you with additional challenges, so in the upperclass years there remain new vistas to explore, rather than getting stale and bored at a small school.<br><br>It's true that it gets cold there. You may find MIT gets cold as well.<br><br>Your grad school chances may indeed be equivalent, but you may want to check the course listings to see the extent of the options you will have in each case to inform your chosen path along the way.<br><br>", "<b>Username: kskywr</b><br><br>I think your decision should depend on what you want to do after you graduate. If you want to stay in Houston or anywhere in Texas, you should definitely go to Rice. People in Houston treat Rice grads like gods. If you want to go to grad school you should also pick Rice. If you plan on living in any other state and working right after undergrad, you should pick Cornell. Its reputation far outweighs Rice's. It shouldn't, but it does. The thing is, most people don't read the rankings.<br><br>", "<b>Username: Modulation</b><br><br>Well, I've already chosen Rice. I hope I made the right choice. Thanks again, everyone. =]<br><br>", "<b>Username: tomackze</b><br><br>we are so glad you did too Modulation :)<br><br>", "<b>Username: Christian2</b><br><br>You made the right choice, Rice is a great school.<br><br>", "<b>Username: nsrjsyt</b><br><br>for undergraduate study, RICE is better than Cornell in general.<br><br>", "<b>Username: Soulside Journey</b><br><br>As has already been said, those whose opinions count hold Rice in very high esteem. I'm personally exasperated after countless occasions of attempting to explain to someone WHAT and where Rice is, much less convince them of its academic strength, so I've simply given up. But my teachers, guidance counselors, friends' parents, the manager of the bank I use, in other words, the people who know what's going on, respect Rice.<br><br>", "<b>Username: amdn</b><br><br>Same boat about a month ago<br>I went over to Cornell for diversity hosting weekend and it sure the engineering was impressive<br>I also went to a frat party and ya it was pretty cool<br>but I chose Rice in the end<br>I'm from Arkansas, I dont want to live in cold weather practically year round!<br><br>", "<b>Username: Modulation</b><br><br>^oh cool! I went to the SWE (society of women engineers) event at Cornell and saw some DHW people! I also went to a frat party... fun party and impressive engineering program. But seriously! Those kids work SO hard, so unnecessarily hard.<br><br>But yeah, RICE!! &lt;3<br><br>", "<b>Username: amdn</b><br><br>Guess I'll see you at O-week Modulation<br><br>my name is andrew btw<br><br>", "<b>Username: anxiousmom</b><br><br>\"\"Those kids work SO hard, so unnecessarily hard.\"\"<br>I'm afraid that Rice students work very hard, too - but I think that they feel supported, and that they take care to balance their work with play.<br><br>", "<b>Username: Modulation</b><br><br>^Yeah, but Cornell students sounded MISERABLE when talking about school, especially the tough curve. I'm sure Rice students are happier. =]<br><br>", "<b>Username: lilypuppy</b><br><br>yes, we rice kids definitely are very happy. Happy indeed. Rice is a great choice - I'm glad you chose it!<br><br>", "<b>Username: Modulation</b><br><br>It's SUPER weird how I can put faces to CC names now...<br><br>", "<b>Username: Soulside Journey</b><br><br>Yeah, stop it, it's embarrassing. :P<br><br>", "<b>Username: SchoolAdvice</b><br><br>I'm not sure if any of you are still even on CC, but I would like to ask some similar advice. I was wondering whether you guys can give me an opinion on the difficulty of Rice vs. UT Austin. I love Rice, but it costs a LOT more for me and I need advice on whether I should attend.<br><br>I am concerned that my GPA in engineering will be much lower at Rice than UT and would preclude me from getting a job later on. Do you guys know what the average Chem Eng or Mech Eng undergrad GPA is at Rice? Would it hurt to go to Rice over UT (I am assuming UT is easier but may be wrong). How hard is it to succeed at Rice and get a good job compared with UT undergrads? I love Rice and really want to go, but I am really concerned that my GPA will be significantly lower and will keep me out of getting into good grad school or even a job for that matter. In your experience was there enough time to sleep or have a social life? How does it compare to the IB program in terms of difficulty? Please give me your advice on this. Thank you so much!<br><br>My other post: <url>http://talk.collegeconfidential.com/rice-university/1124697-rice-vs-ut-austin-chem-mech-engineering-undergrad.html</url><br><br>", "<b>Username: Antarius</b><br><br>This is a Rice vs. Cornell thread from 2 years ago. Why is this being bumped?<br><br>", "<b>Username: SchoolAdvice</b><br><br>Sorry about that. I was hoping some of the members of this thread were still active and could give me some insight. And thank you very much for all the great answers Antarius. They have helped me a great deal! :D<br><br>", "<b>Username: Antarius</b><br><br>You are welcome. It is usually easier to start a new thread because no one knows/remembers what was posted here. And information changes significantly in 2 years (especially fin. aid)<br><br>", "<b>Username: Swimmer726</b><br><br>WRONG, on many counts. We just left Cornell Days up in Ithaca. We took tours of engineering quad and spoke to many engineering students. We also talked to a chemical engineering professor, who was amazing. The environment is NOT cutthroat! Everything is collaborative - the problem sets, the projects, everything. Plus, the students are welcoming and supportive of each other. The professor told us that it's really not about an engineering grad's GPA, it's about the school he came from and the things he did outside of school that gets him/her good jobs. I was hugely relieved and excited for our son when we left. It seems like there is a lot of teamwork and the engineering community actually looks like it has a lot of fun. Plus, 40% of my son's entering class will be female, which is very exciting. I think \"cutthroat\" can be used to described to pre-med kids at EVERY school.<br><br>Cornell also has 13 engineering majors. Rice doesn't have that. Cornell's Operations Research major in engineering (sort of an undergraduate financial engineering field) is one of the best in the country - great for those who want an enhanced business major. I would DEFINITELY pick Cornell. Rice is also highly ranked, but I think Cornell has more bang for the buck. Yes, the weather in Houston is almost intolerable most of the year. Spent much time there - it's pretty hot and uncomfortable.<br><br>", "<b>Username: Owl2014</b><br><br>Cornell and Rice are completely different schools. One is huge and kind of gross, and Rice is small and beautiful. One is also the butt of jokes. Take that for what it's worth. I wouldn't ever change my mind to come to Rice over Cornell.<br><br>", "<b>Username: monydad</b><br><br>\"..kind of gross\"<br><br>yeah it's disgusting<br><br><url>http://www.****/photos/<span class=\"__cf_email__\" data-cfemail=\"93a4a3a3a5a0a1a6aad3dda3a3\">[emailprotected]</span>/188779972/]Waterfall</url> ---- Ithaca, NY | Flickr - Photo Sharing![/url]<br><a href=\"http://mybt.budgettravel.com/_Taughannock-Falls-Ithaca-NY/photo/2046974/21864.html\" rel=\"nofollow\">Taughannock Falls, Ithaca, NY - My Budget Travel Photo</a><br><a href=\"http://replay.waybackmachine.org/20090223211109/http://pbase.com/unexplained_bacon/ithaca_area\" rel=\"nofollow\">Around Ithaca, New York Photo Gallery by Unexplained Bacon at pbase.com</a><br><a href=\"http://www.cornell.edu/tours/scene308f.html\" rel=\"nofollow\">Explore Cornell - Natural Beauty - Introduction</a><br><br>(sheesh,where do people get this stuff..)<br><br>", "<b>Username: FallenAngel9</b><br><br>I agree with monydad, Cornell has one of the most gorgeous campuses I've ever seen. That said, it is also extremely cold up there during a large portion of the year, while Houston is the exact opposite, so if weather is a factor for anyone, they should take note of that.<br><br>Now that the application season is over, I regret not applying to Cornell, though I probably would have ended up attending Rice anyway (if I was even accepted to Cornell that is haha).<br><br>", "<b>Username: Antarius</b><br><br>This is the Rice forum, I understand that we are passionate about our school and think it is a great choice. There is no reason, and I mean absolutely NO reason to drag schools such as Cornell in the mud.<br><br>My personal beef with Cornell is that they lost my application three times. Other than that, I have heard it is a great school suited to a certain type of person, much like Rice is.<br><br>", "<b>Username: rymd</b><br><br>I don't think you can go wrong with either. Personal preference and secondary factors then...<br><br>", "<b>Username: Iwannabeavet</b><br><br>\" One is also the butt of jokes.\"<br>Trust me, Cornell wouldn't want you either.<br>And for all those who think Houston is a major city...I've lived here for 15 years. IT. SUCKS. Weather SUCKS, I think I completely prefer the cold than the nasty humidity that occurs ALL THE TIME. Texas is completely bipolar. There is NOTHING to do in Houston. My family is made of money, but I still find weekends where there is absolutely nothing to do in Houston. It' hardly a city. You need to take a car everywhere you go and drive long-ass distances.<br>And at every school you go to, there are going to be happy and unhappy people.<br>I know people that went to Rice and they're not happy. A lot of them are teachers..and most of them have to stay down here in Texas for jobs. Do you really want to live in Texas the rest of your life?<br>And as to weather..it is not nice. Nice weather is California. Houston, Texas is not nice weather. Whoever tells you that is a lie. Also, you should be studying most of the time in both schools, so you should consider academics more that weather. Rice campus is small, and you may get over it in a couple months. Cornell Campus is huge, and you'll feel that youre part of something big. Whichever one is your preference. As for academics, Cornell will prepare you for pretty much everything, and guess what? Future employers do know that and recognize that.<br>Not trying to be mean, but do not get swayed by Houston, because the city is nootttt that great. :D gl<br><br>", "<b>Username: mogrimoogle</b><br><br>Wow, I usually avoid confrontation and I hate to bump an old thread, but this guy that is putting down Houston by saying \"it's hardly a city\" must be blind. I agree the weather is bipolar and humid, but there are more than enough things to do in Houston that make up for it. Rice even offers their students free admission to surrounding museums and free metro/light rail passes to explore the city. Cornell may be nice too, but apparently they've got some stuck up individuals attending their school. After all, who flagrantly admits that they are from a \"family made of money\"?<br><br>The two campuses are very different. There are pros and cons to both.<br><br>", "<b>Username: Antarius</b><br><br>\"\"My family is made of money, but I still find weekends where there is absolutely nothing to do in Houston. It' hardly a city.\"\"<br><br>As opposed to Ithaca?<br><br>****<br><br>", "<b>Username: jym626</b><br><br>Anyone wnt ot go out on a limb and guess where the poster in post #42 goes to school? Hint-- it starts with a \"C\" and ends with an \"L\"<br><br>", "<b>Username: Antarius</b><br><br>\"\"Anyone wnt ot go out on a limb and guess where the poster in post #42 goes to school? Hint-- it starts with a \"C\" and ends with an \"L\"\"\"<br><br>Or where he probably didn't get in? (Starts with an \"R\" and ends in an \"E\")<br><br>", "<b>Username: jym626</b><br><br>^ ROSE (Hulman)? :D ;)<br><br>", "<b>Username: dragon2owl</b><br><br>The weather is a bit bipolar, but I don't really mind wearing shorts in December. Nothing to do in Houston? You have Rice Village, Miller Outdoor Theatre (FREE concerts, operas, msuicals), the Museum District (18 museums within a 1.5 mile radius), Reliant Center, Toyota Center, Minute Miad, Montrose area, Midtown, Theatre District...all of this within 10-15 mins of Rice campus. And Rice provides many discounts, if not free, tickets to events all nearby. I find most people in Houston, and Texas, to be happy. Why not live in Texas? Houston is one of the top places for recent graduates to work. Who says you should be studying most of your time in college? Most of my learning happened outside of class at Rice. My college experience there was amazing and it was because of people, the culture, the atmosphere, the traditions, events, the bonding, I can go on, but not enought time. The academics were just the icing on the cake. Rice campus is small, but that's what makes it special. You're in a huge city, but you feel like you are at a home, not a school. Wouldn't a huge campus make you feel like you are just another number? I can guarantee employers know Rice, 'nuff said.<br><br>"]}