{"title": "boston university vs university of michigan", "comments": ["<b>Username: aprilmeijune46</b><br><br>I applied and got accepted to the Winter '10 term at University of Michigan as a transfer from Boston University. However, I'm still in the process of deciding whether or not to transfer from BU to UMich. I am currently a sophomore majoring in Political Science with a minor Chemistry hoping to go to Med School. What is the better school for me academically?<br><br>", "<b>Username: Alexandre</b><br><br>Michigan is almost always better than BU academically, regardless of major. There are exceptions, but in general, Michigan is significantly better than BU.<br><br>This said, for pre-med, I don't think it matters where you go to college, as long as it is well regarded (and BU is very well regarded) and as long as you graduate with a high GPA (over 3.7) and do well on the MCAT.<br><br>As such, assuming financial considerations are not an issue, if you are happy and well settled at BU, I would not recommend transfering. If you feel like you would be happier at Michigan, go for it.<br><br>", "<b>Username: Lergnom</b><br><br>I have connections to both schools. They're both very good, large schools and you shouldn't find any real academic difference between them. The grad schools at Michigan tend to be much more highly ranked and grad school is where the difference in career matters.<br><br>If you're unhappy at BU, then leave, but I don't know what you're looking for. BU is eastern and Michigan midwestern. BU is urban and Michigan is more of a college town. Those are the two biggest differences you'll feel as a student.<br><br>", "<b>Username: rjkofnovi</b><br><br>^^^C'mon already. Not all large schools are very good and equivalent. I read this over and over on CC. Michigan is a step above BU. Why can't we just be honest and say it?<br><br>", "<b>Username: jestergirl10</b><br><br>i agree with rjkofnovi. michigan is quite a bit higher on a scale than bu....<br><br>", "<b>Username: Coolbrezze</b><br><br>Boston University is a great school and I personally if I started their my freshmen year wouldn't think of transfering.<br><br>", "<b>Username: kb10</b><br><br>going from BU to Michigan is like going from middle class to royalty, do it.<br><br>", "<b>Username: svtcobra</b><br><br>I agree with Alexandre and Lergnom. If I were in your position the two biggest factors would be money and happiness.<br><br>", "<b>Username: aglages</b><br><br>\"\"...the two biggest factors would be money and happiness.\"\"<br>This may be a universal truth.<br><br>", "<b>Username: svtcobra</b><br><br>^Lol, I'd say it definitely is.<br><br>What I was trying to say, more specifically, is that if you're okay with your life at BU, and Michigan would cost significantly more, then transferring just for prestige or something probably isn't the best decision. If you hate BU, then transferring may be a good idea, especially if your cost would be reasonable (or at least similar to what you're paying now).<br><br>", "<b>Username: rjkofnovi</b><br><br>\"Boston University is a great school and I personally if I started their my freshmen year wouldn't think of transfering.\"<br><br>Now who could argue with that advice?<br><br>", "<b>Username: Coolbrezze</b><br><br>Boston University is a great school and personally if I started there my freshmen year I wouldn't think of transfering.<br><br>", "<b>Username: Entertainer</b><br><br>^ Why would you post the same thing twice?<br><br>", "<b>Username: Coolbrezze</b><br><br>^<br>To correct the mistakes I typed before a cc user does so and completely change the thread.<br><br>", "<b>Username: Alexandre</b><br><br>Coolbreeze, from scratch, assuming the two schools cost the same, Michigan over BU is a no-brainer, unless there is an extreme case to support attending BU. Chosing BU over Michigan is like chosing Michigan over Harvard or Stanford. BU is a very good university, but Michigan is better.<br><br>", "<b>Username: Coolbrezze</b><br><br>^<br>Well I thought Michigan and Boston University were in very similar leagues, especially when considering undergraduate school. I also considered that Boston University is very elite for OP's studies, I do know that international relations is the most popular major at the school ( or at least at the college of literature and arts).<br>I'am one who likes both universities and have done research into both schools. They are very similar in terms, though Boston University tends to be ( at least by statics of collegeboard) a \" more\" popular choice for those not attending Ivy Leagues or schools alike ( and to include the nations top publics). Really by collegeboard statistics the school was popular all across.<br><br>", "<b>Username: aprilmeijune46</b><br><br>Thank you all,<br><br>UMich would currently cost a little more than what I'm paying at BU esp since I'm an OSS. But I do not believe that the difference is of great concern. The reason why I've been applying to transfer is mostly of a social and environmental aspect. But I also wanted to hear opinions about the academics at both schools. Obviously both are great schools, but if I can get a great education while at the same time being able to have a great college experience that I'm looking for, I am going to pick that college. Although this semester has been going well so far at BU, I'm still hesitant about staying.<br><br>", "<b>Username: rjkofnovi</b><br><br>^^Then by all means transfer.<br><br>", "<b>Username: bearcats</b><br><br>people like coolbreeze who have no idea what they are talking about should not be giving advices and ruining someone's future.<br><br>", "<b>Username: Balthezar</b><br><br>^ I was thinking the same thing<br><br>", "<b>Username: aglages</b><br><br>^^^<br>If actual knowledge was a requirement for posting on this site there would be almost no posts and fewer people reading them.<br><br>", "<b>Username: bearcats</b><br><br>there's a difference between knowing some and making assumptions about the rest and knowing nothing and pulling random (and incorrect) ideas/facts out of their @ss<br><br>", "<b>Username: kmccrindle</b><br><br>April...(Mei...June : ) Have you visited U. Mich/Ann Arbor when school is in session and spent some time in a class or two? Do you have any pals you can come visit? I'd be inclined to agree with those who regard U Mich as the stronger academic program -- and I also suspect you may really enjoy the overall campus experience, depending on what you're looking for. My s. compared the two schools (among others) and selected U of M as a breakaway first choice in his particular program. He has loved every minute both academically and socially so far, sleep or no sleep : )<br><br>The poster who considers the two schools closely comparable may not have actually visited either school yet, so that's what Bearcats is talking about. He's not being overly mean -- it's just that the poster in question frequently offers opinions that are not informed by direct experience and sometimes come off as ill-conceived. Eg. in the past he'd based his perceptions of Ann Arbor on an ariel Google map as opposed to a direct visit ; )<br><br>", "<b>Username: Lergnom</b><br><br>Undergraduate school rankings are essentially meaningless (and are garbage statistically) and schools like Michigan benefit dramatically from the halo effect of highly ranked graduate programs, little of which directly affect your undergraduate experience. So it matters to you as a person unsure of your self-worth that you go to a school with more prestige in some BS ranking system but it doesn't matter in the rest of life, in applications to grad schools or in what you learn in school. It simply doesn't. I read dozens of posts on the UofM board about whether having a Michigan degree guarantees you a job. Total garbage thinking. Do well at any good school and you have the same shots in life.<br><br>/Interlude: Usually at this point some kid chimes in with \"Well, Harvard matters.\" Yes, Harvard matters. Yale matters - I went to Yale and can vouch that it gets you in doors. But you won't make more money as an accountant or engineer or teacher or ad copywriter because of the name on your degree and you still have to succeed on your own. Period. The main determinants of salary are the field and the location - because you make more money in New Jersey than in Arkansas. /End of interlude.<br><br>Go to the law school board. You'll learn that Harvard kids tend to get into the top law programs because they score higher on the LSAT. They tend to score higher on the LSAT because they tended to score higher on the SAT. Michigan isn't going to magically raise your SAT number to a top LSAT number. You aren't going to receive an education that hurts you on the LSAT, MCAT or GRE at any good school. That is why a kid from Ball State or Montana who can score well has the same shot at law school.<br><br>My advice is always: go where you feel comfortable, where they have your program, where you can afford.<br><br>", "<b>Username: bearcats</b><br><br>\"Undergraduate school rankings are essentially meaningless (and are garbage statistically) and schools like Michigan benefit dramatically from the halo effect of highly ranked graduate programs, little of which directly affect your undergraduate experience. So it matters to you as a person unsure of your self-worth that you go to a school with more prestige in some BS ranking system but it doesn't matter in the rest of life, in applications to grad schools or in what you learn in school. It simply doesn't. I read dozens of posts on the UofM board about whether having a Michigan degree guarantees you a job. Total garbage thinking. Do well at any good school and you have the same shots in life.\"<br><br>Really? That was pretty garbage advice if you ask me. That was the type of advice that helped me make the mistake of coming to Michigan instead of going to Wharton.<br>First of all, who said it's based on some type of rankings? Prestige is different from any BS rankings. For instance, Ross was ranked higher than Wharton on one of Business Week's stupid rankings, but everyone know that Wharton is more prestigious than Ross and would recruit at Wharton before they recruit at Ross. Like it or not, prestige matters. Just ask any of the bulge brackets ibanks and M/B/B consulting firm that recruit on campus. How about elite boutiques like Lazard, Moelis etc? How about all the fancy prop shops and hedge funds that posts here, for example, DE Shaw, Citadel, DRW, Jane Street, Optiver, Jump, Spot, Chicago Trading and such.<br>None of them recruit at BU, undergrad or graduate level. And if you ever go through recruiting of any of these companies, you will know how applying online is almost like putting your resume in the trash can.<br><br>In fact, I met at kid from BU when I interviewed for the trading arm of an energy supermajor (one of Exxon, Shell, BP) and he was whining about how he had to jump through hoops and network his ass off to get an interview at piper jeffrays while all I had to do is drop my resume for the top banks and consulting firms.<br><br>", "<b>Username: tenisghs</b><br><br>OK -- I will spin the table around with this question: what if the OP isn't interested in banking and consulting firms?<br><br>", "<b>Username: bearcats</b><br><br>That's not my point. I am just saying a one size fit all comment like \"do well at any school and you have the same shots in life\" is plain BS, and to think that prestige doesnt matter is also stupid.<br><br>", "<b>Username: tenisghs</b><br><br>^^ I agree that a one-size-fits-all answer can mislead a student.<br><br>", "<b>Username: Lergnom</b><br><br>I think the poster made my point. He says that Ross is ranked higher but that Wharton does better in the marketplace. My basic point was that undergrad rankings are statistical garbage and that grad school matters.<br><br>As to the rest, Michigan is in the midwest. To expect a Michigan degree to mean much on the east coast is silly. To people in NYC or Boston, it's a good school that begins with an M, much like Minnesota. Wharton is on the east coast and everyone on the east coast knows Wharton. That was also my point, that location and your field matters. Every survey of incomes shows that where you live has a bigger effect on your income than which school you went to because once you're in the workforce in your region then ....<br><br>", "<b>Username: bearcats</b><br><br>who said Michigan is better than BU based on undergrad rankings? Michigan is better than BU because of its reputation, prestige and career placement.<br><br>\"To expect a Michigan degree to mean much on the east coast is silly. To people in NYC or Boston, it's a good school that begins with an M, much like Minnesota.\"<br>hmm funny. Almost all the bulge brackets, MBB, elite boutiques, prop shops, hedge funds in NYC do on campus recruiting at Michigan and NONE do significant recruiting at BU. This further proves Michigan is significantly better than BU grad or undergrad. BU, with its geographical advantage, cant even draw the elite investment banks, hedgefunds and strat consulting firms from their backyard in while Michigan attract these elite employers all the way from the midwest.<br><br>Let's compare on campus recruiting<br><br>Elite Consulting firms<br>Mckinsey: Michigan- Yes BU No<br>BCG: Michigan- Yes BU-No<br>Bain: Michigan-Yes BU-No<br><br>Elite bulge bracket investment banks<br><br>Goldman Sachs: Michigan-Yes BU-Not front office<br>Morgan Stanley: Michigan-Yes BU-No<br>JP Morgan: Michigan- Yes BU - Not front office<br>Bank of America Merrill Lynch: Michigan- Research/Risk BU- Operations<br>Citi: Michigan- Yes BU-Operations<br>Credit Suisse: Michigan-Yes BU-Yes<br>UBS:Michigan-Yes BU-No<br>Deutsche: Michigan-Yes BU-No<br><br>Elite boutiques:<br>Lazard: Michigan-Yes BU- No<br>Greenhill: Michigan- Yes BU-No<br>Moelis: Michigan- Yes BU-No<br><br>Elite prop shops:<br>Jane Street: Michigan - No BU - No<br>DRW : Michigna- yes BU - No<br>Optiver: Michigan- Yes BU - No<br>SIG: Michigan-Yes BU-No<br><br>oh and the best part is, almost everyone of these firms are in the East Coast, somewhere BU should have definite advantage according to your BS logic.<br>But the fact is, in general, the elite career opportunities available to Michigan Grads are not available to a BU Grad, unless he's prepared to network his ass off and by-pass the system<br><br>", "<b>Username: rjkofnovi</b><br><br>All undergraduate schools are equal unless they are in the northeast, which is the only part of the country that matters . Signed, Lergnom.<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"I think the poster made my point. He says that Ross is ranked higher but that Wharton does better in the marketplace.\"\"<br>Uh... Wharton ranks higher in almost any poll.<br>\"\"My basic point was that undergrad rankings are statistical garbage and that grad school matters.\"\"<br>Graduate school counts as part of your alumni network. In fact, it counts more as your graduate alum are more likely in the position for hiring decisions.<br>\"\"what if the OP isn't interested in banking and consulting firms?\"\"<br>In engineering, Michigan is better as it has better industrial connections.<br><br>", "<b>Username: aprilmeijune46</b><br><br>as much as this conversation is interesting, recruiting on campus or discussing the business or engineering school has little importance to my needs. I would be studying in LSA hoping to one day get into medical school. How do the science programs both at BU and UMich compare? Also, I've noticed that since BU is mostly a research school, most professors seem distracted by their research and put little interest in making sure students do well in their classes. How does this compare at UMich.<br>To one of the previous posts, I have recently visited the University of Michigan and I can say there is quite a difference between the environment at BU and at UMich. The overall campus and community feeling might be what I am looking for that BU does not offer. But I also want to make sure that I can get the same solid science background I am getting at BU. Even though UMich is a great school, I've heard that most of its prestige amounts from their business and engineering school. While that is great, I would not be studying at Ross or the Engineering school.<br><br>", "<b>Username: rjkofnovi</b><br><br>Michigan is superior to BU academically in virtually every discipline that both offer. Michigan is easily a top 10-15 school in most all of the so called hard sciences. Michigan is also just as well known for it's social science and humanities concentrations at the UG level, among so many other areas, as it is for business and engineering. It has no glaring weaknesses in any of it's academic programs.<br><br>", "<b>Username: Coolbrezze</b><br><br>From my own research I do see University of Michigan graduate school with more prestige than Boston University. Though when comparing undergraduate, internships, recruitment etc... I think neither school has a definate league of one another, both have the potential... it really starts to be become base off of what your looking for in a university as in environment, campus community, resources of campus and city etc... which is basically the OP's concern.<br><br>Both schools are great and are in about equal leagues speaking of undergraduate, though if your concern graduate school University of Michigan has more prestige... but even with graduate school one school scores much higher than another in specific areas.<br><br>", "<b>Username: rjkofnovi</b><br><br>^^^^Now who could argue with that advice?<br><br>", "<b>Username: Alexandre</b><br><br>\"I think the poster made my point. He says that Ross is ranked higher but that Wharton does better in the marketplace.\"<br><br>Actually, the poster was wrong. Wharton has always been ranked higher than Ross in both Businessweek and the USNWR. The only exception were the first two USNWR undergraduate Business school rankings that had Ross and Wharton tied at #1. However, the overwhelming number of rankings have Wharton ranked slightly higher than Roiss, just as it should be. Otherwise, Michigan is always ranked 1-3 spots lower than Wharton at the BBA level.<br><br>\"As to the rest, Michigan is in the midwest. To expect a Michigan degree to mean much on the east coast is silly. To people in NYC or Boston, it's a good school that begins with an M, much like Minnesota. Wharton is on the east coast and everyone on the east coast knows Wharton. That was also my point, that location and your field matters. Every survey of incomes shows that where you live has a bigger effect on your income than which school you went to because once you're in the workforce in your region then .... \"<br><br>I agree to a degree Lergnom. In most parts of the Northeast, Michigan would not be as recognized as most elite northeastern schools. But there are two notable exceptions where Michigan has forged a very strong reputation: New York City and Washington DC. Those two cities have, quite literally, tens of thousands of Michigan alums, often in key positions, such as lawyers, doctors, company executives. In those two cities, Michigan is virtually unbeatable.<br><br>", "<b>Username: bearcats</b><br><br>\"Though when comparing undergraduate, <b>internships, recruitment</b> etc... I think neither school has a definate league of one another, both have the potential...\"<br><br>campus recruiting<br><br>Elite Consulting firms<br>Mckinsey: Michigan- Yes BU No<br>BCG: Michigan- Yes BU-No<br>Bain: Michigan-Yes BU-No<br><br>Elite bulge bracket investment banks<br><br>Goldman Sachs: Michigan-Yes BU-Not front office<br>Morgan Stanley: Michigan-Yes BU-No<br>JP Morgan: Michigan- Yes BU - Not front office<br>Bank of America Merrill Lynch: Michigan- Research/Risk BU- Operations<br>Citi: Michigan- Yes BU-Operations<br>Credit Suisse: Michigan-Yes BU-Yes<br>UBS:Michigan-Yes BU-No<br>Deutsche: Michigan-Yes BU-No<br><br>Elite boutiques:<br>Lazard: Michigan-Yes BU- No<br>Greenhill: Michigan- Yes BU-No<br>Moelis: Michigan- Yes BU-No<br><br>Elite prop shops:<br>Jane Street: Michigan - No BU - No<br>DRW : Michigna- yes BU - No<br>Optiver: Michigan- Yes BU - No<br>SIG: Michigan-Yes BU - No<br><br>Almost all ELITE firms on the East Coast, mostly in NYC and Boston, IGNORE Boston University when it comes to on campus recruiting, and take the trouble to come on Michigan's campus. I wonder why go through all that trouble if both schools are anywhere close to the same league<br>You definitely can't blame them since there are so many colleges around Boston that are significantly better than BU, including Harvard, MIT, BC, Tufts, Brandeis, Wellesley, Olin College of Engineering just off the top of my head.<br><br>", "<b>Username: tentai</b><br><br>>> In most parts of the Northeast, Michigan would not be as recognized as most elite northeastern schools. But there are two notable exceptions where Michigan has forged a very strong reputation: New York City and Washington DC. Those two cities have, quite literally, tens of thousands of Michigan alums, often in key positions, such as lawyers, doctors, company executives. In those two cities, Michigan is virtually unbeatable.<br><br>This is a vital info that Michigan needs to proclaim loudly: going to Michigan will increase your chance of being hired in the two awesome cities NYC and DC.<br><br>But what about the West Coast? Does Michigan have better prestige than UCLA in the West Coast? Are there as much UM alumni in San Diego, Los Angeles, and San Francisco as in NYC and DC?<br><br>", "<b>Username: Alexandre</b><br><br>No, in the West Coast Michigan will not be more recognized than UCLA, although it does have a strong reputation in its own right in the West Coast, particularly in LA, the Bay area and Seattle, where many Wolverines have played a key role in major Silicon Valley firms, including alums such as Larry Page (Google co-founder), Bill Joy (Sun Microsystem Co-Founder) and Claude Shannon (Father of Information Technology). Other prominent alums have also left their mark in the West Coast. However, the key reason why UCLA is more well recognized in its own turf is becuase it is virtually equal to Michigan academically, so it is only fitting that it be as recognized in the West Coast.<br><br>", "<b>Username: tenisghs</b><br><br>OP, you are receiving some good advice here. Are you planning to remain in Boston after graduation or live in other cities such as Chicago, NYC, and DC? If it is the latter, the Michigan degree will open more doors career-wise for you.<br><br>", "<b>Username: rjkofnovi</b><br><br>It seems recent Michigan alumni are everywhere nowadays, except in Michigan! The brain drain of this state seems to be increasing every year. I can't imagine that a high percentage of Michigan graduates are staying here after they finish school.<br><br>", "<b>Username: tenisghs</b><br><br>^^ rjkofnovi, it's interesting that you bring this up.<br><br>In my graduate course, the professor asked the 40 students how many plan to remain in Michigan after they receive their master's degree. Only half of the students raised their hands.<br><br>Even I told the professor it is 50-50 for me because the jobs I would like to do are predominately in the Boston-Washington DC corridor.<br><br>", "<b>Username: bearcats</b><br><br>why would someone limit their career path and take a job in Michigan if they have options in states in better shape, which is virtually essentially every state outside of Michigan?<br><br>", "<b>Username: tenisghs</b><br><br>rjkofnovi, I forgot to add that many of my <i>high school</i> classmates no longer live in Michigan.<br><br>They are living in \"cool cities\" such as Boston, Chicago, DC Metro, and San Francisco.<br><br>Generation Y Michigan has produced a series about this situation:<br>\"\"Michigan does a great job producing college graduates, but struggles to keep them here. The exodus of educated young people has come to be called brain-drain. Its a threat to Michigans future because those packing their bags are crucial to an economic recovery.<br><br>Michigan has 15 public universities that serve almost 300,000 students each year. But almost half of these students leave the state after they graduate. That means Michigan has the 8th worst migration rate in the nation. Even South Dakota, Alabama and Idaho do a better job keeping college graduates in their states.\"\"<br><br><url>http://generationymichigan.org/2009/11/05/the-brain-drain/</url><br><br>", "<b>Username: Moricarak</b><br><br>Eh, I like Boston University a lot better, I definitely would not transfer if i were you<br><br>", "<b>Username: rjkofnovi</b><br><br>^^^Brilliant advice.<br><br>", "<b>Username: Lergnom</b><br><br>Two final points:<br><br>1. Campus recruiting isn't a big deal and, as with most things, there are reasons, notably that Michigan is a long way from NYC so companies go there to visit. That doesn't mean they don't want to see kids from BU or other east coast schools. They're looking for good people and so they need to stick their faces in at places farther away. The IB's, etc. are also (more) interested in people in the grad program and that leads to #2.<br><br>2. Do not confuse grad school with undergrad. For example, UofM is in the top 15 in economics grad programs - not at the top of the list - but you improve your odds of getting into a top 15 program by doing very well in college, working somewhere in your field, and doing very well on the GRE. Getting into a top 15 program materially helps your career because that is grad school.<br><br>I'm not saying Michigan isn't more \"prestigious\" than BU or a bunch of other schools, just that a) the prestige isn't like Harvard or Stanford and b) doing well at almost any good school leads to the same results.<br><br>", "<b>Username: bearcats</b><br><br>\"1. Campus recruiting isn't a big deal and, as with most things, there are reasons, notably that Michigan is a long way from NYC so companies go there to visit. That doesn't mean they don't want to see kids from BU or other east coast schools. They're looking for good people and so they need to stick their faces in at places farther away.\"<br><br>That's not correct. First of all, anyone with reasonable knowledge about IB recruiting would know that target recruiting trumps non-target recruiting any day by a wide margin. If a bank doesnt do on campus recruiting, you basically have to rely on online application form which almost means your resume go straight in the trash. Last year, the intern class for my BB was 90% targets and semi-targets for front office positions, and most of the 10% of non-target people have an \"in\" at the firm, be it an uncle who's an MD or a close family friend who's a VP or simply great networking. This was at a lower-tier BB known to take more non-targets than GS and MS.<br>Your reason also does not make sense. The proximity does not stop banks from visiting Columbia, Stern right down the street. It does not stop them from visiting worthy schools on the east coast either.<br><br>\"The IB's, etc. are also (more) interested in people in the grad program and that leads to #2.\"<br>Wrong again. The analyst program is way bigger than the associate program, and 95% of the analyst class are undergrads, with most of the other 5% from people in 5 year master programs.<br><br>\"doing well at almost any good school leads to the same results. \"<br>Wrong. The number of \"doors\" opened is different.<br><br>", "<b>Username: kmccrindle</b><br><br>Moricarak, if you like BU so much, why on earth are you so desperately trying/hoping to get in to Michigan??? BU should be a (slightly) easier admit for you!<br><br>", "<b>Username: anononno</b><br><br>I attended both institutions (engineering at both), Michigan is superior to BU in the physical sciences, mathematics, and engineering. My concept of \"superiority\": material covered by Math 215 at UM is covered by Honors Vector Calculus in BU, and it is not always offered because no one takes it (If you can handle Honor Math at UM, you are golden for any related graduate program). Same goes for couple other Math/ Chem/ Engr classes. Sometimes it's funny but BU graduates cannot handle their own grad schools because of a lack of rigor in \"core\" undergraduate training. Example, if one needs to pass Biomed Engr Math Phd qualifier at BU, he should have \"at least\" have taken Honors Vector calculus at BU, which is not a requirement, and not always offered. To sum it up, on the whole BU students are not sufficiently homogeneously competent such that certain concepts can be taught as core requirements. Hence BU students are often \"short-changed\" in terms of things they learn for the amount of tuition they pay.<br><br>", "<b>Username: anononno</b><br><br>I am tired of hearing that graduate school excellence does not translate to undergrad excellence but it does. The translation is not in the sense that professors teaches better, but in the sense that better undergrad students tend to go to schools with better graduate schools (which are often times higher ranked, whatever that means), and hence the professors are able to teach at a higher level. Any professor who is interested in the subject that he is teaching tries to teach at a more competitive level rather than dumb-ing it down for students, which is downright uninteresting to the professor and to the smarter students.<br><br>For math, sciences and engineering, UM and BU are academically very different, not only in terms of the material, but also in terms of the loading per class.<br><br>Career-wise, UM has over a hundred recruiters for college of engineering, plus the myriad others you could crash (like the b-sch, which I did a lot cos they have shrimp cocktails on those events). Since the poster is at BU, he/she should already know how many recruiters came the past couple years. Also like bearcats mentioned, the companies that come are different.<br><br>You can't never ever beat UM's alumni network and alum pride, and I mean that globally.<br><br>People on this forum have many beliefs without substantiations...it's funny.<br><br>", "<b>Username: aglages</b><br><br>\"\"You can't never ever beat...\"\"<br>People on this forum have many beliefs without substantiations...<br>Why do some people doubt?<br><br>", "<b>Username: Alexandre</b><br><br>anononno, you raise a very important point. I have often stated that one of the major components to a great undergraduate program/education is curriculum, but many on CC just don't get it. Fortunately, graduate schools admissions committees and employers get it. Classes offered and what is tought in those classes is what separates undergraduate programs. Michigan is known for having one of the more challenging and rewarding curriculums and that definitely earns it the reputation is has enjoyed over the years.<br><br>I also agree with your assessment of Michigan's alumni network. It is indeed ridiculous! hehe!<br><br>", "<b>Username: Lergnom</b><br><br>I find these discussions interesting and yet kind of silly. I appreciate the information about the content of the math class and of course recognize that any school has its strengths and weaknesses, often varying within a single college or department. And of course reputation attracts better out of state students. How is that in doubt? But again, how much does it matter?<br><br>I've made the comment elsewhere that Clemson is very highly rated and yet almost 7 out of 10 students come from SC and the schools in SC are rated below average. So how \"good\" is a school if nearly 70% of the kids come from a worse school environment? Michigan is a public institution in the state. It takes between 6 to 7 of every 10 students from the state and Michigan isn't exactly California or Texas in size so the pool is smaller. And Michigan has a larger than average public university system so some of the best students don't go to UofM.<br><br>", "<b>Username: QwertyKey</b><br><br>Is the ratio of Michigan students at the University of Michigan system and all high school graduates from Michigan public schools any bigger than California's? Any bigger than Texas's?<br><br>Though I'd like to ask, is the \"dumbed down\" claim of other universities (or the more positive sounding \"smartened up\" claim of Michigan) really true? And by is it true I mean is it true compared to other top public universities and private universities of the same level? Or is it only true compared to schools considered much lower than it?<br><br>", "<b>Username: TheyCallMeCC</b><br><br>\"OP, you are receiving some good advice here...\"<br><br>good? it's all completely contradictory! D: lols.<br><br>", "<b>Username: Alexandre</b><br><br>Lergmom, a few comments about your observation in post #55:<br><br>1. Although the state of Michigan has a large public school system (accommodates roughly 200,000 undergraduate students), it is significantly smaller than the California and Texas state school systems. The UC system alone has over to 150,000 undergrads. The Cal State/Cal Poly system has 200,000 undergrads. And the UT system is also huge. Each of those two states have public university systems that accommodate over 400,000 undergraduate students.<br><br>2. State school systems vary significantly school to school. The drop in quality and reputation can be significant. The gap in quality and reputation from the #1 public university in the state of Michigan the the #2 public university in the state of Michigan is significant. The drop between the #1 public university in California and the #2 public university in California is not that significant at all. The same can be said of the top two public universities in Texas. Yes, Cal is better than UCLA, but only marginally so. Hell, even UCSD is not that much weaker than those two schools. All three universities are ranked out of the top 20 but in the top 35 according to the USNWR. Fiske gives all three universities a ***** academic ranking. And yes, UT-Austin is better than Texas-A&amp;M, but again, only fractionally so. Austin is ranked around #50 in the nation and A&amp;M is ranked roughly #60 in the nation according to the USNWR. Fiske gives Austin a ****1/2 academic rating and A&amp;M a **** academic rating. That is not the case in Michigan, where the University of Michigan is significantly stronger than MSU. Michigan is generally ranked around #25 according to the USNWR and MSU is generally ranked around #75. Fiske gives Michigan a ***** academic rating and MSU a *** academic rating.<br><br>3) A factor you forgot to consider is distance. The distance between schools also plays a part. Students generally want to stay close to home. Many top students in Southern California chose UCLA and even UCSD over Cal because they want to stay close to home. Berkeley is 300 miles away from LA and 500 miles away from San Diego. Austin is much closer to College Station, but we are still talking over 100 miles. Michigan and Michigan State are separated by 65 miles. As such, distance will play a large role in the decision of students in California and a significant role for students in texas but virtually no role for students in Michigan.<br><br>4. Finally, and this is a significant factor to consider here, is in-state student make-up. Roughly 93% of undergrads at the top 3 public universities in California are in-state. Even private universities in California have a soignificantly large in-state student makeup. In Texas, 95% of undergrads at the top 2 public universities are in-state. At Michigan, only 65% of undergrads are in-state. So, the one top public university in the state of Michigan has 16,000 undergraduate in-students. The top 2 public unversities in California have 46,000 undergraduate in-state students (66,000 if you count UCSD) and California has some excellent private schools such as Caltech, Stanford, USC and the Claremont colleges, all of which attract tens of thousands of California students from the state. Stanford is 40% in-state and USC is over 60% in-state. The top 2 public universities in Texas have 67,000 undergraduate in-state students.<br><br>", "<b>Username: losangeles6</b><br><br>I am currently deciding between BU and UMich for an MPH in Epidemiology. I am having hard time reaching a decision because I grew up in Los Angeles and got my undergrad degree on the West coast, so I am not familiar with schools in the Midwest/east. I have heard great things about both programs/schools, but many have said that UMich is way stronger academically.<br><br>I was hoping someone could provide me with some insight about both programs/schools as well as their surrounding communities.<br><br>It seems like BU has a busier city life, like that of New York, whereas UMich is in a smaller town but it is a very busy college community.<br><br>Please help!!!! :)<br><br>"]}