{"title": "mit vs stanford", "comments": ["<b>Username: Affe</b><br><br>Stanford has been my first choice for a while, but I was recently admitted to MIT as well. I honestly didn't think I would get in. I figure I should really consider it as an option, so I am asking about people's general feelings between Stanford and MIT. I'm considering majoring in computer science or economics, but I can see it changing to almost anything. How are MIT's programs in cs and economics? What about humanities? I know they are great, but what makes the special? Did anyone else decide between the two? If so, what were the deciding factors? Are there a lot of siblings at MIT because my brother is there?<br><br>", "<b>Username: oasis</b><br><br>I think there were many threads about this in the past, so you should search around.<br><br>I was admitted to both and ultimately chose MIT over Stanford. I didn't know too much about the two schools at that time, but after being a student here for 3 years, I think one of the biggest distinguishing factors of MIT is the unique campus culture that's here. I honestly don't think you can find it anywhere else...just to give you a few examples: hacks, IHTFP, brass rat, Athena, our building/course/major numbers, very unique dorm vibes (try to visit all the dorms if you can during CPW)...etc.<br><br>What makes our humanities really special is that the humanities department here is definitely still top-notch, but there's a lot less humanities majors and minors compared to other Ivies, so if you're humanities inclined there's a lot of room to distinguish yourself and thrive here. : )<br><br>", "<b>Username: PiperXP</b><br><br>I highly suggest going to CPW :D (And whatever Stanford's version is called, if they have one.)<br><br>", "<b>Username: MITChris</b><br><br>Affe -<br><br>- We have one of, perhaps the, best program in CS in the country.<br><br>- Our econ program isn't too shabby either. If you want to learn more about it, I suggest asking <a href=\"http://pkoms.com\" rel=\"nofollow\">Paul Kominers: Index</a> &lt;- this guy. He's one of our admissions student workers and pretty brilliant.<br><br>- We have an excellent humanities department, including 4 Pulitzer Prize winners on staff. But what really sets MIT apart in this regard is that unlike any other school I have heard of we have a pretty serious humanities requirement from even our engineers. All MIT students, no matter what their major, must take 8 classes (one full year) of humanities work. We consider ourselves a liberal arts school with a science bent.<br><br>As for the MIT cultural match...attend CPW. After that, you'll know or you won't.<br><br>", "<b>Username: tomjonesistheman</b><br><br>I'm kinda in the same situation as you...I've come to the conclusion that I'm just going to go to all the preview weekends and decide from there.<br><br>", "<b>Username: molliebatmit</b><br><br>\"\"Are there a lot of siblings at MIT because my brother is there?\"\"<br>There are, actually, a fair number of siblings at MIT. I don't know if there are more than at other schools or anything, but I was certainly surprised by the number of siblings when I arrived at MIT. Among my immediate group of friends were a set of twins, an '06 whose brother was an '02, and an '05 whose brother and sister were '97 and '96.<br><br>", "<b>Username: yagottabelieve</b><br><br>MIT's and Stanford's campus cultures are very different. MIT is just across the river from a large city; it requires either a car, or a train ride, to get to a large city from Stanford. MIT has much more of a \"hacker\" and \"geek\" culture than Stanford does; you won't find near as many people exploring the tunnels under Stanford buildings, etc. They call Stanford \"the farm\" for good reason; you are within walking distance of horse trails, golf courses, hills that overlook that part of the SF bay area, etc.<br><br>Both schools have excellent CS and Economics departments.<br><br>With respect to humanities, you should probably contact both schools to see to what extent they issue humanities degrees, if you think you want one. There will be more people majoring in the humanities at Stanford than at MIT.<br><br>", "<b>Username: oasis</b><br><br>\"\"We consider ourselves a liberal arts school with a science bent.\"\"<br><br>Even though I am a huge advocate of MIT humanities, I think that may be a bit misleading. More than anything else, I think a <i>technological university with a humanities bent</i> is probably more accurate, IMO.<br>\"\"you should probably contact both schools to see to what extent they issue humanities degrees\"\"<br><br>When you come to CPW, there's this thing called the Academic Fair, where all the departments will be on hand to explain to you what their major offers. Usually there'll be a few professors there along with current students at each booth. If you can decide ahead of time what humanities topics you would be exploring at MIT, you can be sure to stop at their booth. Here's a site where you can explore all the major offerings at MIT: <a href=\"http://web.mit.edu/firstyear/2013/choiceofmajor/courses/index.html\" rel=\"nofollow\">MIT Freshman Class: Exploring the Majors- Course Profiles</a><br><br>", "<b>Username: faraday</b><br><br>I had to make the same decision you did last year. And I absolutely don't regret it. I don't have any complaints about MIT, except for the weather. Honestly, I can't imagine how Stanford could beat the amazing dedication of the institute to academics and learning.<br><br>1. On thing that distinguishes MIT is how much power/choice it gives to the students. The academics here are extremely well scheduled and flexible, you can add class until the 1st month, you can drop it 2 month after class start. You want to take a grad quantum class? No one is going to forbid you. And prereqs are more \"guidelines\" than anything else. MIT really let's you challenge yourself and exploit your potential to a maximum.<br><br>2. The CS department here is extremely strong. I took 6.01 (intro to EECS), 6.002 (circuits), and I can tell you that the teaching was nothing short of amazing (btw, the dude teaching 6.002 also wrote the book). In 6.01, you'll get to code your own robot brain, and there are gazillions of grad students to help you debug (where they find so many people to help you is not obvious). They even organize Saturday and Sunday study sessions to help you debug/code. Another emphasis of the CS department here is that coding/syntax is relatively unemphasized (hence the choice of programming languages: Scheme (which not one really uses), and Python (extremely simple syntax)). Thus, you'll be instead concentrating on the programming paradigms, on things like State-machines, on organizational concepts/abstraction, which will be skills that are timeless. While MIT does not baby you (maybe a major difference with Stanford), it really does a good job at teaching you the right material, and carefully implementing the classes so that the ones who are truly motivated/interested will get the most out of it. MIT will be hard, but everytime it is hard, it is also worthwhile. We also have a 5 yrs MEng. program, which a lot of people participate, because all you need a GPA higher than 4.3/5.0. You can choose the option VI-A, where you get to work on specific real world problems with a certain company.<br><br>3. Needless to say, Employers LOVE MIT CS grads. If you go to career fairs, you'll see that there are gazillions of companies recruiting CS grads for MIT, and they get amazing job offers, not only in sofware engineering/IT, but also in Consulting, trading, Ibanking, finance... If you are CS grad from MIT, you are pretty much set.<br><br>4. Research here is extremely easy to get. I think it stems from the faith MIT has in its students. Here, while you don't have much handholding (class registration, etc... gives you a lot of choice and independence), it is because MIT really trusts in your abilities. That also means it is a lot easier to get involved in research. I know many freshmen who work at the Media lab, and none of them had difficulties to find an awesome project. I don't think Stanford can beat MIT with respect to research opportunities for undergrads.<br><br>5. The students here, especially in CS, are extremely independent ambitious. Heard of Battlecode? You should definitely check that out. Maslab, another activity during the month of IAP, is when you get together with a few friends, and work 30-40 hrs a week to try to build a completely autonomous robot. I think this primarily because of the initiative-taking attitude of MIT students in general.<br><br>6. There is a mentality of \"we're in this *** together\" that really contributes the atmosphere of collaboration between students. While MIT is hard, people here really do help each other out so we make it through. Part of the fun of MIT is that you get to explore how much you can handle, what you can build/create, push yourself to your limits.<br><br>7. Check out the admission blogs.  They definitely were helpful to make my choice.<br><br>Good luck with your decisions! And feel free to ask more questions, that is why we're here.<br><br>-A frosh who loves MIT so far.<br><br>", "<b>Username: faraday</b><br><br>\"I was able to take hard classes and do cutting-edge research, and I developed more as a scientist than I would have if I'd been somewhere that didn't value the intelligence of undergrads so much.<br><br>I really loved the freedom given to students in many aspects of MIT life. Students choose their living groups and the way they want to spend their dining money. Students can choose to take graduate-level classes and/or classes for which they don't have the prereqs.\"<br><br>Here's a quote that Mollieabmit wrote to help me decide between MIT and stanford. She was able to put into words what I clumsily tried to express.<br><br>", "<b>Username: molliebatmit</b><br><br>^Haha, faraday, I was just thinking how nice it is for me to see former prefrosh coming to express the sentiments that I felt myself as an MIT student. But then I find out that I'm just being quoted. :D<br><br>", "<b>Username: 2blue</b><br><br>faraday, I remember you from last year. I'm glad to hear you're so happy.<br><br>", "<b>Username: mathboy98</b><br><br>\"\"Here's a quote that Mollieabmit wrote to help me decide between MIT and stanford. She was able to put into words what I clumsily tried to express.\"\"<br><br>I'm just throwing this out there as a question because it may help the one who posted this thread -- how much of this stuff is <i>unique</i> to MIT? When you're talking about two schools with world class CS departments, perhaps a good question to ask is if one simply seems to get the students to actually take advantage of it more surely and with more ease.<br><br>Simply out of example, if I were to compare and contrast with my home university, another place with a huge CS culture, and a key thing MIT lets you do which we don't have is the 2 month drop deadline. As far as flexibility, somehow nobody really cares what we do -- probably this is (subtly?) different from being pushed to do your best.<br><br>A similar sort of compare/contrast would probably be helpful to the thread creator; although, this would take someone with intimate knowledge of Stanford, which of course an MIT student needn't have, but may :D<br><br>Also, I remember you, and am glad things are going well faraday.<br><br>", "<b>Username: JHS</b><br><br>There's really no need to oversell MIT vs. Stanford. Each is without doubt one of the strongest institutions in the world for both computer science and economics. They are vastly different in their physical settings, geographical locations, cultures, intensity. Most people who can succeed at one would succeed equally well at the other, but most people will also have a pretty instinctual idea which they prefer. If you get off on intensity, MIT has a lot more of it than Stanford. If you are prone to Seasonal Affective Disorder, by all means choose Stanford.<br><br>This is the kind of decision where it's more than OK to trust your gut, and if your gut isn't telling you anything then flip a coin or something. Overanalysis isn't worth it.<br><br>", "<b>Username: CalAlum</b><br><br>I taught at Stanford a year ago as an invited professor (I'm from another California institution), and my husband is a Stanford graduate. My daughter was admitted EA to MIT and also RD to Stanford. She chose MIT three years ago, and we supported that decision.<br><br>But for some students, Stanford can be the better choice. So here's how I'd put it:<br><br>* If you are burnt out from having put nose to grindstone all through high school and want a college experience that presents the opportunity for a less intense existence, choose Stanford.<br><br>* If you love sports, either as an athlete, or because you really enjoy rooting for a team, and if you want to attend a school with amazing school spirit re: sports, choose Stanford.<br><br>* If as a freshman and sophomore you would enjoy the opportunity to live in housing only with other freshmen and sophomores, choose Stanford.<br><br>* If you want a school where math/science/engineering is not the central focus, choose Stanford.<br><br>* If you can stay focused in a dorm and tool long hours on math/science/engineering problem sets while most of your humanities and social-science dormmates relax (having had relatively easy work), choose Stanford.<br><br>* If you want a school where you can abandon Computer Science if it proves too difficult and switch to a humanities major --- without feeling like a sort of fish out of water, or like that's a hard decision to make because everyone around you is committed/passionate about math/science/engineering --- choose Stanford.<br><br>* If you want lots of sun and great weather, choose Stanford.<br><br>* If you enjoy suburban living and don't want nearby access to a bustling city, choose Stanford.<br><br>Stanford faculty members who graduated from schools like Harvard, Yale, Princeton, and MIT often expressed to me the opinion that Stanford students are not as hardworking. I believe this may be true, simply because of the students that self-select Stanford. Figure out who you are, and where you will be happy.<br><br>", "<b>Username: yagottabelieve</b><br><br>\"\"Honestly, I can't imagine how Stanford could beat the amazing dedication of the institute to academics and learning.\"\"<br><br>@faraday, I think you should learn more about the Stanford CS department and its influence on academia and industry before making such claims.<br><br>BTW @CalAlum, I have heard from some Stanford students that they tend not to \"show\" how hard they work; they may appear cool and calm in public but when you get them alone in their dorm rooms or libraries they're studying as hard as MIT students (in general).<br><br>For every good/bad thing I've heard (and experienced, as an alum) about MIT, I've heard (and experienced, to some extent, as a part-time student) the same at Stanford. IMO, in general, it comes down to the type of campus atmosphere/culture you like.<br><br>", "<b>Username: CalAlum</b><br><br>^ They are both great schools; both have outstanding computer science departments. I've heard the same thing about the \"hidden work\" of Stanford math/science/engineering students. A student there described it to me as the \"ducks on a pond\" phenomenon: At Stanford, everything looks calm and placid, but the ducks on the pond are paddling mightily just to stay float.<br><br>I met students at Stanford who'd started out as science majors and dropped when the work became really hard and it seemed as if everyone else around them had more free time. It is probably true, as you say about Stanford students, that \"when you get them alone in their dorm rooms or libraries they're studying as hard as MIT students.\" But at MIT, students have a relatively enormous community of peers who are struggling along with them. That's a huge difference, in my opinion.<br><br>Those admitted to both should visit the campuses, ask some tough questions, and see how they feel.<br><br>", "<b>Username: collegealum314</b><br><br>\"\"I met students at Stanford who'd started out as science majors and dropped when the work became really hard and it seemed as if everyone else around them had more free time. <b>It is probably true, as you say about Stanford students, that \"when you get them alone in their dorm rooms or libraries they're studying as hard as MIT students.\" </b>But at MIT, students have a relatively enormous community of peers who are struggling along with them. That's a huge difference, in my opinion.\"\"<br><br>I still don't think this is true. Maybe the Stanford science majors are working hard next to the humanities majors at Stanford, but there is no comparison to the MIT science majors--based on my friends that went there. I also know firsthand what classes are like at another top 10 university. It is night and day with MIT--although the science majors at the other top 10 university also mentioned that they were much harder working than the humanities people.<br><br>If you're going to found the next software giant, having less workload as an undergrad may help. You have more time to fool around with your computer and strike out on your own. I'm not convinced the extra rigor will necessarily help you do this. I don't know.<br>Also, comp sci. is taught very differently at MIT. Unless you go for the math with comp sci. option, you will have to learn a lot of electrical engineering because it is part of the core for course 6.<br><br>", "<b>Username: datalook</b><br><br>yeh, Stanford computer science department has a reputation unmatched by any other place.<br><br>", "<b>Username: metapod</b><br><br>\"\"yeh, Stanford computer science department has a reputation unmatched by any other place.\"\"<br><br>Nope. MIT and Stanford CS are very comparable.<br><br>", "<b>Username: datalook</b><br><br>The edge definitely goes to Stanford computer science.<br><br>Stanford drives SILICON Valley. MIT drives Route 128. Silicon Valley>> R128.<br><br>More high profile IT companies such as YaHOO, GOOGLE, SUN, HP, CISCO, netscape were founded by Stanford.<br><br>About 20 Turing award winners have ties to Stanford. MIT can not match that.<br><br>More IT milestone inventions come from Stanford (Internet TCP/IP protocol, digital music synthesis, DSL, microprocessor, 1st computer controled robot arm, 1st robot cart, Stanely, and etc). MIT can hardly match that.<br><br>More rankings have ranked Stanford as #1, such as NRC ranking, Shang Hai Jiaotong world university ranking, and business week's best IT lab ranking.<br><br>", "<b>Username: oasis</b><br><br>^ datalook, save your breath. We've heard it all before.<br><br><url>http://talk.collegeconfidential.com/massachusetts-institute-technology/314802-mit-losing.html</url><br><br>", "<b>Username: faraday</b><br><br>to yagottabelieve: I'm not saying specifically just about the CS department, simply because most likely the OP might not major in CS after all. I think MIT puts its money/focus more into academics, which to me is the right place. It's also about how the OP wants to be treated. If the OP likes the independent/exploratory feel of the institute, then MIT is the place. MIT is like driving a race car without the security features. While you risk crashing, you can go faster also (or from a programming point of view, it's like C programming= MIT, Java=Stanford.).<br><br>While rankings don't say everything about a department, last time I checked , MIT tied first with Stanford on Computer engineering/Electrical Engineering. Secondly, what if the OP decides to be a mechanical engineer instead? Or a aero/astro major? Or nuclear engineer? MIT consistently is awesome at all technical fields while stanford is only at select ones. It's extremely likely that by the end of freshman year, the OP would have changed ideas about his major 3-4 times.<br><br>", "<b>Username: datalook</b><br><br>\"\"MIT consistently is awesome at all technical fields while stanford is only at select ones\"\"<br><br>Stanford is awesome at all technical fields as well. According to US NEWS graduate school rankings,<br><br>EE: MIT #1, Stanford #1<br>Computer Engineering: MIT #1, Stanford #1<br>Mechanical engineering: MIT #1, Stanford #2<br>environmental engineering: MIT #9, Stanford #1<br>civil engineering: MIT #3, Stanford #3<br>industrial engineering: MIT (not ranked), Stanford #5<br>biomedical engineering: MIT #5, Stanford #10<br>Areospace eningeering: MIT #1, Stanford #3<br>chemical engineering: MIT #1, Stanford #5<br>neuclear: MIT #2, Stanford (not ranked)<br><br>", "<b>Username: nikki93</b><br><br>Cool. Stanford is awesome.<br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br><br>But MIT too. ^_^<br><br>", "<b>Username: faraday</b><br><br>Oops, my bad datalook. I usually remember rankings in fields I am interested in. THat's why I did not notice environmental, industrial etc...<br><br>", "<b>Username: metapod</b><br><br>Don't feed the ****. datalook has been regurgitating the same posts for years. If you read the thread oasis posted, datalook made essentially the same exact post in early 2007, and sakky showed that most of his arguments were invalid. In fact, most of those 467 datalook posts are just him proclaiming that Stanford is superior to MIT. He's like a college fanboy...<br><br>", "<b>Username: mathboy98</b><br><br>I predicted all this would happen...in all honesty, I think figuring out why some of these schools are ranked so high is a full time job by itself. It's great to toss around #1's and all, but it's incredibly important for the prospective frosh to pick the school they'd think would help <i>them</i> realize why it's so highly regarded quickest. This means the combo of student culture and opportunity that will push them best.<br><br>A more relaxed atmosphere may or may not do this well -- depends if one is the sort of individual to use it as a happy thing in the background to go to after having been productive or if one is the sort to succumb to it and stop being productive altogether :D Having a more intense atmosphere overall either will be damaging or push one to do more.<br><br>", "<b>Username: mathboy98</b><br><br>To clarify the intent of my last post, I'm hinting datalook's and anything revolving around his/her point really doesn't seem to answer the question, which isn't exactly about where the most innovation comes from or whatever. It's about the initial training.<br><br>", "<b>Username: Affe</b><br><br>Oh boy, this is going to be a tough decision. Each seems to have its pros and cons. Hopefully my visits to each will clarify which is more a fit, or maybe I should just flip a coin :) just kidding!<br><br>Just to clarify, I'm looking into computer science and economics at the moment, but I wouldn't be surprised if I graduated with a degree in sociology or something. I come from a very small public school, so I haven't been exposed to many subjects. I'm looking to college as a time to explore my intellectual interests.<br><br>", "<b>Username: harvardfan</b><br><br>Ranking from US news and world report is subjective peer review score. In terms of productivity, MIT has obvious upper hand (<a href=\"http://ranking.heeact.edu.tw/en-us/2009%20by%20Fields/Domain/ENG\" rel=\"nofollow\">Performance Ranking of Scientific Papers for World Universities</a>). In fact, Stanfords productivity is behind UCB, Georgia Tech, Singapore National University. Here is Turing award table (<a href=\"http://en.wikipedia.org/wiki/Turing_Award\" rel=\"nofollow\">Turing Award - Wikipedia, the free encyclopedia</a>), I dont see anywhere near 20 recipients from Stanford. In fact, in the last 10 years, MIT and Stanford appear to tie.<br><br>", "<b>Username: zenkoan</b><br><br>Affe, based on your last post, I think it's clear that Stanford would be the better choice for you. MIT and Stanford are both fantastic schools with strengths in CS and econ, but Stanford would offer you far more opportunity to explore a broad range of intellectual interests--including some interests you may not yet realize you have. As a tech school, MIT has done a relatively good job (compared with, say, Caltech) of offering courses in the humanities, social sciences, etc., but Stanford, as a full-spectrum research university, is in another league entirely in this regard. Its superb science and engineering departments are matched by similarly excellent departments in virtually every field of study. Stanford also operates on the quarter system, which maximizes students' opportunities to explore an especially wide range of courses before declaring their majors at the end of sophomore year. For students who arrive at college with a very open mind about their prospective courses of study, Stanford would be the better match--even before taking into account the weather, campus, housing, dining and many other quality-of-life differentials. Of course, you'll be getting the \"feel\" of each place first-hand when you visit. Enjoy your admit weekends!<br><br>", "<b>Username: yagottabelieve</b><br><br>@faraday, I was only going by what the OP claimed interests in. No one knows what is going to happen in the future. I still stand by my statements (backed by endless publications, reviews, etc.) that MIT and Stanford both have excellent CS and Economics departments. Either will give a top-tier academic experience. As for the TOTAL experience, the other factors that I and others such as @CalAlum have stated should be considered.<br><br>", "<b>Username: coolweather</b><br><br>\"\"Stanford also operates on the quarter system, which maximizes students' opportunities to explore an especially wide range of courses before declaring their majors at the end of sophomore year.\"\"<br><br>This does not mean much. UCB used to have quarter system but they switched to semester system so that students have time to study deeper in the subjects.<br><br>Both MIT and Stanford are great schools. It's a matter of personal preference.<br><br>", "<b>Username: zenkoan</b><br><br>Coolweather, there's nothing about a quarter system that prohibits deeper study; a student can elect to take the next course in the sequence for continued depth in the subject matter. The point is that the quarter system allows for the broadest exposure across disciplines to facilitate the appropriate selection of a major (or majors).<br><br>", "<b>Username: mathboy98</b><br><br>Zenkoan sounds right. I would think it's very foolish to choose MIT if there isn't a clear bias towards maths, science, or tech, simply because of what students have said about the culture.<br><br>And semesters can be long. This one feels short to me, but others have seemed very long. It's certainly better by far to have three times to switch gears if one is figuring things out. Further, my experience is that topics taught in a semester usually go into special optional things. The streamlined courses usually are an entire year's worth of stuff, and can be blocked out by sequences as zenkoan says. I think it's a matter of whether people like switching it up more often (for instance, switching professors). The semester system started working for me very well precisely once I decided I knew exactly what I wanted, and wanted to spend long amounts of time learning from certain professors.<br><br>", "<b>Username: zenkoan</b><br><br>The nice thing about the quarter system is that it lets you have your cake and eat it too. Let's say you are enjoying a particular course and prof., and want to continue studying the subject with that prof. the following quarter. You can usually continue to do so by taking the next course in that sequence with that prof. the following quarter. If, on the other hand, you would prefer to try something (and/or someone) else, that option is typically also open to you.<br><br>", "<b>Username: coolweather</b><br><br>I had the quarter system before. There are pros and cons. But this is not the compelling reason for people to decide between MIT and Stanford. Unlike easy community colleges, both MIT and Stanford will keep students busy. And after 3 or 4 classes people know which major they want to be in.<br><br>", "<b>Username: datalook</b><br><br><a href=\"http://en.wikipedia.org/wiki/List_of_Stanford_University_people#Computer_science_and_electrical_engineering\" rel=\"nofollow\">List of Stanford University people - Wikipedia, the free encyclopedia</a><br><br>19 Turing award winners with ties to Stanford Computer science (not including visiting professors such as Minsky and Wilkinson)<br><br>Vinton Cerf, former faculty, Turing award winning computer scientist<br><br>Douglas Engelbart, Turing award-winning computer scientist, inventor of the computer mouse, former researcher, inducted into National Inventors Hall of Fame<br><br>Edward Feigenbaum, Turing award-winning computer scientist, father of expert system, coinventor of Dendral<br><br>Robert Floyd, former faculty, Turing award winning computer scientist<br><br>Sir Antony Hoare, former faculty, Turing award winning computer scientist<br><br>John Hopcroft, former faculty, Turing award winning computer scientist<br><br>Alan Kay, former faculty, Turing award winning computer scientist<br><br>Donald Knuth, professor emeritus, computer science pioneer, creator of TeX, author of The Art of Computer Programming, Turing award winner<br><br>Barbara Liskov, the first woman earning a ph.d in CS (from Stanford), Turing award winning computer scientist<br><br>John McCarthy, responsible for the coining of the term Artificial Intelligence, and inventor of the Lisp programming language and time sharing, Turing award winner<br><br>Robin Milner former faculty, Turing award winning computer scientist<br><br>Allen Newell Turing award winning computer scientist<br><br>Amir Pnueli postdoc, Turing award winning computer scientist<br><br>Ronald Rivest former faculty, Turing award winning computer scientist<br><br>Raj Reddy, former faculty, Turing award winning computer scientist<br><br>Dana Scott former faculty, Turing award winning computer scientist<br><br>Robert Tarjan, former faculty, Turing award winning computer scientist<br><br>Niklaus Wirth former faculty, Turing award winning computer scientist, inventor of PASCAL<br><br>Andrew Yao, former faculty, Turing award winning computer scientist<br><br>", "<b>Username: collegealum314</b><br><br>^^Without even researching your list, two of those people are faculty at MIT: Rivest and Liskov.<br><br>", "<b>Username: oasis</b><br><br>Don't argue with datalook, lest this thread turn into another 13-page flame war on why Stanford is better than MIT.<br><br>All hail Stanford! Hail!<br><br>", "<b>Username: datalook</b><br><br>\"\"Without even researching your list, two of those people are faculty at MIT: Rivest and Liskov\"\"<br><br>Rivest and Liscov are at MIT. But both are Stanford traind Ph.D and Rivest used to teach at Stanford. So they have a TIE to Stanford.<br><br>", "<b>Username: nikki93</b><br><br>@datalook: Look, we agree Stanford is great, I'm sure there's no doubt about it. But here Affe is making a decision for himself, and rankings and alumni list aren't gonna help much...<br><br>", "<b>Username: Mikalye</b><br><br>\"\"Zenkoan sounds right. I would think it's very foolish to choose MIT if there isn't a clear bias towards maths, science, or tech, simply because of what students have said about the culture.\"\"<br><br>And I would respectfully disagree, having experienced the culture. MIT has plenty of architecture students, economists, linguists, business management (which is usually the second or third most popular major), and the like. You definitely should not restrict yourself to hard sciences or engineering when you think about MIT. What I would say is different: given the MIT core, you will not prosper at MIT if you don't like or at least tolerate math and and sciences. Look most people at MIT like math to some degree. This has its benefits and its drawbacks. Economics at MIT tends to be highly mathematical, because the professors can assume a more than basic familiarity with the mathematical concepts that they may wish to use. MIT does do a fabulous job with most of the less popular humanities and arts subjects as well, and I know several MIT alumni who I speak with regularly who are working in the arts. Nor is there any sense that a music major at MIT is in any way a second class citizen. MIT is quite collaborative and quite supportive, and everyone has to get through the same core.<br><br>", "<b>Username: Mikalye</b><br><br>Look, its not about picking a school, its about picking a home. A close friend from my secondary school ended up at Harvard, a mile up the road, and as a result, I spent a fair amount of time on the Harvard campus particularly my freshman and sophomore years. One day I turned to her and explained that Harvard never felt particularly right for me, it was always vaguely pretentious in a way that I was not completely comfortable with. \"I'm so glad you said that,\" she said to me. \"I've always felt the very same way about MIT.\" And indeed it is a very different kind of pretentiousness at Harvard and at MIT. I was better off at MIT, she was better off at Harvard. I would not wish to claim that one school was \"better\" than the other.<br><br>When I think of Harvard, Yale, Stanford, Princeton, and MIT, I think of very different feelings walking around the campus (and yes, I have walked around all of those campuses). I think that the original poster should forget all the well meaning advice about which is \"better\" and, if finances permit, visit both of the schools. Then go to the one at which you feel most at home. There is no wrong pick here.<br><br>", "<b>Username: mathboy98</b><br><br>You're right Mikalye, that was a horrible mistake on my part, especially considering I'm aware of the political science, economics, Sloan school, music, etc which others have brought up. It was committed not through unawareness but carelessness...<br><br>I think why I still caution the OP is that (s)he sounded rather uncertain of the economics/CS interest and of where the interests lie in general. I'm sure having been accepted to both these schools, the maths skills are at least decent (so I would hope certainly). For someone who may as well end up majoring in sociology, I simply have a gut feel that the broader school might feel most natural. Being fully aware, as others have been kind enough to explain to me, that even the humanities at MIT can be awesome.<br><br>What I would rephrase my belief to be is that choosing the more lopsided school without truly feeling you fit in is probably for the worse. For instance, I come from a school where there is <i>no</i> uniform student culture -- it's so incredibly spread out, and so there's really no question of not fitting in. So while it's great if a clear answer exists, I think in the case of ambivalence, one must have a choice where to err.<br><br>That's really all I have to say, and my gut feel could be wrong of course.<br><br>", "<b>Username: harvardfan</b><br><br>To datalook: Those ties have no connection with the current strength of Stanford CS department, especially for OP. He cannot work with those Stanford alumni if he decides to go to Stanford. Currently, there are 3 Turing awardees affiliated with Stanford CS department (Feigenbaum, Knuth and McCarthy), while MIT has 4 (Liskov, Rivest, Minsky and Lampson). MIT also has more membership of NAE (114 vs. 92). To put it fairly, I dont see MIT in anyway weaker than Stanford in computer science and engineering. MIT appears to have slight edge in achievement.<br><br>", "<b>Username: datalook</b><br><br>\"\"MIT also has more membership of NAE (114 vs. 92). To put it fairly, I dont see MIT in anyway weaker than Stanford in computer science and engineering. MIT appears to have slight edge in achievement.\"\"<br><br>MIT has more NAE members because MIT is bigger. Stanford's engineering school has 240 faculty memebrs, while MIT has 370 faculty members. Stanford also has less faculty members in computer science than MIT.<br><br>See the links below:<br><br><url>http://engineering.mit.edu/about/statistics/statistics.php</url><br><br>I think in terms of the achievements in academia, MIT and Stanford are comparable. But if you count the # of publications, MIT should have more because of its bigger size. But Stanford's contributions to IT industry through Silicon Valley are unmatched.<br><br>", "<b>Username: collegealum314</b><br><br>^^Using that same argument, a guy claimed that Harvard had the best engineering program in the country because they had a higher percentage of engineering faculty in the NAE/NAS.<br><br>", "<b>Username: hermes90</b><br><br>I am also having the same problem >&lt; losing sleeps to choose between MIT and Stanford. I cannot go for CPW of both, so I cannot really experience the culture. My professor told me that I can do undergraduate in one and graduate in another. So, just a quick question, is graduate admission in MIT as competitive and selective as its undergrad programme?<br><br>", "<b>Username: molliebatmit</b><br><br>Graduate admission to both MIT and Stanford is very selective, although how selective depends on the particular department in question -- graduate admissions are done by professors in the department to which you're applying, not a school-wide committee.<br><br>Generally speaking, I don't think it's wise to choose an undergrad institution based on the idea that you can go to another place you also like for graduate school. In the first place, you may change your mind completely about even attending graduate school. Somewhat more subtly, you should never pick a graduate program based on the overall reputation of the school where it's housed -- graduate studies are very specialized, so you should pick a graduate program based on specific professors with whom you'd like to do your graduate work.<br><br>", "<b>Username: mathboy98</b><br><br>Hermes, to give you a small idea from my knowledge of a single field -- MIT's math program supposedly told some students who asked (note: this is something I heard from someone else) that if you're a student from a small, lesser-known school, if you want any chance at all, you should be the best student they've seen in 5 years or so. For a big name school, you should be one of the very topmost in your area of interest to stand a real chance.<br><br>If you're an IMO gold medalist becoming a subsequent Putnam fellow in a US university who's published groundbreaking work in your field of interest, I anticipate you're in without any question at all, unless you're a criminal on the run or something -- it's not super unpredictable in these cases. But obviously these are incredibly rare applicants. Those I know personally who made it in to these schools had really impressive applications<br><br>As for graduate study, to comment a little:<br>\"\"raduate studies are very specialized, so you should pick a graduate program based on specific professors with whom you'd like to do your graduate work.\"\"<br><br>I think it depends on the individual, because some individuals are actually quite flexible in regards to what they would be willing to specialize in, and go in with the opinion that they want to learn about various fields, and make real contributions to at least one. So sometimes, depending on how flexible you are, you could just go to a great school which has something you want, as long as you're fairly sure you want to do real professional research in that area.<br><br>I don't think you should bank on being too flexible though, because to sit through graduate school in a discipline is really grueling work, and unless you care about the minute details, you won't make it....important to consider, because a lot of things appear attractive when presented in a refined form during a course. For all you know, if you don't have an idea what research is like, you may find it's very boring, as interested in the field as you may be.<br><br>All this said, I think I end up coming to the same conclusion as Mollie, which is you shouldn't play the whole \"Oh, I'll head here for undergrad and there for grad, no big deal\" game and expect to be happy with the results.<br><br>", "<b>Username: hermes90</b><br><br>Wow thanks for your advices :D I'm really losing sleeps over college decision :| and the deadline is coming really fast :|<br>I know that MIT has this great UROP :D does Stanford have something similar?<br><br>", "<b>Username: namaskar</b><br><br>Summer Research College<br><a href=\"http://ual.stanford.edu/OO/research_opps/SummerResearchCollege.html\" rel=\"nofollow\">UAL - Summer Research College (SRC)</a><br><br>Student Research Grants<br><a href=\"http://ual.stanford.edu/OO/research_opps/Grants.html\" rel=\"nofollow\">UAL - Student Research Grants Descriptions and Deadlines</a><br><br>Departmental Research Programs<br><a href=\"http://ual.stanford.edu/OO/research_opps/ResearchDepartments.html\" rel=\"nofollow\">UAL - Departmental Research Programs</a><br><br>Other Research Opportunities<br><a href=\"http://ual.stanford.edu/OO/research_opps/ResearchOtherFunding.html\" rel=\"nofollow\">UAL - Other Research Funding</a><br><br>"]}