{"title": "columbia vs nyu", "comments": ["<b>Username: curious2005</b><br><br>Please comment on differences and/or similarities. What sets each college apart from the other? How does academics rate in both? what's their campus and social vibe like? does anyone regret going to Columbia without trying for NYU? Is there rivalry between the two colleges?<br><br>", "<b>Username: imacrazyscientist</b><br><br>It depends what you want to major in.<br><br>", "<b>Username: yoshi503</b><br><br>There's no comparison. Columbia is above and beyond NYU. The only reason I can think of for one to choose NYU over Columbia would be to go to a purely business or art school as an undergraduate.<br><br>", "<b>Username: eternity_hope2005</b><br><br>Stern is awesome for business and the Tisch school school of Arts at NYU is something many admire and dream of studying in. For business and the arts, NYU is a fantastic school; even superior to Columbia itself.<br><br>I don't personally go to NYU or Columbia but if I had to choose between either of the two, I'd def. choose NYU. I think the experience there would nothing less than fabulous. I've talked to quite a few students from both schools and the students at NYU are happier. One NYU student summarized everything in one statement:<br>\"\"It's the ****, that's all you need to know\"\"<br><br>", "<b>Username: yoshi503</b><br><br>NYU is (behind Stanford) one of the top \"dream schools,\" and is getting more selective year after year. Again, if you want to study the arts or business as an undergraduate, NYU may be a better choice than Columbia. However, Columbia is no slouch, and their graduates are more likely than NYU's to make it into graduate business schools (including the Columbia Business School, which consistently ranks higher than NYU Stern) regardless of their major. The difference is that Columbia students use their undergraduate years to explore other, less specialized fields of study that range from philosophy to engineering.<br><br>", "<b>Username: Roger_Dooley</b><br><br>The campuses are quite different - Columbia is more self-contained, with most buildings in a walled/gated multi-block area, while NYU is more organically diffused in its neighborhood. NYU is in the Village, while Columbia is Upper West Side. Socially, both schools are more outward-focused than typical college-town colleges. New York City offers so many things to do that students tend to rely less on school-related activities to fill their spare time.<br><br>Be sure to visit the schools if you are able to, curious.<br><br>", "<b>Username: GT2</b><br><br>As someone who transferred from NYU to Columbia: It's very simple. There is absolutely no comparison between the two. I could not envision a more miserable place for a college experience than greenwich village. It is a very poor representation of the real world.<br><br>Academically, NYU is way overrated... classes are taught by TAs, the buildings and facilities are abysmal and way overcrowded, many of the kids are disinterested in learning. At NYU Being 'artsy' or 'queer' is a great substitution for intelligence.<br><br>", "<b>Username: eternity_hope2005</b><br><br>GT2,<br><br>We all acknowledged that Columbia was superior in everything w/ the exception of undergraduate business and arts at NYU.<br>\"\"I could not envision a more miserable place for a college experience than greenwich village.\"\"<br><br>Why didn't enjoy the location? Many people love Greenwich Village. Indeed, NYU is ranked #1 as having the best location in the country.<br><br>", "<b>Username: slipper1234</b><br><br>That is a lame post.<br><br>I know plenty of NYU kids who felt like they were missing out on the \"true\" college experience, that there was little if any community, and that NYC replaced college life. For some that is amazing, others hate it.<br><br>", "<b>Username: spyrey</b><br><br>Agreed. Columbia kicks the crap out of NYU.<br><br>", "<b>Username: slipper1234</b><br><br>The post that was lame was edited/ erased...so my previous post refers to nothing...<br><br>", "<b>Username: quakerman</b><br><br>I chose Stern over Columbia, as did about 90% of my classmates, and haven't looked back on it at all.<br><br>", "<b>Username: laloopie</b><br><br>NYU is the most overrated school... the incoming freshmen class is HUGE, all the classes are huge. In terms of prestige, columbia def. outshines. you have no self-worth if you apply to NYU...you might as well go to some large state school for less money.<br><br><br>I do have to admit, however, that NYU guys are wayyyyyyy hotter than Columbia guys. Larger selection too... all types of guys, white,chinese, korean, indian, hispanic, etc. you really cant go wrong...<br><br>but you're really an idiot if that is the reason you choose NYU over Columbia..<br>just my two cents :)<br><br>", "<b>Username: eternity_hope2005</b><br><br>\"\"you have no self-worth if you apply to NYU...you might as well go to some large state school for less money.\"\"<br><br>Top investment banks recognize Stern very well. You can graduate from Stern and bank 75K + for a top i-bank your first year out. These guys can really compete with Harvard / Wharton business undergrads.<br><br>I don't think those i-banks recruit from large state schools (w/ exception of Berkeley and UMich). Maybe you could have found a better comparison to make regarding NYU than \"large state schools\"?<br><br>", "<b>Username: quakerman</b><br><br>\"Top investment banks recognize Stern very well. You can graduate from Stern and bank 75K + for a top i-bank your first year out. These guys can really compete with Harvard / Wharton business undergrads.\"<br><br>Yes. I've been out of the field for 3-4 years now and still get job offer soliciations just for coming out of Stern.<br>The only thing that Columbia has over Stern is its massive grade inflation and easy professors.<br><br>", "<b>Username: dknicks2488</b><br><br>according to u.s. news Columbia is ranked much much higher than nyu<br><br>", "<b>Username: eternity_hope2005</b><br><br>Not for law, business, and many other subjects it isn't. look at this website:<br><br><url>http://www.usnews.com/usnews/edu/grad/rankings/law/brief/lawrank_brief.php</url><br><br>NYU ranks almost the same as Columbia for law.<br><br>Look at the below website:<br><br><url>http://www.usnews.com/usnews/edu/grad/rankings/mba/brief/mbarank_brief.php</url><br><br>NYU is ranked #13 for business, and Columbia is ranked #9. That's not \"much higher\". Furthermore, NYU is ranked top ten in MBA programs.<br><br>Stern is actually a little more popular for undergraduate business than Columbia.<br><br>", "<b>Username: GT2</b><br><br>there is no undergraduate business school at columbia so i dont know what you are talking about.<br><br>", "<b>Username: eternity_hope2005</b><br><br>Yeah but I'm sure Columbia offers undergraduate business majors like finance or economics or accounting. Correct me if it doesn't.<br><br>", "<b>Username: curiousstudent1</b><br><br>Columbia only offers economics; there is no other major related to business<br><br>", "<b>Username: yoshi503</b><br><br>Also, as I mentioned before, the fact that Columbia has no business major doesn't hurt students that are interested in business at all. They simply use their four years at Columbia to pursue another field of study before going to a graduate business school.<br><br>", "<b>Username: filmxoxo17</b><br><br>They're two very different schools. I've lived in Manhattan all my life and would never stay for university because I desire a bit of a change for a few years since I'm fairly confident I'll be living in NYC after college. On the other hand, my friend who has spent the last ' years in a Swiss boarding school is biting at the bit to go to NYU. Columbia offers more of the 'traditional' college experience while some may feel that NYU throws you to the wolves (I guess it is shocking coming from flyover states ;)). The only thing that the two schools truly have in common is that after a semester all the students suddenly think theyre New Yorkers. *Groans* ;)<br><br>", "<b>Username: eternity_hope2005</b><br><br>\"\"Also, as I mentioned before, the fact that Columbia has no business major doesn't hurt students that are interested in business at all. They simply use their four years at Columbia to pursue another field of study before going to a graduate business school\"\"<br><br>Yeah but wouldn't it be nice if there was an undergraduate business program? I mean not everyone wants to go into engineering, physics, math, chemistry, biology, literature, humanities, etc.. Many are interested in things like finance, marketing, and other business courses from the beginning. Stern offers many of these topics for undergraduate concentrations.<br><br>So the only the mistake I've seemed to have committed here was quoting that Stern had a better undergrad. business program than Columbia when I should have said \"Stern obviously has a more popular undergrad. business program considering Columbia doesn't even have one\".<br><br>", "<b>Username: crimsonrose</b><br><br>College Confidential doesnt even regard/ place NYU with the top CC universities ... (which by the way are CIT,Carnegie Mellon, Emory, Georgetown, JHU, MIT, Northwestern, Rice, Stanford UCLA, UC-Berkeley, UMICH,UCHICAGO,UVA, UNC, WASHU and Vanderbilt)<br><br>NYU just doesnt cut it...<br>no offense<br><br>", "<b>Username: filmxoxo17</b><br><br>oh well if college confidential doesn't say its good...<br><br>", "<b>Username: eternity_hope2005</b><br><br>It's interesting how college confidential regards UNC, Vanderbilt, and UVA as top schools but not NYU when the latter is clearly better than the former. Ask anyone and they'll tell you NYU is much better and much more popular than either UVA, UNC or Vanderbilt.<br><br>", "<b>Username: filmxoxo17</b><br><br>please.dont.start.a.flame.war.<br>im begging :)<br><br>", "<b>Username: Canadaa0</b><br><br>laloopie, people who go to state schools do have self worth... As long as the school is not advertised on TV, then it should be a decent university. Better yet, as long as it is ranked in the top 50 or a 100 it should be okay. The school is what the individual makes of it; grads from Harvard make about the same as UW grads. According to my doctor, he told me go to the University of Washington for the first year or two and then transfer if I feel the need to attend a more well known school (UW is considered the most prestigious in my state). However he does not think it is necesary for a premed to do that because as long as my grades are good I will get a respectable residency and thats all that matters in the world of medicine. Other doctors do not care where their peers went to school, they care about where they got their training. Also my school is ranked number 1 in the US for primary care medicine and nursing, plus I believe most of the other medical programs are ranked in the top ten.<br><br>The difference between NYU and Columbia for the most part must be living conditions. What do you prefer? The Villiage or Harlem? I personally want to attend Columbia because of its location and the traditional academic environment; I need a break from Washington state. If I were to go by prestige later on, I will definitely pick UW medical over Columbia's medical school.<br><br>", "<b>Username: eternity_hope2005</b><br><br>\"\"Also my school is ranked number 1 in the US for primary care medicine and nursing......If I were to go by prestige later on, I will definitely pick UW medical over Columbia's medical school.\"\"<br><br>If you want prestige, picking UW med over Columbia med would be foolish.<br><br><br>Primary care rankings are worthless if you're interested in prestige. Think about it, John hopkins is the finest medical school in the country and the most reputable; yet it isn't even ranked under the top 15 under \"primary care\" rankings.<br><br>The category of \"research\" rankings is more important and applicable to prospective medical school students. The top research medical schools are the best and the most popular because these school teach and educate their students the best. That's where all the prestige is. Sure, UW is a good med school but Harvard, Yale, Cornell, Columbia med schools are much more prestigious and reputable than UW.<br><br>Ask a doctor in Cali or New York or Texas or even Alaska if he's heard of UW med school or Columbia med school. Everyone will have heard of Columbia but the guy in Cali is probably going to be the only one who's heard of UW.<br><br>UW is still a great school however, and I think that you can be just as successful graduating from UW than if you were to graduate from Columbia.<br><br>", "<b>Username: videogamerx2</b><br><br>I'm sure that most doctors have heard of UW, lol<br><br>", "<b>Username: perfectionist421</b><br><br>USNWR ranks UW first for medicine-primary care.<br><br>", "<b>Username: Canadaa0</b><br><br>I am pretty sure UW is somewhere around 6 for medical research, maybe I will look into it later. Stanford, Harvard, and one of the UC's I think are the leaders in medical research, but again I will need to look it up online which I am too lazy to do right now.<br><br>", "<b>Username: eternity_hope2005</b><br><br>I'm just trying to say that the research rankings are more of use to you if your interested in prestige than the primary care rankings. I just find the primary care rankings odd because they don't list the top schools in medicine and instead list schools like Texas or Colorado above Harvard and John Hopkins.<br><br>", "<b>Username: slipper1234</b><br><br>1) It DOESNT matter if Columbia has a business program. The banks don't care. They recruit from Columbia because Columbia is impressive and that is that. You don't need a business major at all.<br><br>2) It is true Doctors from Harvard med make the same as UW. In fact they make the same as doctors from Wright State too. The difference is Harvard docs get the PRESTIGIOUS academic positions - positions outside the realm of people outside the top 20 or so schools. In fact these people make less initially, but are widely considered the forefront of their field. Often they go to the private sector and make millions. Your neighborhood doctor isnt likely to have gone to a top 10 school. That is a fact.<br><br>", "<b>Username: eternity_hope2005</b><br><br>\"\"1) It DOESNT matter if Columbia has a business program. The banks don't care. They recruit from Columbia because Columbia is impressive and that is that. You don't need a business major at all.\"\"<br><br>What exactly are you trying to prove by saying this? It's common knowledge that one doesn't have to be a business major to do i-banking. Many people know that i-banks recruit math, chemistry, physics, engineering, and even biology majors. Your not telling us anything remarkable by your statements. Most of us already know this.<br><br>Also, by your above comment, you act like the sole and main purpose of getting an undergraduate degree in business is solely for the purpose of I-banking.<br><br>My cousin is an excellent example even though she doesn't go NYU. She does however, go to NYU's equivalent - Cornell. She's decent at pure sciences but she loves business much more. It was her dream to go into business and she relished the subject. At Cornell, she double majored in applied econ. &amp; management / communications. Her years at Cornell were the best times of her life. She said that she would have never given that up to major in something like science. There are many people like her and when faced with Columbia which doesn't even have an undergraduate program, I think they'd prefer NYU over Columbia easily.<br><br>What if someone (like my cousin) is just interested in business and has a passion for something like finance, marketing, AE &amp; M, other business topics? Theyre going to be in undergrad. for up to 4-5 years. There are many people like this  people who are driven to study undergraduate business concentrations. They want to do this because its fun; not solely for the purpose of working at an I-bank for the rest of their lives.<br><br>NYU is more flexible because it provides them this opportunity while Columbia doesnt.<br><br>I just wish you future Columbia students would show some more respect for NYU because the only thing that's \"much\" greater between the two schools is your ego. No one here has talked trash about Columbia from NYU's side. Extend them the same courtesy and respect them.<br><br>", "<b>Username: IvyLeagueORbust...</b><br><br>Columbia and NYU shouldn't even juxtaposed with one another; frankly, there's no competition. Columbia University, by all means is far greater in almost every element over NYU. There has to be a certain degree of beffudlement; the two schools may be in the same ball park physically (that is in Manhattan), but academically there's simply no competition.<br><br>", "<b>Username: crimsonrose</b><br><br>Amen!!! Praise The Lord!!<br><br>", "<b>Username: Canadaa0</b><br><br>I said something then changed my mind by editing...<br><br>", "<b>Username: quakerman</b><br><br>\"Columbia and NYU shouldn't even juxtaposed with one another; frankly, there's no competition. Columbia University, by all means is far greater in almost every element over NYU. There has to be a certain degree of beffudlement; the two schools may be in the same ball park physically (that is in Manhattan), but academically there's simply no competition.\"<br><br>Yes, except that Stern has higher incoming gpa and students, Columbia clearly is better. I take it you are what, 14 years old?<br><br>", "<b>Username: eternity_hope2005</b><br><br>Thank you quakerman.<br><br>IvyLeagueORbust...,<br><br>What kind of a screenname is that? Your basically implying by using a screenname like \"ivyleagueorbust\" that for you, it's either ivy league or no future. That really is quite pathetic. Furthermore, you just ignored my entire post about how Columbia doesn't even have an undergraduate program in business unlike NYU and waltzed your way into talking trash about NYU.<br><br>Are you 14? Or are you 12?<br><br>", "<b>Username: slipper1234</b><br><br>We aren't talking Stern here quaker. Eternity you made a HUGE flaw in your reasoning! Since when is Cornell NYU's equivalent??????????<br><br>Columbia > Cornell (except engineering) >>>>>>>>>>>>>>>>>>>>>NYU (except specialized programs like Tisch, Stern, Gallatin).<br><br>", "<b>Username: eternity_hope2005</b><br><br>What I meant to say was \"Cornell is NYU's equivalent or better\". Are you content now?<br><br>Was it really that big a deal? I don't see how that's even a flaw. Your being utterly ridiculous. Of all the things in my post, the one thing you can counter-attack is something as minor as that. Or, are you going to go back and keep looking up small errors?<br><br>Interesting how you finally start giving credit to Stern just now. After all this trash talking, you finally begin to respect Stern a little more. Changing our mind now are we?<br><br>And you still haven't explained the lack of an undergraduate business program for your \"prestigious\" Columbia. For a school of such reputation and stature, it's interesting how you still lack an undergrad. business program.<br><br>", "<b>Username: wingardiumLeviosa</b><br><br>Columbia doesnt have undergrd business programs? Are you kidding me? Please tell me that's not true. It's such a big school with a big name...<br><br>", "<b>Username: eternity_hope2005</b><br><br>\"\"We aren't talking Stern here quaker. Eternity you made a HUGE flaw in your reasoning! Since when is Cornell NYU's equivalent??????????<br><br>Columbia > Cornell (except engineering) >>>>>>>>>>>>>>>>>>>>>NYU (except specialized programs like Tisch, Stern, Gallatin).\"\"<br><br>What do you mean we're not talking Stern? It's part of NYU and you don't just seperate it. That's like me saying, we don't care about Cornell engineering when rating Cornell's overall education. It's a major part of the school and Stern is a significant part of NYU. Everything is taken into account when grading a university.<br><br>Yes, we're also going to take into consideration Tisch and Gallatin when comparing NYU.<br><br>BTW, while we're at it; Tisch school of arts at NYU is better and more reputable than Columbia's art school.<br><br>What are you going to say next? That Columbia doesn't have an undergrad. art program?<br><br>", "<b>Username: slipper1234</b><br><br>In certain sectors, especially vocational fields like film, engineering, and \"business\" the best schools are often not Ivies whose strength primarily is on well-rounded liberal arts. If I were to try and be a director, I would not pass up NYU, or USC for that matter, for any Ivy. Overall though the Ivy is going to be far and away superior to other schools. A NYU Anthropology major is much less likely going to be able to transition into any field as smoothly as a Columbia Anthropology major.<br><br>The only Ivy with a business program is Wharton (Cornell has a AEM major - but its not true business), and the reason for this is simple: Ivies don't need it. Ivy grads tend to get the top business jobs anyway regardless of major, so why start a business program. Businesses recognize that a majority of training is initially on the job - and that Ivy grads tend to excel. I am working in LA this summer for a major producer, and there are 15 undergrad interns here. Of the ones without family connections, 100% are graduates of Ivies. The Ivy mystique means more than the major in most cases.<br><br>Anyway, outside of stern and Tisch, I don't see the general college at NYU even close to Columbia. Its almost a ridiculous comparison.<br><br>", "<b>Username: yoshi503</b><br><br>In all honesty, I believe that NYU is a very excellent school, and I highly respect it. It was one of my top choices in the college search process, and I'm sure I would have enjoyed my undergraduate years there. However, to compare any university with another university, one must compare the whole university, rather than just one school, like you said.<br><br>NYU is known for having a huge chunk of faculty that just aren't good teachers, for having a laughable core curriculum, and for having student suicides. Also, their student-faculty ratio is lacking. Even if you compare just the undergraduate half of NYU Stern (which has a nicer student/faculty ratio than other NYU schools) with Columbia's equivalent (a bachelor's in the mathematical or physical sciences with the liberal arts base), you'll see that there is no comparison. From NYU Stern's viewbook and website itself, I've found that there are over 200 faculty members and 2265 undergraduate students at NYU Stern. Granted, some of the faculty will not teach undergraduates, but even if I count all of the faculty, I'll still get a student/faculty ratio of about 10:1. Columbia, on the other hand, boasts a student/faculty ratio of 2:1 in the mathematical and physical sciences, and a ratio of 7:1 in other areas, such as philosophy. The student/faculty ratio is only one way that Columbia outshines NYU, but it's an important one because it represents the (relative) amount of attention the students receive. That said, I still honestly believe that NYU is an incredible school, and it is tough for me to bash it.<br><br>", "<b>Username: IvyLeagueORbust...</b><br><br>Eternity_hope:<br><br>For you to go on a tirade and heckle a certain user's account name, that's pretty \"pathetic.\" It is so clear that whenever you try to counterattack Columbia's superiority you always bring up NYU's business school and the art school--fine. Stern and Tisch are excellent schools, but I thought we were talking about the college as whole--right? In that case, it is not only evident, but more probable that a graduate from Columbia would be more likely to get a job over a NYU student; it's simply prestige. Of course, there are other factors: how well the student applies himself at the college, his/her grades, and what he/she has accomplished there. Enough said.<br><br>Second, it's not like I wouldn't want to go to NYU anyway; it has a lot to offer, but even though I came off strong in my other argument, Columbia still holds its own.<br><br>OK? I'm twelve and \"naive\"..<br><br>and your twenty, a b**ch, and pretentious.<br><br>(considering that I'm going through the application process now?)<br><br>", "<b>Username: lovecolumbia</b><br><br>to the OP- why dont you visit both if you can and decide for yourself<br><br>", "<b>Username: vtoodler</b><br><br>Unless NYU is giving you a full scholarship, then there's really no comparison.<br><br>", "<b>Username: wingardiumLeviosa</b><br><br>How's the social life at Columbia compared to the social scene at NYU?<br><br>", "<b>Username: laloopie</b><br><br>i notice people look better at NYU... hotter people in general...and NYU is greenwich..........but columbia kids are cooler and smarter huzzzzah!<br><br>", "<b>Username: GT2</b><br><br>thats the dumbest thing ive ever heard. ever.<br><br>", "<b>Username: wingardiumLeviosa</b><br><br>laloopie, how old are you?<br><br>", "<b>Username: IvyLeagueORbust...</b><br><br>Since when is anorexia \"hot?\"<br><br>*cough*Olsen twins *cough*<br><br>", "<b>Username: Cardinal</b><br><br><url>http://talk.collegeconfidential.com/showthread.php?t=89148&amp;highlight=columbia</url><br><br>See this post for a more reasoned comparison of the two schools, instead of flame wars and idiotic posts on both sides. Honestly people, both schools have their strengths and weaknesses, but we're all in New York together, can't we just get along?<br><br>", "<b>Username: intotherain</b><br><br>Anyone noticed the OP spelled Columbia wrong?? Colubmia.... You people are getting played :-O<br><br>", "<b>Username: xanthom</b><br><br>\"\"We aren't talking Stern here quaker. Eternity you made a HUGE flaw in your reasoning! Since when is Cornell NYU's equivalent??????????<br><br>Columbia > Cornell (except engineering) >>>>>>>>>>>>>>>>>>>>>NYU (except specialized programs like Tisch, Stern, Gallatin).\"\"<br><br>Wow, talk about exaggeration. Cornell isn't that much better than NYU, if better at all.<br><br>", "<b>Username: vayselav99</b><br><br>This whole thread is pointless. Utterly pointless. Hands-down, pants-down, everything-down, Columbia University kicks NYUs whimpy as$.<br><br>And just to really exaggerate and get some NYU-indignants angry - NYU is the dirt that accumulates on Columbia's Alma Mater on the steps of Low Memorial Library.<br><br>", "<b>Username: pearfire</b><br><br>Cornel is definitely better than NYU. Nowadays, may too many schools proclaim themselves as \"top\" colleges.<br><br>", "<b>Username: columbia2007</b><br><br>\"\"This whole thread is pointless. Utterly pointless. Hands-down, pants-down, everything-down, Columbia University kicks NYUs whimpy as$.<br><br>And just to really exaggerate and get some NYU-indignants angry - NYU is the dirt that accumulates on Columbia's Alma Mater on the steps of Low Memorial Library.\"\"<br><br>Not to rain on your parade, but I've been at Columbia for four years and, before transferring here, my girlfriend was at NYU for two. Columbia could certainly learn a few things from its downtown peer. NYU's bureaucracy is far less torturous to navigate, it freely spends on student amenities like dorms and group funding, it has multiple dining halls with different options (in an area of the city with far more dining options than Morningside), its dining dollars equivalent is actually usable in local dining facilities if one gets sick of said dining halls but doesn't want to pay cash, it regularly puts out huge amounts of money to attract renowned scholars from \"better\" universities, its Philosophy and French departments are unsurpassed, it has an undergraduate business school that regularly competes with Ivy League schools for cross-admits, and is considered, currently, the number one \"dream school\" in America.<br><br>Is it the school for me? No. Has it ever been \"better\" than Columbia \"overall\"? Probably not. But it can't be brushed off or demeaned entirely. It's probably up-and-coming faster than any US university right now.<br><br>", "<b>Username: JohnnyK</b><br><br>\"\"Yes, except that Stern has higher incoming gpa and students, Columbia clearly is better. I take it you are what, 14 years old?\"\"<br><br>And they STILL couldn't get into Penn's Wharton school :P<br><br>I for one find if mind-boggling that any undergrad would even consider NYU over Columbia.<br><br>", "<b>Username: pearfire</b><br><br>Columbia2007, which university can't learn stuff from its peers? You talk about stuff that CU could learn from NYU, but an institution does not have to be perfect to be better than another one. So in the end, the one that's closer to perfection is clearly better than the one that's farther away from perfection.<br>Just as JohnnyK, I find it mind-boggling that one would consider NYU over Columbia. There are different degrees of excellence, and CU and NYU are clearly on different levels.<br><br>", "<b>Username: columbia2007</b><br><br>I explicitly said that by most accounts, Columbia is a \"better\" school. I was simply responding to vesalvay's assertion that NYU was somehow virtually worthless.<br><br>", "<b>Username: pearfire</b><br><br>Hm... well he did say that he was using exaggeration to make his point and to get NYU students angry, so he doesn't really think that NYU is worthless. Some ppl in here probably just pushed his button by inflating NYU's image.<br><br>", "<b>Username: vayselav99</b><br><br>Goodness no. Not worthless. Just *relatively* incomparable. :D<br><br>", "<b>Username: orangetwee</b><br><br>I'm sure honors students at NYU compare favorably with Columbia kids. As do the honors seminars.<br><br>", "<b>Username: truazn8948532</b><br><br>Stern is pretty good for finance. Equal with Columbia. But it's not comparable in anything else besides Tisch.<br><br>", "<b>Username: xanthom</b><br><br>Isn't Columbia more science-based though? Some students didn't consider Columbia because of that reason. And I much prefer NYU's open campus to Columbia's \"museum.\"<br><br>Alright, Cornell probably is overall better than NYU (many would say in prestige just because of that superficial \"Ivy League\" slapped onto it), but definitely not in all aspects.<br><br>", "<b>Username: brand_182</b><br><br>NYU vs. Columbia ey....<br><br>On the undergrad level, I don't think the two are comparable. Unless you are hellbent on art (Tisch) or business (Stern), Columbia is the clear choice.<br><br>However, people often get confused when comparing schools. <i>If one is comparing the entire universities against each other</i> there is no clear winner as NYU has some amazing graduate and professional programs that rival or top Columbia's.<br><br>Overall, I do feel Columbia is the better university, though NYU is really moving up as a top university; I don't feel the same way though when one is merely referring to the undergraduate programs.<br><br>", "<b>Username: pearfire</b><br><br>\"Isn't Columbia more science-based though?\"<br><br>Oh yes, you're right. That's probably why our English department rocks and why we all read so much ancient literature.<br><br>\"And I much prefer NYU's open campus\"<br><br>There is no campus.<br><br>", "<b>Username: sphere718</b><br><br>The student bodies at either school are entirely different. Personality wise, by this comparison, NYU probably has more in common with the other local institutions such as CUNY-Hunter, Pace, Baruch, FIT etc etc.<br><br>For those of you who insist on comparing the academics at NYU to Columbia, keep in mind that programs such as Stern, Tisch, etc are only a handful of majors out of nearly 200 of those offered by both institutions. At the undergrad level, appearently the only majors even remotely comparable is the business program (not offered at Columbia), Tisch, Economics and possibly Philosophy. And even in the later, i'd say that Columbia runs the table albeit only marginally.<br><br>All in all, I think that if you chose Columbia over NYU-- for whatever reason then you probably made a better investment.<br><br>", "<b>Username: Shraf</b><br><br>From Bwog:<br><br>Whatever you may think of Columbia Student Councils, at least they're reasonably clean. In comparison to NYU, almost anything would be--the College of Arts and Sciences is currently in the midst of a special election after the news broke that outgoing president Meredith Dolgin (whom Gawker called a \"pompous ass\"), having installed herself as head of a three-member election committee, fixed the race in favor of one candidate. Dolgin has also been accused of embezzling funds, including $2,200 for her grandmother to speak at the school. The Washington Square News gleefully reports on the scandal.<br><br>", "<b>Username: pearfire</b><br><br>lol... did she really gave this much money to her gandma? This is embarrassing NYU.<br><br>", "<b>Username: Denzera</b><br><br>guys, 80% of this thread was 8 months old before Xanthom decided to bump it to start another yelling match.<br><br>Be better than that. I have little hope for JohnnyK but the rest of you, c'mon. Especially you, Vesalvay... trash-talking other schools is a sign of insecurity.<br><br>There's lots to like about NYU, starting with its neighborhood. There's lots to dislike about NYU, starting with its \"campus\". Specialized schools like Tisch or undergraduate programs like what undergrads can do at Stern have no equivalent at Columbia. That doesn't mean you can't get exactly what you want at Columbia, it means the structure is different.<br><br>Now let's all get back to talking about Columbia rather than trying to insult someone else's school.<br><br>", "<b>Username: JohnnyK</b><br><br>I will not stand for these ad-hominem attacks...<br><br>...fatty.<br><br>", "<b>Username: vayselav99</b><br><br>Nah, I'm not being insecure - I just love Columbia :P and when I was searching through colleges for applying, I looked at NYU, and nothing more. So it's not even a Columbia-NYU thing for me because I never even thought of applying there.<br><br>But fine, I know NYU is a great school, and yes I've heard many a good thing about Tisch and Stern etc. and if you do look at my posts, I'm purposely trying to exaggerate eg. the dust on the alma mater lol<br><br>", "<b>Username: columbia2007</b><br><br>\"\"The student bodies at either school are entirely different. Personality wise, by this comparison, NYU probably has more in common with the other local institutions such as CUNY-Hunter, Pace, Baruch, FIT etc etc.\"\"<br><br>I have not found this to be true. If anything, NYU's student body skews slightly more hipster and \"art school,\" but it's more like Columbia than the CUNY schools mentioned, or Pace, primarily because of the socioeconomic status and primarily suburban background of their students, which are roughly equivalent.<br><br>", "<b>Username: egn_cha</b><br><br>You people. You people are adults or close to being adults and are arguing over something completely meaningless to everyone else but you and your ego. It's funny.<br><br>I agree, Columbia is a better \"package\" overall, but that's just the overall perspective of it. For one thing, Columbia is a friggin IVY LEAGUE. Obviously it's going to be more reputable and revered. I chose NYU over Columbia, Carnegie Mellon, and Cornell. Why? Because my passion and intended major is art. To me, the quality of my ART education is far more important than reputation or whatever. Columbia has a great science and english department. That's great, but does that help me? No. People go to different universities for different reasons. I like NYU for its prestigious art programs, location, and opportunities. You really can't be in a better location for the arts than in Greenwich. Definitely for business and art, NYU is a serious contender if not the winner.<br><br>Here's a funny analogy. Let's say NYU is a hamburger and Columbia is a salad. Obviously a fat person with diabetes and heart problems shouldn't eat a hamburger because they can't handle it and will probably complain about it at the expense of others. I, however, am skinny and can handle a burger. I could eat the salad if I want to, it's probably better for me, but I would rather eat something I enjoy than something boring and not to my liking. Nyu is for me, not Columbia. Just like Columbia is for others and not NYU.<br><br>And for people who don't like the NYU atmosphere, a lot of them are from out of state and misinterpret life in the village from shows like Sex And The City and Friends. NYU isn't for everyone. Neither is Columbia. I still respect Columbia, it is a great place to go to college.<br><br>Bottom line is, both are great in their own ways.<br><br>Let's worry about the war.<br><br>", "<b>Username: pearfire</b><br><br>\"Columbia is a friggin IVY LEAGUE. Obviously it's going to be more reputable and revered.\"<br><br>That's prob one of the worst arguments I've heard.<br><br>", "<b>Username: Denzera</b><br><br>\"\"You people.\"\"<br>Sincerely,<br>Don Imus<br>\"\"You people are adults or close to being adults and are arguing over something completely meaningless to everyone else but you and your ego. It's funny.\"\"<br>It's not meaningless.<br><br>1) It has a direct implication on how happy people are at college. The \"type\" of student has real meaning and real distinctions, and the atmosphere and intensity will fit different people differently.<br><br>2) It has an implication on how productive people are at college, and how motivated they are / how hard they work. If their personal preferences and talents line up with the specialties of the school, they will get more out of the education. That's why they're asking the freaking question.<br><br>3) And why do we care? As graduates, the brand name value of the school we attended has a subtle but noticeable implication on the respect and opportunities we have after graduation. Harvard's reputation grows the farther you get from Cambridge. Columbia's diminishes. To the extent this can be changed, it has value for me and all future Columbia grads.<br><br>", "<b>Username: JohnnyK</b><br><br>\"\"Harvard's reputation grows the farther you get from Cambridge.\"\"<br><br>I like that line. heh.<br><br>", "<b>Username: columbia2007</b><br><br>\"\"I chose NYU over Columbia, Carnegie Mellon, and Cornell. Why? Because my passion and intended major is art. To me, the quality of my ART education is far more important than reputation or whatever. Columbia has a great science and english department. That's great, but does that help me? No. People go to different universities for different reasons. I like NYU for its prestigious art programs, location, and opportunities. You really can't be in a better location for the arts than in Greenwich.\"\"<br><br>Um...why didn't you choose Cooper Union, SVA or Pratt, which are in equally good locations (in, respectively, the Village and, for the latter, Brooklyn...you give yourself away as an out of towner by referring to the area as \"Greenwich,\" a term reserved for a certain wealthy town in CT) for art and are actually, well, art schools?<br><br>", "<b>Username: sphere718</b><br><br>\"I have not found this to be true. If anything, NYU's student body skews slightly more hipster and \"art school,\" but it's more like Columbia than the CUNY schools mentioned, or Pace, primarily because of the socioeconomic status and primarily suburban background of their students, which are roughly equivalent.\"<br><br>I disagree, although NYU sudents primarily share a similar socio-economical status to those at Columbia; their students tend to share an identicle day-to-day lifestyle with those at the CUNY and Pace. All of the students there pretty much share the same urban evironment. Columbia students tend to be a bit more removed (figuratively speaking) in comparison. I'd probably have some difficulty distinguishing the CUNY, Pace, NYFA and FIT students from one another simply based on appearence and personality, however (generally speaking of course) I could probably pick the Columbia student out in a heartbeat.<br><br>", "<b>Username: thatguyweknow</b><br><br>I wrote a reply but decided to delete it.<br><br>", "<b>Username: Achilleus</b><br><br>In my experience as a Columbia student and friend of several NYU students, there is no debating that the Columbia student is more intellectual. Now that's not a value judgment - it's just that Columbia attracts students who like reading the Great Books and studying multiple fields in the arts and sciences. NYU students, on the other hand, seem to be more preoccupied with the romance of living in New York. From what I've seen, academics are completely secondary to the NYU \"student.\"<br><br>There are, I'm sure, exceptions to this. Just as Columbia has some jocks who are simply punching their respective tickets, NYU doubtlessly has true scholars whose passion for knowledge mirrors that of Columbians'.<br><br>Finally, the \"dream school\" argument is hardly applicable to a debate about a school's quality.<br><br>", "<b>Username: goyoungha</b><br><br>In my experience, it seemed more and more the case that a typical NYU student would put fun and drinking over anything academic. Furthermore, I see that a lot of the scholarly NYU students tend to sense this and this attributes to a high percentage of students transferring out of the school.<br><br>", "<b>Username: xanthom</b><br><br>goyoungha, not true.<br><br>", "<b>Username: goyoungha</b><br><br>Then maybe you'd like to support that statement? I am speaking from personal experience with many NYU students. Who are you to denounce my opinion?<br><br>", "<b>Username: Denzera</b><br><br>WHO GOES THERE AND CHALLENGES THE WILL OF SAURON? I WILL CRUSH YOU.<br><br>...for god's sake, take yourself less seriously. The first two sentences did just fine.<br><br>", "<b>Username: vayselav99</b><br><br>God bless Denzera's online mocking.<br><br>", "<b>Username: WindowShopping</b><br><br>I once saw a kid kill himself at NYU. While it's happened at Columbia, I haven't personally witnessed it yet. Point: Columbia.<br><br>", "<b>Username: truazn8948532</b><br><br>WHy is this thread still active?<br><br>Aside from Tisch... can one really compare academics between NYU and Columbia? I'd go as far as to suggest that even the average IB-hopeful at Columbia has equal if not better chance than the NYU Stern undergraduate looking for an INvestment Banking position.<br><br>And for applying to Law school/Medical school... Columbia has NYU far beat.<br><br>", "<b>Username: goyoungha</b><br><br>*shrug* That works too.<br><br>", "<b>Username: Denzera</b><br><br>NYU has Two Boots pizza. Columbia has koronets.<br><br>Point: NYU. Unless you just smoked an ounce of pot.<br><br>", "<b>Username: vayselav99</b><br><br>LOLLLL Window Shopping, that's a really really profound point. You could probably argue your whole case on that ... hehehehehe<br><br>(But wow, that's really scary man... You saw death...)<br><br>", "<b>Username: MikeU</b><br><br>I am in NYC so I am familiar with the two universities.<br><br>Here in NYC, with the exception of law, business, and creative arts, Columbia is seen as the superior university. I know NYU outranks Columbia in some subjects, such as philosophy; but such information is irrelevant to many New York City residents.<br><br>Many New York City residents will be more impressed when you tell them you attend or attended Columbia as opposed to NYU.<br><br>Nonetheless, this comparison shows how much NYU has come in my view.<br><br>Years ago, NYU would not even be considered in the same category as Columbia -- in any field.<br><br>", "<b>Username: micheeatsfish</b><br><br>I'm a bit disillusioned by the immaturity of people arguing for or against a school. It's so discomforting to see people constantly using ranks as a factor, or saying x is more superior than y. Prestige isnt everything. Both schools have a very different personality, and some would prefer one over the other for personal reasons aside from prestige. Theres no point in attending a school if you don't find that yourself happy there no matter how prestigous the school is. Although NYU may be \"way overrated\" in the most general of the sense, I also feel a lot of their programs are underrated. You can probably ask any New Yorker, or tourist on Broadway, and they probably would not know of NYU being tops in Philosophy, Applied Math, Law (I mean it's respectable once you get into the field but everyone tends to think it's just a Film School), Finance, etc.<br><br>In the end, both schools are great and if you just want to judge how great a school is by their admissions rate and nothing else, then theres no doubt Columbia wins.<br><br>Also to the OP, you're also asking a bunch of Columbia students (or Columbia prospectives) what/how they feel about their own school.<br><br>", "<b>Username: xanthom</b><br><br>Sorry truazn8948532, but NYU law is usually ranked higher than Columbia law. Same with business and art, obviously.<br><br>And I take back what I say about Cornell being better than NYU in most aspects. I think they're probably comparable in most aspects except for business, art, law, etc. in which NYU excels.<br><br>", "<b>Username: iAppler</b><br><br>I agree with the fact that NYU is better at Undergraduate Business and Film. Their business and film programs are awesome. Columbia rocks at everything else. XD<br><br>", "<b>Username: s snack</b><br><br>Yes, NYU is better than Columbia at Undergraduate Business, as it is better at everything it has that Columbia doesn't.<br><br>", "<b>Username: Skraylor</b><br><br>THREAD NECROMANCY<br><br>was it really necessary to resurrect a thread that was over a month old?<br><br>", "<b>Username: vayselav99</b><br><br>I dare say it wasn't.<br><br>", "<b>Username: Denzera</b><br><br>Night of the Living Thread?<br><br>", "<b>Username: vayselav99</b><br><br>hahahahahahaha well done. I liked that one.<br><br>", "<b>Username: pearfire</b><br><br>At least NYU chicks are way hotter than ours. I'm glad we have NYU, City, Fashion Institute and all those other school in New York, lol... Actually Columbia guys with some sort of game are blessed, because we also have Barnard... Oh yea, and NYU guys are gay, literally, which is also a plus for us.<br><br>", "<b>Username: vayselav99</b><br><br>Columbia boys are pimpingly sexy.<br><br>", "<b>Username: So Authentic</b><br><br>How about we ask Mary-Kate &amp;&amp; Ashley..LOL<br><br>", "<b>Username: hl67</b><br><br>MK and Ashley went to NYU for a bit, but one of them dated a Columbia football player for a while. So yeah, ask them. haha<br><br>", "<b>Username: memeti_12_89</b><br><br>haha look at you guys rambling like little kids... I think that if you want hot girls overall then fordham or NYU are the spots. However I assure any of you guys that NYU's top students can as much as hell compete with Columbia's top. As from what Ive seen. Maybe Stern comes up to mind. Oh and I do know students who have even chosen <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"682b293b2826313d\">[emailprotected]</a> let alone Stern over Columbia without any financial aid; their parents were very rich. NYU may not be as prestigious as Columbia overall but it is WAAAAAYYYYYYYYYYY more fun at NYU. Especially when it comes down to most of the dudes are gay and even without that fact the ratio is 60/40 for women. At least for the straight dudes its all good.<br><br>", "<b>Username: pearfire</b><br><br>What about fashion institute? Any thoughts on their girls?<br><br>", "<b>Username: karot</b><br><br>It sounds like a good idea but then when you think about it, only the models at a fashion institute would be guaranteed to be good looking.<br><br>", "<b>Username: memeti_12_89</b><br><br>Yea there are(my ex went to FIT). And dude if you know something about modeling then you know that great facial looks aren't required that much so you need to be tall.<br><br>", "<b>Username: pearfire</b><br><br>Some of the models I've seen are either damn ugly or were made ugly by the makeup artists. I guess some labels are looking for ppl who are edgy and represent something special... Glad to hear FIT has some nice chicks though, ^^<br><br>", "<b>Username: karot</b><br><br>All the models I've seen have been pretty good looking. I dunno what your standards are but they're good enough for me.<br><br>", "<b>Username: vayselav99</b><br><br>This is coming from a guy who told me Ugly Betty was a hot hoochie-mama.<br><br>", "<b>Username: pearfire</b><br><br>The only thing that's bad about models is that they're so tall and still wear high heels, so they're around 6'1 in total... I wish I was taller, *cries*<br><br>", "<b>Username: Denzera</b><br><br>that's funny, nearly every tall girl i know wishes she were shorter.<br><br>", "<b>Username: vayselav99</b><br><br>True that. They want to be shorter because some of them think they come across as these big behemoths, less guys approach them because most guys are shorter etc etc and in general, they are quite limited to who they can go out with.<br><br>", "<b>Username: truazn8948532</b><br><br>I'm only 5'6... wish to god I were taller. Well guess that rules out 50% of the white girls as potential dates.<br><br>", "<b>Username: vayselav99</b><br><br>What's 178 cm in feet/inches? I'm damn short too.<br><br>", "<b>Username: Denzera</b><br><br>5'9\". average height for a guy is 5'10\".<br><br>", "<b>Username: pearfire</b><br><br>Um... no, it's rather 5'10\". 5'9\" would be about 175 cm, at least I think so, :D.<br>Yea, but honestly, I don't know many guys that would not mind dating a girl who is taller, it's just bad for your self-esteem, ^^. The thing though is that all models wear ridiculously high high-heels.<br><br>", "<b>Username: Denzera</b><br><br>Oh, yeah, you're right. 5.837 feet or so (used an online calculator). look, i was a math major, not an arithmetic major =)<br><br>and heels or not, I sure wouldn't mind dating a model. must project quite a lot of self-confidence to go around with a girl who's your height or taller.<br><br>", "<b>Username: vayselav99</b><br><br>You'll be fine with that, right Denzera?<br><br>", "<b>Username: Denzera</b><br><br>yeah, that's a tradeoff i'm willing to make.<br><br>", "<b>Username: karot</b><br><br>Well I'm 5'5\" so I'm screwed heels or no heels.<br><br>", "<b>Username: vayselav99</b><br><br>Haha!<br><br>How tall are you anyway Denzy-poo :P haha<br><br>", "<b>Username: pearfire</b><br><br>Man I give you respect for that, I know I couldn't do it. Good thing is there are plenty of normal size hot girls, ^^<br><br>", "<b>Username: karot</b><br><br>Mhmmhmmmmm<br><br>", "<b>Username: truazn8948532</b><br><br>You think being 5'6 is a problem>? (for a guy)<br><br>", "<b>Username: karot</b><br><br>Looks like truzazn and I are height brothers.<br><br>", "<b>Username: So Authentic</b><br><br>How da hell did we go from Columbia vs. NYU to Fashion &amp;&amp; Modeling; you guys need to get your heads right &amp;&amp; stop tweaking<br><br>", "<b>Username: vayselav99</b><br><br>So true... haha<br><br>", "<b>Username: branderson925</b><br><br>^ excellent contribution vesal<br><br>", "<b>Username: UriA702</b><br><br>NYU has the advantage as far residency. The lower east side/east village is a great place for college students unlike one - Columbia University - located seconds from spanish harlem. Other than that, No Comparison Columbia hands down - students are more intelligent (although, I sometimes am riddled by how unintelligent the neanderthals that go to Columbia are.<br>Like someone said earlier \"Queer and artsy are great substitutes for intelligence at NYU\" Which, Unfortunately is true.<br><br>", "<b>Username: So Authentic</b><br><br>for the last time Columbia is not in spanish Harlem.....Its in Morningside heights!<br><br>", "<b>Username: Denzera</b><br><br>well, once you walk around, you'll realize that columbia is surrounded on all sides by Harlem. and that \"morningside heights\" is the Columbia Administration's euphemism for \"please just don't call it Harlem\".<br><br>that said, the parts of harlem south of 125th st and east of (roughly) lexington ave are pretty darn safe. i should know, i live there.<br><br>but Spanish Harlem is east of lexington over in the 100s and 110s. that's a very different neighborhood, El Barrio, but it's more than a mile away from columbia.<br><br>", "<b>Username: karot</b><br><br>Adios muchacho!<br><br>", "<b>Username: So Authentic</b><br><br>LOLOLOL...\"please don't call it harlem\"....LOL.wooowwww....is it that bad that its a shame.....Harlem is fine...nothings wrong with it<br><br>", "<b>Username: Skraylor</b><br><br>\"\"LOLOLOL...\"please don't call it harlem\"....LOL.wooowwww....is it that bad that its a shame.....Harlem is fine...nothings wrong with it\"\"<br><br>there's just a stigma associated with the word \"harlem\". people imagine an urban wasteland with grafiti everywhere, daily driveby's, etc. etc...especially those who aren't from the tri-state area and have never been to the city<br><br>so it's perfectly understandable why they would put that spin on it<br><br>", "<b>Username: So Authentic</b><br><br>Yeah I know....Just like places like bedford-stuyvesant....but harlem is histroical; I thought they will give the place more respect &amp;&amp; acclaim<br><br>", "<b>Username: UriA702</b><br><br>I grew up in NYC. Harlem may be historical but look at the inhabitants and my point is proven. fact of the matter is. IT IS NOT TOO SAFE, ESPECIALLY FOR YOUNG WOMEN IN THE EVENING.<br><br>", "<b>Username: Denzera</b><br><br>Uri, I mean this with the best of intentions, but you really have no effing clue what you're talking about. None whatsoever. You grew up in NYC and think you know what it's like to live in harlem? I <b>live in harlem, right freaking now</b>. At night, I walk around, and I see a cop every few minutes. Sure there are guys on the street, a bunch ask for money, but nobody's ever said boo to me. Young women in the evening routinely walk over to my place from the columbia area and aside from the odd guy hollering at them, they said it's no big deal.<br><br>I don't pretend to know what it's like in spanish harlem, and I know that above 125th st it starts getting rougher. The area around 141st and bway is a wholesale drug marketplace and SUVs from the suburbs routinely come in and do their deals there, and there are occasionally guns used. I wouldn't want to live between 125th and 168th. But for south harlem, west of Lex ave, I can assure you it's quite safe these days. This ain't your daddy's harlem.<br><br>\"look at the inhabitants and my point is proven\"? What, black people rob and rape you? I think we see where your thinking is here. 'nuff said.<br><br>", "<b>Username: Skraylor</b><br><br>\"\"\"look at the inhabitants and my point is proven\"? What, black people rob and rape you? I think we see where your thinking is here. 'nuff said.\"\"<br><br>haha, pwned<br><br>", "<b>Username: So Authentic</b><br><br>I knew Harlem wasn't that bad..........Its never on the news......&amp;&amp; there are lots of areas that are on the news for violence etc.<br><br>", "<b>Username: Sterling94</b><br><br>GT2- I'm an NYU sophomore applying to transfer to Columbia. As someone who made that switch, can you provide any insight/advice for me?<br><br>Thanks!<br><br>", "<b>Username: mikesown</b><br><br>I would also say that what UriA702 said is not true. Columbia's campus is not the stereotypical picture you'd have of a campus near Harlem(i.e. it's not filled with poor people mugging Columbia students). In fact, it's quite the opposite around the Columbia campus. Because of the riches Columbia brings to the area, the poor original residents have been pushed out for a more upscale neighborhood(thanks gentrification!).<br><br>There are a lot of reasons to decide not to go to Columbia, but safety is not one of them. Columbia has campus police always patrolling the area, coupled with the NYPD. To evaluate this from a cynical, but true perspective, Columbia has money, and therefore it is protected much better than some other places(e.x. the South Bronx). Columbia has a lot of money, and a good security force, so security should not be a concern.<br><br>", "<b>Username: jh2633</b><br><br>The scene kinda changes once you go east past morningside park, but it really isn't something to freak out about if you fell asleep on the subway and ended up on central park north, even then the area is still relatively safe<br><br>", "<b>Username: ConfucianNemisis</b><br><br>\"\"well, once you walk around, you'll realize that columbia is surrounded on all sides by Harlem. and that \"morningside heights\" is the Columbia Administration's euphemism for \"please just don't call it Harlem\".\"\"<br><br>That's a bit of a stretch... seeing as on the west is riverside park and the hudson river, and to the south is the upper reaches of the upper west side, with some ethnic neighborhoods along amsterdam and columbus between 110th and 98th street. After that it gets yuppified. Neighborhood restaurants and shopping follow thereafter.<br><br>But yeah, it gets sketch once you get past morningside gardens and 125th.<br><br>", "<b>Username: dwharris</b><br><br>Columbia could learn more about naked self-promotion from NYU -- or for that matter, HYPS. Columbia needs to shed its aristocratic reserve and join the affray that is college competition today.<br><br>", "<b>Username: rachael525</b><br><br>I just felt like bumping this.<br><br>", "<b>Username: kenichi0925</b><br><br>I notice that no one is answering the rivalry part of the question. As a varsity fencer for NYU, I don't really notice any athletic rivalry between the two schools. I don't notice any rivalry, for that matter. I know that MIT and Harvard are constantly pulling pranks on each other but you really don't see that same relationship between NYU and Columbia. The two schools are rather separate.<br><br>", "<b>Username: aCTyankee</b><br><br>who owns more land/buildings? i know that CU is the 3rd largest real estate holder in NYC but I dont see how when NYU has like 10 campuses across the city....<br><br>", "<b>Username: Denzera</b><br><br>i'm not sure who owns more property - I do know that within Manhattan, only the Catholic Church holds more property than Columbia among private entities.<br><br>as for the rivalry, though, the two schools don't really interact much as student bodies - sure, you'll meet some NYU friends, or a friend will have some NYU friends and you'll hang out - it's not very competitive. One thing I do know is that our ultimate frisbee team actually taught theirs how to play, when they were forming a while back, and helped them out by scrimmaging regularly, etc. So if there's any sort of rivalry, it's a very friendly one.<br><br>Puck Frinceton, though, yo.<br><br>", "<b>Username: cerberus08</b><br><br>^^ eehhh I've known lots of kids who hate on NYU when they realise that Barnard's staying where it is, and no amount of *****ing is going to get rid of it.<br><br>Those tend to be chronic complainers though :)<br><br>", "<b>Username: aCTyankee</b><br><br>whats so bad about barnard?<br><br>", "<b>Username: karot</b><br><br>Nothing really. I have noticed that the students there have a propensity to own Macbooks.<br><br>", "<b>Username: CU4L91</b><br><br>columbia hands down :P, but NYU's cool though<br><br>", "<b>Username: rachael525</b><br><br>After 11 pages...I still can't choose between NYU and Columbia. Can someone just give a simple, objective rundown of their strengths and weaknesses?<br><br>", "<b>Username: aCTyankee</b><br><br>ummm everyone i know who gets accepted to both chooses CU, especially when they see the cost of NYU- its way overpriced starting around a cool 50g a yr= 200G for your undergrad edu....<br><br>", "<b>Username: Denzera</b><br><br>\"\"After 11 pages...I still can't choose between NYU and Columbia.\"\"<br>well, most of this thread was just a few of us BS'ing around with each other.<br>\"\"Can someone just give a simple, objective rundown of their strengths and weaknesses?\"\"<br>the best thing to do is to look at the Helpful Columbia Threads pinned to the top of this board, and read the stuff on \"likes/dislikes\" and school life &amp; atmosphere. you'll get lots of first-rate opinions on our school. Perhaps the NYU board has something similar.<br><br>If you get into both schools, and visit both of them, and still can't make up your mind, then come back to here with questions and we'll do our best. But that can't possibly be true at this point in the year.<br><br>", "<b>Username: undisclosed</b><br><br>Columbia.<br><br>I haven't read through this entire thread but how is this still even an issue?!<br><br>When it comes to the job market afterwards (the super competitive, reputation-heavy job market....) you're gonna want that sweet, sweet \"Ah, Columbia\" during interviews. Hell its already a huge factor from what I experience in terms of internships.<br><br>", "<b>Username: rach_03</b><br><br>HAHAHAHAHA....\"which is better\"...hahahahaha<br><br><br>*whew* wipes away a tear.<br><br><br><br>That was a GOOD one!<br><br>...unless of course you're an artsy homosexual who feels they can only connect with like ppl in the Village that wants to learn but not work THAT hard...<br><br><br>in that case - the choice is clear :D<br><br>Do You!<br><br>", "<b>Username: rach_03</b><br><br>Looking back - that was a little mean if you really like NYU.<br><br>*Just joking*<br><br>(I'm applying to both Columbia and NYU :P)<br><br>", "<b>Username: aCTyankee</b><br><br>y? r u an artistic homo?<br><br>", "<b>Username: muerteapablo</b><br><br>The student body and faculty of Columbia are absolutely better than those of NYU in almost any metric you could possibly use.<br><br>The only exceptions that I can think of currently are: philosophy, applied math, and law.<br><br>", "<b>Username: Denzera</b><br><br>I may end up conflicted here... I was just admitted to NYU-Stern's MBA program. I probably won't go, but it's a decent program.<br><br>And yes, they have the intellectual center of Applied Math research in the world. Courant is a very impressive place.<br><br>", "<b>Username: karot</b><br><br>\"\"I may end up conflicted here... I was just admitted to NYU-Stern's MBA program. I probably won't go, but it's a decent program.\"\"<br><br>Whoop, congrats.<br><br>", "<b>Username: confidentialcoll</b><br><br>\"I may end up conflicted here... I was just admitted to NYU-Stern's MBA program\"<br><br>dude that's awesome, congrats!! but hey stay true to alma ok.<br><br>", "<b>Username: muerteapablo</b><br><br>\"Decent\"? Isn't it one of the top-10 programs? (the 10th, but still).<br><br>", "<b>Username: nahshimshimhaeyo</b><br><br>\"\"I may end up conflicted here... I was just admitted to NYU-Stern's MBA program. I probably won't go, but it's a decent program.<br><br>And yes, they have the intellectual center of Applied Math research in the world. Courant is a very impressive place.\"\"<br>i thought you were working. Is your consulting firm gonna pay for your MBA?<br><br>", "<b>Username: Denzera</b><br><br>Alright guys let's not get too excited. It's not like I got into Columbia Business School or anything.<br><br>(BOOM! KAPOW! SHAZAM!)<br><br>", "<b>Username: cerberus08</b><br><br>\"It's not like I got into Columbia Business School or anything.\"<br><br>Not yet.<br><br>", "<b>Username: Denzera</b><br><br>We'll see.<br><br>(ZING! BURN! BOOYAH!)<br><br>", "<b>Username: cerberus08</b><br><br>\"ZING! BURN! BOOYAH!\"<br><br>you're crazy. Get back to work.<br><br>", "<b>Username: karot</b><br><br>Bow chicka wow wow.<br><br>", "<b>Username: rwillman</b><br><br>How does Columbia's journalism and political departments compare to NYU?<br><br>", "<b>Username: Excepted</b><br><br>The two school's are completely different. Being in New York, and having spent days on both campuses, you simply cannot compare the two. One is integrated in the heart of New York. The other is a somewhat secluded campus.<br><br>", "<b>Username: rie_91</b><br><br>You said that Philosophy at NYU is better.... is it significantly better?<br>I got admitted to both and plan on double majoring in Philosophy and Poli Sci if I go to Columbia... now my guess is that Poli Sci at Columbia trumps it at NYU?<br>Any advice?<br>At this point, the Core is tipping it in favour of Columbia.<br><br>", "<b>Username: student786</b><br><br>Random question perhaps...but how far is Columbia from NYU? How long would it take (on an average day) to commute by subway?<br><br>", "<b>Username: 3togo</b><br><br>^ ... well I believe Columbia's main gate is at 116th street and NYU is in the Village and I believe south of the beginning of the grid ... so the schools are over 6 miles apart North-South ... I do not know how long that would take on a subway but it would be a bit of a hike.<br><br>", "<b>Username: confidentialcoll</b><br><br>from leaving a dorm on main campus it takes 35-50 minutes to get to NYU including everything depending on which part of NYU you want to go to.<br><br>", "<b>Username: 2kidsincollege</b><br><br>My oldest child will be a senior at NYU Tisch in the fall. There probably is no better school in the country to prepare for a career in acting. My youngest would like to pursue journalism and will be a freshman at Columbia. Columbia is the only Ivy with a graduate school of journalism. Undergrads are allowed to take courses in the journalism school.<br><br>Each school seems like the best fit for each child. I could not be happier for both of them.<br><br>I dont think its a question of which school is better. It all depends on the student and what they are looking for.<br><br>The one area where there is a big difference is in financial aid. Columbia has a much larger endowment and can offer more aid to students who demonstrate need. NYU's endowment does not allow this so some families who would otherwise qualify for aid (based on their FAFSA EFC), don't receive it.<br><br>In full disclosure, I am a Columbia Graduate School of Business alum.<br><br>", "<b>Username: shahdin</b><br><br>NYU is community college compared to an Ivy like Columbia.<br><br>", "<b>Username: House of London</b><br><br>\"NYU is community college compared to an Ivy like Columbia.\"<br><br>In what lifetime? You need to get out more.<br><br>", "<b>Username: Denzera</b><br><br>they still have a number of very highly regarded programs. for example, the Courant Institute is easily the foremost location for Applied Math research in the world, and the smartest applied math students all want to go there for their graduate work, or for employment. And then you have Tisch and Stern and so on.<br><br>There are a great many universities which do not provide enough value for their standard $50k/yr price tag of a private college - but NYU is not one of them. Do I think Columbia is a better place to go for undergrad? Sure. I'll even call it a slam-dunk in 90% of cases. But let's not act like this is University of Bridgeport we're talking about.<br><br>", "<b>Username: cmburns14</b><br><br>at the graduate level:<br><br>NYU > Columbia in applied math, tied with Columbia in pure math<br><br>Columbia > NYU in most science departments<br><br>NYU = Columbia in business and economics<br><br>Columbia >> NYU in most humanities departments<br><br>NYU > Columbia in the arts, theater, etc. (except architecture)<br><br>", "<b>Username: shahdin</b><br><br>Lol sorry i just wanted to see the reaction from the other posters.<br>I'm just an immature sophomore lol.<br><br>", "<b>Username: confidentialcoll</b><br><br>\"\"NYU > Columbia in applied math, tied with Columbia in pure math<br><br>Columbia > NYU in most science departments<br><br>NYU = Columbia in business and economics\"\"<br><br>I'd say Columbia has a better pure math dept.<br>In business you might be able to argue that Columbia and NYU are tied, but for economics Columbia definitely trumps NYU.<br><br>", "<b>Username: Denzera</b><br><br>among the graduate business schools, Columbia is measurably superior to NYU-Stern.<br><br>And I say this as a likely Stern MBA in the fall.<br><br>", "<b>Username: cmburns14</b><br><br>you guys are wrong- NYU Econ had a much better recruiting season this year placing its graduates at top 15 departments- read econjobrumours<br><br>I think NYU Stern is a bit stronger in finance and about the same as Columbia GSB in everything else by strength of faculty (e.g. Engle at NYU). That said, both Columbia and NYU are top targets for sales &amp; trading and probably Columbia has a slight advantage in corp fin. For PE, both are at a disadvantage to Stanford, Harvard and Wharton. Columbia also has a very prestigious value-investing program with Bruce Greenwald and is active in the Pershing Square investment challenge.<br><br>As for alums it's a wash: NYU has John Paulson, Greenspan, Tisch, Freston, Langone, Robert Soros, Dick Fuld, Ferregamo, Golub, Kelleher- the founder of Southwest, Kleiner in KPCB etc.<br><br>Columbia has Buffet, Kravis, Cooperman, Pandit, Von Mueffling, Raanan Agus (head of Goldman Sachs proprietary trading), Mark McGoldrick (former head of Goldman Sachs prop), real estate exec. Speyer, and Carson in Welsh, Carson, Anderson, Stowe<br><br>", "<b>Username: 2kidsincollege</b><br><br>I went to CBS, and loved it, but I am not sure it is \"measurably superior to NYU-Stern\". The latest (2009) U.S. World News Report rankings don't support this notion. CBS is ranked 9th and NYU Stern is ranked 11th with Yale sandwiched in between. Not worth losing sleep over.<br><br>", "<b>Username: Denzera</b><br><br>well, while we're on the subject of MBA programs, <a href=\"http://www.ultimateaq.com/~tyriel/mba_comparison.xls\" rel=\"nofollow\">check out this spreadsheet I made</a>.<br><br>In consulting, NYU has many fewer people coming from a top consulting background - the best firm they typically get people from is Deloitte or Accenture - and correspondingly few go into a top consulting firm afterwards.<br><br>In finance, NYU does rather poorly placing people on buyside jobs. Anyone who wants to can get an M&amp;A or Capital Markets job from either school, sure, but at Columbia people have many more opportunities in PE, VC, hedge funds, investment mgmt or other buyside roles.<br><br>In terms of school resources, Columbia outpaces Stern by a mile - not just in research opportunities but in funding for clubs, housing quality and price, portion of tuition that pays for excursions or trips, faculty who get cited often in the news or WSJ, etc. Columbia offers more financial aid on average. I don't have hard statistics on such things (they almost surely don't exist), but anecdotally and having spent a lot of time at both places, those are all strong impressions i've gotten.<br><br>Columbia's class size is also 2/3s larger than Stern's (~750 to ~450), meaning it's easier to find people with similar backgrounds and/or similar aspirations and learn from them and count on them as part of your future professional network.<br><br>Then you have the minor edge that Columbia enjoys in average GMAT score, undergrad GPA, etc.<br><br>Look, I'm a future Sternie here, but I do have to acknowledge that Columbia is measurably superior as an institution, and ranked 4th in various places (I don't trust US News as far as I can throw it).<br><br>", "<b>Username: Denzera</b><br><br>Yeah, good point PostBac, it's not like the world has any need to cultivate people who are leaders with a strong vision of how the world should be and have the motivation, organizational skills and people skills to bring it to reality. We don't need people who have been trained to see, think about and understand the forest rather than the trees. With companies containing hundreds of thousands of people, there's no need for abstract understandings of how to optimally organize, market, analyze, price, transform or lead the corporations that produce the complex goods and services that drive our modern economy. Better we should all become farmers.<br><br>More seriously...<br><br>The central genius of capitalism is that, in search of greater returns for themselves, investors are incented to invest their capital <i>in the most efficient manner possible</i>. This means having the judgment, borne primarily of experience, in what is a proper and competent corporate management team, a proper operations strategy, technology strategy, marketing strategy, financing strategy, partnership strategy, etc. But that judgment is also borne of education, which ideally should help people avoid mistakes that have been made before, by learning from them, and if they do make mistakes, to make new ones (and thus contribute to the world's knowledge). The ever-more-efficient allocation of capital that results is what has led our country and most developed countries to prosperity. Properly applied, the training of future business leaders - not just investors of course but the executors of those plans, too - creates wealth for everyone.<br><br>You're talking about two very different issues - people having the emotional maturity and self-control to properly manage their finances, and separately, people having the proper training and instincts to properly perform functions within the financial world. The first is a personal issue, the second, a professional issue. Whether someone will be a good, say, management consultant totally does not bear on their ability to be financially stable. I knew people making small fortunes in consulting who did the job just to have the money to buy lots of shoes and dresses. People who, on a project or in a client meeting were absolutely brilliant at illustrating and synthesizing the key ideas that everyone needed to remember, at posing the key questions that people needed to answer, and at generating (or eliciting) optimal solutions to business problems. There is really no connection between the two. Your friends who have MBAs and live paycheck to paycheck either have Imelda Marcos as a girlfriend, or didn't get that much out of an MBA, either through a bad program or a lack of initiative on their part. There may also be a selection bias - you may only encounter the ones who end up needing an accountant to help bail themselves out.<br><br>Your critique of MBAs in favor of \"Liberal Arts\" seems similarly ill-founded. The \"Liberal Arts\" disciplines are not the ones which fundamentally teach people how to \"learn, refine, analyze and solve problems effectively\". You're thinking of engineering or the sciences - or a business degree. History classes are fantastic introductions to the foundation and background of the world as we see it, but aside from teaching research skills, they didn't exactly sharpen my mental pencil. All the sociology majors and women's studies majors and east asian languages and cultures majors... you're telling me these are the people best trained to crunch numbers and lead organizations?<br><br>If the people you meet with MBAs are \"idiots\", either you're hanging around the wrong business schools, or there's something else clouding your judgment of people.<br><br>", "<b>Username: admissionsgeek</b><br><br>wow, why am i joining this debate - well cause of your small hit on liberal arts majors.<br><br>eng/sci/bus teaches you skills; lib arts (which actually includes sci/quant education) gives you perspective on how to utilize skillsets, to negotiate difficult circumstances and how to effectuate a technical answer. without 'soft' skills, you could have all the hard skills in the world and not be successful.<br><br>point is, you need both.<br><br>", "<b>Username: LW Trojan</b><br><br>Columbia > NYU...period.<br><br>", "<b>Username: Epaminondas</b><br><br>Now come on, Columbia is just like NYU...except good.<br><br>", "<b>Username: Denzera</b><br><br>\"\"If they [sic] were so many impressive MBA candidates coming out from the Ivy League system, then why did Wall St. fell [sic] so hard on its knees so suddenly?\"\"<br>The market is naturally cyclical. Markets are motivated by two human forces, greed and fear. They both ebb and flow.<br>\"\"Do you even need a MBA to do the many things that is involved on Wall St.?\"\"<br>To do them successfully? No. To get a chance to do them, via a job offer? Yeah, probably. Ultimately finance, like business, is built on trust and relationships. A large firm chooses a banker to advise them on an M&amp;A deal, or a startup chooses a banker to do an IPO or help them access the credit markets, based on having the relationship with those guys, and trusting them. If you don't have those relationships and can't build that trust, the world of high finance is not open to you. It's not like a law firm where you can hang out your own shingle and acquire customers organically. You need a strong network.<br><br>Well, an MBA (like a top undergrad education) gives you that network. And it gives you the training to use it most effectively. And it gives you the skills such that people in that network can trust that you know what you're doing. perhaps not all of them actually do, all of the time... but the average grad from a top MBA program is much more likely to succeed at such things, ceteris paribus.<br>\"\"Day traders and Stock Brokers can make a good living even without a college degree. Are you telling me that none of the skillsets required for Wall St. can't be taught on the job?\"\"<br>Why would you hire a guy off the street when you can hire an MBA and get much lower risk attached to that hire? Trading requires capital to trade - who's going to give you that money? Stockbrokers work on behalf of a broker/dealer firm selling securities - who's going to give you the client relationships? Sure, objectively speaking, these skills can be taught on the job. It's not brain surgery. But we're talking about masters of managing and balancing risk and return. Who's more likely to make you money when you hire them, Joe Schmo or Joe MBA?<br>\"\"If money is the main objective, then they are other alternatives that are easier and much cheaper. A NYPD Officer can make over $150K a year without any expensive college degree. A tax professional can build up a solid private practice and earn $200K in just 4 months out of the year, and this doesn't require any degree as well. So why do many individuals fall for the sheep mentality and follow the huge crowd just to be suckered in?\"\"<br>Maybe they know something you don't.<br>\"\"Many CEOs of the Fortune 500 companies have a liberal arts background. Perhaps you can blame them for the mess that we are in now?\"\"<br>A bad executive is a bad executive no matter what they got their college degree in. By the time they're put in charge of a major company, their education is far, far behind them and their underlying character, people skills, and personality traits are much more evident - and much more important. And, if admissions officers at top MBA programs are doing their job well, those people skills, personality traits, and ethics are what is common among the students they admit to their program. Nothing is guaranteed in this world, but there are varying odds.<br>\"\"And speaking of friends, I know of one who was a History major in Princeton and now working at Goldman Sachs as an analyst. She tells me that they hire Liberal Arts majors because they have strong analytical skills.\"\"<br>Great. They hire all kinds of majors. They hire extremely smart people willing to bust their arse. I'm not sure what this is supposed to prove. I know a guy who never graduated high school, but his father ran a trading firm, got him a trading job at CSFB like ten years ago, and now he runs his own trading firm, trading treasuries. Yeah, he succeeded in his profession without formal education. Would you want to take those odds?<br><br>", "<b>Username: ilovebagels</b><br><br>Columbia is better than NYU in every way imaginable save for proximity to the Village.<br><br>", "<b>Username: Epaminondas</b><br><br>^unless you want to major in Failing at Life.<br><br>", "<b>Username: lalalalalaiyla</b><br><br><span style=\"color:blue\"><u><b>Columbia</b></u></span> > NYU (:<br><br>", "<b>Username: jwxie</b><br><br>I have read almost every comment.<br>This is stupid. NYU's rank is much lower than Columbia.<br>Stern and Columbia Business School, and the Art School @ NYU are the only two can rank against Columbia. Overall, NYU has more \"racists\" than any other colleges. Just look at those Republican kids at NYU, looked at what they did.<br><br>Okay, let me just be more mature. Overall, Columbia is better than NYU, the name, the rank, the research opportunities and the program itself.<br><br>Just remember, Columbia is far more famous than NYU.<br>Many people may have heard of NYU, but when people know you from an IVY college like Columbia, or even better, Harvard, their eyes are O_O.<br>If you tell someone I am from NYU, they will say, \"okay\".<br><br>Why? Simple.<br><br>And overall, Science and math program at Columbia is far superior than NYU.<br>I am a math and science person, I don't really give a damn about the Art School.<br>Seriously.<br><br>", "<b>Username: pgc433</b><br><br>Haven't read through every page but from what i've seen, the longer more argumentative posts are coming from defensive NYU grads who for whatever reason feel a need to defend their school with this and that argument to show it is as good as columbia.<br><br>In my high school,which is ranked among the top in the country, there were several people who went to NYU. Those guys did not rank in the top 10% of my class and the reason they went to NYU was because they could not get into columbia or any other ivy league school. Those who were in the top 10% mostly went to ivy league schools including columbia (me). Needless to say, NYU was my safety and there's a reason for that.<br><br>", "<b>Username: Poik</b><br><br>\"Wake up in the morning feeling like P. Diddy\"<br><br>Let's take a break from this argument, and grab a muffin. Anyone with me?<br><br>", "<b>Username: saltyballs</b><br><br>Arguing about this is so redundant. Any school is basically as good as you make it out to be. If you're a lousy student, you probably won't get anywhere in life. End of story.<br><br>", "<b>Username: duermomucho</b><br><br>As a prospective college student applying to both Columbia and NYU, I am almost turned off to both these colleges by this silly debate. I hope that most students at Columbia and NYU do not act this immaturely.<br><br>", "<b>Username: ylmc123</b><br><br>NYU is just a glorified state school.<br><br>", "<b>Username: ylmc123</b><br><br>Columbia all the way.<br><br>", "<b>Username: Skittled</b><br><br>I'm applying to Stern and Columbia this year. You guys need to chill out and quit being idiots. Columbia tops NYU in every way except business + drama/arts.<br><br>And I'd still go to Columbia over NYU for business. Better alumni networks, also proximity to Wall Street, bigger target school than Stern. But Stern is not shabby at all. And both live the city life.<br><br>", "<b>Username: admissionsgeek</b><br><br>so this goes with the thing about does columbia have school spirit - of course it does. the way we beat up on the poor violets proves that.<br><br>i like that somehow denouncing as trash a school is somehow irrational on here, but when it is done on the football field like the way that Oklahoma and Texas treat each other it is somehow the apex of human virility. the entire conception of rivalry in college athletics is about reducing the competition rhetorically through often irrational statements.<br><br>but i will hit you here skittled - i know you said you'd go to columbia over stern. i hope in part that you didn't mention is that columbia offers a better and more rounded educational experience and not just name.<br><br>but i think you have to believe that business education for ugrads makes any degree of sense before you start saying that one school is better than the other at 'business'. 'business' as we know it is primarily economics and psychology - you can do that at columbia with some pretty incredible professors. so i would never concede on the fact that stern is better at columbia at 'business' education. rather, i would say that stern buys into an idea (that not even Wharton says as much as their degree is in BES) that there is some amorphous concept called business that can be taught to students. and all you students at home hungry for the idea of making money apply to business schools thinking that somehow the education you receive there is far different than what you receive elsewhere. the biggest differences - you have interactive leadership classes, and more hands on experiences to some degree. (at columbia you can start your own business and have the same kind of experience through columbia's start-up initiative). i was talking to a student who is applying to BBA programs and she was like yeah i want to be in business, its all i've ever wanted to do - i asked her what she thought that meant, and crickets. i think that before you portend to run a business, students should learn the fundamentals. the reason why we major in liberal arts disciplines is that we should know the theoretical and historical development of these ideas. we can't just do modern physics without classical physics. so if you look at most of the classes at stern for BBA they are no different than the ones you'd do at columbia economics, and especially not if you take some psych classes, or the few more accounting/finance classes you can take at the Bschool.<br><br>so if we are to talk about business - lets call it an interdisciplinary study of human behavior and make it a special program that joins econ, psych, math and stats. but in the end you need to take basic psych and basic econ to concretely understand these ideas, and i would argue that a business major ends up diluting the essential information you should have to truly understand business.<br><br>and back to the stern v. cu thing. does stern have some top notch econ, finance and other subdiscipline folks? yes. they are pretty great. but not better than columbia in my estimation. and i think that stripping things to their bare bones and not buying into concepts wholesale makes sense and would lead us away from saying things like NYU is better for 'business.' especially when i would never say for grad that stern is better than CBS (maybe even, maybe a nod to CBS, but never the other way around).<br><br>", "<b>Username: ilovetheformat</b><br><br>Columbia is definitely more prestigious than NYU, but NYU is a very good school. Just because Columbia is the right school for you doesn't mean it's right for everyone. If you go to NYU and you actively pursue opportunities, you may be better off than an arrogant student at Columbia who already thinks he/she is the top at everything and just relies on the name of a good school to help them have a future. I have a friend who was admitted to Yale and Columbia, and she visited both schools and chose Yale easily because she said the students at Columbia were weird and didn't have very good personalities. Of course, this does not apply to all Columbia students because anywhere you go, there will be people you like and people you don't like, but based on this thread, I would have to agree. If all students at Columbia are this stuck-up and close-minded, then it must be a terrible place to be for college. But then maybe the people in this thread who are dissing NYU are applicants who won't even get into Columbia.<br><br>", "<b>Username: admissionsgeek</b><br><br>who are you arguing against ilove? i don't get it.<br><br>but you again are trying to construct somehow that being bellicose is bad, but yet our society encourages rivalry. and for better or worse, nyu and columbia are strong rivals.<br><br>perhaps you should ask the arrogant question about NYUers who write pieces for local websites that denigrate columbia? are they playing nice? this is not a rational debate about merits, it is a jingoistic argument with biased perspectives.<br><br>certainly i can read off a bunch of things that nyu is great in, but that is best done by NYUers than me on the columbia board.<br><br>and if your argument is somehow that columbians are arrogant and with 'weird personalities' that is basically a description writ large of most ivy leaguers.<br><br>the hilarity, is that columbia is known (and i would concur) as being the least arrogant of the ivies, far less so than Yale whose entire existence revolves around countering Harvard.<br><br>", "<b>Username: wanderlust10</b><br><br>Okay so, at my school, I am pretty sure that I am the only person EVER to apply to an Ivy. So while I agree that Columbia might be a \"better school\" that doesn't make it the right school for everyone. And from someone who has grown up around \"ordinary\" people, the chance to even go to NYU is amazing and would garner impressive looks just like Columbia would. I don't think this thread was supposed to be about which school is \"better,\" just a comparison for people who want to attend a good school in NYC. Because not everyone has the means to visit and there are some things you just can't learn from a website. So thanks for wasting this opportunity...<br><br>", "<b>Username: Toshtemirov</b><br><br>Guys what are you talking about?? It all depends on which major are you in. If you are a business major then go to NYU, especially if you major is Finance because it's ranked 3rd in the whole U.S. the undegrad. major in Finance at NYU better than Harvard's and many others, Accounting major was ranked 9th as of 2009. In addition to that, in some areas NYU is much better than Columbia, in others not.<br><br>", "<b>Username: admissionsgeek</b><br><br>columbia nor harvard, and probably not any liberal arts school has a 'finance' nor an 'accounting' major. thus, it is hard to compare apples to oranges.<br><br>and if you wish to major in 'business' then well, as many of us have gone off before, business education (heck look at the debates about MBAs) is a debateable concept. there are those like me who do not really believe in it. for the top tier, business ed is like specializing too early, at the lower tiers, the amount of knowledge you would already need to learn on the job more than supplements this need. it is catchy and kitsch, but not necessarily providing a basis in fundamental concepts, which college ought to do.<br><br>", "<b>Username: confidentialcoll</b><br><br>\"\"It all depends on which major are you in. If you are a business major then go to NYU, especially if you major is Finance because it's ranked 3rd in the whole U.S. the undegrad. major in Finance at NYU better than Harvard's and many others, Accounting major was ranked 9th as of 2009.\"\"<br><br>NYU has a finance major but unfortunately still does not place as well as Columbia or Harvard on wall street. More prestigious positions at top investment banks, asset management and consulting firms come to Columbia and Harvard than Stern. I've recruited on columbia's campus and have friends at stern and I've compared opportunities, columbia has more firms and better positions on offer. If you want to work in finance it's wharton then harvard, then others and columbia, then others and nyu.<br><br>Stern being in new york does better than say ross or UVA business.<br><br>", "<b>Username: mmmcdowe</b><br><br>Recruiters go where the talent is. Getting into Columbia already stereotypes you as being hardworking and intelligent. If neither of these things turns out to be true, it won't likely end well for you when it comes to job searching anyways. The prestige factor that recruiters are going to care about is in the achievement of showing that you were at the top of the applicant pool, not so much in the fact that you go to a specific school. I can only assume that a lot of firms have also had great success with Columbia alumni in the past and thus continue to pursue students based on that.<br><br>Merit will take you much farther than name, the problem is that it is hard to separate the two in many cases since merit is what you need to get the name ;). I have to agree with the fact that there are some pretentious folk affiliated with Yale. A group of my classmates were working at a bone marrow donor recruitment even at the Yale Club here in NYC and they wouldn't let them into the club proper to use the restrooms, get coffee, or even warm up because of the fact that they weren't alum or members. Sad, considering that they invited them there.<br><br>", "<b>Username: admissionsgeek</b><br><br>while we are on this conversation of business majors..<br>businessweek's latest ranking puts Wharton 3rd!<br><br><a href=\"http://www.businessweek.com/magazine/content/09_10/b4122048934051.htm\" rel=\"nofollow\">The Best Undergrad B-Schools - BusinessWeek</a><br><br>", "<b>Username: pigs_at_sea</b><br><br>i agree that Columbia > NYU :]<br><br>", "<b>Username: lovetodance21</b><br><br>ok i just have a few questions. Columbia was originally my first choice for college--unfortunately i was rejected. i was accepted to NYU however, and i plan on doing pre med there. I was wondering if NYU pre med really is any good? or should i consider transferring after a year or so of NYU...would that be more beneficial in applying for med school? and how is columbia as far as preparing people for medical school?<br><br>", "<b>Username: mmmcdowe</b><br><br>To be blunt, you got rejected from Columbia. I wouldn't put my money on transferring into it. Possible, I suppose, but its probably best to focus on achieving what you can where you are at. NYU pre-med will not hold you back when applying to medical school. Likewise, Columbia will not hold you back.<br><br>", "<b>Username: Ohboi</b><br><br>BUMP!<br><br>I NEED HELP deciding between these two. I got into NYU Stern for marketing (and probably minor in math and producing) and Columbia for mathematics. I feel like NYU has more chances for me to explore and combine my interests (namely business, math, theatre, and journalism), but Columbia has that top-notch rigor, appeal, and quality. I find it very difficult to compare an undergrad business major, which Columbia doesn't offer, with a mathematics degree. I have more of an idea what I want to do with my possible combination at NYU as opposed to just a math degree from Columbia.<br>I'm like freaking out right now because I thought Columbia was overrated until I went to Days on Campus and I fell in love with it. Then again, I love NYU as well.<br><br>", "<b>Username: mmmcdowe</b><br><br>Which do you think you will be happier at? It sounds like you are/were leaning NYU.<br><br>", "<b>Username: gedion9324</b><br><br>Columbia..no question. The quality of education that Columbia offers is on par with Harvard, Princeton and Yale. If you're still not attracted to Columbia, go to NYU. (at your peril)<br><br>", "<b>Username: Ohboi</b><br><br>@mmmcdowe<br>I'm not sure. My good friend told me he thinks I'll be happy at either, but says NYU because I've wanted to go there for so freakin' long. I didn't think I would get into Columbia, so I didn't look into it as much as I should have.<br>You're right, I WAS leaning toward NYU before DoC. Now it's 50/50.<br><br>", "<b>Username: Ohboi</b><br><br>@mmmcdowe<br>I'm not sure. My good friend told me he thinks I'll be happy at either, but says NYU because I've wanted to go there for so freakin' long. I didn't think I would get into Columbia, so I didn't look into it as much as I should have.<br>You're right, I WAS leaning toward NYU before DoC. Now it's 50/50.<br><br>", "<b>Username: mmmcdowe</b><br><br>Can you go visit the campuses again informally?<br><br>", "<b>Username: Ohboi</b><br><br>I don't think so. There's only 9 days until May 1. I think I got a pretty genuine feel of Columbia; NYU however, I feel like I have only seen when it was all glamored up for admissions events.<br><br>If I do not attend Columbia, is there still the opportunity to take a couple classes there in my undergad and have the credits transfer over? And vice versa?<br><br>", "<b>Username: mmmcdowe</b><br><br>I assume that NYU has a summer program, but honestly summer classes won't be the same as a college experience there. Same for Columbia if you went to NYU. You feel like you really liked Columbia in a genuine setting, I really suggest you go with your gut feeling. Even if it turns out that NYU is your gut feeling, don't let people discourage you by trying to plant fears of inadequacy and poor education. This is the Columbia board, we are naturally pro-Columbia here. We want you to like it because we like, but the bottom line is you'll be fine at NYU if that's the place that you are happiest.<br><br>", "<b>Username: Ohboi</b><br><br>@mmmcdowe<br>Great non-biased advice.<br>I guess one of my worry is that I might not make it into Columbia for grad school (I know, it's way in the future and I shouldn't be worrying about it yet), because I am set on attending Columbia at some point in my education. And see, if I do go to Columbia for undergrad, I probably won't go for grad (unless I love it THAT much). So it's like, I'm afraid that if I don't get in for grad school that I'll be upset with myself down the line for not going when I had the chance. I probably worry too much, but I can't help it.<br><br>", "<b>Username: mmmcdowe</b><br><br>I understand where you are coming from, I had a similar worry in undergrad. I went with the non-Ivy option and on occasion I did feel slight pangs of regret, but ultimately I am very happy with my outcome at the non-Ivy and would not change the experience for some might-have-been ideal. I guess I would ask will you feel pangs of regret if you don't got to NYU, or is it only one way?<br><br>", "<b>Username: Ohboi</b><br><br>Just out of curiosity, what schools did you choose between? (Ivy vs. non-Ivy)<br>I feel like I would be happy at either school; however, I feel like I'd feel that occasional pang of regret having gotten into both but turned down one [dream school (NYU) vs. great Ivy League opportunity that may not come again (Columbia)].<br><br>", "<b>Username: CCwillBurn</b><br><br>A handful of the posters in this thread seem overly certain from glancing over a few ranking lists that \"Columbia tops NYU in every way imaginable\". I'm not sure if these people are NYU rejects or simply ignorant. NYU is ranked higher in quite a few areas by various authoritative sources - in some cases even #1 (e.g. philosophy, applied mathematics). Do a bit more research before making unsubstantiated claims! ;)<br>\"\"Just remember, Columbia is far more famous than NYU.<br>Many people may have heard of NYU, but when people know you from an IVY college like Columbia, or even better, Harvard, their eyes are O_O.<br>If you tell someone I am from NYU, they will say, \"okay\"\"\"<br>I'm sorry but that's a load of bullocks. XD<br>If you socialized enough, you would be likely to learn that most people couldn't care less about the school you went to. And no, believe it or not, Columbia is not \"far more famous\" than NYU. If you want to see the statistics that show where I am coming from, just PM me. :)<br><br>", "<b>Username: PaxPax</b><br><br>Ivy league is Ivy league.<br><br>NYU is NYU<br><br>", "<b>Username: yaintime21</b><br><br>NYU is crappy. It's not even an actual campus. No comparison, whatsoever.<br><br>", "<b>Username: wahkimoocow</b><br><br>This shouldnt even be an argument lol.<br>Unless you are DEAD set on art or business, then yea choose tisch and stern over columbia.<br>other than that, go to columbia.<br>columbia wins overall by a big margin.<br>and nyu doesn't have a campus -_-<br><br>", "<b>Username: goestowashington</b><br><br>@CCwillBurn: It's more than a little disingenuous to use graduate school rankings as an indicator of the quality of undergraduate programs.<br><br>", "<b>Username: naomikt</b><br><br>Coming from a high school senior who applied ED to Columbia and is imagining a rejection in a week...take my opinion with a grain of salt.<br><br>I visited NYC last spring and I loved it. It was absolutely, totally beautiful. I love the city, and I mean I /love/ it. But at the same time, when I visited NYU I found the campus very disenchanting. If you don't mind being in a total urban setting (I thought I didn't, but it's different once you actually visit it) then good for you. However, VISIT the school before you send out a check. The campus is sprawled all around manhattan; there is no discernible campus boundaries. There is a main \"quad\" if you will, but it's just a big concrete slab with some concrete desks where students sit out with their macbooks and drink Starbucks. On the other hand, Columbia is HUGELY aesthetically appealing. You get a beautiful campus, sprawling grass, etc, etc. And of course, there's a subway stop literally right outside the gates. In my mind, you get the best of both worlds: a college setting and NYC at your doorstep.<br><br>There is no doubt that Columbia is quite a lot more competitive than NYU. AND their financial aid is much better than NYU, who admits openly they do not always meet 100% of need. Considering their nearly $55 price tag, that's definitely something to take into consideration - especially if you're planning on going to grad school. That being said, NYU has great graduate programs (several ranked higher than Columbia's). It's also a great substitute for Columbia for those who maybe don't QUITE have the SAT scores to get in, but are set on living in NYC. And who can beat their dorms? Private bathrooms in EVERY room. Also, if you have the money they have great study abroad programs. (Although I imagine Columbia does to.)<br><br>In the end, just see which one you get into and way your pros and cons. Overall, Columbia has more prestige and it has a much smaller, cozier (well as cozy as you can get in NYC) setting. But NYU is a great school too with a lot to offer.<br><br>", "<b>Username: blue147</b><br><br>TISCH - \"There probably is no better school in the country to prepare for a career in acting.\"<br><br>That's debatable.<br><br>", "<b>Username: SamSaulsbury</b><br><br>Huh, im a guy considering both, and (I decided nyu) I'd say you could find information like this out on pro forums for each college, having a comparison just makes ivy snobs and bitter ivy rejects come out of the woodwork to diss each college, just do the research yourself and go with your gut. It's well known that nyu doesn't have a campus, it's well known that Columbia has restrictive majors, just pick which is right for you. Although I would say if you want to do the arts nyu is pretty hands down for this one, agreed?<br><br>", "<b>Username: mardad</b><br><br>I agree with SamSaulsbury. A visit to the two campuses will tell the OP which he prefers. Two excellent schools, two very different campuses. (Of course the OP is already in college, but it would have helped)<br><br>"]}