{"title": "yale vs wharton", "comments": ["<b>Username: 1a1</b><br><br>I was lucky enough to get accepted to these two great institutions. Now, I need to choose.<br><br>", "<b>Username: thatguy100</b><br><br>hey.. im gonna be a tiny bit biased (got rejected from penn, accepted to yale)<br><br>BUT. straight up, wharton is a higher ranked MBA school (and their undergrad is awesome by extension) however, i got told (by both yale and penn) that getting your undergrad and MBA from the same school carries a negative stigma (many believe you only would have been accepted to the school because of your undergrad position.. which isnt true, but its the way its seen)<br><br>i went on visits to both yale and penn, and i can honestly say the atmosphere at yale is WAY better.. if you really like philly, then penns good, but yales campus etc is just spectacular, no comparison to penn...<br><br>sooo, if your overall plan is to get your MBA, then wharton is the place to be.. for your MBA only.. wharton is easily the best MBA program in the world (with harvard, IMD, london school of economics.. all are the top pretty much), so, if you are to avoid any negative stigma, i would choose wharton when it matters the most, not for undergrad...<br><br>for undergrad i would choose yale.. mainly because of the stigma issue and because yale is pretty much just plain better in my opinion....<br><br>", "<b>Username: 1a1</b><br><br>I'm definitely going to visit both schools before making a decision, but I got a better vibe initially at Yale's campus. Thanks for your input.<br><br>", "<b>Username: thatguy100</b><br><br>well good luck in your decision, and, like both yale and penn told me, youll be happy wherever you go. you cant really lose when it comes to the ivy league. except maybe like cornell :P lol kidding!<br><br>", "<b>Username: booyaksha</b><br><br>I go to Yale, econ major, worked at a bulge bracket investment bank last summer and will work at one again this summer. I also know a few top hedge fund managers, CEOs, etc. So I have at least some cred.<br><br>Here's the deal: Going to Wharton is not any better for business than going to Yale and studying economics. In fact it may even hurt you. Sorry, but that's the truth.<br><br>Why have I learned that?<br><br>All of the top investment banks look at Yale and Wharton (as well as other top schools). They take many kids from Yale and many from Wharton. However, if you go to Wharton, they absolutely drill you in the interview process. Every banker that I have talked to says that going to Wharton means that you will be drilled on technicals and EXPECTED to know everything ahead of time since you have been taught it. They realize that Yale (and Harvard) only teach economics, not financial modeling, so they have lower standards and look more at your general intellect. And, even though the Wharton kids know stuff going into interviews, they realize that Yale kids can learn it all on the job, so they take as many if not more.<br><br>This means that if you are an econ major at Yale you are not going to be put at any disadvantage even though you don't study \"business\"/\"finance\" whatsoever.<br><br>And, in fact, you will probably be put at an advantage. There are way fewer people from Yale looking to go into business so it may be easier to stand out. Moreover, business schools like Yale kids just as much as they like Wharton kids if not more since they haven't already studied business. And perhaps most imporantly, you will get to study something cool like economics--an actual real discipline--rather than just finance.<br><br>One senior exec that I talked to called Wharton undergrads \"preprofessional money-grubbing dou***bags.\" Quite simply, I don't think it's worth it...<br><br>", "<b>Username: 1a1</b><br><br>Wow, that was the kind of insider advice I was looking for. Thank you so much.<br><br>I had no clue that they tested Wharton kids at a different level, but it makes sense.<br><br>", "<b>Username: poste3</b><br><br>I smell bias, I know thats what you wanted but if you want an honest opinion dont post it in Yale's forum! What booyakasha said is not true, if you want to go into business wharton is a no brainer, ask anyone who really knows what he is talking about! (not saying that I do, I just think this is not the place to get the answers you are looking for)<br><br>", "<b>Username: poste3</b><br><br>BTW are you seriously stating that businesses like Yale kids better than Wharton kids because they haven't already studied business??? that is a complete fabrication! Plus, it doesn't even make any kind of sense. Could someone please enlighten me on how this can be possible?<br><br>", "<b>Username: 187</b><br><br>\"\"All of the top investment banks look at Yale and Wharton (as well as other top schools). They take many kids from Yale and many from Wharton. However, if you go to Wharton, they absolutely drill you in the interview process. Every banker that I have talked to says that going to <b>Wharton means that you will be drilled on technicals and EXPECTED to know everything ahead of time since you have been taught it. They realize that Yale (and Harvard) only teach economics, not financial modeling, so they have lower standards</b> and look more at your general intellect. <b>And, even though the Wharton kids know stuff going into interviews, they realize that Yale kids can learn it all on the job, so they take as many if not more.</b><br>...<br>One senior exec that I talked to called Wharton undergrads <b>\"preprofessional money-grubbing dou***bags.\"</b> Quite simply, I don't think it's worth it...\"\"<br>This has way too many logical fallacies to even begin with.<br><br>", "<b>Username: poste3</b><br><br>what buyakasha is basically trying to say is that Yale is obviously better because they dont teach you business, they dont teach you real life applications, and you are less qualified overall and because of this, top firms will lower their expectations and instinctively hire Yale kids. Yeah... that sound right. Please 1a1, dont let your decision be based by completely false and meaningless statements.<br><br>", "<b>Username: booyaksha</b><br><br>Wow, my statements are being completely misconstrued. All I am saying is that it does NOT make a difference and Wharton is not some magic route to an ibanking job that Yale cannot provide.<br><br>I have gone through this interview process twice. They do not expect you to know NOTHING if you go to Yale; they just expect you to know more about the general economy and general knowledge than drill you on accounting differences like between income statement vs. cash flow vs. balance sheet.<br><br>The thing about technicals is absolutely true; they expect you to know technicals when you major in finance at Wharton but they will use more brain teasers and general intelligence questions when you go to Yale.<br><br>I encourage you to look at other websites where kids actually know something about Wall Street. E.g. <a href=\"http://www.wallstreetoasis.com/forums/please-advise-future-wharton-undergrad\" rel=\"nofollow\">Please Advise Future Wharton Undergrad | WallStreetOasis.com</a><br><br>\"The main negative i my mind about Wharton is that it is extremely competitive to get good jobs.<br><br>While at HYPS, students want to be lawyers, doctors, professors, business, etc, everyone at Wharton wants to get into business. Yet the number of spots for BB is limited (probably around 10 into each IBD per year). This leaves quite a few students with less desirable jobs.<br><br>So you had better get an extremely high GPA and solid internships.\"<br><br>\"the bottom line is this.<br>If you want to work in Finance and don't care about a liberal arts education, go to Wharton.<br><br>If not, go to HYP.\"<br><br>ETC. Bottom line is going to Wharton is not much more likely to get an ibanking job than Yale and you should base your decision on if you ONLY want to study finance vs liberal arts. Ibanks realize that Yale and Harvard kids will learn how to do it on the job rather than at school but that DOES NOT mean they hire them disproportionately less than Wharton.<br><br>", "<b>Username: mancune</b><br><br>I'll answer with the benefit of experience at both schools, but in the end, this is only one person's perspective:<br><br>I graduated from Yale about 10 years ago having majored in Economics (did not apply to Wharton/Penn undergrad) and eventually went back and got an MBA/MA from Wharton a couple of years ago. I now work at a well respected hedge fund in NYC.<br><br>I have great respect for Penn and its powerful array of academic and professional programs. I found Wharton to be an impressive, challenging and well-oiled machine for churning out analytical business and finance types. People at Penn are smart, ambitious, friendly and know how to have a good time, too. It clearly offers one of the superlative undergrad experiences in the US.<br><br>For a narrow spectrum of students, Wharton would have no match as an undergraduate choice. But I believe this clutch of students is, and should be, relatively small. For intelligent and thinking students, life is too short for this kind of intense focus at such a young age. This is what grad/professional school is for.<br><br>For most talented kids, I honestly believe Yale is a better choice. Yale pulsates with intellectual and creative life in a way that Penn does not. Students at Yale are just more broadly curious and intrinsically excited by ideas and debate and discussion. Extracurricular life (except sports, perhaps) sparkles more brightly and the options are far wider. I do believe you will be stretched more as a student at Yale, in a way that will affect you throughout your life which is not quite as likely to happen at Penn. Though I like Philly as a city, I personally think Yale's campus is far more beautiful, bewitching and inspiring than Penn's. (For example, compare the horror of Penn's utilitarian Van Pelt library to the majesty of Yale's Sterling Library -- a nutshell of a contrast between the two universities.) Like most Yalies, I am a huge proponent of the residential college system which fosters a comfortable hominess in the undergrad experience.<br><br>As someone who now recruits in the financial sector, I can tell you that resumes from Wharton, Yale, Princeton and Harvard are all roughly equal when drawing a first glance from recruiters (then it's up to you to shine in an interview). Wharton does produce a lot of slick recruits with an early depth of knowledge you don't generally see in the other kids, but there is a cookie-cutter sameness about many of them. I find that that the interesting recruiting discussions happen with the kids from HYP who describe their Senior papers on topics like medieval philosophers and recent trends in neuroscience -- you are much more likely to see a truly creative mind who in the long run is more likely to do interesting things in the business world as well.<br><br>Good luck, and hope to run into you in New Haven!<br><br>", "<b>Username: Nanquanmikey</b><br><br>Wow, I'm in the exact same boat as you, choosing between Wharton and Yale!<br><br>I live right outside of Philadelphia, and it's a great city. If you are a city person you will definitely like Philly more than New Haven.<br><br>Just one note though: getting a Wharton undergraduate degree a lot of times makes graduates feel as if they do not even need an MBA. A lot of Wharton grads end up never getting one because of the training they got with their BS in Economics. Just keep that in mind!<br><br>", "<b>Username: Nanquanmikey</b><br><br>And I second mancune's discussion of the campuses. Penn's campus is great, but not nearly as nice as Yale's.<br><br>", "<b>Username: kafkareborn</b><br><br>Go here:<br><br>See what people in the industry have to say.<br><br><a href=\"http://www.wallstreetoasis.com/forums/wharton-or-hyp-for-undergrad\" rel=\"nofollow\">Wharton or HYP for undergrad ? | WallStreetOasis.com</a><br><br>", "<b>Username: poste3</b><br><br>Here is the deal, a lot of talented kids are in the same position as you, these are smart kids and they probably made a well-informed decision. Wharton's yield rate is 80% only matched by harvard. Yale is in the low 60 and princeton in the high 50. The numbers speak for themselves! I think some of these biased posts are a bit resentful because kids are choosing upenn (a lower ranked school) for wharton over HYP. It is your choice, go wherever you will be happier!<br><br>", "<b>Username: booyaksha</b><br><br>I hope this is my last post on this topic. In response to poste3, none of the college admissions statistics show much, save perhaps the \"peer admit\" selections.<br><br>Even yield rate, for instance, can be misleading. Yale yield rate is 69 percent, Harvard is like 76, and Wharton (I guess) is like 80. However, it may well be that Wharton kids always go because they do not get into Harvard or Princeton. Thus Yale's yield rate may only be lower because it has more overlap with Harvard and Princeton.<br><br>Brigham Young University has the nation's highest yield. But you'd be very hardpressed to prove that based on its yield it is a more attractive university than HYPS!<br><br>To reiterate, do not choose to go to Wharton because you think it will give you a huge edge. The reason to go is if you don't mind the intense competition and only want to study finance, not a broader liberal arts education.<br><br>", "<b>Username: kafkareborn</b><br><br>Posted this in the Princeton forum, it is probably relevant here also:<br><br>You can do anything you want after Wharton. Whartonites become doctors, Profs (Gene Falk at Princeton) and even Supreme Court justices (Brennan). Remember, business, finance, management skills, and all of the other things you get out of a Wharton education are essential in every field. Penn Med School is the oldest med school in America, and part of the med school HYP (Harvard Hopkins Penn), a few Whartonites end up there and at other top med and law schools every year. You lose nothing by attending Wharton since half of your courses are liberal arts courses, so your son can still get a broad based education and study what he is most interested in. When he graduates, any employer and grad school will want him. Whartonites are at the top of the recruiting pile in Wall Street.<br><br>Actually, going to Wharton is beneficial because it allows you to then go on and get a law degree or another degree of your preference outside of business. You already know everything the top MBA students know and your degree is respected as much as an MBA, most Whartonites do not go back to get an MBA because it is useless to them. BUT, if you do go to an MBA program, going to Wharton also allows you to place out of basic courses in an MBA program and lets you take more electives, essentially giving you a super MBA.<br><br>No door that is open to a Princetonian is closed to a Huntsman kid; but if you want to get directly into Private equity or hedge funds, the reverse is not as true since kids with a business background are strongly preferred in such firms due to their size.<br><br>", "<b>Username: Z.Exodus2008</b><br><br>I write as a source of second-hand (third-hand, perhaps?) information; my sister is currently a junior at the University of Pennsylvania, although not a Whartonite.<br><br>When I asked her about applying to Wharton next year, she told me that Wharton undergraduates have very little freedom, since there are many classes all Whartonites must take; these classes are supposedly structured in such a way that many students (NOT all, but many) come to think in very similar ways. Furthermore, the competition is absolutely cut-throat, worse than it is in CAS. It's said that a large portion of Whartonites (again, I repeat: NOT ALL, but many) are tools--very efficient and highly intelligent, but intensely focused (perhaps too much so?) on business, GPA, internships, etc. I've heard stories of students deliberately telling others false information at study groups in order to undermine the competition. (This practice, though, is obviously not very widespread. It's hopefully a worst-case scenario.)<br><br>That being said, she advised me to not even apply to Wharton. Of course, much of her opinion reflects what she knows about me, and I'm probably not at all like the OP (I intend to go to law school). Plus, she herself changed majors three times during college, so while she may think Whartonites' schedules are too predetermined and cookie-cut, it might seem fine to most.<br><br>The bottom line is that while some Whartonites are extremely happy, others are rock-bottom miserable, and this definitely isn't a singularly Wharton phenomenon. =P I know I haven't given you too much information, but I hope it's helped at least a tiny bit.<br><br>", "<b>Username: 1a1</b><br><br>Hmm ... this is all interesting. Thank you.<br><br>I am going to visit both schools before I make a definite decision.<br><br>", "<b>Username: Lergnom</b><br><br>You only want a business education, then go to Wharton. If you want more than that, then go to Yale. If you only want a business education, don't waste your place at a great liberal arts school because others will take advantage of what that offers.<br><br>Do you understand what a Yale education is? I'm disappointed. I'd hope they'd admit kids who value a liberal education.<br><br>", "<b>Username: 1a1</b><br><br>I do understand what a Yale education is, and that is a large part of the reason I applied to the school. I'm just having a very difficult time choosing between two great schools, seeing as I can't predict the future and know what my career will be. Even high schoolers who say that they are definite in studying business are susceptible to changing their minds. And that really isn't their fault, as who is to know what college experience will be better without knowing how their interests will develop in college?<br><br>", "<b>Username: kafkareborn</b><br><br>As if you cannot study things that interest at Wharton as well. I plan to minor in Philosophy for instance. Penn has a wealth of options and top profs to learn from. You lose nothing by going to Wharton, but you gain actual skills that you can use. You learn finance at a deep theoretical level. You do not have to get an MBA. Many Whartonites also go onto medicine school, get PHDs in Chemistry, become full bright scholars and study economic development in China. The breadth is available at Wharton as well. People who do not know anything about Wharton assume things about it that are just incorrect.<br><br>Check out this thread:<br><br><url>http://talk.collegeconfidential.com/princeton-university/896715-huntsman-vs-princeton.html</url><br><br><url>http://www.vpul.upenn.edu/careerservices/wharton/surveys/Wharton2008Report.pdf</url><br><br>", "<b>Username: An0maly</b><br><br>It seems to me like you're not 100% set on business. Although Wharton will also provide the liberal arts courses through Penn, I don't think it can compare to Yale. With Wharton you're basically set in the finance field and you have various professional/grad programs open. With Yale I think you have every single door possible open.<br><br>I was just looking over the courses at Yale and planning on how I want to double major in computer science and economics along with the MS in comp sci through the special program at Yale. I saw it would lock about 30 courses and I thought that my AP's would cover the general requirement.<br><br>Then I took a step back and realized I was being stupid. Here I have the opportunity to attend one of the greatest liberal arts institution in the country and I'm going to limit my focus? Not a chance. I want to take the English/History/Politics/Non-Science stuff that composes of a true Liberal Arts education and that's why I chose Yale over Penn. Both schools are great but I think the options and the experiences I'll have/get at Yale will be better for me.<br><br>Good luck mate! Hopefully I'll see you at New Haven next year.<br><br>", "<b>Username: Rtgrove123</b><br><br>Ya, I definately agree with An0maly. Though I think it depends how uncertain you are. For example, I am not sure I wanna b an Ibanker. Though, I do know I want to get an Econ degree because almost every possible career path I am considering (Med, consulting, Ibanking, business law) could be GREATLY enhanced with a financial degree.<br><br>Honestly, you can't go wrong with either choice. While UPenn does provide some liberal arts, Yale would prbly give you an even more holistic educational view. Thats not really for me but it may be for you. Just visit and research. At this point, rankings dont matter and it all comes down to fit.<br><br>", "<b>Username: kafkareborn</b><br><br>It is not like there is a huge difference in the quality of the liberal arts departments between Yale and Penn. If you look at the National research council's rankings, Penn has many top top notch departments (and many of that are superior to Yale). Penn is just one place behind Yale on US news and it is middle Ivy, the liberal arts experience is going to be very similar. It is not like Plato's republic is going to become so much better if you are studying it with a prof that published 500 articles on the book instead of 450, both of whom have Harvard PHDs. Plus, Penn has the one university concept. That means you can take classes at any of its graduate schools. So you can sit in on courses at Penn Law School, or attend Penn Med School lectures (the oldest med school in the country, top 3 along with Harvard and John Hopkins). The opportunities are limitless. Plus, you have a much wider range of choices within the financial industry itself. Yale sends almost no one to PE or Hedge funds directly out of undergrad. Such firms recruit most of their class at Wharton. That's because they are small and cannot train you as much so they want kids who are ready from day one, so Wharton kids have a huge advantage in getting hired. Some firms, like Silver Lake, recruit exclusively at Wharton. If your goal is to get into finance, Wharton is the best place on earth. If, however, you find the idea of studying detestable, I would recommend Harvard over Yale since it has a far far larger alumni network in the financial world. If you do not mind studying business, Wharton is the clear choice.<br><br>Look at this:<br><br>As you can see, some Whartonites end up in many varied fields. You can do everything you can do at Yale at Wharton. Wharton does not pigeon hole you, that is a myth. This list, that shows you where Whartonites go right after undergrad, proves that.<br><br>Business and Public Policy<br>Harvard University - Kennedy School, MPP (Public Policy-Social Policy &amp; Inequality)<br>Finance<br>Harvard University, MPP (Public Policy)<br>Harvard University, JD (Law)<br>MIT, PhD (Financial Economics)<br>Stanford University, MA (International Relations)<br>University of Pennsylvania - Wharton School, MBA (Private Equity, Strategic Management)<br>University of Pennsylvania - Wharton School, MBA (Finance)<br>University of Pennsylvania - Wharton School, MBA (Entrepreneurial Management)<br>University of Pennsylvania - Wharton School, MBA (Finance, Management)<br>University of Southern California, JD (Law)<br>Finance/Bioengineering/Biotechnology<br>University of Pennsylvania, MS (Biotechnology)<br>Finance/History<br>University of Maryland, JD (Law)<br>Finance/International Studies and Business<br>London School of Economics, MSc (Economics)<br>Oxford University, MSc (Economics for Development)<br>Finance/International Studies and Business/East Asian Languages and Civilizations<br>Peking University, Fulbright Scholar (Economic Development)<br>Health Care Management &amp; Policy/Bioengineering<br>University of Pennsylvania, MD (Medicine)<br>Management<br>Tulane University, JD (Law)<br>Marketing<br>University of Pennsylvania, M.S. Ed. (Higher Education Management)<br>University of Southern California, MFA (Producing)<br>Operations and Information Management/Chemistry<br>Harvard University, PhD (Chemistry)<br>Real Estate/Individualized Major (SEAS)<br>London School of Economics, MSE (Real Estate)<br><br>", "<b>Username: 1a1</b><br><br>kafkareborn, you bring up good points.<br><br>On a related note, is there some reason you don't like Yale? On an other thread, you posted \"Yale seems so depressing.\"<br><br>Is there any reason why? Thanks.<br><br>", "<b>Username: kafkareborn</b><br><br>No. Lol, I applied to Wharton ED. My father went to Harvard though, he used to dunk me in water if I ever said the word Yale, bad memories, JK! Just today I wrote a post about how I admired Yale's debate team (it was the same post that I said I found the campus to be depressing). If I wanted to become a lawyer, I would almost have certainly gone to Yale above any other school, since Humanities are its main strength. Two of my cousins went to Yale. Plus, my prep school is a feeder school to Yale. If anything, I should be boosting Yale.<br><br>", "<b>Username: 1a1</b><br><br>But what made you think Yale seemed depressing? Just wondering. Congrats on Wharton ED btw.<br><br>", "<b>Username: Rtgrove123</b><br><br>I wasnt a huge fan of the neighborhood around Yale....which kind of made it depressing. However, that was just a personal thing. The gothic style of most buildings at Yale is simply stunning. Though, Huntsman Hall is every bit as fantastic.<br><br>", "<b>Username: kafkareborn</b><br><br>Thanks. I just did not like the gothic architecture. The architecture coupled with the gray sky and weather made me feel like commiting suicide. It was like seeing a dementor. Lol, I am kidding, it was not that bad, just was not my thing. Some people think it is the nicest campus on earth.<br><br>I hope to see you on campus. Try to go to Penn on the 16th. It is spring Fling (the biggest college party on the east coast. Kid come from all over the east coast to be there. This year Snoop dog and kesha are coming, last year it was Akon and a few other people. I hear it is just amazing. It'll give you a taste of Penn culture.<br><br>", "<b>Username: 1a1</b><br><br>Kid Cudi too! How is that going to work out? Going to admitted events and everything with spring fling going on?<br><br>", "<b>Username: kafkareborn</b><br><br>No clue, ha. But that's okay. I am sure they have handled this type of thing before.<br><br>", "<b>Username: MSauce</b><br><br>If you choose Wharton without visiting it first, you're crazy. Yale is not in a nice city, but the campus is fantastic and beautiful. Wharton is nice. But when you visit the two schools, there is a distinct difference in the atmosphere and appearance. I loved Wharton until I actually visited it and compared it to some other Ivies (Brown, Princeton, Harvard, and Yale specifically)<br><br>From reading the kafkareborn thread comparing Wharton to Princeton and now to Yale, I think we can confirm him as a strong Wharton homer. Absolutely, if you go to Wharton over Yale, you better be pigeonholed in business. Sure, you can go on to do many things out of Wharton. But that's true of almost any College--one of the richest men I've ever met got his undergraduate at a Community College. The point is not that you <b>can't</b> do certain things after graduating from Wharton--the point is that Yale is far better in every academic category with the exception of Business, which Yale doesn't offer. The only reason to choose Penn over Yale is for the Wharton Business school in the first place, so if you change your major--while you won't be trapped--you'll have <b>definitely</b> made the wrong decision.<br><br>Then the question is raised whether, if you're sure you want to enter business, you prefer Yale or Wharton. I'm a prospective student this Spring, I chose not even to apply to Wharton. The way I see it, when it comes to business, I'm probably going to want to go on to get my MBA. I have a tough time believing Business graduate schools are going to treat Wharton students in a higher regard than they'll treat students from Harvard and Yale. At worst, they'll be equal--and that's if they don't consider that Yale and Harvard are generally more selective and attract a higher quality of student, even if the Whartonites already know a bunch because of their undergraduate experience.<br><br>Again, its a matter of opinion, but unlike kaf, I'm not an alumni (or current student?) of either of the schools. I'm making my College choices (with an interest in business) just like the OP is. I chose during the admissions process that I wasn't interested in Wharton, simply because it doesn't offer enough advantages to make the up for its disadvantages, such as the campus, the quality of fellow student, and the huge deficits in comparison to Yale if you'd like to change your major.<br><br>That was my opinion, and I'll understand if your opinions are different, because its admittedly in the eye of the beholder. But my advice to you would be to keep in mind the greatest Wharton supporter on this thread is likely a bit biased due to his ED to Wharton--and he might admit as much. If you decide to go to Wharton, <b>definitely</b> visit first. I loved it until I did so.<br><br>", "<b>Username: poste3</b><br><br>@Msauce<br><br>\"Yale is far better in every academic category with the exception of Business\"<br><br>Not even close to reality<br><br>\"Yale and Harvard are generally more selective and attract a higher quality of student\"<br><br>When looking at Penn as a whole yes, but when comparing to Wharton the quality of students and selectivity is virtually the same.<br><br>", "<b>Username: kafkareborn</b><br><br>Yes, I am biased. But notice, you did not deconstruct any of my arguments. It is one thing to say that I am biased, it is quite another to prove that I am wrong.<br><br>\"the point is that Yale is far better in every academic category with the exception of Business, which Yale doesn't offer.\"<br><br>That is simply not true. Penn Med is light years ahead of Yale Med, for instance. That is relevant because you can take classes there as an undergrad at Penn. Penn has the one university concept, so you can take classes at any of Penn's grad schools. Penn is stronger in many sciences than Yale because of the Med school. Penn also has a better anthropology department, and numerous other departments. Don't let the whole general prestige thing sway you. These are both ivy league schools, both offer a superb liberal arts experience, the only difference is that Wharton offers you more on top of that.<br><br>\"Business graduate schools are going to treat Wharton students in a higher regard than they'll treat students from Harvard and Yale. At worst, they'll be equal--and that's if they don't consider that Yale and Harvard are generally more selective and attract a higher quality of student\"<br><br>Not true. Wharton is just as selective as Harvard and Yale (similar SATs and acceptance rate, its yield is higher than both at 80%). At this level, business schools do not give a rats ass where you went to college. The only thing that matters is work experience and college GPA. You will probably get a better job coming out of Wharton than Yale, so you will be more completive. Plus, why would you even want to go to business school? You already know everything the MBAs know, you learned the stuff from the same profs ! Most Whartonites do not go back to get an MBA because they can get the same jobs you can get with 2 degrees simply with their single degree. There is also no guarantee that you will be accepted by a top MBA program. Most traders never get an MBA, an MBA is not valued in that field no matter where you went to school. Many businessmen realize that an MBA is only good if you want to switch careers and for networking. That's it.<br><br>\"The only reason to choose Penn over Yale is for the Wharton Business school in the first place, so if you change your major--while you won't be trapped--you'll have definitely made the wrong decision.\"<br><br>Not true, you can double major in the field you want. Many Whartonites do that and end up at top grad schools (look above, some become MDs). No doors are closed to you by going to Wharton. The reverse is not true, getting into high finance jobs (PE hedge, hedge funds, is much much much easier out of Wharton than Yale) I explained why that is the case and provided proof on the princeton vs huntsman thread.<br><br>Ultimately, it is up to you. Go visit both schools. See what you think. Hear what the students have to say. See which students you like more. And go to the school you love. Both schools are wonderful.<br><br>", "<b>Username: DunninLA</b><br><br>MSauce wrote: \"the point is that Yale is far better (than Penn) in every academic category with the exception of Business\"<br><hr><br><br>Good lord, where did you get that broad brush, at the store for crude thinkers? That's as silly as saying that Harvard is better in every academic category (than Yale) with the exception of Theater.<br><br>", "<b>Username: Lergnom</b><br><br>The question, again, is blunt and simple: a business education versus a liberal education. The answer depends on the person. To argue about the relative worth of the schools is stupid. I've never understood this ridiculous hair-splitting among very good schools. We're not comparing community college to Ivy League. Most of the differences are imagined or important only in the mind of the advocate - and that means, of course, the real issue is the need of the advocate to get others to agree, to win, to impose a perspective.<br><br>It matters if we're talking grad schools, but not so much if we're talking top tier grad schools, particularly in business because that feeds into the economy, not into academia. Want to be an economics professor? Better go to one of the top ranked grad schools. Want to be successful in life, in business? That's a much wider universe and you'll find highly successful people from many programs - and from no program at all.<br><br>Why do people confuse these issues? Especially intelligent people who get into places like Wharton or Yale?<br><br>", "<b>Username: 1a1</b><br><br>Is there a link where I can view graduate school placement for Y and W graduates?<br><br>", "<b>Username: kafkareborn</b><br><br>No such link exists. Wharton would probably not do as well in that regard, but that is only because they do not need or want to go to grad school. They can get the same jobs as the Yalie with an MBA with just their Wharton degree since it is that respected.<br><br>The fact of the matter is, it depends on you. People go onto to top grad schools from both Wharton and Yale. Grad school adcoms would view both equally (they are much more concerned with what you did after school, not where you went to school though). The question is what YOU want to do. Wharton gives you the flexibility of deciding that you do not want to go get an MBA at all. Or you could pursue a law degree, and have the equivalent of an MBA without pursuing a JD / MBA. You would have the equivalent of a JD / MBA without taking an additional 2 years out of your life. Options exist to earn an MBA in a single year as well, or to place out of basic courses in your MBA program and take more electives. It is just more efficient.<br><br>Remember, even if you decide to become a chemist when you are in Wharton, the skills you learn will be transferable to your job. You learn how to manage a team, how to set up your own company, how to manage your expenses, and just about everything else under the sun. It is a full blown MBA. If you look at the list I provided above, it shows that Whartonites pursue chemistry degrees at Harvard, Medical School at Penn, and go onto become Fulbright scholars in China. If they choose to do all that, they can do so easily. My advice to you is simple: If you are leaning towards becoming an econ Prof. go to Yale, if you are leaning towards entering business, go to Wharton. It is that simple. Remember, you also take liberal arts courses at Penn. I am going to minor (maybe double major) in philosophy, simply because I find the subject interesting. You do not sacrifice the liberal arts by going to Wharton. Finance, as an academic subject, also interests me immensely. I would love to study under Siegel and Souleles, legends in their field.<br><br>Go on the revisits. Try to talk to people there. Figure out why the cross admits turned down Yale or Wharton. They will probably be the most helpful people to you. See which student body you like more. Where would you have more fun? Do you prefer Philly to New Haven? Which campus do you like? Which school will help you with your career goals better? For instance, if you are gunning for PE, you would probably go to Wharton over Yale; if you just want to be a normal banker, then both schools will do and the cultural stuff mentioned above takes precedent.<br><br>I think that is all I have to say on this topic. Good luck on your decision, you are smart, I am sure that whatever choice you make, it will be the right choice for you.<br><br>", "<b>Username: aweirdo</b><br><br>Go visit. If you are more pre-prof, then W would be good. For me though, I would choose Yale, just so that I would have a more rewarding and liberal-arts (and less cutthroat) education, but that's just me. You should go to the place that feels most comfortable to you, because honestly, at this point, it's all about fit because they are both great schools with about the same level of career opps (W might be stronger in recruiting but honestly, everybody I've met at W wants to go into ibanking and the competition for the same jobs is something fierce).<br><br>", "<b>Username: 1a1</b><br><br>I'm definitely going to go visit to find my fit.<br><br>", "<b>Username: polyglotmom</b><br><br>My S's classmate will be getting dual degree - Wharton (B.S.) and College of Arts, Math degree (B.A.) in four years. I also know someone who got an MBA with an extra year of study. These are some unique Wharton benefits. Having said that you can't go wrong with either Yale or Wharton. Congratulations!<br><br>", "<b>Username: sjmomof2</b><br><br>D had the choice between Wharton and Yale. Husband is a Wharton alum. In trying to convince her to go to Wharton he told her that Wharton is about the \"destination\" and Yale is about the \"journey.\" To his surprise, she chose the journey, and thus far has had an incredible experience at Yale. She has several leadership positions, has interned at a bank abroad and recently won a coveted internship with competition from Wharton, Harvard etc. Bottomline is that you have great choices. You just need to decide what's best for you.<br><br>", "<b>Username: 1a1</b><br><br>sjmomof2: could you elaborate? What field is your daughter in, what type of internships, etc. I'm just curious to see the path of a Yale student. Thanks.<br><br>", "<b>Username: 1a1</b><br><br>Do you guys think it would be more beneficial to pursue business in Yale through economics or Ethics, Politics and Economics? Or, what kind of jobs can you get studying EPE?<br><br>", "<b>Username: tlashley</b><br><br>This is an exact question of mine.<br><br>", "<b>Username: booyaksha</b><br><br>EPE or Economics are both good for business or law or whatever.... your major, especially between those two, does not matter.<br><br>FYI, EPE is a competitive program to which you must apply during your sophomore and be accepted. Econ you can just major in if you want.<br><br>", "<b>Username: 1a1</b><br><br>How competitive is it, in terms of percentages? Thanks so much by the way.<br><br>", "<b>Username: kafkareborn</b><br><br>If you want to get the best jobs possible, go to Wharton. Coming out of Yale, you will almost certainly be able to get a BB IB, S&amp;T, but more so MBB (consulting) jobs if you have a high GPA and show some basic knowledge of the industry. Obviously, you get all of that at Wharton too, and Wharton places a hell of a lot more kids than Yale does into those jobs.<br><br>However, the cream of the crop at Wharton have options that Yale kids don't, thanks to their in-depth business knowledge. That includes Private Equity (the pay is almost twice that of the jobs mentioned above and is a lot more interesting. Half, or more than half of most firms PE jobs will go to Whartonites - some Yalies do get in right out of undergrad but it is very rare), VC (which some Yale kids do get into, it is just rare), and Hedge Funds (which is very rare for a Yalie). Some firms recruit exclusively at Wharton - like Silver Lake. If you want to have the widest possible set of jobs in the financial industry open to you, go to Wharton. If you want to have the widest set of jobs in all industries open to you, go to Wharton, but double major and get a liberal arts degree from Penn's college.<br><br>The rankings on the street of so-called \"target schools\" are:<br><br>Wharton and Harvard at the top rung, and then the rest of HYPSM (Yale being last among these when west coast positions are taken into consideration). Yale's greatest strength is its humanities. If you wanted to be a lawyer I would say go to Yale, no contest (unless you wanted to become a lawyer in a field related to finance). The Yale alumni network is much smaller relative to Wharton and Harvard since its MBA program is very weak. There is a reason that Wharton alone has produced more billionaires than all of Yale combined. Look, the bottom line is: if you want to be a banker or a trader or whatever, and don't mind studying business along with liberal arts courses, go to the school known for its strength, go to Wharton.<br><br>", "<b>Username: kafkareborn</b><br><br>If these schools are so close in your mind, why not just go to the school that has an alumni network in finance that is probably 5 times the size? We have already established that you can get a superb liberal arts education at both institutions. We have also established that for your career path, Wharton outstrips Yale (significantly if you count getting a PE, Venture Capital, or a hedge fund gig). Both schools provide for amazing undergraduate experiences. We have also established that going to Wharton means that you do not have to get an MBA, whereas the necessity of one at Yale is far far more likely, if not almost always necessary.<br>But Wharton has one advantage that Yale does not, the largest network on Wall Street. Only Harvards rivals Wharton for power. Ask anyone in the industry, they will tell you that networking is perhaps the most important thing when looking for a job. Wharton helps you there far more than Yale does since it has a vast alumni base (that Yale does not), that, in turn, provides for better job security since even in London or Hong Kong, there will be plenty of Wharton alums to help you out.<br><br>But you are choosing from two of the best schools on earth. Revisit both, talk to some professors at both Yale and Wharton if possible. There will be a lot of Wharton kids that turned down Yale for Wharton, approach one and ask them why they did that. Do the same at Yale. Ask both sets of kids what the career options are at both schools. You really cannot go wrong. Two of my cousins went to Yale. Both loved it. Another went to Penn, he loved it as well. All would agree that you are in a superb position. Congratulations and good luck. You seem like a very interesting person, which is why I have spent so much time trying to sway you. I hope I get to see you on campus!<br><br>", "<b>Username: 1a1</b><br><br>I really appreciate all the work you've put in towards your responses. I will be visiting both schools in the coming weeks.<br><br>The most important thing I want to establish is my potential career. I know both schools provide many options, and I would like to pursue a career in business, but whether it is in Wharton's specialty of ibanking/Wall Street or the more humanities-centered consulting/politics/NGO, I do not know yet.<br><br>", "<b>Username: kafkareborn</b><br><br>Your welcome. Whartonites help fellow Whartonites in need, it is part of Penn's culture.<br><br>I've just got one more thing to add:<br><br>Going to Wharton also gives you in-depth knowledge about these different career paths, (far more than you could learn over a summer internship) so you will know exactly what you are getting into. Wharton MBA students who have already gone through the process can also be useful guides and chaperones for you. So that will help you decide precisely what facet of the industry you love you wish to pursue.<br><br>You might want to give this thread a read as well:<br><br><url>http://talk.collegeconfidential.com/university-pennsylvania/899983-gladwells-theory-supports-wharton-ug.html</url><br><br>", "<b>Username: An0maly</b><br><br>If you're definite about a career in business, I think Wharton makes more sense no matter what the field. It's important to keep in mind, however, that Yale doesn't have as many UG's <i>interested</i> in Wall Street as compared to Wharton. If you look at the proportion who get a job vs. those interested in one, I'd imagine it's quite high. That being said, Wharton is still your best bet for business.<br><br>Btw, thanks for all the great posts kafkareborn. They all seem very unbiased and are a useful source of info to all, especially pre-frosh like me.<br><br>", "<b>Username: mancune</b><br><br>1a1<br><br>As a Yale BA and Wharton MBA who now has recruited for several years for a prominent fund, let me assure you that a Yale degree with a good GPA puts you in just as good a stead for a career in finance as Wharton. Yale is one of the target schools of any organization that habitually recruits on the street because it has some of the best undergrads in the land and you will find Yalies in positions of power all over the street. Only difference is they have generally had a much broader education than the Whartonites.<br>In addition to business, Yale's alumni network extends deep into other channels of power. 5 of the last 6 presidents have a Yale degree; Penn has never produced a president, for example. 3 of the 9 current supreme court justices have a Yale law degree, even though it's one of the smallest law schools in Amarica. There are no Penn people on the court now or in recent memory. In the long run, Yale's stature and power can be very important for a career.<br><br>Go to Yale, get broadly educated, work a little, get an MBA. Life is long, live richly!<br><br>", "<b>Username: kafkareborn</b><br><br>Wrong. Penn has produced a President (William Henry Harrison) - as well as the leaders of many nations (Nkhrumah, for instance). It also has produced more signatories of the declaration of independence than any other school. But how that will help you in business though? Last time I checked, your average Yalie did not call up Bush for help, unless you are in the skulls and bones or something (ha, if i knew for certain that I would get into the bones that would make my decision much much harder, they would be very hard to resist. One of my cousin was tapped by a society (not the bones) but he turned them down; I will never forgive him for that.<br><br>No doubt, Yale law school is the best of the best; it puts even HLS to shame. But, again, the connections you make there are very unlikely to help you in your career in any way. They are interesting to have, sure, but that's it. Penn has a law school, nowhere near as good as Yales but still, that can offer you useful connections. Look, if you wanted to become a lawyer, I would probably be making the same arguments that I am making for you to choose Wharton about Yale, I openly admit that their law network is much stronger. But if business is your main focus, then the strength of the Wharton network is much stronger than Yales.<br><br>", "<b>Username: mancune</b><br><br>kafka-<br><br>You got me. I forgot about Harrison 150 years ago, but Yale has produced 5 of the last 6 presidents and many of the also rans like Kerry, Lieberman, Dean and Hillary. World leaders? The recent presidents of Mexico and Turkey were educated at Yale, for starters, and are teaching there now. Tony Blair chose Yale to host his institute for religion and politics, and is teaching there now, too. It is a powerful, powerful, network.<br><br>Look at this study by the Wall Street Journal on the undergraduate sources of students at a selection of top graduate professional schools:<br><br><url>http://wsjclassroom.com/pdfs/wsj_college_092503.pdf</url><br><br>It's not even close; the academic quality of the student body at Yale is just that much better. (I suppose you'll argue that Penn students, unlike Harvard, Yale and Princeton, don't need to go to grad school).<br><br>And, of course, there's gotta be a reason students choose Yale over Penn almost 90% of the time:<br><br><a href=\"http://www.nytimes.com/imagepages/2006/09/17/weekinreview/20060917_LEONHARDT_CHART.html\" rel=\"nofollow\">The New York Times > Week in Review > Image > Collegiate Matchups: Predicting Student Choices</a><br><br>", "<b>Username: kafkareborn</b><br><br>Ha, mancune, you have a little spark in you, I like that. But that does not change the fact that you're wrong.<br><br>First of all, you make the fallacy of comparing all of Penn to all of Yale; we are comparing Wharton and Yale College here for someone that is interested in business. Wharton's network, in the relevant career field, absolutely trumps Yale's (much in the same way that Yale's trumps Wharton's in politics - something I do not deny). But the OP is not talking about Politics, stay focused on his interests. For his interests, Wharton is \"just that much better.\" Wharton alone has produced more billionaires than all of Yale combined. It is great that Yale has produced all of these presidents, but that has ZERO effect on you and your ability to network with alumni to find a job in the business world. Zero. Yale beats Harvard in the political arena, I am not surprised that it has some impressive alumni in politics, but that is not what we are discussing here. Last time I checked, the OP has an interest in business, not politics. And just as Yale's network puts Penn to shame in politics, Wharton's network puts Yale to shame in business. Which, again, is really what is most important to the OP. Alumni arguably matter more in business than in any other field. I'd love to hear of the time you called up Kerry and had him help you out on a huge deal. Again, Penn also has many prominent people in politics currently, Huntsman (the current ambassador to China and a former governor is an alum, as is Ed Rendell, as is the head of Time Magazine, Joe Klein).<br><br>Secondly, the WSJ source also says that Duke places more kids into grad schools than MIT and Dartmouth. Caltech places worse than Cornell, Wesleyan and Rice. Doesn't that strike you as odd? What, are you going to argue that a hopeful engineer should go to Yale over Caltech because of this WSJ ranking? Obviously that is very foolish. Furthermore, it is talking about all of Penn, not Wharton specifically. Congratulations on finding a credible source to back up your claims.<br><br>For instance, Penn sends the most kids to Penn Med, the oldest med school in America. It is superior to Yale Med School. If Penn Med was included and Yale Med taken out that would undoubtedly sway things in Penn's favor significantly. (The article says as much: Penns medical school (not one of our survey schools) has the highest percentage of Penn undergrads in six years.) Had Penn Med been included, that would easily add another 50 kids or so to Penn's total and detracted some large number from Yale's. Stanford's MBA program was not included. Dartmouth Tuck School was chosen over Columbia business school. It is all very questionable. Michigan law was chosen over Penn Law or NYU law. These rankings are a single data point and not a very good one as I demonstrated above. They should have gone with the top 5 schools in each field and left it at that. Also, Wharton makes up around a 1/4 of Penn's class. Few Whartonites go onto grad school (Wharton profs themselves have said that the undergraduate cirriculum is superior, or at the very least on par with, the MBA one) because they have no need for it. Therefore that does reduce Penn's standing in such a ranking simply due to that fact.<br><br>Your preference ranking is also misleading, because, once more, it refers to all of Penn and not Wharton. The most applicants have little interest in business, and therefore would probably not think of Wharton or Penn as highly as Yale, so that skews the data. However, if you did a preference ranking of kids interested in business, Wharton would kill Yale. But that is not all, if you look carefully at the graduate schools chosen; there it is very easy to sway the rankings significantly one way or another. Anyways, the preference of a few college kids is insignificant to me, I care far more about employer's preference and Wharton wins at that hands down (particularly in high finance areas like PE firms, VC firms, and Hedge Funds).<br><br><br>In the past ten years, Penn has produced ten Nobel Winners to Yale's 8. That does not seem that \"vastly different\" to me. Many of Penn's college's departments beat or are essentially equal to Yale's in the National Research council rankings, the same is true at the grad school level. The truth is, out of these schools is middle to upper Ivy League schools, both have incredibly brilliant kids and professors, Nobel prize winners and the like. Both will provide you with a superb liberal arts education. Is Noam Chomsky stupider than Yale's top linguists just because he graduated from Penn ? And what about Joe Klein? Try harder mate. Try to stay on topic next time. :)<br><br>", "<b>Username: mancune</b><br><br>kafka-<br><br>Your arguments are getting as absurdist as the tales of the Czech master whose name you have coopted!<br><br>I don't have the time to dig out data on the past 10 years, but over the long run, Yale has had far more Nobel laureates associated with it, 48, to Penn's 23 according to this tally:<br><br><a href=\"http://en.wikipedia.org/wiki/List_of_Nobel_laureates_by_university_affiliation\" rel=\"nofollow\">List of Nobel laureates by university affiliation - Wikipedia, the free encyclopedia</a><br><br>And remember, Yale is half the size of Penn and Penn enjoys the advantage of a much larger medical complex, where a lot of laureates are generally nurtured. Penn SHOULD have many more laureates than Yale, other things being equal, but somehow it has managed to come up with fewer than half as many.<br><br>Like all Wharton undergrads, you view an education's purpose by its proclivity to place you in whatever flavor-of-the-moment boutique all your friends are excited about. So, let's do a little investigation.<br><br>Did you see the journal front page last week (I think April 2nd) on the 10 biggest pay checks on wall street this year. I guess you could call these guys the 10 \"big swinging d<u>cks\" of Wall Street: John Paulson, David Tepper, Phil Falcone, John Arnold, Ken Griffin, Ed Lampert, Carl Icahn, Steve Cohen, James Simon and George Soros. All hedge fund heads. Six have a connection to Harvard, 2 have a connection to Yale (Ed Lampert-undergrad and Phil Falcone law school dropout), and only 1 has a connection to Wharton (Steve Cohen). Two have a connection to NYU and one to Princeton and 1 to Carnegie Mellon. In the long run, there is no disadvantage to going to an HYP vs Wharton, even for scaling the heights of finance.<br><br>I was a Wharton MBA student (Lauder) so I know well what Wharton is all about. I took finance with Franklin Allen and Jeremy Siegel and Gary Gorton (now at Yale, I think) and marketing with Jerry Wind. I put up with the gunner 20 year old Wharton undergrads who think that grinding out equations on derivative gammas is the holy grail of life. I found them narrow and homogeneous in interests and outlook and generally less interesting as a group than my peers at Yale as an undergraduate.<br><br>Look at the business world. Who has created the businesses that literally change society over the past 30 years? Bill Gates and the Zuckerberg kid from Harvard; Steve Jobs from Reed College; Princeton kids founded Amazon and eBay. Stanford students produced google and yahoo and a gazillion others. A Yalie gave us realaudio which ushered in the audio download revolution. I just don't see as many Whartonites starting truly creative ventures with revolutionary prospects -- they're just too narrow in outlook.<br><br>It seems like it's the HYPS kids who are changing the world, in business and in other sectors, not the Wharton gunners.<br><br>Again, if you're smart enough to get into Wharton undergrad, you'd do better to get the kind of broad, creative education that HYPS fosters and hang around with those kids, at least according to my personal observation. There's time to become a finance dweeb later [like me].</u><br><br>", "<b>Username: 1a1</b><br><br>If you don't mind me asking, what type of job do you currently have? I haven't met anybody else who has done Yale UG -> Wharton MBA.<br><br>", "<b>Username: kafkareborn</b><br><br>I'm glad I met you Mancune, youre a good debater. But yet again, I find that I disagree with you. I will attempt to refute you point by point.<br><br>He said: \"Like all Wharton undergrads, you view an education's purpose by its proclivity to place you in whatever flavor-of-the-moment boutique all your friends are excited about. So, let's do a little investigation.\"<br><br>False. The Whartonite you are talking to disproves it. I have a strong interest in philosophy; Penn allows me to pursue my interest in Philosophy with some of the world's best professors, study alongside brilliant students, and read Plato and Heidegger to my heart's content. While simultaneously studying topics that I find equally intellectually stimulating, topics like financial theory. I am a utilitarian in the Millhousian stream. I believe that the value of what we learn can only be judged on the outcome that that knowledge has on greater society. If you think about it, we, students at elite institutions, have been endowed with great cognitive abilities. That was no mistake; we have an obligation to use our abilities to enrich society, whether that be in art or finance. Economics tells us that specialization makes for a more efficient market; therefore, you should specialize in a field that you are best in, in order to have the greatest impact on society. So if finance interests you, study that. If it is physics, study that. In my purview, that is the only metric that can be used to decide whether a subject is worth pursuing or not. I also believe that there is nothing inherent about Philosophy that makes it more of an intellectual undertaking than stochastic calculus, for instance.<br><br>Wharton allows you to pursue BOTH philosophy, biology, chemistry, or whatever it is that tickles your fancy and broadens your mind (as you put it) and the finance courses, management courses, and other courses that a utilitarian would value. So you get the best of both worlds. The better career options, the efficiency of the degree, and all of these other things are just added benefits. At least 30% of Whartons undergraduate class does double majors, even greater numbers minors in something else. Everyone explores a full range of liberal arts topics, whether they double major in them or not. The fact of the matter is, you still get a liberal arts education at Wharton through Penns fantastic college (which is ranked right behind Yale on US News let us remember).<br><br><br>Now, onto the Wall Street Journal article. Firstly, Id just like to point out that Penn currently has more billionaires than all of Yale University combined. Many, if not most, of Yales billionaires inherited their wealth, I would know since I went to the same prep school a number of them did. Penn has 27, Yale has 19. Wharton alone has produced more billionaires than all of Yale combined. Wharton, at the undergraduate level, has produced more billionaires than any other university; Harvard comes in second. At the undergraduate level, Wharton is king. Whartonites are known for their domination of the finance field, so it is not unexpected that when the biggest financial crisis of our era hit, Whartonites were hit the hardest (as the numbers show they were, many have since recovered). At the MBA level, Harvard is an immense, but we are talking about the undergrad level here. Imagine having access to both the Wharton and HBS networks? That is pretty cool.<br><url>http://talk.collegeconfidential.com/university-pennsylvania/899983-gladwells-theory-supports-wharton-ug.html</url><br><br>If you look at the list of the top ten Wall Street dudes you referenced, every single one was trading and doing very pre-professional things in college. Back in the day, Wharton offered little in the way of liberal arts, but that is no longer the case. Now, it is much easier to become truly great at what you do and get liberal arts experience at Wharton. The fact that you brought the hedgies up helps my argument.<br><br>", "<b>Username: kafkareborn</b><br><br>\"Again, if you're smart enough to get into Wharton undergrad, you'd do better to get the kind of broad, creative education that HYPS fosters and hang around with those kids, at least according to my personal observation. There's time to become a finance dweeb later [like me].\"<br><br>When you are at Wharton, you do not just hang out with Wharton kids. That would be toolish. You stay in dorms with kids in the engineering school, the college and the nursing school, thus you are exposed to a wide range (if not wider) of people. You take classes with them as well. You take classes with graduate students, if you wish, and you get exposed to them as well. Who knows, they may be exposed to the next Noam Chomsky, Gene Falk, Cenk Uygur, or Nassim Taleb. There is so much interaction between the school's at Penn, courtesy of Locust Walk and the centralized layout of the school, that you are bound to meet new and interesting people. You do not miss out on any of that by going to Wharton. It is not like Wharton sits in isolation from the rest of Penn (like HBS does at Harvard).<br><br>", "<b>Username: mancune</b><br><br>1a1<br><br>I graduated from Yale with a double major degree in Economics and Slavic Languages and Literature around the turn of the millenium, worked in a famous Wall Street house for a year and a half, left to start an internet based retail business with some friends, raised some venture capital, and was in the process of taking it public thru CS First Boston when the tech collapse happened and we couldn't raise capital, so it died. I was exhausted and broke so I went to biz school at Wharton (where I had to endure hordes of nebbishy Wharton undergrads and the Ivy league's ugliest campus) thru student loans and am now back working for a well-known hedge fund focusing on special situations in the emerging markets, the BRICS mostly. There were many, many Yalies at Wharton grad, as there are at all the major professional schools. Yale to Wharton grad is not unusual at all.<br><br>kafka<br><br>I appreciate your tenacity and energy; the power of delusion is immensely enabling sometimes! I would hire you at my firm, except that you are so sloppy and loosy-goosy with numbers, that I couldn't bear to proof your models and comp sheets! For instance,<br><br>The billionaire red herring. Here is a summary of Forbes billionaire results for 2009:<br><br><a href=\"http://finance.yahoo.com/college-education/article/107531/billionaire-university.html\" rel=\"nofollow\">billionaire-university.html: Personal Finance News from Yahoo! Finance</a><br><br>Penn has 18 billionaires vs. 16 for Yale. Penn also has an alumni base that is twice as large as Yale's! Pound for pound, a Yale grad is almost twice as likely to be a billionaire as a Penn grad. Now let's narrow it to Wharton. If you check the actual Forbes article, which I own, you will see that Wharton accounts for 14 of these names. Wharton graduates 500 undergrads and 800 MBAs or 1300 a year, almost all of whom head into business. Yale graduates about 1300 a year, many fewer of whom go into business. Something like 15% go into medicine at Yale, 20% go into law, and a LOT go into teaching, arts/creative, media and non-profit. I would guess that maybe half of all Yalies end up in business. That would be a pool of about 650 Yalies plus another 200 at Yale SOM or 850 each year headed into business. (Yale SOM has a tiny graduate pool compared to Wharton, being onlyl 30 years old and 1/4 the size of Wharton grad.) Yet despite the much smaller numbers, Yale holds up very well, producing as many billionaires as Wharton does. Proportionally, it tops Wharton by a good margin. If you are someone probably headed for business, then, you have every anticipation of doing just as well in your career as any one from Wharton, probably better on average.<br><br>So, lets review. We have shown over our threads that:<br><br>Yale produces 4 times the number of Nobel laureates that Penn does, proportionally<br><br>A Yalie is 3 times is likely to get into a top professional school as Penn grad<br><br>A Yalie is 6 million times more likely to be President and 12.7 million times as likely to end up on the supreme court<br><br>Despite all of the sloppy Wharton brou-ha-ha, a Yalie is proportionally more likely to end up a billionaire<br><br>Now, if you were a reasonable person, where would you send your kid?<br><br>", "<b>Username: booyaksha</b><br><br>^^^^hahahahah..... ouch!<br><br>", "<b>Username: poste3</b><br><br>This has turned into a never ending story and I think that we can all agree that both wharton and yale are equally good, both have their pros and cons and it really comes down to what you want<br><br>", "<b>Username: kafkareborn</b><br><br>\"\"No. 3 University of Pennsylvania<br><br>Number of billionaire alumni: 18<br>Early last year, U. Penn had 27 billionaire graduates, thanks to its famous business school, Wharton. But the financial meltdown last year shaved off almost a third of that list, including hedge fund tycoon Peter Briger Jr. and money maven Marc Rowan. Amongst the school's remaining billionaire grads: Ronald and Leonard Lauder, and Michael Milken.\"\"<br><br>Most of the Yale guys inherited their wealth and have it in private companies; the Whartonites were deeply invested in the financial system and were more adversely affected. The guy who lost the most money ($30 billion - Anil Ambani) was a Whartonite. The numbers I quoted reflect the true situation better.<br><br>Look at the Yale list for yourself. Two from the mars family, Cullman, Cargill, and the list goes one. Point is: their Yale education did not make then wealthy. You can't say the same thing about Wharton's list. Except for Lauders (who are among the few remaining billionaires and inherited a lot of their money) essentially all of them are self-made men. If you were born a billionaire, then yes, you are likely to remain a billionaire by attending Yale. It's mostly old money.<br><br>", "<b>Username: MSauce</b><br><br>Until you can actually back that up through a full breakdown of billionaires (and former billionaires) from both schools, that's just an unsubstantiated attack.<br><br>", "<b>Username: poste3</b><br><br>But we all know its mostly true<br><br>", "<b>Username: kafkareborn</b><br><br>Hey,<br><br>I have compiled many of my arguments in favor of Wharton here:<br><br><url>http://talk.collegeconfidential.com/university-pennsylvania/902457-wharton-mythbusters.html</url><br><br>Do check it out, there are a lot of misconceptions floating around about Wharton, you would do well to be able to differentiate between the fact and the fiction.<br><br>", "<b>Username: 1a1</b><br><br>Thanks so much.<br><br>", "<b>Username: 1a1</b><br><br>I was just thinking: since around 45% of Wharton kids go into investment banking, wouldn't it be better for me to attend Yale, a school with fewer kids interested in ibanking and such (more focused on English, humanities). I think firms still recruit at Yale and the number of students competing for the same jobs would be smaller. Does this make any sense?<br><br>", "<b>Username: platorepublic</b><br><br>I was just thinking: Since 90% of HYP kids get into the top med schools, wouldn't it be better for me to go to a school like Amherst where fewer kids are accepted into Med schools? I think all med schools accept applications from Amherst, but the number of students competing for the same jobs would be smaller ....<br><br><br>As you can see, that makes little sense. Don't second guess your abilities, having more kids that go into IB is a good thing, it means you will have a larger alumni base to call on. It means that your job will be more secure. It means that the higher ups will probably be alums of your school and will pull for you. The fact of the matter is, if you are not good enough to get an IB job out of Wharton, you won't get one at Yale either. Plus, you have many more recruiters on campus at Wharton, so you have more options in the financial world. Many smaller elite overseas companies will only bother to send recruiters to Wharton or recruit from there. If you want an IB job in Wharton, you will almost certainly get one. Think long term kid, long term.<br><br>", "<b>Username: 1a1</b><br><br>But that analogy makes no sense?<br><br>Amhest can't replace Yale when speaking about Yale and Wharton relatively ... but I digress.<br><br>I'm pretty sure recruiters go to both schools quite a bit (obviously Wharton is favored), but I'm just saying that it seems it would be easier RELATIVELY at Yale than it would be at Wharton. At both schools, getting an IB job is very possible.<br><br>", "<b>Username: platorepublic</b><br><br>The fact that you are competing against more kids is balanced out by the fact that companies reserve more jobs for Wharton kids, because they know that more smart kids that are interested in them are there. They know that if they offer you a job coming out of Wharton, that kid is far more likely to take it than the kid at Yale. That's part of the reason Wharton places so much better. Ceterius Paribus, firms will take the Whartonite over the Yalie. That's way some firms recruit solely out of Wharton. That's why, at essentially every bulge bracket IB firm, Wharton undergrad is the most represented school.<br><br>Companies are not stupid, why would they allow such a loop-hole to exist? Everyone would just take the easy route out then and the company would be overlooking arguably better talent at the larger school. Companies look to higher kids where they can find smart, motivated kids, who will accept their offers.<br><br>Think about it logically. You have two equally intelligent groups of kids, one that studied business and liberal arts courses and one that only studied the liberal arts. More kids from the first group are interested in working for you than the kids in the second group. Who would you give more job offers to? Obviously to the kids in the first group and that is precisely what happens.<br><br>So no, that's just not how it works.<br><br>", "<b>Username: platorepublic</b><br><br>*hire<br><br>\"companies look to hire kids...\"<br><br>", "<b>Username: platorepublic</b><br><br>Alright, let me edit my analogy then. Say you want to be an engineer and you want to choose between two equally good schools, Yale and Princeton. Now, Princeton is superior to Yale in engineering and sends way more kids to top engineering firms than Yale. But, according to the logic you used above, even though Princeton is better at engineering (and is regarded as such by top firms, some of which probably do not recruit at Yale) you should go to Yale because more people at Princeton are pursuing engineering so there is greater competition. Obviously, the firms that are recruiting take into account the amount of students interested in the firm from the school and adjust the number of offers that they hand out accordingly. This offsets the competition between students for the same jobs at Princeton. Actually, you probably have a higher chance of landing the job out of Princeton since companies know that the yield for such jobs would be greater at Princeton than at Yale (since Princetonian are more interested), so they will overcompensate for that by giving out more offers at Princeton. Plus, if you do get a job, you will have a far larger alumni network in the field to help guide you. The same is true of Wharton and Yale in banking / PE / HF / VC.<br><br>", "<b>Username: aweirdo</b><br><br>Yes, W recruiting is better than Yale's, but W competition is also extremely fierce and cutthroat. I have friends there who admit to a certain degree of backstabbing and intense competition because you are competing with 500 classmates for the same type of jobs. I would just go to Yale, have a more rewarding and enjoyable four years of college and a more liberal-arts curriculum, and still do pretty well career-wise, because honestly, if you are going to be equally outstanding both places, it's what you do that really matters, and both are great institutions, so it's all up to personal fit. Based on my personality, I would want Yale though.<br><br>", "<b>Username: platorepublic</b><br><br>The whole \"cut throat, back stabbing, knife wielding, eye-gouging\" BS is only pandered around by people who have never actually taken a single course at Wharton and are unable to refute any of the other arguments in support of Wharton. Go to the Penn page, you will see many posts that specifically address that false-hood.<br><br>I think this guy sums it up well:<br>\"\"<a rel=\"nofollow\" href=\"/profile/kafkareborn\">kafkareborn</a> wrote:\"\"<br><br>Read myth No.3 on here for more details: <url>http://talk.collegeconfidential.com/university-pennsylvania/902457-wharton-mythbusters.html</url><br><br>", "<b>Username: metronycmom</b><br><br>First of all, I have to say that I am probably biased because I am a Yale alumna, but I did go get an MBA afterwards (at Columbia). I would highly recommend going to Yale because it is an INCREDIBLE place and has GLOBAL RECOGNITION which you will carry with you for the rest of your life. Many institutions recruit at Yale and having the Yale name on your resume is something that will get you noticed, I think more so than a U Penn or Wharton undergraduate degree. The market place for jobs is getting more and more GLOBALLY competitive. With a Yale degree, you will have a name that is recognized in Asia, Europe, Latin America etc. In my case, I have worked in Europe, Asia &amp; Europe, and every employer was impressed with the Yale name. Additionally, the Yale alumni network is FANTASTIC. There are Yale Alumni Clubs almost everywhere you go. So in Hong Kong, Korea, London, Miami, etc., I was immediately able to join a club and have contacts who have helped me decide where to live, go hiking together, helped determine schools for my kids, etc. Yale alumni are also on the whole very impressive people. I have found that people with business undergraduate degrees more narrow minded. You can always supplement your education at Yale later by taking courses in accounting, getting a CFA, an MBA, etc. But a Yale degree is PRICELESS. I can explain more if you have questions.<br><br>", "<b>Username: platorepublic</b><br><br>Wharton has more Global Recognition where it matters - the business world. Sure, your average farmer in China is more likely to have heard of Yale, but any business professional would have heard of Wharton and would respect it more.<br><br>Fact of the matter is, Wharton has a larger international alumni base than any other school in the world. Nearly 50% of Wharton MBA alums are international and work internationally. In any given country (considering how weak the Yale MBA program is) Wharton would outplace Yale by a factor of five or more (considering that Wharton out places Yale at the undergraduate level and totally eradicates it at the graduate level). The top foreign companies sometimes recruit solely out of Wharton.<br><br>All the aspiring businessmen in these country dream of getting a Wharton or Harvard or Stanford MBA, not a Yale one. Wharton has arguably two of the most famous alums in business: Warren Buffett and Donald Trump (Bill Gates would also be in this category - but he went to Harvard), as a result it has immense global recognition. Many of the top businessmen you talk to in these countries are far more likely to have gotten their MBA from Wharton, done a deal with a Whartonite, had a Wharton work for them, than they are with a Yalie. If you go to Wharton undergrad, you have more than 80 thousand alumni in business to call upon with clubs all around the world, go to get your Harvard MBA after that and you nearly double that. Bottom line, Wharton's alumni network is far far stronger. A Wharton degree is priceless.<br><br>", "<b>Username: thatguy100</b><br><br>When you go almost anywhere in the world and say you went to an ivy league, where do people ask? Harvard and Yale. And occasionally Princeton -- wheres UPenn in this mix? People get it confused with Penn State almost every time.<br><br>And, since were being so \"fact of the matter,\" how about you dont use generalizations like \"ALL the aspiring business men in these country dream of getting a Wharton or Harvard or Stanford MBA\" (btw, check your grammar about \"these country\")<br><br>As well, are you really going to begin to argue the alumni connections between Penn and Yale? Or even Wharton and Yale. Sure, you got Warren Buffett and DTrump as alumni, but.. oh, wait, Yale has EVERYONE ELSE.<br><br>It seems as if you equate fame with power, just because DTrump and Buffett are two of most well known billionaires in the world (and, that name dropping of Bill Gates was clever too) it certainly doesnt mean that they have the most influence or strongest connections in the world of business.<br><br>Take a look at Yales connections - they are globally spread and involve many of the worlds most influential business people. And, if you want to name drop, they are the university of choice it seems (or HYP in general.. still no Penn?? Weird) for the Vanderbilts, the Whitneys, etc.<br><br>Last I checked, aspiring business men aspire to Harvard and Yale, and only a select few idolize Wharton. Whartons alumni network may be larger in pure size, but Yale simple cannot be beaten by some number. As you said, everyone seems to do business with a Whartonite at one point in their lives.. kind of shows how keen Whartonites are to work with Yalies.....<br><br>", "<b>Username: mancune</b><br><br>platosrepublic- (or kafkareborn, I mean, why do you spend so much time posting under two cover names on the Yale forum?????)<br><br>1) Make no mistake about it. I am very happy to have a Wharton MBA, but for influential people abroad, the holy grail is a Harvard, or maybe a Stanford, MBA. Wharton (as well as Columbia, Chicago and Sloan) are respected afterthoughts, known and targeted by a smaller group of people, and seen as a second-best result in the MBA admissions process.<br><br>2) On the undergraduate level, foreign businessmen people view an Oxbridge or a Harvard/Yale degree as the ultimate mark of educational cachet (with Yale a tiny notch below; and yes, ouch, that hurts to type that as a Yale BA). Stanford is rising fast, particularly in Asia. (Interestingly enough, Yale has connections in China that date to 1870, and Yale is extremely popular as destination; Yale's President Levin is an educational rock star in the Chinese media). Penn/Wharton does NOT enjoy the same prominence at all.<br><br>3) In dealing with many foreign clients as someone involved in emerging markets finance, the Yale connection has helped MUCH than my Wharton MBA connection. Clients seem much more impressed being taken to the classy Yale Club for drinks and looking at the pictures of Clinton on the wall or Bush senior playing baseball than when I take them to the Marriottesque \"renovated\" Penn Club. Blecccccchhhhh!<br><br>4) Do you honestly look up to Donald Trump as an inspiration? A creepy, arrogant guy who screws over people routinely who just inherited his Daddy's real estate business, has gone bankrupt more than once -- his casinos are now bankrupts YET AGAIN? And Buffett often talks about his time at Columbia studying under his heroes Graham and Dodd, but I never hear him say anything about Wharton; he fled the darn place, as far as I remember.<br><br>5) If Penn/Wharton produce so many incredibly successful business people, and has the strength of its Wharton alums to manage its funds, how did it end up so relatively poor compared to Yale and Harvard???? Even with last year's cataclysm, Yale has almost 3 times the endowment that all of Penn has, and it has an alumni network about half as big!!! On a per capita basis, Yale has SIX times the wealth that Penn has! The only explanations I can see are 1) Penn people aren't as successful as Yale people, so can't give as much, or 2) Penn people are as successful or more successful than Yalies, but are so preternaturally cheap or so turned off by their experience they keep their purses shut, or 3) Penn people are successful and give a lot to their beloved alma mater, but their \"hot shot\" Wharton money mangers screw up the long term returns. You decide!<br><br>", "<b>Username: poste3</b><br><br>Just food for thought, search Wharton vs Harvard and look at the unbiased responses. It looks like it is 50/50 and yet some people here say that Yale is obviously a better choice than Wharton? hmmmm....<br><br>", "<b>Username: metronycmom</b><br><br>By the way, Warren Buffet went to the Columbia Business School. I did not work with Chinese farmers, but investment bankers and CEOs at the top firms in Hong Kong as well as Beijing, London, NYC, etc.. And the Yale degree always opened doors. Certainly, Wharton has a better business school than Yale's SOM, but if you are talking about the undergraduate experience, it's a totally different story. You will do fine either way. But you may regret deeply later in life if you give up the chance to experience Yale. If you have the chance to get an MBA later, you can always go to Wharton then &amp; you will have practically an unbeatable resume.<br><br>", "<b>Username: disgradius</b><br><br>@metro and mancune, noone is saying that Yale won't open doors, just that Wharton will open more (especially abroad). Do consider that many firms only offer OCR to Harvard, Wharton, INSEAD, etc. Also, no one is denying here that Yale probably offers a better liberal arts education than Penn. That said, no one seriously denies (especially foreign businessmen) that Wharton trumps Yale in business education.<br><br>Why are we even comparing university achievements anyways? It should really be about the student body. Otherwise, I could boast that Penn is the first university in the United States, Penn produced more historically important figures (just think of whose statue you see all over campus), Philadelphia is a major city whereas New Haven is... a town? Not to offend but to me it seems like you're a foreigner and I can tell you for a fact that the 'foreign businessmen' you'll usually be dealing with are not the ones calling the shots.<br><br>It's also great to know that Yale's greatest impact on the world was forever altering the political landscape by royally screwing America with their most prominent alumnus who foreign leaders even refer to as Satan.<br><br>Frankly, none of this even matters, let's keep discussion to the students and opportunities shall we?<br><br>It's also important to separate business from finance here. If you're conducting business, that's pure people skills. If you're investing, that's a completely different skillset (and please don't bring up ibd, no one takes modelling seriously there).<br><br>", "<b>Username: 1a1</b><br><br>So in terms of undergraduate studies, just the name \"Yale\" gives employers/others a better impression? Some say the name Wharton opens more doors, but others say Yale in terms of global job opportunities. I don't think the choice between the two is obvious.<br><br>", "<b>Username: thatguy100</b><br><br>Yale opens EVERY door. Wharton opens select business world doors. both have the same quality of education, but Yale is more of a brand, done and done.<br><br>It would be like asking if someone has heard of Harry Rosen vs Giorgio Armani for mens suits. Both are amazing quality and both are great style, but Armani the world recognized brand. Now, if you had the choice, would you choose Armani or Rosen? Armani wins 95% of the time.<br><br>EDIT:<br><br>If youre a girl, just take suits and change it to dresses aha, both companies do both. :P<br><br>", "<b>Username: platorepublic</b><br><br>`1a1, look at the Wharton career service reports (the link is all over the Penn page) you will see that Whartonites work all over the world. Some international firms (like Rothschild in the UK - aka another door closed to Yalies) recruit ONLY out of Wharton undergrad. Top PE firms and hedge funds, both nationally and internationally concentrate on getting Whartonites ahead of any other school at the undergraduate level. Thats concrete proof of a preference for Whartonites.<br><br>The Yalies cannot give you a single counter example. Whartonites have the best placement both internationally and domestically  thats a fact. Yales MBA program is a bad joke.For a business education (which is really all international businessmen care about) -remember most of the rest of the world does not have liberal arts - everyone knows that Wharton blows Yale out of the water. These Yalies are blowing hot air. International firms are not stupid, they know the pecking order within the US and that applies outside it. Do you actually believe that businessmen in China or India would not have heard of Wharton? The best finance school in the world. One of the best business schools in the world ? One that they themselves sent their kids to (Mittal's son in India, Ambani himself in India, Ruimin's son in China) etc.<br><br>ALL know of Wharton and respect it above all others at the undergraduate level (which is why they sent their kids there). Wharton's business alumni base outstrips Yale by a factor of 5. Ask anyone on Wall Street (who did not go to Yale) what the top tier target schools are and they will say Wharton and Harvard, then Princeton then somewhere down the line comes Yale. There is a reason that: Cohen, Asness, Buffett, Trump, Perelman, Taleb, Kashkari -the men that are shaping our world today, not the whitney's and vanderbilt's that shaped in 150 years ago are Whartonites. In the general world, (in political circles for instance) sure Yale is absolutely respected, but Wharton trumps Yale in terms of international reputation for those in business by FAR. Wharton's way larger alumni base and further reach in all of these countries shows that to be true. No one, other than Yalies, would argue that Yale has better international representation in business circles.<br><br>You are confusing the attitudes of the general uneducated populous (who would probably have heard of Yale more than Wharton - but would probably have heard of neither) for the actual attitudes of the business community - they are not the same. Even in America, your average person walking down the street would probably think that a Yale MBA is superior to a Wharton MBA, but that does not reflect what people in the business community think at all. Yale's MBA program is far far inferior and the people that need to know that, that have an effect on you, know that. No one who knew anything about the industry would choose Yale MBA over Wharton MBA, the views of uneducated fishermen don't matter. I've spent 15 years in Asia, I can tell you as a fact that Wharton is way more respected than Yale in the business community in Asia.<br><br>Thatguy100, you are totally off the mark. I cannot believe you actually are trying to tell me that Warren Buffett does not have influence in the business world. He probably has more influence than anyone else. Anyone in the industry would agree, you obviously don't know what you are talking about. Buffett left Wharton after three years only because his father lost his congress relelection campaign and he wanted to be closer to him - he is a Whartonite though (just as Bill Gates is a Harvardian) and he hosts meeting with Wharton kids every year. If you go to Wharton, it is likely that you will be able to meet him in person.<br><br>Go to Wharton, get a Harvard MBA. That's unbeatable.<br><br>", "<b>Username: poste3</b><br><br>After being some time in these forums this is what I have gathered about the wharton vs hyp debate.<br><br>Academically, wharton and hyp are equally selective and all generally accept the same quality of students.<br>If you want to go to business for sure, wharton is the right choice, however, if you are not so sure hyp would be better becuase they have better liberal arts education, compared to penn's cas (although penn is right on their heels).<br>Even though wharton is highly business focused, it does not limit your academic interests by allowing students to take almost 50% of their classes in any of penn's departments.<br>Hyp have more name recognition than wharton, nevertheless, Wharton has more prestige in the business world (only paralleled by harvard)<br>Regarding recruiting, wharton places first followed closely by harvard, then princeton and yale.<br>Wharton has a more pre-prof and competitive atmosphere, whereas hyp are more intelectual and offer a more well-rounded experience.<br><br>Now, social life at penn is a good balance of fun/party and academics, whereas hyp is more intelectual and nerdy, the party scene doesnt compare (only yale/princeton kids say that their social scene is AMAZING, yet people from the outside who visit say the contrary. At penn no one denies it has a good social scene, although its kind of like the tallest midget)<br><br>Remember, this is not my personal opinion but what I have gathered in these forums. Feel free to add coments or to disagree<br><br>", "<b>Username: 1a1</b><br><br>Is there a noticeable difference in advantage in getting to top grad schools (HSB, Wharton, Stanford GSB, Columbia) between Y and W? I can't find any info that tells the breakdown of undergraduate colleges represented at these top grad schools.<br><br>", "<b>Username: booyaksha</b><br><br>There is no PRACTICAL difference in terms of grad school admissions.<br><br>This thread is insanely long for absolutely no reason! They are both great schools. Go to Penn if you ONLY want to study finance and don't mind hanging out with competitive, pre-professional types. Go to Yale if you want to have a broader education (e.g. econ, not finance), love the res college system, and/or want to hang out with a greater diversity of people.<br><br>As for what school is \"better\" for finance or MBAs, to reiterate, there is NO PRACTICAL DIFFERENCE.<br><br>", "<b>Username: MSauce</b><br><br>I've seen an actual breakdown of % admissions to top grad schools by class. I tried to google it and unfortunately couldn't find it. Harvard was #1 on its own, Yale was #2 below Harvard but on its own, and from there most of the lower Ivies and upper non-Ivies were around equal, with Stanford and Princeton near the front of the pack, if I remember correctly.<br><br>Although that wouldn't help you here--as the list counted Penn, not Wharton independently--there is a difference in getting into top graduate schools depending on where you go.<br><br>I say if you like Yale, go to Yale for undergraduate, get a well-rounded education and enjoy yourself, then go to Wharton for graduate. That way you don't have to worry about undergrad/grad in the same place, and you get a top notch education in every sense of it--as well as great resources if halfway through your undergrad, you decide not to pursue business.<br><br>That's my personal plan, only I can't decide between Yale and Princeton :(<br><br>", "<b>Username: poste3</b><br><br>Msauce, why do you assume the OP wont enjoy himself at wharton?<br><br>", "<b>Username: poste3</b><br><br>the general consensus of these boards is that if you want business go to wharton, if you are not so sure you want to study business but might want to do that after graduation, go to priceton or harvard, yale comes last.<br><br>", "<b>Username: An0maly</b><br><br>\"\"the general consensus of these boards is that if you want business go to wharton, if you are not so sure you want to study business but might want to do that after graduation, go to priceton or harvard, yale comes last.\"\"<br><br>Sorry but that's just your opinion. I'd be surprised to find that you know the general consensus of this board in a mere 2 months of posting. An actual study on college preference found here:<br><br><a href=\"http://papers.ssrn.com/sol3/papers.cfm?abstract_id=601105#PaperDownload\" rel=\"nofollow\">SSRN-A Revealed Preference Ranking of U.S. Colleges and Universities by Christopher Avery, Mark Glickman, Caroline Hoxby, Andrew Metrick</a><br><br>shows that Yale is rated above Princeton in pretty much everything. This isn't to say it's a better school [because the differences in academics are negligible] but it is <i>preferred</i> more.<br><br>", "<b>Username: poste3</b><br><br>I think you missed the \"if you are not so sure you want to study business but might want to do that after graduation\" bit, as I said, Yale comes last.<br><br>", "<b>Username: cmburns14</b><br><br>I worked on a derivatives trading desk on Wall Street from 2004-2007 and have no direct affiliation to either Yale or Wharton/Penn so I think I can be unbiased.<br><br>For top hedge funds, private equity firms and elite desks like proprietary trading/AmSSG at Goldman Sachs, SAC Capital, AQR, Blackstone- going to Wharton will be a significant advantage over Yale. Billionaire alums in the industry include Dan Och, Stevie Cohen, Cliff Asness, Richard Perry, Raj Raj (MBA), Peter Briger (MBA) and possibly a few I can't think of right now. Anil Ambani went to Penn and is worth about $40 billion. I believe his son is an undergrad. Interestingly, Aditya Mittal graduated from Wharton undergrad in 1996 and works for his dad who is currently worth $29 billion.<br><br>Yale is no slouch either, Eddie Lampert, Dinakar Singh, Steve Schwarzman, Sid Bass are all names that come to mind. Bob Rubin as well, before the Citi fiasco. I'm not counting dynastically rich people like Forest Mars (Yale).<br><br>For general investment banking/corporate finance/management consulting- I would suggest Yale over Wharton- Wharton is too competitve and too many people in the class apply to those jobs. Even though Wharton is a higher target than Yale for just about every bank (i.e. they take significantly more kids) an even higher ratio of kids apply to these jobs. If you add in smart students from CAS and SEAS that's over 900-1000 resumes for 20-40 interview slots, which may result in 10 superdays and 5 offers. So slim odds. My guess at Yale College is probably around 400 resumes for 2-3 offers, so the odds are significantly better.<br><br>In terms of Nobel Prizes, yeah, Penn has had 10 in the past decade vs. about 8 at Yale, which is pretty even to most people. Interestingly, Penn has earned most of its Nobels in chemistry, physics and econ not medicine. But overall, Columbia destroys both schools, 94 Nobels at Columbia vs. 48 at Yale, 41 at Cornell, 32 at Princeton and 23 at Penn. Granted, you should look at recent Nobels because a prize in the 1920s is less relevant to the quality of research today.<br><br>", "<b>Username: mancune</b><br><br>cmburns-<br><br>For Yale, too, you forgot Wilbur Ross, probably the king of vulture investors; Ted Forstman, of Forstman Little, who practically invented LBO/PE game in the 80s along with KKR; Jim Chanos is currently the leading \"bear\" investor on the street; throw in Bob Prechter, who is fairly prominent, too.<br><br>I'm a Yale undergrad and a Wharton MBA and work at a hedge fund. There are plenty of Yalies around in prominent positions. As you said, on a relative basis, Yale undergrads do just fine.<br><br>As a Wharton MBA I have witnessed how large the Wharton network is, but I would add that it is not particularly tight. Wharton itself is large, impersonal and competitive, and Whartonians don't reach out to help other Whartonians with the same degree of vigor other schools do. Anybody who has worked in finance for any time will tell you that Dartmouth has the most intense network in terms of people energetically helping each other over the course of their careers. There may be fewer Dartmouth grads on the street than Wharton grads, but they are intensely devoted to the Green.<br><br>", "<b>Username: 1a1</b><br><br>Last bump.<br><br>", "<b>Username: MSauce</b><br><br>I hope you're coming to Yale! Not a lot anyone's going to do to change your mind now. Hopefully you're a fellow 2014er.<br><br>", "<b>Username: platorepublic</b><br><br>Take a look at these threads before you make your decision:<br><br>This refutes many of the misconceptions about Wharton:<br><url>http://talk.collegeconfidential.com/university-pennsylvania/902457-wharton-mythbusters.html</url><br><br>This one has commentary from people actually in the industry:<br><br><a href=\"http://www.wallstreetoasis.com/forums/wharton-vs-top-ivies\" rel=\"nofollow\">Wharton vs Top Ivies? | WallStreetOasis.com</a><br><br>I hope you come to Wharton and Penn, welcome to the family. The social Ivy awaits you. :)<br><br>", "<b>Username: platorepublic</b><br><br>Give this a read:<br><br>Myth #9:<br>Quote:<br>Originally Posted by 1a1<br>I was just thinking: since around 45% of Wharton kids go into investment banking, wouldn't it be better for me to attend Yale, a school with fewer kids interested in ibanking and such (more focused on English, humanities). I think firms still recruit at Yale and the number of students competing for the same jobs would be smaller. Does this make any sense?<br><br>The fact that you are competing against more kids is balanced out by the fact that companies reserve more jobs for Wharton kids, because they know that more smart kids that are interested in them are there. They know that if they offer you a job coming out of Wharton, that kid is far more likely to take it than the kid at Yale. That's part of the reason Wharton places so much better. Ceterius Paribus, firms will take the Whartonite over the Yalie. That's way some firms recruit solely out of Wharton. That's why, at essentially every bulge bracket IB firm, Wharton (at the undergraduate level) is the most represented school. That's why international firms come to Wharton first to get their pick of prime talent. The smaller, more technical, and more elite the firm is, the higher the concentration of Whartonites will be at those jobs, and, chances are, the more likely the Whartonite is going to get the job over the HYP kid.<br><br><br>Companies are not stupid, why would they allow such a loop-hole to exist? Everyone would just take the easy route out then and the company would be overlooking arguably better talent at the larger school. No company would do that. Companies look to higher kids where they can find smart, motivated kids, who will accept their offers.<br><br><br>Think about it logically. You have two equally intelligent groups of kids, one that studied business and liberal arts courses and one that only studied the liberal arts. More kids from the first group are interested in working for you than the kids in the second group. Who would you give more job offers to? Obviously to the kids in the first group and that is precisely what happens.<br><br><br>Also remember, it is cheaper for companies to hire Whartonites because they already have their technical skills in place, which means they waste less of the higher-ups time in training. Also, Whartonites tend to be driven (which is why they choose to attend Wharton in the first place), and that is a huge draw for companies. So no, it would not be better, it would arguably be worse.<br><br>Here is an analogy to help elucidate the points I made above. Say you want to be an engineer and you want to choose between two equally good schools, Yale and Princeton. Now, Princeton is superior to Yale in engineering and sends way more kids to top engineering firms than Yale. But, according to the logic you used above, even though Princeton is better at engineering (and is regarded as such by top firms, some of which probably do not recruit at Yale) you should go to Yale because more people at Princeton are pursuing engineering so there is greater competition. Obviously, the firms that are recruiting take into account the amount of students interested in the firm from the school and adjust the number of offers that they hand out accordingly. This offsets the competition between students for the same jobs at Princeton. Actually, you probably have a higher chance of landing the job out of Princeton since companies know that the yield for such jobs would be greater at Princeton than at Yale (since Princetonian are more interested), so they will overcompensate for that by giving out more offers at Princeton. Plus, if you do get a job, you will have a far larger alumni network in the field to help guide you. The same is true of Wharton and Yale in banking / PE / HF / VC.<br><br>", "<b>Username: supersizeme</b><br><br>Okay, I feel the need to chip in my two cents. So here goes.<br><br>I know someone who was in the same exact position as the OP. Accepted to Yale and Wharton for his undergraduate education. After a lot of bouncing around, he opted for Yale. He graduated this year, Class of 2010, and couldn't find a job. He had the intention to go on a path of banking, but again, could not land a job.<br><br>Why?<br><br>The thing is, he couldn't land a job, because Yale didn't offer adequate enough majors for his intended profession. Sure, he could have done economics, but he fell into the typical hole of a Yale student. He studied History, something that seems far more appealing when you are in an intellectual environment like Yale.<br><br>Yale is liberal arts school, with every major imaginable. Wharton is a specialized school WITHIN a liberal arts school. If you know you want to do banking/finance or whatever, my gut says Wharton, you'll be more adequately prepared than any other post-college employee, and even many of your Business school peers. If you don't like it, you can opt out to Penn's CAS, but be warned: Penn's CAS is great, but it is NO YALE.<br><br>If you aren't sure what you want to do with your life yet (It's alright, people older than you don't have the slightest clue either), then go to Yale... that's my gut. If it's business related, Wharton is for you.<br><br>My judgment is based on what I've seen happen to someone in your exact position. He didn't know what to do, and screwed himself over in the process. Don't repeat his mistake. The choice is yours.<br><br>BTW, this Yale grad I know is now doing an accounting course at USC, will probably land a job afterward. So even if you do mess up, you're not screwed-- at least not completely. :)<br><br>"]}