{"title": "princeton vs yale pre med", "comments": ["<b>Username: goodluck1</b><br><br>My son was accepted to Princeton, Yale, Columbia, Caltech, Duke, Darthmouth, Cornell, Brown, and Emory(full-ride).<br><br>", "<b>Username: randombetch</b><br><br>If you check these threads:<br><url>http://talk.collegeconfidential.com/princeton-university/896715-huntsman-vs-princeton.html</url><br><url>http://talk.collegeconfidential.com/princeton-university/896626-princeton-vs-penn-m-t.html</url><br><br>You'll see that I'm very biased towards Princeton. I love Princeton.<br><br>But for pre-med, I have to say that Yale is superior. No grade deflation --> better chances of having a good GPA --> better medical school. Yes, most med schools take into account the difference between a Princeton GPA and some other schools' GPA, but believe me when I say a 3.7 from Yale is easier to obtain (0.19 above their average) and looked at more favorably than a 3.6 (0.32 above our average) from Princeton.<br><br>", "<b>Username: german_car</b><br><br>Yale UG gets home advantage when applying to Yale MD PhD JD MBA Schools.<br><br>For example, at Yale Law<br><br>82 Yale UG are enrolled while only 17 Princeton UG there.<br><a href=\"http://www.yale.edu/printer/bulletin/htmlfiles/law/law-school-students.html\" rel=\"nofollow\">Yale University Bulletin | Yale Law School 2009?2010 | Law School Students</a><br><br><br>Harvard, Yale, Columbia, Stanford MD PhD JD MBA programs all give strong preferences to their own UG applicants. Princeton UG need really really outstanding GPA and test scores etc ..<br><br>", "<b>Username: goodluck1</b><br><br>Thanks you so much randombetch and german_car. Please Bump<br><br>", "<b>Username: FermatABC</b><br><br>If your son is really set on being premed, go for Yale. The average grade in science courses (premed reqs) is a 3.0-3.2. It is EXTREMELY difficult to do pre-med at Princeton. Many students here have voiced this concern and ended up having to fulfill premed requirements at different universities. Yale, on the other hand, is much easier to do well/get higher gpa. On the other hand, if you're interested in investment banking, economics, math, and business in general, come to Princeton. You'll be in great hands.<br><br>But just to let you know, most HS students who come into college wanting to do premed change their minds after the first semester anyway. It really depends how much your son wants to do premed.<br><br>", "<b>Username: randombetch</b><br><br>German_car's just a **** here who posts the same link on every post. Princeton and Yale are pretty much on par for law school admissions.<br><br>", "<b>Username: goodluck1</b><br><br>More unbiased suggestions please.<br><br>", "<b>Username: goodluck1</b><br><br>How many students go to medical colleges from Princeton every year?<br><br>", "<b>Username: midatlmom</b><br><br>If you look at this link, you will see that approximately 93% of Princeton students applying to medical school in 2009 were accepted. <a href=\"http://www.princeton.edu/odoc/faculty/grading/faq/\" rel=\"nofollow\">Princeton University - Dean of the College - FAQ</a><br>Numbers of students applying to medical school each year ranged from approximately 115-125, but I can't tell how many apply directly as seniors and how many have worked or done something else and then applied to medical school.<br><br>", "<b>Username: Peytoncline</b><br><br>Princeton does very well in medical school admissions (90% or higher), which is on par with its Ivy league peers. However, being a pre-med here will probably be more stressful due to the stricter grading policy here. If you are absolutely sure you want to be pre-med, Yale may be a better fit for you because it would be easier to get a higher GPA, but coming here, while it means you may have a lower GPA, doesn't mean that you'll be any less equipped to go to med school.<br><br>", "<b>Username: PimpDaddy1</b><br><br>Once again, I really wouldn't worry about grade deflation as a pre-med, it never effected any of the hard sciences.<br><br>", "<b>Username: randombetch</b><br><br><i>Once again, I really wouldn't worry about grade deflation as a pre-med, it never effected any of the hard sciences.</i><br><br>Pre-meds take non-science courses too... The average GPA of Princeton pre-meds is significantly lower than the average GPA of Yale pre-meds.<br><br>", "<b>Username: german_car</b><br><br>Princeton's lack of medical school is more serious problem than grade deflation.<br><br>Harvard Yale Stanford Columbia UG partifipate in medical research or volunteer work at their medical school school. You may get the letter of recommendation from a faculty member who is very well known to the admissions committee.<br><br>Medical school also very strongly prefers application from their own undergraduate college.<br><br>", "<b>Username: kafkareborn</b><br><br>Penn students also benefit from the medical research that goes on at Penn Med School, it is one of America's best med schools (top 3) along with Harvard and Johns Hopkins.<br><br>", "<b>Username: german_car</b><br><br>That is correct. Penn Med school is one of the best.<br>Penn UG are also most represnted at Penn Med School.<br><br>At Penn Med school, Penn UG applicants will considered with 'first priority'.<br><br>At Princeton Med school, Princeton UG w..... sorry Princeton doesn't have medical school.<br><br>", "<b>Username: randombetch</b><br><br>^I've personally talked to the Dean of Admissions of Penn Med - he's actually a Princeton alum and loves accepting Princeton students. He actually emphasized that he takes into account our grade deflation when making admissions decisions.<br><br>", "<b>Username: kafkareborn</b><br><br>That is correct. Princeton and Penn Med also have a close association. Any top medical school should, and they do, want Princeton grads because they are very bright kids. Having a close association with Princeton is an advantage for any medical school. I was not agreeing with German_car, I was just correcting his ommission of Penn.<br><br>", "<b>Username: Jersey13</b><br><br>It's quite a shame Princeton doesn't have its own medical school. Fortunately, Princeton is consistently a top 5 feeder school for all elite graduate schools.<br><br><url>http://wsjclassroom.com/pdfs/wsj_college_092503.pdf</url><br><br>I suggest you take a look German_Car, I'm sure even whatever limited capability for logical thought you possess can process that information.<br><br>", "<b>Username: crystal91</b><br><br>Ouch, lol.<br><br>", "<b>Username: PtonAlumnus</b><br><br>Congrats to your son<br><br>Your son should visit the schools. Yes, Princeton has taken a tough line on grades; but other schools may follow. The acceptance rate into med school runs 90% to 95% so the tough grading standards have not prevented Princeton students from getting into med school.<br><br>One major many pre-med students choose is molecular biology. All Molecular Biology undergraduates are given the opportunity to become fully integrated members of cutting-edge research laboratories. One indication of the success of the program is the number of research publications with undergraduates as authors. Since the inception of the department in 1985, over 160 undergraduates have co-authored significant research papers. Another hallmark of success is the career paths taken by Molecular Biology majors. Approximately 70 per cent of Princeton University Molecular Biology majors obtain a higher educational degree, including MD, MD/PhD, MD/M.P.H. and PhD.<br><br>Molecular Biology juniors writing a laboratory-based senior thesis are invited to participate in the Summer Undergraduate Research Program. Each student joins a world-class research group  headed by a faculty member  and carries out an original research project. Participants are immersed in a culture of close collaboration with other undergraduates, graduate students, postdoctoral fellows, and faculty, and thereby experience first-hand what it is like to be a scientist. Over half of the molecular biology majors become paid researchers through this program while attending Princeton.<br><br>Princeton has made the life sciences a major focus for funding and growth. The Lewis-Sigler Institute for Integrative Genomics was established to innovate in research and teaching at the interface of modern biology and the more quantitative sciences. Professor David Botstein, director of the institute won the $500,000 Albany Medical Center Prize in Medicine and Biomedical Research; the award is the largest prize in medicine in the United States and is considered second only to the Nobel Prize. In 1980, Botstein and three colleagues proposed a method for mapping genes that laid the groundwork for the Human Genome Project. The Princeton Neuroscience Institute is designed to integrate the work of theorists and experimentalists through new quantitative methods and an arsenal of cutting-edge technologies. The facilities include an EEG lab, a neuroimaging facility, and a Transcranial Magnetic Stimulation (TMS)/Eye tracking laboratory, and a functional MRI scanner specially designed to focus exclusively on brain study.<br><br>At Preview weekend your son should visit the Molecular Biology Department, the Lewis-Sigler Institute for Integrative Genomics, the Princeton Neuroscience Institute, and talk to pre-meds. He will have more information to make a decision.<br><br>", "<b>Username: german_car</b><br><br>\"\"Princeton and Penn Med also have a close association.\"\"<br><br>Do you think UPenn med favor Princeton UG over UPenn UG ? Why would Penn med do that ?<br><br>No matter how close the relationship betwen them is, UPenn med will never admit more Princeton UG than UPenn UG.<br><br><br>Look at Yale Law, there are 5 time more Yale UG than Princeton UG.<br><br>Every top Law Med PhD MBA programs gives special treatment to their own UG applicant. Everyone knows that !!<br><br>", "<b>Username: german_car</b><br><br>\"\"WSJ ranking .....Princeton is consistently a top 5 feeder school for all elite graduate schools.\"\"<br>Not really. Stanford Law Med Business shcools are NOT included in WSJ ranking.<br><br>What I am saying is ..<br><br>At UPenn med, Princeton &amp; Harvard applicants gets fair and equal treatment.<br>However, at Stanford Med , Stanford UG gets special preferential treatment.<br>at Yale Law, Yale UG get special preferential treamtment.<br>at Upenn Med, UPenn UG get special preferential treatment<br>at Columbia Med, Columbia UG get special preferential treamtent.<br>.<br>.<br>.<br>at Princeton Med, of course Princeton UG get speci....... oops sorry Princeton doesn't have medical school.<br><br>", "<b>Username: randombetch</b><br><br>Yet we still dominate at grad/professional school admissions, which shows how much we rock.<br><br>Besides, who would want to stay at Princeton for 8 years? I love Princeton, but even I would get so sick of this place.<br><br>", "<b>Username: german_car</b><br><br>\"\"Yet we still dominate at grad/professional school admissions,\"\"<br><br>Nope. they are 5 grad programs selected by WSJ. It somehow conveniently excluded Stanford Med Law Business. and included mostly East coast grad schools.<br><br>", "<b>Username: erikadizzle</b><br><br>I spoke with some pre-med students at Princeton last weekend. They said they were happy with the grade deflation because it meant they truly earned the diploma they worked for.<br><br>Of course, they could've just been saying anything to get prospective students to come. Good luck to your son! Maybe I'll see him in the fall.<br><br>", "<b>Username: randombetch</b><br><br>\"\"Nope. they are 5 grad programs selected by WSJ. It somehow conveniently excluded Stanford Med Law Business. and included mostly East coast grad schools.\"\"<br><br>Which makes it a better comparison between Princeton and Stanford since Princeton doesn't have any grad students counted in the feeder score comparison either. Oops, looks like you lost again. Why am I not surprised?<br><br>", "<b>Username: german_car</b><br><br>\"\"Which makes it a better comparison between Princeton and Stanford since Princeton doesn't have any grad students counted in the feeder score comparison either.\"\"<br><br>Again I am not talking about whether Stanford is better or worse than Princeton.<br><br>At Stanford Med Law , PhD MBA program, more Stanford UGs will always be admitted than Princeton UG, no matter how excellent Princeto UG is ...<br><br>At Yale Law, 5 times more Yale UG are admitted than Princeton UG even though Princeton UG are much more qualified.<br><br>", "<b>Username: goodluck1</b><br><br>As a parent I read many threads about different things. I sincerely appreciate the responses and the professional discussion without crossing the line. Everybody is presenting the facts in a reasonable way. This positive discussion helps many students. We are planning to attend both Princeton and Yale in coming weeks. We love both schools. Once we visit, its upto my son to decide. No matter which school he chooses, we love Princeton and Yale equally. They are the best. Please continue debating and post more facts. Your help is invaluable.<br><br>", "<b>Username: Jersey13</b><br><br>\"\"Nope. they are 5 grad programs selected by WSJ. It somehow conveniently excluded Stanford Med Law Business. and included mostly East coast grad schools\"\"<br><br>I apologize German_Car, I obviously vastly overestimated your intelligence in assuming you were able to read. The WSJ selected 15 elite graduate programs, including 5 top programs from Med, Law and Business, which were determined based off of actual graduate school rankings.<br><br>Try reading this, perhaps if you go slowly and take a few hours to process the text, you may be able to understand.<br><br><a href=\"http://wsjclassroom.com/college/feederschools.htm#rankings\" rel=\"nofollow\">The Wall Street Journal Classroom Edition</a><br><br>", "<b>Username: PtonAlumnus</b><br><br>German_car raises an issue worth discussing.<br><br>Is it better to attend a university that places an emphasis on undergraduate education or should you attend a university based on the graduate school you may want to attend in four years. German_car clearly believes if you want to go to Yale Med you should attend Yale College.<br><br>There is a good reason why many organizations that rank undergraduate education rank Princeton number one. Princeton's administration and endowment are dedicated to making Princeton the best undergraduate education in the world. Princeton has the highest endowment per undergraduate in the country. Princeton simply has more money to spend on faculty salaries and undergraduate education. Penn's endowment must support all their professional schools.<br><br>I think that it is highly advantageous for students to attend a different graduate school and undergraduate school. Different schools have different philosophies and approaches. For example, in economics there are the salt water economists [Princeton, Harvard, MIT, Stanford] and the fresh water economists [University of Chicago, Minnesota.] There are advantages to learning both schools of thought.<br><br>The danger of trying to pick an undergraduate college based on the graduate school you may want to attend is that students change their major! A freshman pre-med is a sophomore novelist or a junior attorney.<br><br>Students should choose the college where they can get the best education, where they are comfortable with the students that attend, the school that has activities of interest (sports, arts, music, special interest clubs, etc.), and will support their ever changing educational goals.<br><br>Princeton students do not share German-cars concern over their ability to get into graduate school. Princeton pre-meds end up studying medicine at Yale, Harvard, Stanford, John Hopkins, and other fine schools.<br><br>", "<b>Username: randombetch</b><br><br>^Bravo - what an awesome post.<br><br>", "<b>Username: german_car</b><br><br>\"\"I think that it is highly advantageous for students to attend a different graduate school and undergraduate school.\"\"<br><br>Same UG/G is more likely to happen thant different UG/G.<br>At yale law school., Yale UG/Yale Law is 5 time more likely than Princeotn UG/Yale Law.<br><br>", "<b>Username: goodluck1</b><br><br>Any statistics from recent Princeton medical school applicants(Princeton students who applied to medical schools). How many students applied(in 2009/2008), how many got accepted, and how many to each medical school?<br><br>", "<b>Username: randombetch</b><br><br>Fall 2009 matriculants: 107/115 accepted to a medical school (93.0%), somewhere around 30% of those headed to a top 10 medical school.<br><br>It's certainly not bad (except for Harvard, Yale, and Stanford, which also have around 90-95% acceptance rates to a medical school, no other school comes close), but I still think life would be easier if someone did pre-med at Yale rather than Princeton.<br><br>", "<b>Username: honeyjay</b><br><br>what about the advantage penn has...it facilities...access to bigger city?<br>im just asking<br><br>", "<b>Username: german_car</b><br><br>UPenn undergrad are the most represented at Penn Med school because top grad school<br>always give strongest preferences to their own undergraduate applicants.<br><br>Because Princeton does not have med ( law PhD MBA) programs, Princeton UG are alwasy treated as 2nd class applicants.<br><br>", "<b>Username: randombetch</b><br><br>Lol we don't have PhD programs now?<br><br>Penn undergrads have a very slight advantage over Princeton for Penn Med.<br>Princeton undergrads have a slight advantage over Penn undergrads for all other medical schools.<br><br>", "<b>Username: german_car</b><br><br>Nope. Penn UG have HUGE advanage over Princeton for Penn Med Law PhD MBA(wharton) programs. Penn and Princeton are treated equally at all other grad schools.<br><br>", "<b>Username: Silly Puddy</b><br><br>On the Internets, we can say whatever we want - no data required! Example:<br>\"\"<a rel=\"nofollow\" href=\"/profile/german_car\">german_car</a> wrote:\"\"<br><br>Nope. Mercer Community College has a HUGE advantage over Penn UG for ALL Penn Med Law PhD MBA(wharton) programs. Mercer Community College and Penn are treated equally for all other grad schools.<br><br>", "<b>Username: german_car</b><br><br>\"\"On the Internets, we can say whatever we want - no data required! Example:.....\"\"<br><br>Yes I want to add one more example:<br>\"\"Princeton undergrads have a slight advantage over Penn undergrads\"\"<br><br>", "<b>Username: Jersey13</b><br><br>^ I'll add the most moronic of all<br>\"\"Because Princeton does not have med ( law PhD MBA) programs, Princeton UG are alwasy treated as 2nd class applicants.\"\"<br><br>", "<b>Username: goodluck1</b><br><br>I don't want to see -ve posts. Please try to provide some facts.<br><br>", "<b>Username: PimpDaddy1</b><br><br>Do you really think there will be a huge difference in your medical school options if you went to Princeton or Yale or Harvard or any of the other schools in that range? Princeton/Yale both place exceedingly well into medical school, base your decision on one of the million differences between the two schools, not on a nonexistent difference in medical school placement.<br><br>", "<b>Username: midatlmom</b><br><br>\"\"Fall 2009 matriculants: 107/115 accepted to a medical school (93.0%), somewhere around 30% of those headed to a top 10 medical school.\"\"<br><br>Goodluck1--I think that the statistics quoted above (as well as the additional info as to previous years available in this link <a href=\"http://www.princeton.edu/odoc/faculty/grading/faq/\" rel=\"nofollow\">Princeton University - Dean of the College - FAQ</a> ) are all that's available from Princeton in terms of med schools admissions (and I should note that many/most schools don't provide as much information as Princeton).<br><br>Princeton and I assume Yale (although I can't find any specifics on its website), have very high acceptance rates into medical school and as PimpDaddy has suggested, I think that you and your son should probably make your decision based on other factors.<br><br>Good luck with your decision and congratulations to your son on so many wonderful acceptances.<br><br>", "<b>Username: goodluck1</b><br><br>Let me give some FA details. Yale FA offer is the best among 10 offers we have. Princeton's offer is 5K less per year than that of Yale's(we need to pay 5k more per year to Princeton). Can we bargain with Princeton, if my son decides to go to Princeton?<br><br>", "<b>Username: german_car</b><br><br>Harvard &amp; Yale Medical Schools give highest priority to Harvard &amp; Yale UG applicants.<br>About 5 times more Yale UG are enrolled at Yale Med School than Princeton UG.<br><br>If you want to go Harvard-Yale level medical school, then you should go H Y UG.<br>Yale UG also have an opportunity to conduct research with Yale Med faculty members and<br>get a recommendation letter from someone known to the yale med school admissions committee.<br><br><br>Most Princeton UG end up at state-university level med schools.<br><br>", "<b>Username: Jersey13</b><br><br>\"\"Most Princeton UG end up at state-university level med schools.\"\"<br>Dang, your expansive evidence has really stumped me now...<br><br>", "<b>Username: randombetch</b><br><br>Well I have no desire to go to Harvard nor Yale Med School so I'm at no disadvantage in comparison to Harvard/Yale undergrads then.<br><br>Btw, your stats are horrendously off. Actually, 5 times more Princeton undergrads attend Harvard Med than Harvard undergrads.<br><br>Yup. I said it on the internet, so it must be true.<br><br>", "<b>Username: german_car</b><br><br>Well. At Yale Law<br>17 Princeton UG enrolled vs. 82 from Yale UG.<br>82/17 ~ 5. I know it is hard to believe. but there is really a HUGE difference.<br><a href=\"http://www.yale.edu/printer/bulletin/htmlfiles/law/law-school-students.html\" rel=\"nofollow\">Yale University Bulletin | Yale Law School 2009?2010 | Law School Students</a><br><br>All Ivy league levele schools MD PhD JD MBA programs have similar ratio.<br>Princeton's lack of graduate/professional school is really a HUGE disadvange. THat is why Princeton UG end up getting a job that requires only undergradute degree.<br><br>", "<b>Username: german_car</b><br><br>\"\"Well I have no desire to go to Harvard nor Yale Med School so I'm at no disadvantage in comparison to Harvard/Yale undergrads then.\"\"<br>At Stanfod Med Law, Stanford UG get first priority and Princeton UG are at disadvantge.<br>At Columbia Med Law, Columbia UG get first priority and Princeton UG are treated as 2nd class applicant.<br>All other top grad schools have similiar admission policy.<br>That is why Princeton UG end up getting a job that requires only UG degee.<br><br>", "<b>Username: ib612</b><br><br>really german car? so that's why Princeton UG has a 92% med school acceptance rate, only 2% shy of Yale's<br><br><a href=\"http://www.princeton.edu/odoc/faculty/grading/faq/\" rel=\"nofollow\">Princeton University - Dean of the College - FAQ</a><br><br>", "<b>Username: midatlmom</b><br><br>ib612<br><br>I think that Princeton had a 93% acceptance rate last year, according to those stats. I was wondering where you got the Yale stat from--I can't find anything published by Yale giving the 94% figure.<br><br>", "<b>Username: german_car</b><br><br>You can go to Yale Med school and request a year book (or facebook), which lists<br>all students with UG school attended. Approximately 30-40% students are from Yale UG. Similar statistics at Harvard Columbia Stanford Med Law PhD MBA programs.<br><br>", "<b>Username: randombetch</b><br><br>^Dude, no one cares. If Princeton had a med school, I sure as hell wouldn't go. So there is effectively no disadvantage for me whatsoever. You lost ;).<br><br>", "<b>Username: Boondocks</b><br><br>I graduated from Princeton 25+ years ago, so I can't tell you exactly what is going on campus at this second (the advantage is, as an executive and physician recruiter, I am seeing physicians' resumes who are 20 to 30 years past their college days).<br><br>In any case, your child can get into med school by attending either Yale or Princeton (although I had to make such an admission about our hated Yale). I doubt if his chances are any better coming from one or the other (and getting into med school is only going to get easier, as more med school slots are created - we have an acute shortage of MD's these days, especially in primary care).<br><br>The deciding factor shouldn't be whether or not Yale or Princeton gives him a better shot at getting into med school, but rather his decision should be based on which college fits him best. If he's miserable at Princeton, or winds up hating New Haven, his grades will be lousy, and he'll falter.<br><br>The two schools academically will provide everything he needs to get in. All of the tenured profs at these two schools are internationally-renowned. There are only about 12 courses he must take to get into med school anyway, and those courses are offered at any college in the country. I know a very successful orthopedist who was a religion major at Princeton.<br><br>The settings of these two schools are much different, and both have different atmospheres. Have him check the schools out carefully in the next few weeks, and make his decision based upon which one he likes best.<br><br>", "<b>Username: Boondocks</b><br><br>Some additional thoughts:<br><br>1) I wouldn't choose an undergraduate college because it has a med school, especially an elite med school like Yale's. Yale Med chooses from a national/international pool of applicants. Most Yale undergrads who are qualified to get into med school will get turned down by Yale if they apply - they may be good enough to get into med school but not good enough to get into Yale - the competition is thick. Perhaps Yale undergrads get a small preference at Yale, but I doubt if it's much. They are looking for diversity, and may find that brilliant kid from Kalamazoo College, Grinnell or University of Montana (and yes, there are brilliant kids at all those schools - brilliance isn't reserved for the Ivy college students) to be more interesting. My father, an orthodontist, was accepted into Pitt's dental school after two years at a no-name junior college that graduated less than 100 kids a year, in no small part because they wanted more diversity and because they wanted to train some dentists who would practice in small towns in the middle of nowhere, like the one in which my father grew up.<br><br>2) I occasionally see CV's from physicians who attended med school at the same place they did their undergraduate work, but that's rare. It's rarer still at an elite med school (and who is to say that after four years of college at Yale, he would prefer to stay at Yale, rather than go to Hopkins or Baylor? ...).<br><br>3) I applied to Princeton as a chemistry major, changed my mind before I got there, winding up as a psychology major. I graduated thinking I wanted to be a writer, wrote magazine articles for three years, didn't like it, and after twelve years in sales management, moved into consulting and executive/physician search. Your son's college and career path is likely to resemble something like that - almost every kid changes his mind over and over again during college, and after graduation. My doctor graduated from college, spent a year in Asia, and then decided to attend med school. He needed to take biology and some other courses he hadn't taken as an undergrad at Oberlin, and got into Dartmouth Med School.<br><br>4) I think that a kid who chooses Yale should do so in part because they want to be in a setting like New Haven, rather than for the quality of their biology department or the percentage accepted to med school. The opportunities to get involved in outreach programs for inner city people are far more plentiful than at Princeton. If a fairly tough urban climate is something he finds scary, he should think about Princeton, rather than Yale. (My business partner went to Trinity, which is set in a struggling neighborhood in Hartford, CT, and we have discussed this issue many times).<br><br>5) Don't try to compare one college's med school acceptance percentage with that of another school. To make any sensible comparison, you need to have complete data on who is in each pool, and whether the school discourages kids who aren't likely to get into med school from applying to med school. That kind of data is not available.<br><br>", "<b>Username: goodluck1</b><br><br>boondocks, nice post.<br><br>", "<b>Username: PimpDaddy1</b><br><br>\"4) I think that a kid who chooses Yale should do so in part because they want to be in a setting like New Haven, rather than for the quality of their biology department or the percentage accepted to med school. The opportunities to get involved in outreach programs for inner city people are far more plentiful than at Princeton. If a fairly tough urban climate is something he finds scary, he should think about Princeton, rather than Yale. (My business partner went to Trinity, which is set in a struggling neighborhood in Hartford, CT, and we have discussed this issue many times).\"<br><br>Exactly, this really should be the only factor at play.<br><br>", "<b>Username: SaVin99</b><br><br>Hi, Could you please let us know what your son finally decided and what does he think about that decision now. My daughter is accepted to Princeton. She is interested in pre-med path. Applying to Yale and Harvard as well. Thanks for initiating the great discussion. I really appreciate your feedback.<br><br>", "<b>Username: T26E4</b><br><br>@Savin99 Welcome to CC. If you click on the User's name, you can see when was the last time they were on the site. The orig poster hasn't been here since 2014 so won't likely see your question. The site requests that old threads not be resurrected too. You can make a new thread w/your question, however<br><br>"]}