{"title": "cal vs berkeley", "comments": ["<b>Username: iHateCeltics</b><br><br>Which school is better? I always wanted to go to Cal, but I heard Berkeley is good too. Which one do you guys think is better?<br><br>", "<b>Username: HelloAll</b><br><br>Berkeley because its the name of the actual city.<br><br>", "<b>Username: ZorroX99</b><br><br>Berkeley for sure, Cal sucks<br><br>", "<b>Username: HelloAll</b><br><br>Plus, some might not know which college Cal is ... so go to Berkeley just to be safe.<br><br>", "<b>Username: schrei</b><br><br>What's \"Cal\"? I thought Cal was a nickname for UC Berkeley... Someone please explain.<br><br>", "<b>Username: rider730</b><br><br>No, UCB beats both Cal and Berkeley<br><br>", "<b>Username: Batllo</b><br><br>Go to UCB for 2 years and then transfer to either Cal or Berkeley depending on your major<br><br>", "<b>Username: fortify</b><br><br>Berkeley has a good business program. Cal's engineering is pretty good and UCB is good for english majors<br><br>", "<b>Username: rider730</b><br><br>While the athletic battles between football players from Cal, Berkeley and UCB might be passionate, for some reason no tickets are sold and few get to watch these. Further, they don't post scores or use refs.<br><br>", "<b>Username: BusyMei</b><br><br>I graduated from UCB, Cal and Berkeley. They are the greatest!<br><br>", "<b>Username: Batllo</b><br><br>I know a guy who got into Cal, waitlisted at UCB and rejected from Berkeley.<br><br>", "<b>Username: fortify</b><br><br>That's not surprising. Berkeley is usually the most selective.<br><br>", "<b>Username: demoz</b><br><br>i actually just exploded<br><br>", "<b>Username: missionewokzzz</b><br><br>Cal is sort of the poor man's Berkeley<br><br>", "<b>Username: Neon Green</b><br><br>UCB, Cal, Berkeley.. ugh. Berk is the rave nowadays.<br><br>", "<b>Username: ZorroX99</b><br><br>this topics wins<br><br>", "<b>Username: HidingInACorner</b><br><br>This thread is posted in Cal's, UCB's, and Berk's forums as well, right? We don't want anyone to miss out<br><br>", "<b>Username: rider730</b><br><br>Good point - have to move copies of it over.<br><br>", "<b>Username: Flipper519</b><br><br>you guys are awesome<br><br>", "<b>Username: EmpathyInAnarchy</b><br><br>They're all ranked the same, but there's more to consider than rankings. California is having budget problems, so you might have trouble getting into classes at Cal. UCB has a great L&amp;S college, and their college of Letters and Sciences is great as well.<br><br>", "<b>Username: Batllo</b><br><br>Better to take the BART or Caltrain to get from UCB to Cal?<br><br>", "<b>Username: TearxDrops</b><br><br>Sorry for sounding ignorant, but what's UCB, Cal, and Berkeley? Aren't they all the same school?<br><br>", "<b>Username: Flipper519</b><br><br>Cal > UCB > Berkeley<br><br>", "<b>Username: rider730</b><br><br>No, I disagree. Cal is known mainly for its Golden Bears athletes. Berkeley is the awesome academic institution, and UCB is just a big state school. thus Berkeley > UCB > Cal<br><br>", "<b>Username: Flipper519</b><br><br>^ I see where your coming from. I wholeheartedly agree.<br><br>", "<b>Username: sapatel12</b><br><br>hahahahaha<br><br>", "<b>Username: ZorroX99</b><br><br>Well Cal has its ups and downs. But as a student from a small private school in Anaheim who really had a tough time making this decision last year, I have to recommend Berkeley. Its hands down the better school.<br><br>And don't even get me started with UCB, that place is full of hobos.<br><br>", "<b>Username: xpolly</b><br><br>whaaaat. hahahah aren't they all the same?<br><br>", "<b>Username: fortify</b><br><br>If you think they're all the same then you're probably not smart enough to get into any of the 3<br><br>", "<b>Username: HelloAll</b><br><br>@xpolly: Nope. Cal = 3 letters. Berkeley = 8. I thought they taught you this in Pre-school?<br><br>", "<b>Username: RileyJon</b><br><br>I enjoyed this.<br><br>", "<b>Username: HelloAll</b><br><br>If you plan to party hard, I would suggest Cal. However, if you hardly party, definitely go to Berkeley.<br><br>", "<b>Username: collegeconfusi0n</b><br><br>dammit. i'm attending the wrong school. I thought i submitted my SIR to UCB, the big state school that's supposed to have affordable tuition, but everyone here keeps talking about fees at Berkeley keep going up and up. public education ftw! maybe next time around i'll consult the forums before deciding which school to go to...<br><br>", "<b>Username: 88888888</b><br><br>what has this thread turn into.. lol<br><br>", "<b>Username: HidingInACorner</b><br><br>You guys are so helpful! I've officially decided to go to Berkeley instead of Cal. I didn't get into UCB...<br><br>", "<b>Username: PlatosCave</b><br><br>Great choice Hidinginacorner, I think Berkeley will be a great fit for you, it's much more catered to the student who wants top notch academics and a well rounded social life. Most people have a hard time adjusting at first but everything falls in place nicely and you'll get much more opportunities than you will at Cal.<br><br>Forget about UCB, you're going to do great at Berkeley.<br><br>", "<b>Username: Diivio</b><br><br>For those who haven't caught on, Cal, UCB, Berkeley, and Berk are all one of the same lol (when I first read the post's title, I was thinking \"uh oh did i apply to the wrong place? lol\".<br><br>", "<b>Username: singh2010</b><br><br>I laughed at this. Brilliant.<br><br>", "<b>Username: Batllo</b><br><br>Did you read about the triplet sisters-one admitted to Cal, another to UCB and the third, poor thing, only got into Berkeley-she's appealing, of course.<br><br>", "<b>Username: calnyc</b><br><br>Ugh it's definitely harder to get into Cal OOS...Berkeley has been taking more OOSers this year, which is probably why I got in. I didn't even bother applying to Berk...it's trying to encroach on Cal and Berkeley's reputation. UCB was my safety, so I'm glad I got into Berkeley also<br><br>", "<b>Username: dragonscale333</b><br><br>Warning to all future applicants:<br><br>You know how some people apply to Cornell College thinking it's Cornell University - and how there's rumors that someone actually submitted their SIR to CC thinking it was CU? Well, I meant to apply to Berkeley, but I applied to Cal because someone told me they were the same thing...after submitting my SIR, I find out they're not! ****.<br><br>Basically, know your stuff. If you don't know the difference between Cal, Berkeley, and UCB, you don't deserve to go to any of them (meaning, I am an idiot. And maybe some of you guys are too?)<br><br>", "<b>Username: Collegestress16</b><br><br>IDK I have to disagree with some of you guys, I think Caltech> UCB> Berkeley College. But what do I know, I've only visited a couple of times.<br><br>", "<b>Username: sapatel12</b><br><br>collegestress16, you fail.<br><br>", "<b>Username: Collegestress16</b><br><br>^ LOLOL, I'm just saying that although the OP is obviously ****, the names could easily be misconstrued. I sincerely thought CAL meant Caltech before I started applying to colleges last year.<br><br>", "<b>Username: rider730</b><br><br>Its a well known confusion, one that has to be addressed by anyone giving a college tour. You will find that Cal is the most commonly used term by students by quite a bit. It is only when dealing with 'outsiders' that someone tends to revert to Berkeley or sometimes UCB.<br><br>", "<b>Username: ao1313</b><br><br>I mean Cal is good and all but UCB and Berkeley are a little more prestigious , just sayin<br><br>", "<b>Username: FellowCCViewer</b><br><br>This thread is ridiculous.<br><br>", "<b>Username: GoCalBearss</b><br><br>I don't know about you guys.. but I think Berkeley is better than Cal...<br><br>", "<b>Username: iHateCeltics</b><br><br>Cal is probably the best school in the United States, but Berkeley is for sure the best school in America.<br><br>", "<b>Username: yallniggaz</b><br><br>[url]<url>http://i153.****/albums/s227/kevinrwalker71/YallNiggazPostinInATrollThread.jpg[/url]</url><br><br>Guys, this is what I think about Cal vs UCB vs Berkeley.<br><br>", "<b>Username: coolsons</b><br><br>you guys are just hilarious... and gonna confused some of them...<br><br>", "<b>Username: emilsinclair9</b><br><br>Ahhh laker laker laker.....you just don't stop do you? lmao.<br><br>", "<b>Username: Calcruzer</b><br><br>I liked Cal so much I named myself after it.<br><br>My friend Busby named himself after Berkeley.<br><br>Nobody would ever name themselves after UCB.<br><br>", "<b>Username: emilsinclair9</b><br><br>@ Batllo: WOW! lol I actually laughed out loud at your comment about the triplets.<br><br>", "<b>Username: phoenix7</b><br><br>Stanford owns Berkeley.<br><br>I'm funny, too, right?<br><br>", "<b>Username: rider730</b><br><br>Tell that joke to the Axe, near permanent possession of Cal.<br><br>", "<b>Username: calnyc</b><br><br>Yo berkeley, 'imma let you finish but cal is the best university of all time.<br><br>", "<b>Username: ao1313</b><br><br>HAhahaha @calnyc<br><br>", "<b>Username: ThatOnePianist</b><br><br><a href=\"http://objection.mrdictionary.net/go.php?n=3820564\" rel=\"nofollow\">Objection!</a><br><br>OBJECTION!!!! Berkeley for the win. Cal fails anyways.<br><br>", "<b>Username: icesplendor</b><br><br>I was reading this during physics section today and had to restrain myself from laughing out loud.<br><br>I'm at Berkeley. I applied to Cal too and got in. Didn't even bother with UCB. I'm double-majoring in ChE and chemical engineering, so obviously Berkeley was the right choice.<br><br>", "<b>Username: The Legend</b><br><br>The funny thing is... most people really do think they are different.<br><br>Actual conversation at my school in the Bay Area...<br><br>Guy: Hey did you get into Berkeley?<br>Me: No<br>Guy: Oh, did you get into Cal then?<br>Me:....<br><br>", "<b>Username: jojomonkey</b><br><br>UCB is like Cal and Berkeley's ****ty cousin.<br><br>", "<b>Username: soulkamikaze</b><br><br>yea, I agree. UCB isn't as good is Cal. I can't believe I chose that over Cal. I'm thinking of transferring to Cal now.<br><br>", "<b>Username: Batllo</b><br><br>soulkam-Don't fool yourself into thinking UCB is different from Cal, stay put.<br><br>", "<b>Username: YeloPen</b><br><br>berklee is the best.<br><br>", "<b>Username: jcilla</b><br><br>so guys are the berklee bears D1? i'm thinking of trying out for their curling team...<br><br>", "<b>Username: YeloPen</b><br><br>yeah dude, berklee shiny-yellow bears are D1. they play in the big game against samford.<br>good luck with curling, they have a good team.<br><br>", "<b>Username: jcilla</b><br><br>grazie YeloPen. wish me luck!<br><br>also, 69 GET.<br><br>", "<b>Username: ThoughtProvoking</b><br><br>This is great.<br><br>", "<b>Username: harhar415</b><br><br>@yelopen. Berklee curling gets destroyed by samford curling.<br><br>", "<b>Username: ChemELover</b><br><br>I wish I got into either of these two colleges. >&lt;<br><br>", "<b>Username: Batman17</b><br><br>I applied to Berkeley Community College and ended up here.<br><br>", "<b>Username: CCnewbie</b><br><br>This is probably the funniest post in our forum history.<br><br>", "<b>Username: Batman17</b><br><br>I liked the Hot girls at Berkeley one better. That lasted for a good while before mods took it off and now we can't even talk about how girls look before they sto<br><br>", "<b>Username: paulalalala</b><br><br>Berkeley is 69 times better than Cal. I've never heard of UCB. Isn't that like a clothing company? united colors of benneton???? I'm sooo confused<br><br>", "<b>Username: MuffinDude</b><br><br>Heck guys. Cal stands for CALIFORNIA. We all know that CALIFORNIA is better than wherever that junk school called Harvard is located. Berkeley is just a ghetto where you get robbed if you walk out in the night. Why the heck would you want to go to Berkeley over Cal??? CALIFORNIA FTW GUYS!<br><br>", "<b>Username: redmangoose</b><br><br>Toughie..<br>I'd say go for Cal..and then transfer to UCB. Berkeley is..meh..<br><br>", "<b>Username: renee4ever</b><br><br>AHAHAHAHAHAHAHAHAHAH OMG that made me laugh out loud.<br><br>", "<b>Username: Loyalty253</b><br><br>Berkeley rejected me, Cal is full of ******bags, and I didn't even bother applying to UCB.<br><br>In other news, this is the greatest thing I have ever read.<br><br>", "<b>Username: Eloriel</b><br><br>I can imagine the herds of confused people running about right now.<br><br>By the way, Cal /is/ better than Berkeley. UCB is rubbish. Just sayin'.<br><br>", "<b>Username: jojomonkey</b><br><br>Berkeley is going through some major budget deficits right now and UCB just lost their star running back.<br><br>I'd say, go to Cal, their dining halls are better and they have hotter girls.<br><br>", "<b>Username: ShesOnHerWay</b><br><br>So why does my diploma say Berzerkley?<br><br>", "<b>Username: jojomonkey</b><br><br>\"\"So why does my diploma say Berzerkley?\"\"<br><br>That's obviously Cal's lame sister school. You're like a Barnard girl claiming you go to Columbia. Stop leeching off our success *rollseyes*<br><br>:P<br><br>", "<b>Username: chadwicked</b><br><br>Dudes, it's all about Berkely.<br><br>", "<b>Username: calbears1868</b><br><br>I laughed out loud when i read the topic, then I noticed how someone starts talking about Berklee, as in the music school.<br><br>", "<b>Username: Provecho</b><br><br>Bumped for great justice because clearly UCB >>>>> Cal and Berkeley.<br><br>", "<b>Username: kmazza</b><br><br>Not so fast, I met Cal the other day and he said that Berkeley > UCB<br><br>", "<b>Username: lolschool</b><br><br>I like Stanford.<br><br>", "<b>Username: GlobalDolphin</b><br><br>Stanford>>>all of the above. However UCB has a better quality of life than the others, and the parties at Cal tend to be pretty wild.<br><br>", "<b>Username: GlobalDolphin</b><br><br>Stanford>all of the above. Though UCB has the best weather and Cal has the wildest parties.<br><br>", "<b>Username: nick_scheu</b><br><br>Holy thread resurrection, Batman!<br><br>", "<b>Username: Batllo</b><br><br>Due to California's budget crisis the California University System Board of Regents announces that Cal, Berkeley and UCB will be consolidated to one campus.<br>Students will only need to check one box on the Common App for all 3 schools.<br><br>Good to be back from the dead thread pile.<br>Gonna stretch my legs.<br><br>", "<b>Username: Batman17</b><br><br>why would you talk about stanford when we're talking about cal and berkeley and ucb?<br><br>", "<b>Username: busterbeetle</b><br><br>Stuck Fanford<br><br>", "<b>Username: DiogenesofSinope</b><br><br>University of Northern California, guys. It's so warm and cute and sexy...<br><br>", "<b>Username: Diivio</b><br><br>^Is that a real college?<br><br>", "<b>Username: SockherMom</b><br><br>^<br>^<br>sfsu<br>^<br>^<br><br>", "<b>Username: mrszaynmalik</b><br><br>omg all the **** on this thread... i can't<br><br>", "<b>Username: mffly122</b><br><br>BUMP! I applied to all Berkeley, Cal, and UCB... I'm awaiting decisions. Hopefully I get into Cal, Berkeley too. UCB..not so much.<br><br>", "<b>Username: Tizil7</b><br><br>Berk's my friend's name :eek:<br>I wouldn't like to go to \"Berk\" :p<br><br>Anyways, Fun thread is fun.<br><br>", "<b>Username: EllexInc</b><br><br>Cal - go there if you want to party<br>Berkeley - go there if you want to study<br>UCB - don't go here...<br><br>", "<b>Username: CaliGoldenBear</b><br><br>This might just be the best thread ever.<br><br>", "<b>Username: UberSandvich</b><br><br>Remember that horrible attempt at a merger of the two with \"Cal Berkeley\"<br><br>Yeah...I'd like to forget too...<br><br>", "<b>Username: tum741</b><br><br>Hi, I'm sorry if I'm posting this on the wrong thread but I'm currently in CC hoping to transfer into UCB, Cal, or Berkeley. I will be applying for next year and I was hoping if anyone can chance me on the schools? GPA: 2.3. Will be 4.0 be the end of the semester. EC's: almost none Volunteer: 2 hours helping professor by driving him to school. Strengths: I'm very well versed in pickle licking and exuding fluids from my fingers to my toes as well as organizing snowmen by height and abstract structure. Thanks in advance! :)<br><br>", "<b>Username: singh2010</b><br><br>^ Rejected by Berkeley, admitted to UCB, and waitlisted by Cal.<br><br>", "<b>Username: Diivio</b><br><br>lol forum people are sooo silly it's awesome :)<br><br>", "<b>Username: JamesGatz2</b><br><br>Lmao !!!!!!<br><br>", "<b>Username: ChuckieP</b><br><br>I'm a Berkeley student and Cal is short for Berkeley. What's Cal in the context of this thread?<br><br>", "<b>Username: fortify</b><br><br>Cal is Cal. The separate from Berkeley entity that it is.<br><br>", "<b>Username: seafarer</b><br><br>^^ Be happy that you attend Berkeley. You don't need to worry about Cal ... or UCB, for that matter.<br><br>", "<b>Username: garggaurav</b><br><br>I got into Berkeley but was rejected from Cal :(<br><br>It's tough. My parents always wanted me to go to Berkeley and they are happy. But I am so sad. I just love Cal's blue and gold much more than Berkeley's gold and blue. Even Cal's Oski is so much better than Berkeley's golden bear. I am definitely gonna appeal.<br><br>", "<b>Username: BAYLIFE</b><br><br>Ugh, did anyone else accidentally mention Berkeley in their \"Why Cal\" essay? I was thinking that would kill my application, but I got in anyway! Still going to Berkeley tho.<br><br>", "<b>Username: collegedad2013</b><br><br>As a football fan, it is hard to chose.<br>In the big game match up Cal leads Berkeley over the last 5 years, but Berkeley has the edge over the last 10 years.<br>UCB is weaker, but it plays the spoiler since it can keep either out of the Rose Bowl with an upset win.<br><br>", "<b>Username: yohcs9999</b><br><br>I'm in the exact same situation as you, but I was wondering if Cal was not surpassing Berkeley in terms of prestige.<br>Do you know which college is better for pre med ?<br>My daughter is an undergrad at Cal and she loves it !<br>They are both great schools, you can't go wrong with any of them.<br>I'd say, follow your heart.<br><br>", "<b>Username: yeeharryee</b><br><br>hey guys. I just heard back from cal and ucb. I got a $36,000 scholarship from cal (I play the oboe) and only $40,000 from ucb. Idk I am like a little surprised because I was expecting more money from ucb, it's a worse school. Anyways, I'm still waiting on hearing back from princeton. Quick question- how easy is to transfer from cal to berkelee? I really want to pursue oboe playing as a career, maybe tie it in with biomedical engineering?<br><br>Here are my stats:<br>-nationally recognized oboe player<br>-honorable mention for trombone playing<br>-national merit winner<br>-drafted to the nfl<br>-winner of spelling bee<br>-ballet dancer<br>-36 Act, 2347 SAT<br>-4.20 GPA (unweighted)<br>-super hipster<br><br>Tryna rush delta delt in college!! Berkeleei has it, but Cal doesn't. Any delta delt brothers out here?<br><br>Guise, what do I do? I just want to cure cancer.<br>Thx.<br><br>", "<b>Username: prospie7</b><br><br>Yeeharryee-<br><br>Dude, those are some sick stats. I've been dabbling in the art of hipsters too, got any advice?? I'm a delta delt right now, if you have any questions dm on twitter @deltabrosnohomo and follow me on instagram @deltabrosyeshomo.<br><br>As far as colleges go, I would def go for cal, it's a way better school. I heard you can cross enroll at berkelee, it's a pretty long commute but it's doable. Keep up that oboe passion.<br><br>Also, have you looked at Barnard? I think that would be a great school for you.<br><br>What time recruited you for the NFL? I play for the falcons, it's pretty chill.<br><br>", "<b>Username: mothergoldenbear</b><br><br>@ ChuckieP (post #109)<br><br>\"I'm a Berkeley student and Cal is short for Berkeley. What's Cal in the context of this thread?\"<br><br>I believe \"Cal\" is short for \"California\". I've seen some college sweatshirts in the Cal section and it simply has \"California\" emblazoned across the front. I myself wondered why some people wouldn't think you were just a strong proponent of the great state of CA, but I guess not. BTW, I've seen it with and without the bear.<br><br>Eg: <url>http://i.ebayimg.com/t/UC-Berkeley-Cal-Bear-Official-Zippered-Hoodie-Sweatshirt-Champion-Authentic-/00/s/MTYwMFgxMTU5/z/PrYAAOxy1yZSLpzl/$</url>(KGrHqJ,!qIFIYlwfI!UBSLpzkmpK!~~60_35.JPG<br><br>", "<b>Username: yeeharryee</b><br><br>Prospie7<br><br>I have lots of advice, you just can't shop at urban outfitters. even though they have hipster brands, it just isn't legit. I'm taking AP Hipster Studies and I specifically studied a lot about shopping for the AP test (to eliminate my requirement in cal or bereklee, wherever I decide). Try to go to some garage sales, antique stores, or thrift shops to buy things that nobody else has.<br>Yee man Im so excited to rush delta delt wherever I go. Did you like their fb page? its <a href=\"www.****/yeedeltadeltyee\" rel=\"nofollow\">www.****/yeedeltadeltyee</a><br><br>I think my football coach likes me cross enrolling so that I can run to the other campus to practice. I was drafted to the Packers in 8th grade as an offensive lineman but I don't like it because there isn't enough physical contact.<br><br>I WAS ALREADY ACCEPTED TO BARNARD AS THE FIRST MALE TO ATTEND SINCE BARACK OBAMA<br><br>", "<b>Username: prospie7</b><br><br>Yeeharryee-<br><br>Bro, that's impressive. Deltadelt loves stuff like that. If you end up at Berkeley, you'll definitely get a bid from us.<br><br>If you join delta delt at berkeley we can be roommates ;) and go hipster shopping all the time.<br><br>I would seriously consider cal though, it's way cooler and I love it here. SO happy i didn't choose berkeley. However, I wish I got into berkelee.<br><br>thoughts guys?!?!<br><br>", "<b>Username: merc81</b><br><br>Cal: high match<br>Berkeley: match<br>UCB: safety<br><br>", "<b>Username: merc81</b><br><br>The OP has most likely made their decision as to where to enroll, but for others considering these schools:<br><br>Cal: Intellectual, but quirky students. Thesis required.<br>Berkeley: Preppiest. Swim test required.<br>UCB: party-school reputation for non-engineering students there, but that's just what I've heard.<br><br>Having said that, the similarities of these schools are much greater than their differences, and a student who would do well at one would likely do well at any of them.<br><br>", "<b>Username: merc81</b><br><br>Posters who have suggested that these aren't \"real\" schools have a typical Eastern bias and shouldn't have commented on this thread.<br><br>"]}