{"title": "cambridge vs princeton for math", "comments": ["<b>Username: Derivate</b><br><br>I have offers from the two and I want to study math.<br><br>", "<b>Username: PtonAlumnus</b><br><br>The Princeton Mathematics Department is ranked by the U.S. News &amp; World Report and other organizations as perhaps the best Mathematics Department in the U.S. The department has approximately 70 faculty and research staff, 70 graduate students, and 70 undergraduate majors. Math majors study subjects such as Number Theory, Topology, Discrete Mathematics, Algebraic Geometry, Differential Geometry, Differential Equations, Automorphic Forms, Representation Theory, Complex Analysis, Linear Algebra, Analysis, and Finite Mathematics.<br><br>The Putnam math competition is an annual North American math contest for college students, administered by the Mathematical Association of America. The examination is intended to test creativity as well as technical competence in undergraduate-level mathematics. 2008 was the fifth consecutive year that the Princeton team has won first or second place and the 27th year that it has been among the winning five teams.<br><br>The Fields Medal is a prize awarded to two, three, or four mathematicians not over 40 years of age at every four years by the International Mathematical Union. The Fields Medal is often viewed as the top honor a mathematician can receive. The Fields Medal is often described as the Nobel Prize of Mathematics for the prestige it carries. Since 1936 there have been 48 Field Medal awarded. Over three fourths of the world's greatest mathematicians (37) selected by the International Mathematical Union have lived in Princeton, N.J. having been affiliated with Princeton University, The Institute for Advanced Study, or both institutions. The Institute for Advanced Study is about a mile from the Princeton campus. Four of the first five faculty members came from the Princeton University math department. Albert Einstein was the fifth. The Institute faculty originally had offices in the Princeton University math department building.<br><br>Professor emeritus Harold Kuhn *50 said, If you sat long enough in the Fine Hall (math building) common room you eventually would have tea with 98 percent of the world's great mathematicians.<br><br>", "<b>Username: JohnAdams12</b><br><br><a href=\"http://en.wikipedia.org/wiki/William_Lowell_Putnam_Mathematical_Competition\" rel=\"nofollow\">William Lowell Putnam Mathematical Competition - Wikipedia, the free encyclopedia</a><br><br>The following table lists teams that finished in the top five since 1990 (as of 2009[update] competition):<br><br>Top Five Team (s)<br>19 Harvard<br>14 MIT<br>13 Princeton<br>12 Duke<br>8 Waterloo<br>7 Caltech<br>6 Stanford<br>4 Toronto<br>3 Cornell, Washington U in StL<br>2 Chicago, UC Berkeley, Harvey Mudd, University of Michigan, Yale<br>1 Miami University<br><br>", "<b>Username: Pea</b><br><br>\"\"Also, how much financial aid does a typical Princeton student receive? I just got my dad's tax return and have yet to fill out the financial aid forms, but I hope I receive enough.\"\"<br><br>When is Princeton's deadline for applying for financial aid?<br><br>", "<b>Username: Derivate</b><br><br>I'm not sure. I hope I did not miss the deadline.<br><br>", "<b>Username: zeinX</b><br><br>There's a checklist of deadlines/things to do in the packet they sent with your acceptance letter. I don't have my folder on hand right now, but I'm fairly certain you must have your tax return in by the 15th of April, so I'd hurry up and fax it.<br><br>", "<b>Username: Pea</b><br><br>From a downloaded document from the Princeton website about their financial aid. The PFAA refers to the Princeton Financial Aid Application.<br>\"\"Deadlines<br>The PFAA will be available on the Web beginning November 30, 2009. We recommend submitting this form by January 15, 2010, but no later than February 1, 2010. Tips for Using the Princeton Financial Aid Application on the Web. The best way to complete your PFAA on the Web is for both you and a parent informationadjusted gross income, federal income tax, and wage and salary figures\"\"<br><br>From your first post it sounds like you have not yet filled out any financial aid forms. I hope that isn't the case.<br><br>If that is the case you have missed a deadline. Call the financial aid office immediately and tell them what you have done. Maybe there is still time.<br><br>", "<b>Username: Derivate</b><br><br>Uh oh. I didn't fill out the PFAA. If I fill it out by tonight, do you think they'll forgive me?<br><br>", "<b>Username: Derivate</b><br><br>Actually on the FAQ, if you fill out PFAA late, there are no penalties. I just submitted it.<br><br>I also have to submit the Noncustodial Parent form, but I have no contact with my mother, will that be a problem? I emailed the office explaining my circumstances.<br><br>Lastly, what else do I need to turn in. I guess the tax forms etc. Do I just fax it over? Should I write a note so they'll know the tax forms belong to my dad?<br><br>", "<b>Username: Pea</b><br><br>\"\"Actually on the FAQ, if you fill out PFAA late, there are no penalties. I just submitted it.\"\"<br><br>Oh good. I thought you might be OK since Princeton is need-blind and doesn't have a financial aid budget they have to stay within. About your other questions just contact the financial aid office and they'll be able to tell you what they want you to do.<br>\"\"Also, how much financial aid does a typical Princeton student receive?\"\"<br><br>There probably isn't a typical and it is need-based. I noticed that the Princeton website contained an on-line calculator for determining how much aid you could expect to receive. Those things are usually pretty accurate.<br>\"\"Are there any math majors from Princeton that can elaborate a bit more on how math is at Princeton?\"\"<br><br>Really? I'm shouldn't answer this because I'm not a math major at Princeton but the reputation of the math department at Princeton is that it is one of the best in the country.<br><br>", "<b>Username: Derivate</b><br><br>Ya, Cambridge will cost a lot more compared to Princeton. So the question becomes which school is better for Math?<br><br>I know at Cambridge, all I will be studying is Math (no general education reqs) and after 4 years I'll get a M.Maths degree instead of a Bachelor's.<br><br>But then I wonder if paying almost 40,000 a year will be worth that. I'm guessing Princeton will be considerably lower than that, so this is my dilemma.<br><br>", "<b>Username: Derivate</b><br><br>Got financial aid back from Princeton. Family contribution is 20,000.<br><br>", "<b>Username: ib612</b><br><br>Then obviously Princeton, better than cambridge and cheaper<br><br>", "<b>Username: Derivate</b><br><br>Really? I'm still leaning towards Cambridge.<br><br>Ughh. They're all good for Math!<br><br>", "<b>Username: pigs_at_sea</b><br><br>Go with Princieton and we can be math major buddies :D:D<br><br>", "<b>Username: Derivate</b><br><br>I talked it over with my college math instructor and he told me to \"roll an n-sided die, where n is the number of schools you've been accepted to\".<br><br>", "<b>Username: pigs_at_sea</b><br><br>gotta get me an 11 sided die (6 of those are ivies baby!)<br><br>", "<b>Username: Derivate</b><br><br>I don't think the Putnam is an accurate depiction of how good an institution's math program is.<br><br>", "<b>Username: FightTheTide11</b><br><br>Princeton has finished in the top 2 in Putnam in 6 of the last 8 years (note: Putnam is DEFINITELY not the best measure of a math department; the team score is the sum of three of the school's individual scores, and the team must be declared before the contest). Harvard typically pulls in more (IMO-caliber) talent than Princeton, and MIT is starting to as well, but Princeton definitely has a top-tier student body in the math department.<br><br>", "<b>Username: FermatABC</b><br><br>...Especially since more Princeton PhD's has won the Fields Medal, Wolf Prize, and are in the National Academy of Sciences for Math than any other university. These are THE top mathematics prizes in the field of math.<br><br>The Putnam Competition is simply an undergraduate math competition.<br><br>", "<b>Username: FutureENTSurgeon</b><br><br>Princeton for sure they will probably give you most money<br><br>", "<b>Username: Derivate</b><br><br>So Cambridge v Princeton v MIT.<br><br>", "<b>Username: christiansoldier</b><br><br>Einstein v. Newton: take your pick.<br><br>", "<b>Username: pigs_at_sea</b><br><br>Ooooo tough one<br><br>", "<b>Username: xrCalico23</b><br><br>MIT, because it's awesome. :D<br><br>", "<b>Username: Derivate</b><br><br>Hmm. I like the antique feel Cambridge has to offer. I mean, 800 years + Newton + G.H. Hardy and all the other famous English mathematicians >>> Einstein.<br><br>", "<b>Username: christiansoldier</b><br><br>To be honest, I'm in the Newton camp myself.<br><br>", "<b>Username: pigs_at_sea</b><br><br>ouchhh :(<br><br>", "<b>Username: christiansoldier</b><br><br>Don't worry; we get Feynman, Nash, Turing, Terence Tao, two Fed chairs, Fitzgerald, and Forbes. And, unlike Newton, these guys aren't ancient history.<br><br>Not to mention Dr. Manhattan, Carlton, Doogie Howser, and Charlie from Numbers. Fictional, but still awesome.<br><br>", "<b>Username: Silly Puddy</b><br><br>Speaking of fictional Princetonians: we also have Batman and Jack Donaghy.<br><br>", "<b>Username: khgaus</b><br><br>yes, nash! :) cambridge is very solid, and if you wanted to do maths and maths alone, that would be the better choice for an academic career...but if youre looking to branch off into investment banking/applied maths, tiger's program would support you much better. ive applied as a physics/applied maths major myself and am very excited to be getting access to one of the world's best phys/maths departments! i havent looked at uk undergrad, but a very close friend of mine is doing a math degree at cambridge (two time IMO silver medallist) and he seems to think the education is worth the money. i wonder how many IMO/IPhO calibre kids princeton scrapes in every year? i hear MIT has rejected a fair bit, with gold/silvers dangling from their specs - do they all leach off to caltech?<br><br>", "<b>Username: Grisam</b><br><br>Obv. you're going to get Princeton bias if you post this in the Princeton board.<br><br>I think it's fair to say that both are equal in terms of prestige. Cambridge certainly has a much richer history in mathematics, but both are equally recognized in the United States. Besides, Cambridge will get you a M. Math which is certainly more valuable than a Bachelor's degree. It's also worth mentioning that the Cambridge system is unique ([url=<url>http://****/aJQXVt]Cambridge</url> Mathematical Tripos - Wikipedia, the free encyclopedia[/url]) and I think it'll be a valuable experience.<br><br>In my opinion, go to Cambridge and get an M. Math.<br><br>", "<b>Username: corale05</b><br><br>Personally, I wouldn't be keen about doing all the general stuff that american universities (or at least the top ones) require and would be more interested in Cambridge.<br>However, for me, my problem is trying to choose between Oxford and Cambridge for where to apply next year!<br>But if you don't mind doing all the general stuff and it does work out cheaper, then maybe go with Princeton (although some of the Cambridge colleges are GORGEOUS and the Cambridge maths building apparently looks REALLY cool! Like something out of NASA or something.<br>And cambridge DOES give you the MMath...)<br>It is ultimately where you think you would fit in best, the type of people there, etc.<br><br>", "<b>Username: Grisam</b><br><br>^ The Centre for Mathematical Sciences:<br><br><url>http://upload.wikimedia.org/wikipedia/commons/f/fe/Centre_for_mathematical_sciences_cambridge_panorama.jpg</url><br><br>", "<b>Username: Derivate</b><br><br>@Grisam, I appreciate your advice. I am leaning a bit towards Cambridge, but I still need to get the required STEP scores.<br><br>One concern i have is undergraduate research. I know it's not as common over at Cambridge, but my thinking is that it would be hard for an undergrad to know enough mathematics to write a paper or do research in pure math.<br><br>", "<b>Username: corale05</b><br><br>I don't know about the research bit but I know they have a paid 10-week summer research thing for undergraduates.<br><br>And STEP scores are extremely important! Can't stress that enough. A friend of mine went to a cambridge maths open day on saturday and the admissions tutor said,<br>'Do I care about your personal statement? No!<br>Do I care about your A levels? (or whatever else) No!<br>Do I care about your STEP results? Yes!'<br>I guess that was an exaggeration but they want 1's in Step 2 and 3, I think...<br>So make sure that if you do choose Cambridge you are seriously prepared for the STEP papers!<br><br>", "<b>Username: Grisam</b><br><br>STEP scores are <b>very very very very very</b> important.<br><br>Out of curiosity, which college were you accepted in?<br><br>", "<b>Username: Derivate</b><br><br>Yah I realize that.<br><br>I got accepted to Magdalene College.<br><br>", "<b>Username: Grisam</b><br><br>Keep in mind that your college becomes your home during your years at Cambridge. If you like the smaller field of Magdalene (~300 students), then you may like Cambridge as a whole.<br><br>Did you go for an interview to Cambridge? That gives you a good feel for the school.<br><br>", "<b>Username: FermatABC</b><br><br>If you plan on working in the US, go with Princeton. It definitely has the better name recognition and opportunities for the US. Why would you ever choose Cambridge, unless if you're from England? That is just silly to me.<br><br>", "<b>Username: Derivate</b><br><br>I actually applied to Trinity. My application got pooled. During my interviews (I did fly over to England), I enjoyed Trinity, but did not visit Magdalene since I did not know I would be pooled and fished by Magdalene.<br><br>But even while I was there, most of the students had left since the term was over.<br><br>", "<b>Username: Momsters</b><br><br>Go to Cambridge. It's clear that Princeton is your #2 choice.<br><br>", "<b>Username: JohnAdams12</b><br><br>well, it seems that the OP chose Princeton:<br><br><url>http://talk.collegeconfidential.com/college-search-selection/920080-harvard-yale-princeton-stanford-mit-cross-admits-class-2014-a-3.html</url><br><br>", "<b>Username: SHawking</b><br><br>Good on him; its the much better choice in my opinion.<br><br>", "<b>Username: Grisam</b><br><br>I'd have picked Cambridge but...<br><br>to all men their own devices. ^_^<br><br>", "<b>Username: pigs_at_sea</b><br><br>wahooooo oooo<br><br>", "<b>Username: corale05</b><br><br>I might've picked Cambridge too... but tough choice.<br><br>", "<b>Username: Derivate</b><br><br>Well if I pass my STEP. I sent my SIR to Princeton in the event I fail my STEP.<br><br>", "<b>Username: corale05</b><br><br>Oh right! But if you do get 1,1 in STEP, will you go to Cambridge or Princeton?<br><br>", "<b>Username: Derivate</b><br><br>I'm leaning towards Cambridge, but it's all up in the air right now.<br><br>", "<b>Username: Derivate</b><br><br>Reviving this thread.<br><br>I still have time to decide, and I should be focusing more on meeting my STEP offers...<br><br>Cambridge also wanted me to get a 5 in AP Stats. Hopefully I did...<br><br>", "<b>Username: corale05</b><br><br>AP Stats as in Statistics? That's interesting. A friend of mine told me that universities were more interested in pure maths and mechanics...<br><br>", "<b>Username: Derivate</b><br><br>Yah, Cambridge is making me jump through some hoops. I'm sure as long as I get a 1,1 in STEP I and II, they won't freak out too much about AP Stats.<br><br>", "<b>Username: corale05</b><br><br>Oh right. Out of interest, did they tell you which STEP exams you have to do?<br><br>", "<b>Username: Derivate</b><br><br>Yah. I got lucky and they told me I and II.<br><br>Even though I did enough mathematics throughout high school to do II and III instead. I figured they gave me the benefit of the doubt and since they might be sure what I did and did not cover as I am an American and not an UK student, they just told me to do I and II.<br><br>", "<b>Username: corale05</b><br><br>Lucky you! I am not looking forward to doing STEP next year...<br><br>", "<b>Username: Derivate</b><br><br>I am not bumping this by writing a pointless post.<br><br>"]}