{"title": "caltech vs mit", "comments": ["<b>Username: mangopeachie</b><br><br>Wow. This certainly isn't a decision I ever thought I'd have to make in my entire life... I'm just a girl from the Middle of Nowhere, New Hampshire.<br><br>", "<b>Username: Wufei</b><br><br>I think you should goto MIT ;)<br><br>I think each has a different atmosphere. Caltech is very rigorous and heavy on theory, Stanford's very much about practical/industrial applications, and when I visited them, both said MIT was a blend of the two.<br><br>", "<b>Username: over30</b><br><br>If at all possible visit both schools before you make a decision. That should help you decide where you would feel most at home. Congratulations.<br><br>", "<b>Username: Spartan Pho3nix</b><br><br>What do you want to major in?<br><br>", "<b>Username: mootmom</b><br><br>What a great decision to have to make, congrats!<br><br>Is the decision for you mostly \"Boston or California\"? What are you interested in studying, and what are the dimensions of undergrad experience that you're most concerned about or questioning? I'll have more to say once I hear a little more about your interests and concerns.<br><br>", "<b>Username: shikari</b><br><br>I chose MIT and never looked back. MIT's great - it's bigger than CalTech and has fantastic people. It's in Boston as opposed to Pasadena, and is just surrounded by so much culture that I for one certainly love it. I'm on the debate team and hang out with people from other awesome New England colleges all the time - I've friends from Harvard, Yale, Brown, etc. I just don't think CalTech could provide that.<br><br>Then again, I'm sure CalTech has its own charm. Two of my friends go there; they love it. If you can't decide, I definitely agree with the suggestion to visit both, to see which one is right for you. When you get to schools of MIT and CalTech's caliber, the education you'll be receiving will be first-rate, no matter which you go to. It's all a matter of how much you love being there that's really important - and that really is a very important decision to make, too.<br><br>", "<b>Username: mit2007mit</b><br><br>Of course we'll be biased to MIT :D<br><br>Just check both out and get a feel for both campuses, but I must say... MIT rocks!! ;)<br><br>", "<b>Username: zoogies</b><br><br>And it's not so small! :) I think you definitely have more options open at MIT.<br><br>", "<b>Username: texas137</b><br><br>Congratulations! These are both fabulous schools, and you have a wonderful choice. Try to spend time at both (preferably outside of their admitted student week-ends when things are more typical). The right answer for you should become much clearer. The schools' sizes, campuses, surrounding communities, and weather are obvious differences. The schools' cultures and \"feel\" are also quite different. Here are some random thoughts after visiting both places several times with my son, and after hearing him discuss his visits. (caveat - the visits were short, and I'm not a student. Others may give you more informed impressions)<br><br>Caltech, perhaps because of its smaller size, seems more academically focused than MIT. If you are oriented towards research and already have a clear idea of your interests, Caltech might be better. Research and academic focus are available at MIT also, of course. But if you view college as a time to try lots of different things, MIT would give you a broader range of classes and activities to sample.<br><br>I don't honestly believe that students at either school are significantly more or less happy or stressed or overworked than at the other. But there seems to be more of a \"united in adversity\" culture at Caltech. Caltech students are more likely to say \"don't go here\", \"it's too hard\", etc. I think it's sort of a Marine mentality, like saying it's only for The Few, The Proud, and mere mortals shouldn't attempt it. MIT students are more likely to say that it's fun and they are having a blast, and to encourage prospective frehmen to attend.<br><br>I think the top students are similarly brilliant and hard-working at both schools. There is probably more of a difference in the bottom students. If someone who was not brilliant and hardworking found themselves at one of these schools and just wanted to squeak by, I think that would be much easier to do at MIT than at Caltech. If you got there and decided that you aren't really as passionate or talented as you thought you were in nuclear physics or complexity theory or whatever else you thought you were going to devote your life to, you would have more options at MIT. At Caltech, you might have to transfer out.<br><br>The MIT campus has more people on it per sq. inch, particularly when the weather is bad and everyone is inside. This increases the urban feel and sense of energy. Caltech has a gorgeous campus, with much more use of outdoor space and a greater feeling of serenity.<br><br>At Caltech, student social life seems centered on the houses which operate sort of like a cross btwn dorms and fraternities. There are not a lot of places outside the houses where students seem to congregate and you don't see a lot of students in common areas. Undergrad houses are close to the classroom buildings, which may encourage people to go back to their house if they have some time off btwn classes. At MIT, people are loyal to their dorms/halls, but also seem more likely to form groups based on interests. Some of the dorms are too far from the classroom buildings to reasonably go back to your room during breaks btwn classes, and there seem to be more people hanging out in public areas.<br><br>", "<b>Username: sakky</b><br><br>\"\"It's in Boston as opposed to Pasadena\"\"<br>\"\"Now I'm wondering... Boston or California\"\"<br><br>I've said it before, I'll say it again. MIT is NOT in Boston. MIT is in Cambridge. Cambridge is not Boston.<br><br>It is true that MIT is near Boston. But on the other hand, Caltech is near Los Angeles.<br><br>", "<b>Username: tech_fan</b><br><br>sakky, you are tiresome ;-)<br><br>Everyone knows, I am sure, what is meant here. Most people feel like MIT is in Boston, since Cambridge is more of a neighborhood in the city and less of its own separate town (visit and you'll see what I mean). LA is a completely different ballgame -- I'd almost go so far as to say there is no such thing as the city of Los Angeles, since it's such a huge area of diffuse urbanity with neighborhoods like Pasadena nestled throughout -- many of my profs, who have lived here forever, agree. People don't mean \"MIT is in Boston\" as a bad thing -- in fact, I think it's a very good thing. When I'm visiting my girlfriend, I love being able to hop on the T and be virtually anywhere in that great city in half an hour. It's not like people are putting down MIT for being, essentially, a part of the city of Boston. It is, in many ways, an excellent feature. Some people wouldn't give it up for all the orange trees and eternal summer in the world.<br><br>Go see both places. Is there a theme developing? ;-)<br><br>", "<b>Username: tech_fan</b><br><br>By the way, as a Caltech student who really likes MIT, it makes me happy to see so much good, informative, many-sided and even-keeled advice on both the Caltech and MIT versions of this thread. It's great that people aren't just blindly plugging their own schools but trying to help admits pick the best one in their situations.<br><br>: )<br><br>", "<b>Username: molliebatmit</b><br><br>Don't forget, also, that there are admits who would only be happy at Caltech and admits who would only be happy at MIT, but that many cross-admits would probably be perfectly happy in both places.<br><br>Best of luck to you in your decision! It's a great one to have to make. :)<br><br>", "<b>Username: kevtrice</b><br><br>I think Caltech is far from Los Angeles, but MIT is extremely close to Boston--people go into Boston all the time. In fact it might as well be considered in Boston.<br><br>I absolutely hate Boston's weather and California would be so nice, but I think Boston does actually provide you with more stuff to do.<br><br>MIT is kinda depressing because of the workload, and I think Caltech would be worse. It is smaller and there are less things to do (that you can walk to, at least).<br><br>Also, it probably depends on your major. MIT is known to be the best at engineering, and I hear Caltech is potentially the best at physics and science.<br><br>MIT is better known, which, I think plays into the choice.<br><br>", "<b>Username: tech_fan</b><br><br>I agree that the workload sometimes gets to you at both places, but at Caltech at least you almost always have a sunny, warm day with blue skies to enjoy after handing in a problem set, which I've found lifts the spirit. This is anecdotal, and I'm sure many people disagree, but a student visiting from MIT once said \"Gee, you guys seem so much less miserable. Maybe it's that there's no cold.\"<br><br>Neither MIT nor Caltech have that much random-person-on-the-street name recognition (weird, isn't it?). If you want that, go to Harvard or maybe Yale. MIT is probably better known in engineering circles, but the Caltech name probably has somewhat more impact in, say, theoretical physics and astronomy and hard-science chemistry. Certainly, among the people who matter for hiring you or whatnot, MIT and Caltech both come in with sterling reputations as the best math/science/engineering institutions in the country.<br><br>Oh, and good point that downtown Boston is closer to Cambridge than downtown LA is to Pasadena, making Pasadena a little more quiet and peaceful-feeling, and MIT more bustling and busy. Which one is better obviously depends completely on your priorities and tastes.<br><br>", "<b>Username: pebbles</b><br><br>I don't need good weather to be happy- I need good people :)<br><br>besides- most of the calendar winter is consumed by IAP good times. I've lived in New England for some 9 years now, it makes spring all the sweeter.<br><br>", "<b>Username: mangopeachie</b><br><br>Thank you for all of the input.<br><br>My current interest is in Physics, although I easily might lean towards some field of engineering, so that doesn't help me much. I honestly don't have a clear idea of what I want to do from only 2 years of high school Physics/Chemistry/Calculus and no outside research or anything.<br><br>The thing is, I can only logistically visit Caltech if I miraculously find a plane ticket from Boston to LA.<br><br>", "<b>Username: tech_fan</b><br><br>\"\"I honestly don't have a clear idea of what I want to do from only 2 years of high school Physics/Chemistry/Calculus and no outside research or anything.\"\"<br><br>That's great. I think that people who have decided for sure what they want to do at like 12 (me, for instance) are a little silly. It's far better to leave your options open until you can see everything \"for real\" at a great university.<br>\"\"The thing is, I can only logistically visit Caltech if I miraculously find a plane ticket from Boston to LA.\"\"<br><br>We'll see what we can do ;-) You'll be getting more mail as the year goes on.<br><br>", "<b>Username: zoogies</b><br><br>Well, real winter can start in October and end in March :) The worst about MA is the coooold. But since OP lives in NH, it can't be *that bad*, unless OP is one of those people who live in New England and make it their life goal to run away to some place much closer to the equator.<br><br>", "<b>Username: pebbles</b><br><br>notice I said \"calendar winter\" :P<br><br>but PLEEEASE, it didn't really get cold until maybe after Thanksgiving.<br><br>", "<b>Username: Mystic Merlin</b><br><br>Cambridge pretty much is Boston. A 5-minute walk across the bridge will bring you to the heart of the city.<br><br>", "<b>Username: molliebatmit</b><br><br>Haha, Mystic Merlin, how fast do <i>you</i> walk? :)<br><br>", "<b>Username: sakky</b><br><br>A 5 minute walk from MIT to the heart of Boston, eh? It takes about TEN minutes for the T to get from Kendall Square to Downtown Crossing, and that doesn't even include the time you spend sitting around waiting in Kendall for the T (generally another 5-10 minutes).<br><br>Furthermore, I wouldn't even say that the Downtown Crossing stop is near the true heart of the city. A stop like Government Center, State Street, or Aquarium/Financial District would probably be closer to the true heart of the city. But of course to get to those stops, you have to transfer lines, which is another 5-10 minutes.<br><br>", "<b>Username: tech_fan</b><br><br>Merlin flies!<br><br>", "<b>Username: me?</b><br><br>As far as I see, MIT is too near Boston for it to be considered 'seperate', even if it isn't 'legally' inside the city. I'm quite certain MIT is closer to the heart of Boston than a lot of Boston's suburbs. ;) I'm a bit biased in my view though, seeing as the closest a big city is to me is New Orleans(?) which is about 3 hours away, or Atlanta, which is about 6.<br><br>", "<b>Username: sakky</b><br><br>Hey, let's not discount the closeness of Caltech to Los Angeles. It's pretty close - only about a 15 minute drive. Furthermore, let's keep in mind that at Caltech, unlike at MIT, it's actually semi-reasonable to have a car. I would submit that Los Angeles is MORE accessible to Caltech'ers with a car than Boston is to MIT'ers without a car. Heck, I would submit that Los Angeles is more accessible with Caltech'ers with a car than Boston is to those few MIT'ers that have cars, mostly because it's a whole lot harder to find parking in Boston than in Los Angeles.<br><br>", "<b>Username: pebbles</b><br><br>don't be silly sakky- the disparity is obvious. If you're going to argue the distinction between ENTERING boston and finding DOWNTOWN boston (which the Park Street stop takes care of - 2 stops, I believe... max 3), then you'd have to do the same for LA. Factoring in the traffic in LA, I'm sure 15 min would far from take you downtown. The Caltech and MIT students both agree, what's there to argue?<br><br>", "<b>Username: GracieLegend</b><br><br>Furthermore, non-seniors at Caltech rarely visit Los Angeles for any length of time (unless they live in the area), whereas virtually everyone I know at MIT, freshmen through senior, regularly spends their free time in Boston.<br><br>", "<b>Username: sakky</b><br><br>I think there is a lot to argue simply because I am demonstrating that Caltech is not as 'remote' from a major city as seems to be implied in this thread. Whether Caltech'ers actually choose to go to LA is not the issue, the issue is that LA is right there. If you want it, it's there.<br><br>And no, I do not consider Park Street to be downtown Boston.<br><br>", "<b>Username: tech_fan</b><br><br>pebbles is right -- everyone who is currently attending one school or the other agrees that MIT is, for all practical purposes (i.e. how it actually affects people's lives) more a part of Boston than Pasadena is a part of \"the city of LA\". That's kind of a completely value-free perception that everyone seems to have settled on. Obviously it is a plus from the point of view of some people, and a plus for MIT from the point of view of some other people.<br><br>By the way, I can't imagine two cities more different than Boston and LA, so the point about who is closer to where is a bit moot. While downtown Boston holds most of the area's nightlife and attractions, Old Town Pasadena, the Santa Monica Third Street Promenade, and some parts of Hollywood are probably the three best spots to go in the LA area if you want to have a good time (downtown is mainly a business district). LA is culturally and geographically very different from Boston -- which city you enjoy will be a matter of taste.<br><br>But when you visit, it's not a bad idea to ask some students to take you to a place they go to hang out off campus (despite silly rules which discourage this) so you can get a feel for what the area is like.<br><br>", "<b>Username: zoogies</b><br><br>While we're on the subject of cities - correct me if I'm wrong, but Cambridge is much, much more urban (and uglier) than Pasadena? At least, it doesn't have palm trees.<br><br>What silly rules do you refer to?<br><br>", "<b>Username: tech_fan</b><br><br>Most people say Pasadena is very pretty, and we do have a lot of palm trees and very well tended lawns and mountains in the distance and such.<br><br>The MIT side of Cambridge is more industrial, but a short bus ride away one has the somewhat more picturesque Harvard Square. It always felt unfair to me that MIT got screwed out of the better real estate, in some respects. On the other hand, many MIT dorms face directly out onto the Charles, which is kind of cool.<br><br>In the past, admissions has \"discouraged\" students from taking prefrosh off campus, but that's kind of silly from my point of view -- the prefrosh I've talked to said that seeing the area really drew them to Caltech. I see no purpose in hiding a very strong selling point. Last year, admissions had students take prefrosh on tours of the nearby area, but I think a less formal night out with your host is a better idea. So basically, if you get in and come to prefrosh, ask to see Old Pas and the like -- you won't regret it.<br><br>: )<br><br>", "<b>Username: mootmom</b><br><br>On the flip side, my California son doesn't care for LA at all, so in terms of a nearby city, Boston won without a second thought. And y'know, call me weird, but I think MIT and its surrounding area has a real charm. It's not like Pasadena for sure, but I don't think it's ugly. It's just, as you say, more on the industrial side of things.<br><br>", "<b>Username: Spartan Pho3nix</b><br><br>Well. I was about to post exactly what you just said, mootmom, but I didn't. You did it for me.<br><br>Lemme fix it:<br><br>On the flip side, I, a california kid, don't care for LA at all, so in terms of a nearby city, Boston won without a second thought. And y'know, call me weird, but I think MIT and its surrounding area has a real charm. It's not like Pasadena for sure, but I don't think it's ugly. It's just, as you say, more on the industrial side of things.<br><br>", "<b>Username: Moose0884</b><br><br>I live in Airzona, and the last place I would want to go is where it's sunny all the time. So, this is one of the reasons why I would personally prefer MIT.<br><br>", "<b>Username: tech_fan</b><br><br>It's funny how there's a bit of crossover, hehe. Northeasterners like me see a certain, um, appeal in Socal, whereas there are a few paradise-dwellers who apparently think a blizzard is the best thing since sliced bread.<br><br>", "<b>Username: pebbles</b><br><br>I rather like the change of seasons. :)<br><br>signed,<br>Northeasterner.<br><br>", "<b>Username: bookworm</b><br><br>I hope everyone gets to experience both, as I have (having spent 12+ years @boston/cambridge) and now @ pasadena. Personally, I didn't get to see much of boston when an UG; in grad school and after, I finally got to explore the city.<br>I'd encourage MIT kids to apply for a SURF at caltech for a summer, and vice versa.<br>(I know a caltech student can do a SURF at MIT, but does MIT offer something similar?)<br><br>", "<b>Username: mycornerofparadise</b><br><br>MIT, because you can cross reg with Harvard (and talk to all of us on the Harvard forum!) and walk around with froofy hair and spout nonsense about classical philosophy. And wear suspenders. &lt;---My goal in life.<br><br>", "<b>Username: sakky</b><br><br>\"\"The MIT side of Cambridge is more industrial, but a short bus ride away one has the somewhat more picturesque Harvard Square. It always felt unfair to me that MIT got screwed out of the better real estate, in some respects.\"\"<br><br>Well, I would say that a lot of it is MIT's own fault. Schools have some power to affect the beauty or ugliness of their surroundings. However, MIT almost seems to \"like\" having an ugly campus. For those who don't know what I'm talking about, why not take a walk around the East side of campus near the medical center where you'll see all these ghetto-ish buildings with broken windows that haven't been replaced in years. The way I see it is, if MIT doesn't put an effort into making its own campus beautiful, you can't really expect the surrounding neighborhood to make itself beautiful.<br><br>Also I would point out that Cambridge used to be a thriving industrial city and because MIT was founded as a trade school, it was entirely logical to relocate MIT (in 1916) to near all the manufacturing plants and warehouses. Now, much of that manufacturing capacity is sitting as empty shells of building, much as a lot of the older Eastern manufacturing sites around the country are.<br><br>", "<b>Username: LSA</b><br><br>Hey, I happen to think Carleton Street has a sort of charm :-P<br><br>", "<b>Username: Neo99</b><br><br>Nobody talked about the important difference between Caltech's quarter system and MIT's semester system. I'm currently attending a university that uses the quarter system. What I could tell is that if you're not well prepared in high school, you would not probably survive at Caltech.<br><br>A quarter lasts only 2 months and a week. But during that short period, for each subject, you have to take 2 midterms and one final, along with a problem set every week (and lab, if any). So, the quarter system is all about reading books, sitting for exams and doing problem sets (and labs). (The worst case is that you might have to turn in a hard problem set and sit a midterm on the same day. Also, something like, take the midterm today and the final just one week after.) So, the system is suitable only for those who are already well prepared in high school. (And my friend from Indonesia told me that a gold medalist of Physics Olympic (also from Indonesia) who went to Caltech finally dropped out. So, you could guess how hard it is at Caltech to study sciences like Physics.)<br><br>Unlike Caltech, MIT uses, in addition to its 4-month semester system, pass/no record for its first semester and grade/no record for the second semester during the freshman year. (i.e, there is no such thing as failing a class during freshman.) So, I'm sure MIT students would already get used to the academic rigor at the start of their sophomore.<br><br>Just go to MIT. You can make any adjustments there, but not probably at Caltech.<br><br>", "<b>Username: si1verdrake</b><br><br>\"A quarter lasts only 2 months and a week. But during that short period, for each subject, you have to take 2 midterms and one final, along with a problem set every week (and lab, if any).\"<br><br>Um... 2 midterms? Not at Tech. And not all subjects have midterms. But yeah, there's generally a set every week, and final and midterm. It is intense.<br><br>\"Unlike Caltech, MIT uses, in addition to its 4-month semester system, pass/no record for its first semester and grade/no record for the second semester during the freshman year. (i.e, there is no such thing as failing a class during freshman.) So, I'm sure MIT students would already get used to the academic rigor at the start of their sophomore.\"<br><br>Caltech has pass/fail for the first two terms. And it's pretty hard to fail your freshman courses. So you do have a chance to adjust to the rigor.<br><br>However, it is true that Caltech is intense and fast-paced. So is MIT, I'd imagine. I'd say that it's a LITTLE easier for the less-prepared students to get by at MIT, as I understand their core requirements are a bit more flexible and the semester system would help.<br><br>", "<b>Username: JSuresh</b><br><br>yea i have the same decision to make.. caltech v. mit. im leaning towards mit because i think i want to minor in a humanities subject (philosophy especially) and mit offers much more in humanities than caltech<br><br>", "<b>Username: tech_fan</b><br><br>Well, regarding philosophy: MIT has more courses, but Caltech is listed on the Philosophical Gourmet report ( <url>http://www.philosophicalgourmet.com/</url> ) as one of the schools with a very strong faculty in philosophy despite not awarding a doctorate in that field. I know something about this because I am still very seriously considering a philosophy double major and the courses I have taken have been incredible. For one thing, everything at Caltech is done with such a rigorous streak that the philosophy papers undergraduates write -- with such an emphasis on mathematical, logical reasoning -- would impress many professional philosophers. I guess the bottom line is that Caltech students are so uniformly smart that everything is done at a very high level.<br><br>Also, the faculty is great. I wrote a paper criticizing a famous argument of Hume (about miracles) and my professor liked it so much that he decided to write it up for publication (with me as a coauthor) in a major philosophy journal. I don't think that would happen as much at MIT, where in the philosophical writing courses, TA's often grade the work. So, amusingly, even as far as breaking into \"real\" academic philosophy, Caltech is probably a bit stronger than MIT.<br><br>", "<b>Username: pebbles</b><br><br>\"\"I don't think that would happen as much at MIT, where in the philosophical writing courses, TA's often grade the work.\"\"<br><br>your musings on caltech are none of my business but unless by 'often', you mean in the 2 or 3 intro courses of over 50 people, that's not true.<br><br>", "<b>Username: tech_fan</b><br><br>pebbles -- I realize this, but:<br><br>First, as you know, those intro courses (by virtue of their size and popularity) account for the bulk of most students' contact with philosophy, as well as a large chunk of the department's total teaching load, measured in terms of students. Sure, it's \"only\" a few courses, but they're very important courses.<br><br>In particular, those intro courses can be the place where two-way contact with an experienced scholar can be most important. I wrote my paper on Hume in the equivalent of 24.00. At MIT, I probably would have gotten a pat on the back from the TA. At Caltech, I got a full-fledged intellectual debate with a world-renowned philosopher and a publication. I'm sure similar stories have happened at MIT in more advanced courses, but a year or even a semester in your intellectual prime is too valuable, in my view, to waste having your work judged by assistants.<br><br>Oh, and: I've taken quite a few philosophy courses after the equivalent of 24.00, and, sad to say -- no other publication-worthy diamonds in the rough. That's to be expected. It's not often that an undergraduate has a truly original idea in a field that's at least three millennia old. I happened to get lucky, and had my idea in my first philosophy course. I guess that illustrates the point that you shouldn't have TA's grade the intro course and say \"oh, that's just the intro course.\" As my example illustrates, you can already miss out on a lot that way.<br><br>", "<b>Username: tech_fan</b><br><br>Oh, I forgot: the philosophical dialectic -- the back-and-forth debate -- is probably the most crucial aspect of the discipline, and one that is very important to actually learning philosophy. Big lectures followed by discussion sections with TA's are, in my view, a highly suboptimal way to teach the subject, ESPECIALLY in the intro course. It should almost be backwards if you have to settle for a lecture/recitation split: anyone can read a prepared lecture pretty decently, but it takes a genius (or at least somebody <i>very</i> experienced) to direct a truly productive, interesting, and wide-ranging discussion.<br><br>Those discussions were the reason I fell in love with philosophy, and I don't think the experience would have been nearly as great with a TA who had 4 or 5, as opposed to the professorial 15 or 20, years worth of philosophical experience and inisight.<br><br>", "<b>Username: nspeds</b><br><br>\"\"Well, regarding philosophy: MIT has more courses, but Caltech is listed on the Philosophical Gourmet report ( <url>http://www.philosophicalgourmet.com/</url> ) as one of the schools with a very strong faculty in philosophy despite not awarding a doctorate in that field. I know something about this because I am still very seriously considering a philosophy double major and the courses I have taken have been incredible. For one thing, everything at Caltech is done with such a rigorous streak that the philosophy papers undergraduates write -- with such an emphasis on mathematical, logical reasoning -- would impress many professional philosophers. I guess the bottom line is that Caltech students are so uniformly smart that everything is done at a very high level.\"\"<br><br>MIT is still ranked higher than the preponderance of schools in the philosophicalgourmet. To be sure, they are the best in philosophy of language - which subsumes symbolic logic, modal logic, and mathematical logic - and analyic metaphysics. Though Caltech is good, I do not think it measures up to what MIT has to offer in philosophy.<br><br>\"\"Also, the faculty is great. I wrote a paper criticizing a famous argument of Hume (about miracles) and my professor liked it so much that he decided to write it up for publication (with me as a coauthor) in a major philosophy journal.\"\"<br><br>Not to belittle your accomplishment, but that can happen anywhere. I am publishing during the spring, though I will be the only author.<br><br>In which journal is your paper being published?<br>\"\"I don't think that would happen as much at MIT, where in the philosophical writing courses, TA's often grade the work.\"\"<br><br>First, TAs rarely grade in higher level courses. Second, whether or not TAs actually grade papers, nothing prevents them from recognizing merit or forwarding outstanding papers to the professor. My TAs have already done that on several occasions.<br>\"\"So, amusingly, even as far as breaking into \"real\" academic philosophy, Caltech is probably a bit stronger than MIT.\"\"<br><br>Not quite, MIT still offers more resources, from a better overal faculty to an outstanding Ph.D program. You might think the latter is useless as an undergrad, but, to be sure, undergraduates are allowed to enroll in most graduate level philosophy courses. Next semester, for instance, I will be in a graduate epistemology course, even though I am only a sophomore.<br><br>Graduate courses offer an even more personalized environment: around seven students, a meeting room environment, two or three books to read, one paper to write, and discussion. The discourse you desire is available to any earnest undergraduate, in my opinion, and no philosophy department ignores philosophical enthusiasm from neophytes.<br><br>In addition, MIT offers the following which I do not think Caltech matches:<br>- Outstanding Colloquia: <url>http://web.mit.edu/philos/www/colloq.html</url><br>- Outstanding Conferences and Lectures: <url>http://web.mit.edu/philos/www/conferences.html</url><br>- Outstanding Reading Groups: <url>http://web.mit.edu/philos/www/read_groups.html</url><br>- Do not forget Tea Time! <url>http://web.mit.edu/philos/www/teatime.html</url><br>...which is held in the same building as where the philosophy department is located: <url>http://web.mit.edu/buildings/statacenter/</url><br>- Courses that students can take at Harvard.<br><br>Combined with the resources that Harvard offers, which are unparalleled, MITs program requires much in order to be matched, and very few departments can do it, much less departments that do not have a Ph.D program.<br><br>", "<b>Username: pebbles</b><br><br>Um. the largest philosophy course happened to be one I was enrolled in for first semester (then I had to drop it to make room for 8.012 and blahblahblah I still plan on taking it next fall when it is offered again) - it was taught in lecture/recitation style and enrolled approximately 80 students. I wouldn't call that <i>a large chunk of the department's total teaching load, measured in terms of students</i> when a hundred plus different courses in philosophy are run yearly.<br><br>In terms of philosophy, I am not a bit insecure about MIT's offerings. I have friends who came here to study philosophy and philosophy alone (actually, same with music- but that's another post altogether); I will most likely be a philosophy major/minor/concentration; I've received nothing but the best recommendations from upperclassmen who have taken courses in that department (like... one actually overheard my indecision regarding one of the courses and bounded over midway through whatever she was doing to gush about it being the 'best class she'd taken at MIT so far'- and she's a math major); undergraduates of ALL levels are encouraged to take on UROPs (one-on-one research projects with a professor) in departments including philosophy- so, really, you're able to work on a level of intimacy not available through a classroom setting, even; the faculty is pretty amazing from what I hear; oh, and all that stuff above from nspeds's post.<br><br>But, really, what is a little bit of anecdotal heresay worth? Best way to figure things out is to get on both campuses and ask around, attend classes, talk to professors, whatever is necessary. Philosophy is actually fairly well-respected here. For a humanities course, that's gotta count for something ;)<br><br>Oh, and one more thing. I'm really a little put-off by the whole, look-down-your-nose-at-TA's thing you're doing, and its accompanying reek of arrogance:<br>\"\"but a year or even a semester in your intellectual prime is too valuable, in my view, to waste having your work judged by assistants.\"\"<br><br>Honestly, what is with this forum and TA's? Even without further addressing (and refuting) your claims that TA's grade students' papers, what the heck is so wrong with receiving instruction from those who are much more educated than you are? There is a <i>very</i> scant number of courses that allow upperclassmen and grad students to become TA's- and those are the most basic math/science courses (calc 1, intro to solid state chem, etc). Hell, even 8.012 (freshman physics) TA's were all full MIT professors. One of them will be the lecturer for 8.012 next year; one of them is the lecturer for 8.02 next semester; another one won the Nobel Prize... and on days where my Nobel Prize-winning TA was absent to give lectures at oh... Stanford or Caltech or something, the substitute TA turned out to be the main author of our (actually quite famous) textbook.<br><br>So, no, I really don't feel like my intellectual prime was mutilated beyond repair per my most unfortunate association with these \"TA's\". =\\<br><br>", "<b>Username: nspeds</b><br><br>\"\"Philosophy is actually fairly well-respected here.\"\"<br><br>Of course! Have you seen MIT's graduate placement?<br>\"\"Honestly, what is with this forum and TA's?\"\"<br><br>I was going to ask the exact same question in my previous poost.<br><br>", "<b>Username: tech_fan</b><br><br>nspeds -- we're submitting to Analysis, and my co-author is fairly confident of acceptance based on interest from editors in the idea.<br><br>more soon.<br><br>", "<b>Username: pebbles</b><br><br>ooohh can't wait :D<br><br>", "<b>Username: molliebatmit</b><br><br>Hey, I visited Caltech yesterday! We're here in southern California for the Rose Parade (my HS band -- containing my little brother -- is marching), and my family was driving around Pasadena and ran into Caltech. It was very pretty!<br><br>", "<b>Username: nspeds</b><br><br>\"\"nspeds -- we're submitting to Analysis, and my co-author is fairly confident of acceptance based on interest from editors in the idea.\"\"<br><br>I look forward to reading it.<br><br>", "<b>Username: nspeds</b><br><br>\"\"interest from editors in the idea.\"\"<br><br>Piqued interest is always a good indicator; my professor is one of the editors for one of the best philosophical journals, and he always complains about receiving articles on the same book published over 25 years ago!<br><br>I hope you idea was not that Hume's entire criticism of induction is one large post-hoc fallacy, because that was my idea!<br><br>", "<b>Username: tech_fan</b><br><br>Okay, now onto a more substantive response.<br><br>You're missing the point, guys. To my knowledge, most TA's at MIT in 24.00 are graduate students in philosophy. I'd welcome data to refute this, but everyone I know who has taken 24.00 has had the recitation led by a grad student, and the grading done by same. Granted, often TA's (in physics, for example) are full professors, etc. At Caltech, too, David Politzer, who won the Nobel last year, helps people wire circuits. That's not what I was talking about, and far be it from me to say a negative word about TA's who are professors. That's great. But, until you show me otherwise, I'm pretty sure that TA's in 24.00 are mostly grad studens in philosophy. So most of pebbles' response on this point is, I think, completely irrelevant. My beef is with grad students teaching 24.00.<br><br>And there <i>is</i> undoubtedly a problem with TA's and discussion leaders in a sweepingly broad course like 24.00 being grad students. Their limited knowledge (limited in view of how huge philosophy is) sometimes causes them to offer a quite a stilted view of the landscape. I'm glad nspeds is here so that he can appreciate this point (but I'm pretty sure you don't need to be a philosopher to do so) -- a friend of mine had a TA say that he thought ethical relativism was \"obvious nonsense\" and not worth much discussion. That's something that a broadly trained philosophy professor would almost certainly <i>not</i> say. The problem was that this grad student was speaking outside his specialty (which was, I believe, logic) and showed a remarkable lack of appreciation for the complexity of a huge and far from settled debate in another subfield. Or, in any case, he certainly robbed the students of an adequate exposure to at least a small part of that complexity.<br><br>So am I misguided in my \"whole, look-down-your-nose-at-TA's thing\"? On this topic, frankly, I don't think so. The fact that it's <i>easy</i> for an MIT undergraduate to know more about a big, important, contentious philosophical area than his TA (at least as far as that TA lets on in his discussion of that field) shows that something is wrong.<br><br>So, I'll stand by my claim that Caltech's approach to introductory courses is better than MIT's. nsped's summary of MIT's virtues is comprehensive, but what's all that worth if the introduction is subpar and it doesn't intrigue students who didn't even know that philosophy was their calling?<br><br>Oh, and pebbles. Your remarks about \"reek of arrogance\" ring a little hollow in view of the generally snarky and smug tenor of your own posts.<br><br>", "<b>Username: beprepn</b><br><br>Pick the cheaper including transportation.<br><br>Or, ask about the dormitory differences.<br><br>", "<b>Username: nspeds</b><br><br>\"\"That's something that a broadly trained philosophy professor would almost certainly not say.\"\"<br><br>HA! Then you most certainly have not read the works of Bernard Williams!<br><br>I will deliver a more substantive post later.<br><br>", "<b>Username: tech_fan</b><br><br>nspeds -- don't mistake my claim for the suggestion that no philosopher <i>thinks</i> that ethical relativism is nonsense. I've read enough Peter Singer, among others, to know otherwise. But Singer, when he teaches broad ethics courses at Princeton, takes care to emphasize the different approaches of people like J. L. Mackie. There's a difference between not buying a certain philosophical position and not thinking it's not even worth saying much about. Few professors that I'd consider worthy of respect would completely neglect a flourishing school of thought in their own discipline when discussing a relevant topic.<br><br>The person whose 24.00 experience I'm recounting says that I should point out that she found her graduate student TA, despite his comparitive lack of subtlety regarding ethics, to be an extermely interesting and engaging discussion leader. So grad student TA's often have upsides. But I'd still prefer profs for myself : )<br><br>", "<b>Username: nspeds</b><br><br>I promised a more substantive response, but I am afraid I will not live up to that self-imposed demand. Ben, your posts make sense, and to engage in a protracted battle over nuances is clearly otiose. So, in other words, I agree with what you are generally arguing, but disagree with a few details.<br><br>Regarding ethics, I abhor Singer. Call me a Nozickan or Korsgaardian anyday over a Singer.<br><br>", "<b>Username: tech_fan</b><br><br>Pleasure chatting with you, nspeds : )<br><br>", "<b>Username: tech_fan</b><br><br>mollie -- that makes me happy. Good to hear you're in the neighborhood.<br><br>", "<b>Username: pebbles</b><br><br>\"\"Oh, and pebbles. Your remarks about \"reek of arrogance\" ring a little hollow in view of the generally snarky and smug tenor of your own posts.\"\"<br><br>Oh well, then ring hollow it must, my noble friend. I've done all I needed/set out to do, which was to stand up briefly for a department and school I love- and you gotta do that ONCE every ten times it is attacked- and since I won't be NEARLY so inclined to gently cradle MIT in my lap and shield it from the daggers of BIG BAD CALTECH MAN during the spring term while the institute is swallowing me whole, figure I'd do it now. But yeah, I frankly can't think of anything duller than pursuing a never-ending argument over the thousandth digit. So I call it quits. I avoided debate team for a reason.<br><br>Good tidings to you on this brand new year. It's doing the whole 'oh yeah we're New England' thing outside again and decided to snow. So we lit a fire and it was nice. By the way egg-nog is abysmal. Who can stand that stuff?<br><br>", "<b>Username: nephilim</b><br><br>I took 24.02 (ethics, bascially) this past semester and was not very pleased. I did learn a lot, but I don't feel that the ideas were presented very well.<br><br>We never really defined ethics. As the course progressed, I eventually figured out what definition we were supposed to be using. In 24.02, ethics was the study of secular theories of right and wrong that best align with our \"moral intution.\" Now, I completely disagree with that definition of ethics, but we weren't given any opportunity to discuss it. Also, I think the \"secular\" qualification was ridiculous. We weren't even allowed to talk about religion in the class, and that, in my opinion, was absurd. To study philosophy without studying religion is to study calculus without using trig. You could do it, but you'd have a gaping hole in your understanding of the subject.<br><br>I just thought the course was very narrow in both it's scope and it's grading. I didn't do poorly, but the comments on my papers really just seemed like the opinions of my TA.<br><br>", "<b>Username: tech_fan</b><br><br>If you expect a particularly respectful treatment of religion, you are likely to be extremely disappointed in most courses dealing with Western philosophy. However, it is a little odd to have a course about ethics without mentioning the numerous theories that are, in some respects, motivated or influenced by religion. (Although note that even deeply religious thinkers have said that ethics needs a \"secular\" footing: if we define \"right\" or \"good\" to mean just \"what God approves of\", then God's moral dictates aren't independently virtuous. Plus, what would \"God is good\" even mean? That God approves of Himself?)<br><br>", "<b>Username: JSuresh</b><br><br>so what i got out of that debate was that Caltech has stronger introductory philosophy courses while MIT has a stronger upper-level philosophy program. is that agreeable to both sides?<br><br>which, if thats the case, means im still leaning towards MIT :/<br>\"\"Plus, what would \"God is good\" even mean? That God approves of Himself?\"\"<br>that made me smile btw :)<br><br>", "<b>Username: tech_fan</b><br><br>Yes. While I think the closer student-faculty contact, especially at the introductory levels, is something that Caltech has the edge on, MIT does certainly have more offerings at the upper levels of philosophy. So if a major or minor in philosophy is a serious possibility for you, then choosing MIT would probably be wise. But do, if you have the chance, visit both schools and see how you feel at both. Seeing how well you fit with the place is a very important part of the choice. And then do what's right for you. Good luck.<br><br>", "<b>Username: nspeds</b><br><br>\"\"I eventually figured out what definition we were supposed to be using. In 24.02, ethics was the study of secular theories of right and wrong that best align with our \"moral intution.\"\"\"<br><br>There is no one-line definition to ethics, especially when some books are solely dedicated to defining it.<br>\"\"To study philosophy without studying religion is to study calculus without using trig.\"\"<br><br>Then you should be looking for a course that covers the likes of Aquinas. From Kant onward, ethical theories will have nothing to do with God, so you are not missing much from the 'secular instruction.' Additionally, 'religion' is not that important to philosophy, especially of the analytic sort. If you are looking for discussions on such, I recommend taking a course on the philosophy of religion.<br>\"\"so what i got out of that debate was that Caltech has stronger introductory philosophy courses while MIT has a stronger upper-level philosophy program. is that agreeable to both sides?\"\"<br><br>Not only should one regard the upper-level course offerings, but the resources that I listed in my previous posts on this thread adumbrate the strength of the department.<br><br>", "<b>Username: tech_fan</b><br><br>\"\"my previous posts on this thread adumbrate the strength of the department\"\"<br>...in addition to offering a paradigmatic adumbration of the recondite grandiloquence that recrementitious rehearsal for the GRE (substitute appropriate equivalent) can yield.<br><br>Now (perhaps) you may have to go look up some words in return for what that post did to everyone -- but I am not counting on it ;-)<br><br>", "<b>Username: xXPhoenixFireXx</b><br><br>paradigmatic-Of or relating to the set of substitutional or oppositional relationships a linguistic unit has with other units<br>adumbration-To give a sketchy outline of<br>recondite-Not easily understood<br>grandiloquence-Pompous or bombastic speech or expression<br>recrementitious-Of or pertaining to recrement (waste matter)<br>rehearsal-The act of practicing in preparation for a public performance<br>GRE-test of pain<br><br>Well I knew more than half of those offhand so do I get my cupcake now?<br><br>", "<b>Username: nspeds</b><br><br>\"\"...in addition to offering a paradigmatic adumbration of the recondite grandiloquence that recrementitious rehearsal for the GRE (substitute appropriate equivalent) can yield.\"\"<br><br>Eh, I have read better.<br>\"\"GRE-test of pain\"\"<br><br>The GRE is not that much more difficult than the SAT. If you are graduating from a school like MIT, you should have no problem at excelling.<br>\"\"...in addition to offering a paradigmatic adumbration of the recondite grandiloquence that recrementitious rehearsal for the GRE (substitute appropriate equivalent) can yield.\"\"<br><br>That was uncalled for, especially since the only difficult word was 'adumbrate.' Additionally, no, I did not need to consult the dictionary, so retribution for my recondite posts will need to performed in some other manner, preferably in a form that avoids my lampooning you again.<br><br>", "<b>Username: tech_fan</b><br><br>With respect, I do not feel particularly lampooned :-P<br><br>", "<b>Username: qwerty693</b><br><br>MIT sells shirts that say:<br><br>CALTECH: Cause not everyone can go to MIT.<br><br>There's the answer.<br><br>", "<b>Username: Moose0884</b><br><br><url>http://www.princetonreview.com/college/research/profiles/rankings.asp?listing=1023684&amp;ltid=1&amp;intbucketid=</url><br><br>Any reason why it says on princetonreview.com that Caltech's professors are horrible?<br><br>", "<b>Username: ramsfan</b><br><br>@qwerty693:<br>Actually, Caltech started that at MIT Prefrosh last year. The shirt read MIT: Cause not everyone can go to Caltech.<br><br>", "<b>Username: Flippy</b><br><br>^That's ironic since MIT is renown to be harder to get into.<br><br>", "<b>Username: tech_fan</b><br><br>\"Renown\" (not a word) by whom? That is nonsense. It is hard to compare head to head without working in both admissions offices (and I would venture to say that you probably haven't even worked in one) but Caltech has higher average SAT scores and better high school grades in the pool of admitted students (and I am almost positive the same is true of the pool of applicants). There are quite a few students that Caltech would never take and MIT gladly does (and, of course, vice versa). The reasons for all this are complicated, but I don't like wrong statements by uninformed people without any data to back them up.<br><br>", "<b>Username: flierdeke</b><br><br>The Caltech shirt makes more sense. MIT is big enough that if they really wanted to, they could probably accept everyone who got into Caltech. And anyway, what can MIT put on the back of the shirt? Palm trees don't make much sense...<br><br>", "<b>Username: pebbles</b><br><br>The original shirt sold at the coop says:<br><br>FRONT: Harvard<br>BACK: 'Cause not everyone can get into MIT.<br><br>The caltech hackers played off of that.<br><br>But just a sidenote. Because of their low-ish yield, Caltech has to accept a lot more applicants than is assumed here to reach their actual target class. Almost 3x as many. So, when it comes down to it, MIT really doesn't admit THAT many more students than does Caltech.<br><br>", "<b>Username: tech_fan</b><br><br>Students accepted by Caltech last year: 550.<br>Studens accepted by MIT last year: 1665.<br><br>To say that it isn't THAT many more in sheer numbers is a bit ... erm ...?<br><br>", "<b>Username: Slak</b><br><br>maybe hes speaking i terms of percentages. But still...<br><br>", "<b>Username: zoogies</b><br><br>pebbles is a she (I believe)...and I think her point was Caltech must take a larger percentage of applicants in because a lower percentage of them enroll. I only have 2004 stats, and they go:<br><br>Caltech: Applicants accepted - 21% of 2,615<br>Accepted who enrolled - 45%<br><br>MIT: Applicants accepted: 16% of 10,664<br>Accepted applicants who enrolled - 57%<br><br>So the size difference of the accepted applicants is not as drastic as the size difference of the enrolled classes. But anyway.<br><br>As Ben said, you can hardly quantify either school as \"easier to get into\" or \"harder to get into.\" The t-shirts are jokes, of course (though they're admittedly pretty funny, at least, the Harvard one is) and honestly, I think it's almost a crime that both MIT and Caltech have matriculation rates that low. How can so many people who get into either school turn them down!? It's beyond me :)<br><br>A Caltech student who recently commented on Matt's blog had to make the MIT v Caltech choice, and as he said, put in that position, there really is no wrong choice. I'm sure we all wish we'll get to be put in that decision come March.<br>\"\"Ben Golub wrote: \"Renown\" (not a word) by whom?\"\"<br><br>Hey Ben, renown is a word! I think you mean wrong form (should be 'renowned') - what happened to those recrementitious rehearsals?<br><br>", "<b>Username: tech_fan</b><br><br>You've got me. I meant, of course, that it was ungrammatical, but I will admit to speaking quite imprecisely.<br><br>", "<b>Username: Flippy</b><br><br>Since you wanted a source, here's a credible one:<br><br><url>http://www.princetonreview.com/college/research/rankings/rankingDetails.asp?CategoryID=1&amp;TopicID=10</url><br><br>", "<b>Username: tech_fan</b><br><br>Yes, since PR is such a reputable and august source........<br><br>*rolls around laughing*<br><br>", "<b>Username: Flippy</b><br><br><url>http://www.graduateshotline.com/ranks/index.html</url><br><br><url>http://www.usnews.com/usnews/edu/grad/rankings/eng/brief/engrank_brief.php</url><br><br>A few minutes of Google will find more...<br><br><br>And also explain why Caltech's EA acceptance rate is like 40%.<br><br>* Number of early action applications received: 468<br>* Number admitted under early action plan: 169<br>* Number enrolled under early action plan: 67<br><br>", "<b>Username: tech_fan</b><br><br>Because the people who apply to Caltech early are extremely good. Trust me, I've read the applications. The self-selection at that level is incredible -- virtualy nobody mediocre applies. (It's certainly not because we <i>had</i> to take that many. We could have taken 0 in the early round and easily filled the class with incredible students.)<br><br>Nevertheless, our EA admit percentage was much lower this year (around 20%), partly because we didn't want to fill such a large portion of our class EA no matter how good the applicants were.<br><br>Anyway, without knowing anything about the strength of the pool, it's specious to draw any conclusions based on a single percentage.<br><br>", "<b>Username: ramsfan</b><br><br>What's your point in all these posts, Flippy? It only shows that Caltech is well into the top echelon of engineering colleges. A few spots in the rankings really do not mean that much. If you want proof, Caltech and MIT are a \"lowly\" 7th under \"national universities\" in the incredibly reliable USNews report. Maybe going to Harvard and Princeton (#1) will get you a better education. Also, the Caltech pool is very self-selective, hence the higher admit rates. Caltech has the highest average SAT score in the nation, so to say its easier to get in is a little absurd.<br><br>", "<b>Username: ramsfan</b><br><br>I see I've been beaten to the punch. :-)<br><br>", "<b>Username: tech_fan</b><br><br>Thanks for the help, ramsfan : )<br><br>", "<b>Username: GracieLegend</b><br><br>See, if the exact same media rankings were used year after year, people would be bored. So, what they do is take the top X number of schools and assign random rankings for \"Toughest to Get Into\", \"Overall Best\", etc. It adds a pleasant variety and keeps parents and students on their toes. An added benefit is that it can be used as ammunition for message board arguments.<br><br>If you take any two top schools and look at their relative rankings for the past 20 years, one will be higher than the other approximately 50% of the time.<br><br>", "<b>Username: tech_fan</b><br><br>With the exception of HYP, which are pretty consistently rated top three.<br><br>", "<b>Username: JSuresh</b><br><br>after a certain point ratings lose meaning and become popularity contests<br><br>", "<b>Username: Olo</b><br><br>If you want to compare a Caltech education to an MIT education, you're splitting hairs. There are very few departments where one's is really THAT much better than the other's (Caltech's geology, MIT's aero/astro), and even then, it's negligible for an undergraduate education.<br><br>Pick whichever one feels right to you. :)<br><br>", "<b>Username: JSuresh</b><br><br>\"\"If you want to compare a Caltech education to an MIT education, you're splitting hairs.\"\"<br><br>sure if you're strictly speaking of education in a math/science sense. as ive said earlier on this post, mit seems to win out in the humanities and business (also has access to harvard)<br><br>", "<b>Username: tech_fan</b><br><br>Yes. Caltech is aimed at math/science types who want to focus early. That approach has some drawbacks, but also huge advantages.<br><br>", "<b>Username: bookworm</b><br><br>Many students will end up with the best of all worlds--UG for one, and Grad for the other (including Stanford, UCB, Princeton, etc., for certain fields). I think if one wants a strong math school as well as healthy dose of humanties, I'd advise P or U of Chicago.<br>I think most of you would be content and enriched at any of the above colleges.<br><br>", "<b>Username: pebbles</b><br><br>I was basing my post on the 67% MIT yield last year vs the 37% Caltech yield. (the stats are from Princeton Review, not sure how reliable they are -the MIT one is correct I know) I was just trying to offer another point of consideration. I was actually quite appalled the caltech yield was reported to be so low- correct it if it is wrong.<br><br>", "<b>Username: nephilim</b><br><br>Ok, this is jumping back a bit.<br><br>What's wrong with God dictating morality? True, then He'd only be \"good\" for agreeing with Himself, but why is that a problem? If God is omnipotent, then He can't be subject to any external laws, so morality must be defined by Him. I don't see anything wrong with this idea.<br><br>Also, if there is no God or morality is independent of Him, then \"good\" can't be truly intrinsic to the universe. It can only be defined by human minds, which lessens its significance and influence.<br><br>", "<b>Username: nspeds</b><br><br>\"\"True, then He'd only be \"good\" for agreeing with Himself, but why is that a problem?\"\"<br><br>I do not think that was a cogent objection, so you can ignore it.<br>\"\"If God is omnipotent, then He can't be subject to any external laws, so morality must be defined by Him. I don't see anything wrong with this idea.\"\"<br><br>Well, there are a number of reasons. If you want to build morals from God, your system will presuppose the existence of God, which is tendentious. In addition, it removes the unconditionality of morals: if I fulfill an obligation to another because of God, am I fulfilling it because I recognize the obligation in itself, or merely because I am doing it to please God?<br>\"\"if there is no God or morality is independent of Him, then \"good\" can't be truly intrinsic to the universe.\"\"<br><br>I do not see why you are ascribing 'good' to universe in the first place: there also exists pointless evil in the universe, whether God exists or not. Recognizing its existence will not change that.<br><br>", "<b>Username: abelian</b><br><br>Hey, I have a question! I am not an advocate for philosophy by any means, neither am I fully content with philosophical arguments, but out of curiosity, what good is philosophy to mathematics? Isn't mathematics prescribed and additional results are then derived? I mean, hearing a philosophical argument about the rationality of square root of 2 is pretty irritating and I've since been associating philosophy to nonsensical mathematical results, but has philosophy ever done any good to mathematics?<br><br>Haha, I hope I'm making sense here.<br><br>", "<b>Username: tech_fan</b><br><br>\"\"True, then He'd only be \"good\" for agreeing with Himself, but why is that a problem?\"\"<br>Because then His goodness is not <i>a priori</i> but arbitrary. This arbitrariness poses a problem for some people.<br>\"\"Also, if there is no God or morality is independent of Him, then \"good\" can't be truly intrinsic to the universe.\"\"<br>First of all, that doesn't follow. Planck's constant need not be related to God to be \"intrinsic to the universe\", at least not without further explanation. Why can't \"having universal moral laws\" be a property of the universe in the same way that primeness is a property of seven, without further recourse to deities? You might be right about your assertion, but you've certainly given nobody any reason to think so.<br>\"\"[If there is no God, then morality] can only be defined by human minds, which lessens its significance and influence.\"\"<br>I've never been a fan of the (specious and unsound) \"If there were no God, life would be less meaningful than if there were one\" argument. So what? If I had a million dollars, my life would be fuller of freedom and some kinds of happiness. Just that I prefer this state of affairs to the state of affairs in which I don't have a million dollars does not soundly justify the assumption that I have a million dollars. My desires don't pertain to the way reality should be. The argument for God or for the study of God via wishful thinking has always struck me as weak.<br><br>", "<b>Username: tech_fan</b><br><br>\"\"what good is philosophy to mathematics?\"\"<br><br>Briefly: it's good for studying exactly how many axioms suffice for deriving the mathematics we want, as well as how good we can ever hope mathematics to be (would mathematical theorems still work on another planet? how much of mathematics is an accident of the structure of our minds?) Most earth-shaking philosophy of mathematics is still done by mathematicians (see Godel's incompleteness theorems in Wikipedia). Bertrand Russell's \"Introduction to Mathematical Philosophy\" is a very good book that answers your question more fully.<br><br>", "<b>Username: abelian</b><br><br>Appreciate your quick response, Ben Golub! :)<br><br>", "<b>Username: nspeds</b><br><br>\"\"Because then His goodness is not a priori but arbitrary. This arbitrariness poses a problem for some people.\"\"<br><br>Arbitrariness and <i>a priori</i> are not mutually exclusive.<br>\"\"If I had a million dollars, my life would be fuller of freedom and some kinds of happiness.\"\"<br><br>I know this sounds obvious, but you cannot buy metaphysical freedom.<br>\"\"Bertrand Russell's \"Introduction to Mathematical Philosophy\" is a very good book that answers your question more fully.\"\"<br><br>...or the seminal 'Principia Mathematica' co-authored Bertrand Russell and A.N. Whitehead.<br>\"\"Most earth-shaking philosophy of mathematics is still done by mathematicians (see Godel's incompleteness theorems in Wikipedia).\"\"<br><br>Technically, Gdel ruined the project of attempting to derive mathematical axioms from the principles of logic, which is why is famous proof was published in a text callled \"On Formally Undecidable Propositions of Principia Mathematica and Related Systems.\"<br><br>If one wishes to peruse that text, then a good 'guide book' is \"Gdel's Proof,\" written by Ernest Nagel.<br><br>As one of my professors is fond of noting, it is such a pity that Gdel's pamphlet dismantled what was an ambitious attempt to ground mathematics on logic. Given the wrath of Russell, I wonder how he reacted.<br><br>Edit: Also, wikipedia is often inaccurate, try the following links instead:<br><url>http://plato.stanford.edu/entries/computability/</url><br><url>http://plato.stanford.edu/entries/russell/</url><br><url>http://plato.stanford.edu/entries/principia-mathematica/</url><br><br>If you plan on attending MIT/Harvard, here are some interesting courses related to the subject:<br><url>http://www.courses.fas.harvard.edu/~math141/</url><br><url>http://my.harvard.edu/icb/icb.do?course=fas-math143</url><br><br>", "<b>Username: tech_fan</b><br><br>\"\"Technically, Gdel ruined the project of attempting to derive mathematical axioms from the principles of logic\"\"<br>I gather this isn't supposed to be any kind of correction, since that was precisely what was so earth-shattering -- the realization that axiomatization had a fundamental shortcoming.<br><br>", "<b>Username: JSuresh</b><br><br>\"\"<br><blockquote class=\"Quote UserQuote\"><br><div class=\"QuoteText\">Also, if there is no God or morality is independent of Him, then \"good\" can't be truly intrinsic to the universe.\"\"<br><br>First of all, that doesn't follow. Planck's constant need not be related to God to be \"intrinsic to the universe\", at least not without further explanation. Why can't \"having universal moral laws\" be a property of the universe in the same way that primeness is a property of seven, without further recourse to deities? You might be right about your assertion, but you've certainly given nobody any reason to think so.</div><br></blockquote><br><br>But if God created and sustains the Universe, isnt Plank's constant, by virtue of being intrinsic to the universe, dependent on God? Likewise the primeness of seven, another construct of God, would be dependent on God.<br><br>", "<b>Username: tech_fan</b><br><br>Yes, but the point is <i>it doesn't have to be so</i>. There are multiple ways for Planck's constant or having moral laws to be intrinsic properties of the universe, and everything being put there by God is only one such way. Nephilim asserted that morality can only be inherent in the universe in one way -- God put it there. I was saying that isn't so.<br><br>", "<b>Username: JSuresh</b><br><br>ok sorry misunderstood. what id say to that is that planck's constant or the primeness of the number seven are physical constants that can be verified externally. without god, however, moral laws can only be validated by individual opinion; without an omniscient creator (not that i necessarily believe in one) morality cannot be intrinsic.<br><br>", "<b>Username: tech_fan</b><br><br>Well, the primeness of the number seven has nothing to do with the physical world, but that's another story.<br><br>The main thrust of your post is roughly similar to J. L. Mackie's \"argument from queerness\" against the existence of moral absolutes. It's hard to imagine what a moral absolute would <i>be</i> if not someone's opinion. But just because it's hard to think of, philosophers do not necessarily admit it doesn't exist. Normativity could be something that just is -- universal laws about morality that permeate the universe, deities or not.<br><br>", "<b>Username: JSuresh</b><br><br>yes moral laws independent of man and god \"could\" exist, but just as you accuse the opposition of not proving exactly why, you have yet to say why or how they could exist. if all you're saying is that they could exist i wont argue but its still a very weak statement to make (anything \"could\" exist)<br><br>", "<b>Username: nspeds</b><br><br>\"\"But just because it's hard to think of, philosophers do not necessarily admit it doesn't exist. Normativity could be something that just is -- universal laws about morality that permeate the universe, deities or not.\"\"<br><br>You and JSuresh are touching on an issue known as 'moral realism.'<br><br>I wish had my <i>Sources of Normativity</i> (Christine Korsgaard) with me, because it contains the most coherent refutation of both realism, and Mackie's argument, while providing a strong neo-Kantian framework for her argument about the sources of normativity.<br><br>If I am not mistaken, though, the problem with moral realism is that it is question-begging, and any argument that obligations derive from divine doctrines goes into an infinite regress, so neither are adequate sources of normativity.<br><br>", "<b>Username: JSuresh</b><br><br>i think i understand how moral realism begs the question. but how is divine morality regressive?<br><br>", "<b>Username: nspeds</b><br><br>\"\"but how is divine morality regressive?\"\"<br><br>I believe the argument Korsgaard provided was against all theories that derive ethics from doctrines, which also subsumes divine doctrines. Her reasoning is as follows:<br><br>Say we live in a state:<br>Person 1: Why should I not punch kill person 3?<br>Person 2: Because it is immoral.<br>Person 1: Why should I be moral?<br>Person 2: Because the State commands you to do so.<br>Person 1: Why should I listen to the state?<br><br>The two participants can perpetually engage in this conversation. Now let us draw an analogy to divine doctrines...<br><br>Person 1: Why should I not punch kill person 3?<br>Person 2: Because it is immoral.<br>Person 1: Why should I be moral?<br>Person 2: Because the God commands you to do so.<br>Person 1: Why should I listen to God?<br><br>", "<b>Username: JSuresh</b><br><br>\"because he loves you\"<br><br>lol right i see your point nsdeps<br><br>", "<b>Username: JSuresh</b><br><br>actually now that i think about it, wouldnt that line of reasoning defeat any system or source of morality?<br><br>\"You shouldnt kill because its illogical if everyone in a state does it.\"<br>\"Why does that matter?\"<br><br>\"You shouldnt kill because it is universally wrong.\"<br>\"Who made it so?\"<br><br>i mean it seems that at some point you just have to accept some authority above yourself (like god) or revert to relative moralities<br><br>", "<b>Username: tech_fan</b><br><br>I certainly don't buy moral realism (so I wouldn't defend the ill-defined universe-permeating absolutes JSuresh finds dubious). I am also not a scholar of Mackie's work at a sufficient level to know how much there is in it to refute (many of his arguments are negative). But Korsgaard someimes makes sense, surely.<br><br>I myself am a \"moral naturalist\": my view is that moral rules derive from society's enforcement of certain norms (and yes, this entails moral relativism and a denial that there is such a thing as a categorical imperative). Any other philosophical analysis of morality suffers from the following problem. The philosopher goes through a lengthy (and usually unsound) argument explaining why there is a categorical imperative that binds you to do this and that. You say \"so what?\" and go on doing what you are doing.<br><br>Moral rules that are abstract and unenforced are irrelevant, and those that are enforced (through social punishments, guilty consciences, etc.) can be analyzed at the level of their manifestation, not in some needlessly abstract noumenal realm.<br><br>See Ken Binmore's <i>Natural Justice</i> for why Kant and his followers are mostly ridiculous.<br><br>", "<b>Username: JSuresh</b><br><br>Ben, I find cultural relativism to be the easiest position to defend, but also one of the least satisfying of the moral systems out there<br><br>", "<b>Username: nspeds</b><br><br>\"\"The philosopher goes through a lengthy (and usually unsound) argument explaining why there is a categorical imperative that binds you to do this and that. You say \"so what?\" and go on doing what you are doing.\"\"<br><br>In its first formulation, the categorical imperative is simply an account of autonomy: be a law to yourself. That is what makes Korsgaard's arguments so good: if one is to be autonomous, the reasons for one's actions must be a law for the domain which that reason governs.<br><br>I do not have the materials with which to explicate Korsgaard's argument in its entirety, but my publication provides an accurate reconstruction of Korsgaard's argument, though in the context of evolution and the tacit reasons involved in acting.<br><br>I can send the article to those who are interested.<br><br>", "<b>Username: nspeds</b><br><br>Also, be chary, for Korsgaard was Rawls's student, and he had perhaps the most thorough understanding of Kantian ethics.<br><br>", "<b>Username: tech_fan</b><br><br>I think Rawls' categorical imperatives are silly too. ;-)<br><br>", "<b>Username: nephilim</b><br><br>\"There are multiple ways for Planck's constant or having moral laws to be intrinsic properties of the universe, and everything being put there by God is only one such way. Nephilim asserted that morality can only be inherent in the universe in one way -- God put it there. I was saying that isn't so.\"<br><br>What is another way?<br><br>\"I myself am a \"moral naturalist\": my view is that moral rules derive from society's enforcement of certain norms (and yes, this entails moral relativism and a denial that there is such a thing as a categorical imperative). Any other philosophical analysis of morality suffers from the following problem. The philosopher goes through a lengthy (and usually unsound) argument explaining why there is a categorical imperative that binds you to do this and that. You say \"so what?\" and go on doing what you are doing.\"<br><br>Just because people can say \"so what?\" to a moral absolute doesn't mean that it doesn't exist. Upholding the truth is more more important than upholding whatever happens to \"work\".<br><br>Note: The Emperor's Club is a good movie that is all about this issue.<br><br>Other Note: Most everyone who believes in moral absolutes also believes in some kind of consequence in the afterlife or next life, so they can't really just say \"so what?\"<br><br>", "<b>Username: nspeds</b><br><br>\"\"Just because people can say \"so what?\" to a moral absolute doesn't mean that it doesn't exist.\"\"<br><br>But it denies them normative force, which is the basis of any moral obligation or duty.<br><br>", "<b>Username: JSuresh</b><br><br>\"\"<br><blockquote class=\"Quote UserQuote\"><br><div class=\"QuoteText\">Just because people can say \"so what?\" to a moral absolute doesn't mean that it doesn't exist.\"\"<br><br>But it denies them normative force, which is the basis of any moral obligation or duty.</div><br></blockquote><br><br>That's true. If someone denies a so-called moral absolute then that \"absolute\" can only be defended by its proponents, and this quickly reduces to a very subjective form of morality.<br><br>The problem is that the question of \"are ethics subjective?\" is itself a matter of opinion.<br><br>", "<b>Username: pebbles</b><br><br>well, obviously.<br><br>", "<b>Username: abless</b><br><br>I didn't read the whole discussion about this philosophy thing, but catched up some phrases:<br>\"\"See Ken Binmore's Natural Justice for why Kant and his followers are mostly ridiculous.\"\"<br>I would be careful with such statements. Kant and his categorical imperative are often misunderstood. Kant was _not_ the one who said \"you ought to do this and that\". His categorical imperative cannot be thought of as a dictation. Instead, Kant _analyzed_ how our reason assesses moral actions; the categorical imperative is the general principle of the functionality of our reason.<br>\"\"The philosopher goes through a lengthy (and usually unsound) argument explaining why there is a categorical imperative that binds you to do this and that. You say \"so what?\" and go on doing what you are doing.\"\"<br>What do you try to show us here? In how far does this pose a problem to \"any other philosophical analysis of morality\"? I think two things are mixed up here: (1) the analysis of moral standards, and (2) the realization and the compliance with moral rules.<br><br>Moral relativism is, in my eyes, untenable. There are two reasons I would like to mention:<br>(1) If morality really depends on culture/society/history, then what's wrong with Nazism, slavery, colonialism, terrorism, Stalinism, etc., etc.?<br><br>(2) Moral relativism &lt;=> ethics are subjective<br>However, the second part is a contradiction in itself. Ethics are by definition general.<br><br>", "<b>Username: tech_fan</b><br><br>\"\"(1) If morality really depends on culture/society/history, then what's wrong with Nazism, slavery, colonialism, terrorism, Stalinism, etc., etc.?\"\"<br>The desire to find some universal law (as opposed to our own society's judgment) to justify our dislike for Nazism or asparagus is not a good reason to think such a law exists.<br>\"\"(2) Moral relativism &lt;=> ethics are subjective<br>However, the second part is a contradiction in itself. Ethics are by definition general.\"\"<br>Fine, but then your definition of ethical principles as \"generally applicable, universal moral laws\" might be such that such things do not exist. (E.g.: If you define broobles as integers that are prime perfect squares, then broobles do not exist.) If you define ethics in this way, that would be my position.<br><br>", "<b>Username: abless</b><br><br>Hi Ben,<br>\"\"Fine, but then your definition of ethical principles as \"generally applicable, universal moral laws\" might be such that such things do not exist.\"\"<br>It is a pity I am not too familiar with modern ethical philosophy. I don't really want to talk about something I am not completely familiar with. However, your statement is almost comparable with nihilism. Let it put me in another way: it is _much_, _much_ easier to say that there are no \"generally applicable, universal moral laws\" than trying to find them (E.g.: it is much easier to state that Fermat's last theorem is unprovable than to prove it). Your statement would _only_ be acceptable if you could be sure that there aren't any universal laws. So how can you be sure of that?<br><br>PS: Maybe this is all getting a bit too off-topic. I don't really want to start/restart a philosophical discussion ;). Interesting topic, though.<br><br>", "<b>Username: tech_fan</b><br><br>That is a good point, and I strongly recommend reading Ken Binmore's <i>Natural Justice</i> -- for he analyzes your question in extreme depth. I agree that the denial of a universal moral law might just be lazy -- \"I don't want to find one.\" But it could also be the result of deep thought, and Binmore is definitely on that end -- his refutation of the various possible sources of nouminal, universal moral laws is complete and quite persuasive.<br><br>Yes, this is a funny place for a \"Caltech vs. MIT\" discussion to end up :-P<br><br>", "<b>Username: nephilim</b><br><br>\"The desire to find some universal law (as opposed to our own society's judgment) to justify our dislike for Nazism or asparagus is not a good reason to think such a law exists.\"<br><br>Sweet, let's kill people. [/sarcasm] My problem with this is that the sort of cultural relativism you're talking about is a universal law itself. You pull it out of thin air because you think it makes sense and you like it. This is no different than assuming there is \"some universal law to justify our dislike of Nazism or asparagus.\"<br><br>", "<b>Username: tech_fan</b><br><br>No. The assertion that \"there is no universal moral law\" is not itself a universal moral law. Nobody is claiming that what cultures deem right is, therefore, abstractly right -- just that the concept of \"general, abstract moral rightness\" doesn't even make sense.<br><br>", "<b>Username: Neo99</b><br><br>I just want to ask one simple question.<br><br>I've heard a thousand times that MIT and Tech students are all geniuses. So, I'm sure most of them get straight As nearly all the time.<br><br>But I'm just wondering whether there are some MIT or Tech students who usually got B+ in most subjects (like me :D).<br><br>Are those guys/girls at MIT or Tech who are in B-range (if any) in a serious disadvantage when applying for jobs?<br><br>", "<b>Username: tech_fan</b><br><br>Plenty of MIT/Caltech students don't get straight A's. Many, many students have a B average and still get good jobs, make six figures a few years out of school, etc.<br><br>", "<b>Username: molliebatmit</b><br><br>I've said it before and I'll say it again: unless you're applying to med school or law school, your college GPA is <i>not all that important</i>.<br><br>I mean, honestly, there are very few MIT (and I assume Caltech) students who <i>do</i> get straight A's. I mean, we're smart, but that just means that it's harder to destroy the curve...?<br><br>I feel quite comfortable saying that the average MIT student is about a B student. That's just where most professors here center the curve.<br><br>", "<b>Username: sakky</b><br><br>\"\"I've heard a thousand times that MIT and Tech students are all geniuses. So, I'm sure most of them get straight As nearly all the time.<br><br>But I'm just wondering whether there are some MIT or Tech students who usually got B+ in most subjects (like me ).<br><br>Are those guys/girls at MIT or Tech who are in B-range (if any) in a serious disadvantage when applying for jobs?\"\"<br><br>Like molliebatmit alluded to, it's really all about the curve. It is PRECISELY because MIT and Caltech students are such geniuses that most of them do NOT get straight A's. After all, this is not high school straight-scale grading. Grades often times tend to be based on curves, where to get an A, you can't just know the material well, you have to know it better than the other students in the class. That's what a curve is all about - only a fixed percentage of students will get an A. If the other people in the class are geniuses, then think about how hard it is for you to get an A even if you are yourself a genius.<br><br>", "<b>Username: abless</b><br><br>\"\"It is PRECISELY because MIT and Caltech students are such geniuses that most of them do NOT get straight A's.\"\"<br>I highly doubt that every MIT/Caltech student is a genius. Come on. They are all intelligent, but ... genius ?!<br><br>", "<b>Username: sakky</b><br><br>You know what I meant. I am saying that if you start with the initial presumption that they are all geniuses, then that's precisely the reason WHY they cannot all get straight A's. In other words, the logic is flawed. However, I never said that I agreed with the initial presumption.<br><br>", "<b>Username: abless</b><br><br>I know, I know, you're right. Just wanted to make this clear :)<br><br>", "<b>Username: Neo99</b><br><br>thanks for all the replies.<br><br>", "<b>Username: E4Engineer</b><br><br>Congrats!<br>I'm from New Hampshire too and would be thrilled to get into either MIT, or CalTech. Personally I would prefer MIT, but it is really up to what you are interested in. You should also definitely visit both campuses to see were you feel more comfortable before you make any decision. Either way both schools are among the best (if not the best) science and engineering schools in the world, so you can't go wrong either which way.<br><br>", "<b>Username: kryptonsa36</b><br><br>A little late for this, don't you think?<br><br>", "<b>Username: Zippidyduda</b><br><br>Well, you know the old saying...<br><br>Caltech- because not everyone can get into MIT ;)<br><br>", "<b>Username: River Phoenix</b><br><br>Caltech- because not everyone can get into Sarasota Clown College<br><br>", "<b>Username: rspence</b><br><br>I chose MIT mostly b/c Cambridge is really nice, and MIT has a wider range of majors to choose from. Caltech is also nice, but it's more for pure research. MIT is a little more \"applied\" than Caltech.<br><br>Be sure that you either choose one or the other, because of the rivalry between the two....<br><br>", "<b>Username: collegealum314</b><br><br>\"\"A little late for this, don't you think?\"\"<br><br>It might be useful for the OP's kids, though.<br><br>", "<b>Username: MaybeOnMars</b><br><br>But more people apply to MIT<br><br>", "<b>Username: lidusha</b><br><br>This thread is eight years old. Eight years old. My little brother was three when this thread was started, and I was still thinking about being a journalist. If someone posted in this thread as a high school student, they have now graduated from college and are real people with jobs and soon they'll have houses and mortgages and spouses and other grown-up things. Some of the people who posted in this thread might *already* have mortgages. Wow.<br><br>"]}