{"title": "cornell vs princeton", "comments": ["<b>Username: mxmmstudent</b><br><br>Please forgive my probably annoying, standard college comparison thread. Nevertheless...<br><br>", "<b>Username: MSauce</b><br><br>Keep in mind that saying something like \"the X at any Ivy League school should be...\"<br><br>Cornell is worse than many schools outside the Ivy League. Not that Cornell is a bad school, but you're definitely going to see a difference between Cornell's programs and Princeton's. Between HYPS? Eh, not a lot of difference.<br><br>I had a choice between a near-guarantee (as much as you could say that) into Columbia ED this year, as a legacy with a strong application. My uncle (Alum) thought I had little to no chance, but I passed on the Columbia ED to apply SCEA to Yale regardless, got in, and it was one of the best decisions I ever made. I was also accepted to Princeton and Columbia RD, so I got to visit all three, and Columbia ended up my least favorite.<br><br>The bottom line is, if you think you're going to have a strong chance at an Ivy, don't let fear dictate your application.<br><br>", "<b>Username: JohnAdams12</b><br><br>mxm, it is common knowledge that Harvard/Princeton are far apart from all the other Ivies in Physics and Math, and could very well have the best combination of those two areas (along with MIT and Stanford) in the U.S.<br><br>", "<b>Username: cmburns14</b><br><br>Cornell is one of the world's great centers for physics and mathematics research as is Princeton of course.<br><br>Cornell has two Nobel prize winners in the physics department and one in Chemistry. William Thurston is a Fields medalist in mathematics.<br><br>Princeton has two Nobel prize winners in physics as well as one in Biology. Charles Fefferman and Andrei Okounkov are both Fields medalists in math.<br><br>As you can see, both universities are comparable and obviously, excellent. I am not affiliated with either.<br><br>", "<b>Username: eating food</b><br><br>Aside from making any statement on its academics, Cornell is actually relatively easy to get into (people from my high school who have no business at schools of ivy caliber consistently get in). I would say just apply regular decision and choose then :).<br><br>", "<b>Username: BuddyMcAwesome</b><br><br>You haven't gotten in either yet, so calm down. That said, Princeton is much, much better in math and science, especially physics.<br><br>", "<b>Username: JHS</b><br><br>Jeepers, you people are so snotty it's disgusting. Disgusting.<br><br>There is no predicate, none, zero, zip, nada, for snotty statements like \"Princeton is much, much better in math and science, especially physics\". This stuff is coming from high school students, and maybe people who have spent 14 months in college, and they are talking out of a part of their body that can't see what's in front of them and is pretty far from their brains.<br><br>The differences in faculty quality and resources between Princeton and Cornell in math and physics are (a) minimal and (b) unlikely to affect the experience of any undergraduate. As an undergraduate you are extremely unlikely to get to the point where you could tell the difference, and no sophisticated person would expect a generic Princeton graduate in either field to know more or to be more sophisticated than a generic Cornell graduate.<br><br>Both are relatively small majors at their colleges, and about the same size (which is relatively much smaller at Cornell, with more than twice the number of undergraduates Princeton has): about 30 math majors/class and 15 physics majors. For comparison, look at the equivalent undergraduate majors at similarly ranked MIT (90/80), Harvard (80/40), or the University of Chicago (60/35). The point is not that Princeton or Cornell is \"worse\" than those schools, but it is that neither Princeton nor Cornell is necessarily where you would find the biggest concentration of energy around those subjects at the undergraduate level.<br><br>Princeton IS more selective, and probably has more impressive students overall, although Princeton (and Harvard, etc.) are SO selective that there are plenty of top-notch students left over for places like Cornell. Princeton also tends to award more and better need-based aid to students, and Princeton has more general prestige. Both institutions are rich, but Princeton is richer. As a result, students choosing between Cornell and Princeton are overwhelmingly likely to choose Princeton.<br><br>Princeton is not as monumental as Cornell, nor does it sit on top of a steep hill overlooking a beautiful lake. It is not shot through with rugged gorges. But it is fabulously beautiful. In my mind, Princeton and Cornell are 1-2 for physical beauty, with Princeton winning by a nose. If you need places of tranquility, and felt claustrophobic at Columbia, you shouldn't worry about Princeton at all. But you should worry a little about Harvard, MIT, and Chicago.<br><br>", "<b>Username: physicshobo</b><br><br>JHS: A larger department does not indicate \"more energy in the subject at the undergraduate level\". Rather, a smaller department is often (I'm not saying always) better because it allows for a smaller student to faculty ratio, which is important in getting attention, research opportunities, etc from faculty. I don't know about Cornell, but I know Princeton's student-faculty ratio in the math/physics/astrophysics department is amazing. Also, because Princeton has a relatively small graduate student population, undergraduates really get to be part of these world class departments in a way that they might not at equal caliber schools. Princeton's required senior thesis (and junior papers, at least in the physics department) also make the Princeton undergraduate experience (in my opinion) nearly unparalleled from an academic perspective, at least as far as math or physics goes. I am going to Princeton in the fall to study physics (or maybe math), so maybe I'm biased, but these are all reasons why I chose Princeton over Harvard (though the \"fit\" factor was probably more important in my decision).<br><br>", "<b>Username: mxmmstudent</b><br><br>I understand that Princeton is better at mathematics, but I anticipate that mathematics at any institutions in the top 15 of that field won't show much of a difference to an undergrad. With that said, Cornell is extremely close to Princeton in its physics prestige, and is actually higher in its engineering, so I think that half of that statement is at best a big exaggeration.<br><br>About reminding me that I haven't yet gotten in to either... I know that. I'm just wondering if either of those would have any large academic differences for an undergrad, since I'm deciding whether or not to use Cornell ED, which *does* require settling this issue long before I get accepted anywhere.<br><br>I don't want to go to Cornell just because it's the easiest Ivy to get into, or because I just want an Ivy name stamped on my degree, but because I absolutely loved the atmosphere, and one of the only ways I wouldn't apply there is if (1) I found a better choice for my long-term academic career, as in one that would make a great grad school much more likely than if I went to Cornell, or (2) I found the same quality of academics, yet with a better setting. That said, I'm not wanting to see you tout Princeton or disrespect Cornell, but to rather tell answer me the following question: In reality, does Princeton exceed Cornell noticeably for an undergrad in these subjects; and, in your opinion, does it have a better setting (social and environmental)?<br><br>Thanks, and I hope that none of my reply sounded rude.. I sincerely didn't mean it that way, just providing a rebuttal to show you more clearly what I'm asking.<br><br>", "<b>Username: Marsden</b><br><br>They're both great places to go to school, and especially in the fields being discussed. But Princeton is and always has been the more exclusive of the two. Whether or not that makes it \"better\" is up to you. Spending time on both campuses establishes a real difference in the 'vibe'. And for my part, I find <i>both </i>locations to be altogether cold enough in wintertime ;)<br><br>JHS, your personal insults are out of place and do not assist you in making your arguments.<br><br>", "<b>Username: JohnAdams12</b><br><br>this has been answered many times above<br><br>further, if you want a feeling for how good Princeton's Math department is, including for undergraduates, please review the Princeton v. MIT and Princeton v. MIT, Cambridge threads in the field of Math that have been recently completed<br><br>\"\"In reality, does Princeton exceed Cornell noticeably for an undergrad in these subjects; and, in your opinion, does it have a better setting (social and environmental)?\"\"<br><br>", "<b>Username: JHS</b><br><br>physicshobo:<br><br>Based on the NCES numbers, which reflect degrees awarded in the 2008-2009 academic year, Princeton awarded 35 bachelor's degrees and 18 PhDs in math, and 16 bachelor's degrees and 30 PhDs in physics. Cornell awarded 29 bachelor's degrees and 16 PhDs in math, and 15 bachelor's degrees and 28 PhDs in physics. I think the departments are the same size, and that sure looks like the same ratio between undergraduate and grad students. You don't get a fundamentally different experience at Cornell on that score.<br><br>As for number of majors, you are right that there are advantages to being one of a small number of undergraduate majors in a big, important department -- something that applies to both Princeton and Cornell. I'm not trying to contradict that, but I was giving the numbers that back up what I notice in real life: the really hardcore math/physics nerds seem to congregate elsewhere in greater numbers, for whatever reason (which may include that Princeton doesn't admit as many of them).<br><br>Princeton's senior thesis requirement is cool, but lots of places have senior thesis requirements. I'm not looking up Cornell. That is a style point, not some vast quality gap.<br><br>The OP wasn't asking whether Princeton was better, or more prestigious, or more selective than Cornell. He was saying that he loved Cornell, and asking what, specifically, he would be giving up if he applied ED there and thus lost the chance to be accepted at Princeton. The only correct answer, at the level of academics, in math and physics, is \"not very much\". There are certainly lots of other bases of comparison between the two colleges, some of which may cut either way depending on the student (e.g., the OP likes Cornell's isolation, which some people see as a negative, or the size difference), some of which probably favor Princeton (e.g., financial aid, which is extremely important, residential colleges, general prestige, less overt competition and inferiority complexes), and a few of which may even favor Cornell. (No one, but no one, looks good in orange and black if it's not Halloween.)<br><br>", "<b>Username: JHS</b><br><br>Marsden, I'm sorry, but I had a pretty negative reaction to the \"much, much better\" line.<br><br>I don't like to use USNWR rankings, but they will work for this purpose.<br><br>In the math/science area, in the general graduate program rankings (which are purely reputational), on a scale of 5.0, math is the ONLY area where the two universities both have a program and the rating difference between them is more than 0.2. In math, Princeton wins 4.9-4.3. Cornell does better in chemistry and computer science, Princeton in biology (by 0.1), earth sciences, and physics. Out of 30 possible rating points in those fields, the net difference between them is 0.7 points. (If you take into account the seventh field ranked by USNWR, Statistics, where Princeton does not have any program, the difference would be about 3.0 in Cornell's favor.)<br><br>I wouldn't put too much weight on the accuracy of those ratings, but they do reflect some general perception of quality by people in the field who know what they are talking about. And they do NOT support the notion that there is \"much, much\" difference between the two universities' departments in ANY of these fields, much less overall.<br><br>", "<b>Username: Marsden</b><br><br>No worries. I've just been reading your incredibly comprehensive and thoughtful notes in the Eating Clubs thread. And anyway, everyone gets set off now and then ;)<br><br>", "<b>Username: PtonAlumnus</b><br><br>You have not even visited Princeton and you are asking if you should even bother to apply.<br><br>First step is you should visit, if you can, your top three choices. You are too young to settle for second best. If you visit Princeton and another university and are convinced that Cornell is your first choice then apply ED at Cornell.<br><br>In applying to schools you should also consider the location of the university, transportation to and from the university, the academic and social environment, the size of the university, the type of students that attend, the research opportunities, and financial aid and research grants that are available.<br><br>To answer your specific questions: does Princeton exceed Cornell noticeably for an undergrad in these subjects It depends. If you interested in studying plasma physics, cosmology, or relativity then Princeton is unequaled. Top string theory experts are found at both Princeton University and the Institute for Advanced Study in Princeton. I am sure that Cornell has an area of unique expertise. You should compare Princeton's requirement for independent research for research opportunities at Cornell.<br><br>does it have a better setting (social and environmental This is entirely personal. Some students want to attend a big frat school. Most Princeton students do not join frats or sororities. Some students want a party school. Princeton is not a party school.<br><br>When you consider the ranking of graduate department consider the structural bias against a smaller school like Princeton. For example, physics is reviewed in seven areas. Larger universities such as Berkeley, Stanford, The University of Arizona have many more faculty and are more likely to have an expert in each field. When the question is asked of faculty, where would you advise your best student to attend for a PhD Princeton ranks much higher. An undergraduate at Princeton has an excellent opportunity to work on a one and one basis with a world famous physicist or mathematician.<br><br>If you were a third generation Cornell hopeful and are satisfied with the academic environment I would say perhaps apply ED at Cornell. However, if you are still evaluating which university best meets your needs then you should apply to both regular decision. If you are admitted to Princeton then you have a good chance of also being admitted to Cornell and you can decide next year where to attend.<br><br>", "<b>Username: 2006Alum</b><br><br>The better question is whether \"prestige\" of the department matters for undergraduates. Having been through undergrad and knowing a thing or two about the PhD process, my gut is that frankly, it makes no difference how prestigious the university or department is (once you get into the top tier, which both Princeton and Cornell are) and lots of difference what you do there. Questions like, \"can I do research? What is professor access like? Do I get to do independent work if I want to?\" to me, are much much much more important than \"is the program #1, #3, or #5.\" If you work hard, do good work, and get to know faculty who will support you , you'll get your pick (within reason) of graduate schools.<br><br>Spend the time deciding which school you'd like better. I'd try to move heaven and earth to visit Princeton--not because I think that it's the right call, but because you should compare your top choices (as someone pointed out). Compare apples to apples, not apples to what other people tell you apples might be like. Then make the choice, and if you think that you'll like Cornell better--enjoy your time there more, do better work there, fit in better there, then the choice is obvious. Really and truly obvious. Once you're in the top ten, don't let rankings make your decision for you.<br><br>There is one other thing to keep in mind. It's entirely possible that you're going to change your mind. Yes, yes, I know, you're decided. But people do change their mind during college (most popular major early sophomore year? \"I thought I knew, but now I'm unsure\") As such, make sure that the school you attend has a good backup plan, in case you decide that you don't really like physics or math after all. Not saying that's Princeton or Cornell (I'm really neutral here), but just make sure that you're comfortable with what happens if happily ever after doesn't materialize quite as quickly as you thought it might.<br><br>", "<b>Username: physicshobo</b><br><br>JHS: I was NOT trying to say that Princeton is better than Cornell at math/physics. I was mostly responding to your comment (which I cited in my post) that \"neither Princeton nor Cornell is necessarily where you would find the biggest concentration of energy around those subjects at the undergraduate level\". Much of what I said may apply to Cornell as well. I just referred specifically to Princeton because I have personal experience with the math/physics departments there. Students who make it through Princeton's physics major (which is quite challenging) are among the most prized graduate students, from what I have heard from various professors at numerous schools, and the people I know who were physics majors at Princeton say it was among the most challenging and rewarding four years of their lives. I KNOW Princeton's physics/math departments are excellent, and that was what I was trying to substantiate, NOT that these departments are significantly better than at Cornell.<br><br>Personally, I didn't apply to Cornell because in my experience, my personality more that of a Princeton student than a Cornell student. I say this based on the students I know who attend both. In general, the people I know who are going to/already at Cornell are less focused than those I know who are going to/already at Princeton. This is a judgment based on the sample I have seen, and not an absolute truth in any way. And frankly, being around focused people is not the right thing for everyone. Also, Cornell is in general a bigger school. I prefer the cozy, quiet atmosphere of Princeton. For me, the quietness will help me achieve more academically, so from an academic perspective, Princeton is a better school than Cornell for me.<br><br>", "<b>Username: JHS</b><br><br>physicshobo: Princeton is a great university. Math and physics at Princeton are famously great. You are incredibly lucky to have the chance to go there and study those things (but I'm sure you earned your luck). No one, not I certainly, is going to second-guess your decisions to go to Princeton if you have the chance. Given that you are going to Princeton, no one will ever ask you why you didn't bother applying to Cornell. They might ask you why you didn't apply to Harvard, MIT, or Chicago, say . . . but maybe you did. Anyway, a rational person could easily like Princeton best from among that lot for precisely the reasons you give.<br><br>I don't know why Princeton has so many fewer math and physics majors than Chicago or Harvard. (MIT isn't really a fair comparison.) It surprised me a lot when I saw that. Chicago and Princeton are the same size exactly. Chicago awarded 88 math bachelor's degrees last year; Princeton 35. Chicago had 273 declared math majors last spring, including sophomores (who can but don't have to declare majors). Princeton has 72 now, counting only juniors and seniors -- so maybe that's 100-110 if you count sophomores who would have declared already if they could. Harvard, which is bigger than either, has about 100 math/applied math majors/class, too.<br><br>Maybe the difference is Princeton's ORFE major, I don't know. That does seem different from straight math, though. And it doesn't explain the similar difference in physics.<br><br>", "<b>Username: whiteboy</b><br><br>For most areas of study, I would agree that the difference between any two schools in the top 20, isn't that large. However, I think when you're discussing something like math and physics (you could throw in comp sci as well), it actually makes a lot of sense to consider the differences.<br><br>Why do I say this? The first reason is because math and physics are very transparent, in the sense that it is very clear when you either understand something, or fail to understand. The second reason, possibly related to the first, and also likely because all students are exposed to math from an early age, is that math and physics are subjects where students will have HUGELY varied levels of preparation, ranging from the basic competency to prodigy level, and by prodigy, I mean truly precocious, think 7-year old debuting with the NY Philharmonic).<br><br>Why does this then affect the quality of the education? While it might be true that faculty strength isn't the biggest factor in determining the quality of the program, what is the single biggest factor is going to be the quality of your peers, and at Princeton, particularly in the math and physics departments, you are going to see a large number of some very, very smart students.<br><br>The result of this is that schools like Princeton can not only offer some very challenging courses at all levels, but also make them REQUIREMENTS for the major.<br><br>For example, at Princeton, almost every math major (with the exception of those people who are able to skip the course) takes MAT 215, a real analysis course that covers the first 8 chapters of Baby Rudin, as their FIRST course. Something like this simply isn't possible at other schools, even those in the top 20, because they don't have the necessary raw resources, ie students, who are able to keep up with the material at that pace.<br><br>The takeaway from all this is that at the very top schools for math/physics, if you major in those subjects, you won't be able to avoid learning a lot of math/physics. But at some of the lower ranked schools, while it's without a doubt possible to learn a lot, it's also possible to not learn so much if you don't make it your responsibility to challenge yourself.<br><br>", "<b>Username: natasha11</b><br><br>Question: When you qualify for PSAT/NMSQT as one of the highest scoring students, which two colleges to select for reporting and how does that play in the long run. For scholarships etc etc<br><br>", "<b>Username: Alumother</b><br><br>Princeton's math department, as I understand it, weeds out the regular \"Boy I was tops in math in high school and scored a 5 on my AP and won calculus prizes\" kids. Those who continue on to major in math are the types who solve major theorems, or at least become math professors at top unis. I know nothing about Chicago, and therefore will not guess about it.<br><br>", "<b>Username: mxmmstudent</b><br><br>Thanks for all of your useful replies!<br><br>Just to let you know, the reason I want to go to a top-tier school is because of its top-notch guidance and extremely extensive libraries and great environment to learn. Well, I wouldn't pay that much just for that, but I do get a degree at the end, so that makes it better.<br><br>I don't have any illusions that a Cornell degree or a Princeton degree will necessarily get me anything in life. However, I will take any college from which I can drive myself to learn enough and do enough research to get into virtually any grad school (I know this is impossible to guarantee, but I think that this is adequately possible from any Ivy.)<br><br>About me changing my major during college... I don't really see that happening (but I know it's possible), and I don't like to think that I'm just that good kid in the class at AP Calc... I am absolutely fascinated by proofs, and even have some original ones of my own; and if I can get paid to find more, I would take that job. Thus, why I want to get a Ph.D. in Mathematics or Physics.<br><br>If all of this is completely available from a Cornell education just as it is with a Princeton one, I could really care less. But if any of you think that I will be severely limited from excelling at Cornell, please tell me, because this is the time for me to know.<br><br>Thanks.<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"If all of this is completely available from a Cornell education just as it is with a Princeton one, I could really care less. But if any of you think that I will be severely limited from excelling at Cornell, please tell me, because this is the time for me to know.\"\"<br><br>In physics and math, there is no way that you would be limited at Cornell vis-a-vis Princeton, let alone severely limited. As 2006alum nicely put it:<br>\"\"Having been through undergrad and knowing a thing or two about the PhD process, my gut is that frankly, it makes no difference how prestigious the university or department is (once you get into the top tier, which both Princeton and Cornell are) and lots of difference what you do there.\"\"<br><br>That said, I can't stress enough that there are very distinct differences between Cornell and Princeton in terms of the student experience. Cornell has three times as many undergraduates as Princeton, including students in fields that Princeton would never think to educate. Many Cornell students choose to live off-campus as upperclassmen and consider it an integral part of the Cornell experience. Cornell only requires a senior thesis if you desire to graduate with honors, etc.<br><br>That and Cornell seems to have been a little bit more successful on the hard court and on the lacrosse field in recent years. ;-)<br><br>", "<b>Username: JohnAdams12</b><br><br>wait til next year<br><br>ha!<br>\"\"That and Cornell seems to have been a little bit more successful on the hard court and on the lacrosse field in recent years. ;-)\"\"<br><br>", "<b>Username: FightTheTide11</b><br><br>One note on Chicago's larger math department:<br>First, a BA or BS in math from Chicago requires only nine quarters of math (and a few more quarters of physical science). An AB math from Princeton requires eleven semesters (215-217-218 plus 8 upper division classes), independent work, and a thesis. That's a huge difference.<br>When I visited Chicago, Prof. Boller (who teaches Honors Analysis) told me that normally somewhere between one half and two thirds of declared math majors are also majoring in a complementary field like econ, CS, or physics. I don't think this can happen at Princeton except in special cases. The \"real\" math majors at Chicago are typically the ones who take the honors track, and there are about 30 of them per year.<br><br>", "<b>Username: PtonAlumnus</b><br><br>If any of you think that I will be severely limited from excelling at Cornell, please tell me.<br><br>In a word NO.<br><br>However, you should read the perspectives of students that have attended both Princeton and Cornell.<br><br><a href=\"http://blogs.dailyprincetonian.com/2010/04/orange-and-apples-cornell.html\" rel=\"nofollow\">The Prox: Orange and Apples: Cornell</a><br><br><a href=\"http://blogs.dailyprincetonian.com/2010/02/orange-and-apples-cornell_23.html\" rel=\"nofollow\">The Prox: Orange and Apples: Cornell</a><br><br><a href=\"http://blogs.dailyprincetonian.com/2010/02/orange-and-apples-cornell.html\" rel=\"nofollow\">The Prox: Orange and Apples: Cornell</a><br><br>You should consider aspects of the universities such as size. Do you want a large university with an extensive array of activities or do you want a more personal relationship with your professors?<br><br>In comparing the students here are the math SATs for the 25th and 75th percentiles.<br><br>Cornell 660 770<br>Princeton 700 790<br><br>The Putnam math competition is an annual North American math contest for college students, administered by the Mathematical Association of America. The examination is intended to test creativity as well as technical competence in undergraduate-level mathematics. 2008 was the fifth consecutive year that the Princeton team has won first or second place and the 27th year that it has been among the winning five teams. Cornell has not placed in the top five in over 10 years. The Barry M. Goldwater Scholarship is widely considered the most prestigious award in the U.S. conferred upon undergraduates studying the science, math, and engineering. Through March 2006 Princeton University has had the most Goldwater Scholars followed by Harvard and Duke.<br><br>It is easy to criticize these comparisons. The math SATs are not limited to the math majors. Princeton may attract math students that enjoy math competitions and Cornell may not. The Goldwater Scholarships are not limited to math majors. But collectively they reinforce the general consensus that Princeton has a top math department.<br><br>Visit Princeton. Talk to the students. You will do your best where you feel at home, where you find students of similar interests, or where you just enjoy the atmosphere. Cornell may be best for you; but you will never know until you visit Princeton.<br><br>", "<b>Username: MSauce</b><br><br>Cornell is not going to severely limit you, and if you love it there, go there. But the big thing to keep in mind is that people love to say HYPS is overrated--but it has a massive advantage over many of the non HYPS schools.<br><br>Money.<br><br>If you're interested in research or some sort of self made initiative, Princeton has (I believe) the third highest endowment overall and the highest per-student endowment in America. People may say the student-faculty ratio isn't that big of a deal, or the facilities aren't that different, or the prestige isn't that great. But whats undeniable is Princeton simply has a LOT more money than Cornell. And that means more opportunities available to its students.<br><br>", "<b>Username: cmburns14</b><br><br>I think you're really splitting hairs here- in the academic ranking of world universities:<br><br><a href=\"http://en.wikipedia.org/wiki/Academic_Ranking_of_World_Universities\" rel=\"nofollow\">Academic Ranking of World Universities - Wikipedia, the free encyclopedia</a><br><br>University 2003 2004 2005 2006 2007 2008 2009<br>Harvard University 1 1 1 1 1 1 1<br>Stanford University 2 2 2 3 2 2 2<br>University of California, Berkeley 4 4 4 4 3 3 3<br>University of Cambridge 5 3 3 2 4 4 4<br>Massachusetts Institute of Technology 6 5 5 5 5 5 5<br>California Institute of Technology 3 6 6 6 6 6 6<br>Columbia University 10 9 9 7 7 7 7<br><b>Princeton University 7 7 7 8 8 8 8</b><br>University of Chicago 11 10 10 8 9 9 8<br>University of Oxford 9 8 8 10 10 10 10<br>Yale University 8 11 11 11 11 11 11<br><b>Cornell University 12 12 12 12 12 12 12 </b><br>University of California, Los Angeles 15 16 16 14 13 13 13<br>University of California, San Diego 14 13 13 13 14 14 14<br>University of Pennsylvania 18 15 15 15 15 15 15<br>University of Washington 16 20 20 17 16 16 16<br>University of WisconsinMadison 27 18 18 16 17 17 17<br>University of California, San Francisco 13 17 17 18 18 18 18<br>Johns Hopkins University 24 22 22 20 19 20 19<br>University of Tokyo 19 14 14 19 20 19 20<br>University College London 20 25 25 26 25 22 21<br>University of Michigan, Ann Arbor 21 19 19 21 21 21 22<br>ETH Zurich 25 27 27 27 27 24 23<br>Kyoto University 30 21 21 22 22 23 24<br>University of Illinois at Urbana-Champaign 45 25 25 25 26 26 25<br><br>", "<b>Username: JohnAdams12</b><br><br>cmburns, thanks for showing us the \"academic ranking of world universities\"<br><br>no lets look at the USNWR rankings of top US Research Universities:<br><br><br><b>1. Princeton</b><br>2.<br>3.<br>4.<br>5.<br>6.<br>7.<br>8.<br>9.<br>10.<br>11.<br>12.<br>13.<br>14.<br><b>15. Cornell</b><br><br>", "<b>Username: cmburns14</b><br><br>no, that's US News <b>undergrad</b> rankings- it factors in classes under 20 and over 50, reputational surveys etc.<br><br>In terms of research, i.e. federal funding, etc. the list looks like this:<br><br><url>http://mup.asu.edu/research2009.pdf</url><br><br>Top American Research Universities (1-25)<br>Institutions in Order of Top 25 Score,<br>then Top 26-50 Score,<br>then Alphabetically<br>2008<br>National Rank 2008<br>Endowment<br>Assetsx $1000 2007<br>National Rank 2007<br>Federal Research x $1000 2007<br>National Rank 2007<br>Total Research x $1000<br>Number of Measures in<br>Top 26-50 Nationally<br>Number of Measures in Top 25 Nationally<br><br>Private Columbia University 9 0 545,995 20 459,748 10 7,146,806 8<br>Private Massachusetts Institute of Technology 9 0 614,352 13 476,318 6 10,068,800 5<br>Private Stanford University 9 0 687,511 10 534,787 4 17,200,000 3<br>Private Harvard University 8 1 451,276 28 392,103 15 36,556,284 1<br>Private University of Pennsylvania 8 1 648,247 11 449,687 12 6,233,281 12<br>Private Duke University 8 0 781,843 7 459,122 11 6,123,743 14<br>Public University of Michigan - Ann Arbor 8 0 808,731 5 577,201 3 7,571,904 6<br>Private Yale University 7 2 448,671 30 349,027 17 22,869,700 2<br>Public University of California - Berkeley 7 1 552,365 19 251,043 38 2,885,352 23<br>Public University of California - Los Angeles 7 1 823,083 4 488,846 5 2,320,333 30<br>Public University of Washington - Seattle 7 1 756,787 8 620,375 2 2,262,149 31<br>Public University of Wisconsin - Madison 7 1 840,672 3 469,076 8 2,119,513 32<br>Private Johns Hopkins University 6 3 1,554,103 1 1,362,836 1 2,524,575 26<br>Private University of Southern California 6 3 508,138 23 355,084 16 3,589,225 21<br>Public University of Minnesota - Twin Cities 6 2 624,149 12 337,966 19 2,750,770 24<br>Public University of North Carolina - Chapel Hill 6 2 477,231 25 346,672 18 2,358,676 28<br>Private Washington University in St. Louis 6 2 572,775 17 424,451 14 5,350,470 16<br>Public University of Texas - Austin 6 1 446,765 31 289,331 24 6,895,038 9<br>Public University of California - San Diego 6 0 798,896 6 475,708 7 525,555 136<br>Public University of California - San Francisco 6 0 842,840 2 467,402 9 1,306,438 54<br>Public Ohio State University - Columbus 5 3 720,206 9 313,242 21 2,075,853 33<br>Private University of Chicago 5 2 322,488 52 261,870 31 6,632,311 10<br><b>Private Princeton University 5 1 188,732 91 119,171 77 16,349,329 4<br>Private Cornell University 4 5 449,307 29 256,938 34 4,416,095 19</b><br>Public University of Pittsburgh - Pittsburgh 4 4 558,566 18 441,357 13 2,333,602 29<br>Private Northwestern University 3 6 443,345 32 249,411 39 7,243,948 7<br>Private Vanderbilt University 3 5 399,149 35 312,178 22 3,524,338 22<br>Public Pennsylvania State Univ. - Univ. Park 3 4 582,443 16 331,159 20 1,140,442 61<br>Public Texas A&amp;M University 3 4 543,888 21 228,363 42 6,259,791 11<br>Public University of Florida 3 4 592,835 15 240,819 40 1,250,603 59<br>Public University of Illinois - Urbana-Champaign 3 4 473,890 26 253,612 37 1,043,892 68<br><br>", "<b>Username: JHS</b><br><br>Look, these are all different ways of slicing the same apple. The world rankings are based on reputational surveys, which are probably the most relevant information anyway if you are trying to assess academic quality. The USNWR college rankings try to introduce some more objective factors in there, which is a laudable goal, but the factors are of questionable relevance to actual educational quality, and systematically favor whichever university has more money/student, more applicants, and greater selectivity (i.e., is more popular with high school students). In a sense, the USNWR rankings measure how closely a college resembles Princeton, so it's no huge surprise that Princeton does very well in them. (For years, the effort was being run by Princeton alumni. I don't know if that's still true.)<br><br>The main point is that there is no yawning chasm of educational quality between Princeton and Cornell. Saying that doesn't diminish at all the many fine things that Princeton offers that cause most people to prefer it to Cornell. It does mean that if someone affirmatively likes Cornell, he's not throwing his life away if he forgoes applying to Princeton.<br><br>", "<b>Username: PtonGrad2000</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/JHS\">JHS</a> wrote:\"\"<br><br>This has never been true but, perhaps unsurprisingly, keeps getting repeated as \"common wisdom\".<br><br>", "<b>Username: JHS</b><br><br>\"\"Mindful that the use of the yield rate in the rankings formula had drawn them into the debate about early admissions, the editors of U. S. News decided to omit the figure this year, <b>Sara Sklaroff, the magazine's education editor</b>, said yesterday.\"\"<br>NY Times July 10, 2003.<br>\"\"Sara Gillian Sklaroff, a magazine editor, and Kevin Joseph Mary Carey, a university professor, were married last evening by Rabbi Susan Schnur in the Horticulture Center of Fairmount Park in Philadelphia.<br><br>Ms. Sklaroff, 29, is keeping her name. She is an assistant managing editor and the editor of the Ideas section at U.S. News &amp; World Report in Washington. <b>She graduated from Princeton University</b>.\"\"<br>NT Times April 16, 2000.<br><br>I know for a fact, of course, that there was only one Sara Sklaroff at USNWR and that she oversaw the rankings from 2002 to, I think, 2006 (not sure when she stopped).<br><br>", "<b>Username: JHS</b><br><br>Obviously, just another plot by the mainstream media to smear Princeton.<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"In comparing the students here are the math SATs for the 25th and 75th percentiles.<br><br>Cornell 660 770<br>Princeton 700 790\"\"<br><br>For what it is worth, if you only look at Cornell's Colleges of Arts &amp; Sciences and Engineering (the schools with the math/physics majors), the 25th/75th percentile for SAT math increases to 690/780.<br><br><url>http://dpb.cornell.edu/documents/1000176.pdf</url><br><br>", "<b>Username: PtonGrad2000</b><br><br>Well JHS, believe it or not, I've heard that one too.<br>\"\"<a rel=\"nofollow\" href=\"/profile/from%202004\">from 2004</a> wrote:\"\"<br><br><a href=\"http://www.amazon.com/U-S-News-Ultimate-College-Guide/dp/140220292X\" rel=\"nofollow\">Amazon.com: U.S. News Ultimate College Guide 2005 (Us News Ultimate College Guide) (0760789202926): Inc. U. S. News &amp; World Report, Anne McGrath: Books</a><br><br>Sara Sklaroff, who graduated from Princeton in 1992, was education editor at U.S. News for three years from 2002 to 2004. At the time she left the magazine in 2005 she was culture editor. She was never involved in decisions regarding \"research, data collection, methodologies [or] survey design\" all of which have always been managed by Robert Morse who has absolutely no connection to Princeton and has been managing this project for over 20 years. Morse took on the data collection and analysis project in 1988 and has been responsible for it every year since.<br><br>USNWR has published its rankings for over 25 years now. During that quarter century, Princeton has been ranked number one or two (generally sharing these positions with Harvard) most of the time and every year for the last decade. It's a bit difficult to make a case that a Princeton grad not directly involved in the research or analysis of the data and in the position of education editor for a mere three years would have affected rankings over a quarter of a century of their publication.<br><br>Ironically, the one reference you have to Sklaroff acting as a spokesperson for the rankings is related to a change that actually worked against Princeton. At the time the decision you quote above was made, Princeton had an early decision program. As you know, both Harvard and Princeton dropped their early programs three years ago. (As you probably also know, Yale, your alma mater, has retained its early program.) Early programs boost yield significantly so dropping yield from the USNWR formula back in 2003 when Princeton had a binding early decision program, would, to the extent it had any effect, have harmed Princeton's position in the rankings.<br><br>For you to suggest that Sklaroff's three year association with the educational content of the magazine in a non-technical capacity is somehow part of a great Princeton plot to dominate these rankings is embarrassingly light on evidence. For someone like you, with a legal education, it's more than embarrassing.<br>\"\"<a rel=\"nofollow\" href=\"/profile/JHS\">JHS</a> wrote:\"\"<br><br>The nastiness of this comment aside, I don't think we need to rely on the mainstream media here on the Princeton board when we have so much help from you, my friend.<br><br>", "<b>Username: JHS</b><br><br>PtonGrad:<br><br>The history of the USNWR rankings is pretty well known. It has more Harvard fingerprints on it than Princeton, granted, but after an initial period of just pulling it out of their butts, when they designed some sort of automatic system, the test that was applied was that it had to produce Harvard, Yale, or Princeton as #1 every year, preferably changing year to year so that there would be some \"news\" involved. Morse's role was to come up with a formula that would produce that result, and he did. Morse was replaced by Amy Graham, who revised the ranking formula in 1999 in a way that caused Cal Tech to be ranked first, whereupon she lost her job and the formula was revised yet again to ensure a HYP or sometimes S win. Jim Fallows was running the project at the time -- a Harvard AB, and former Crimson Editor-in-Chief, but also a fellow at Princeton for three years in the mid-70s.<br><br>Of course, there was no Princeton conspiracy to rank Princeton first. There was a bunch of Ivy-educated Establishment types who believed that to be credible their system had to reflect what everyone \"knew\", that HYP was the best. Which, in large part, is why USNWR tells us every year that Vanderbilt and USC are better than Michigan and Berkeley. One of the consequences, though, is that size winds up being a negative -- in the top 10, I believe only Penn has more than 6,500 undergraduates -- which devalues a place like Cornell. Princeton does well in the rankings because the rankings are designed to measure the qualities that Princeton has.<br><br>When they stopped treating yield as a separate factor, by the way, it was because everyone had noticed that yield was already reflected in admission percentage, which essentially is beds / yield / applications, so that treating yield as an additional factor effectively double-counted it. Was it relevant that Harvard and Yale had recently ended their ED programs in favor of EA? Probably.<br><br>", "<b>Username: Alumother</b><br><br>I always heard it was a <b>Penn</b> graduate who was jiggering the rankings:).<br><br>", "<b>Username: PtonGrad2000</b><br><br>Oh, JHS, there you go again . . .<br>\"\"<a rel=\"nofollow\" href=\"/profile/JHS\">JHS</a> wrote:\"\"<br><br>For a lawyer, JHS, you are an astonishing believer in conspiracy theories. Do you have any hard evidence for any of this? I'm guessing you may simply be repeating what you read in Amy Graham's scathing and widely discussed article in the Washington Monthly, which, one should note, now annually publishes its own highly criticized college rankings and thus competes with USNWR.<br><br><a href=\"http://www.washingtonmonthly.com/features/2001/0109.graham.thompson.html#byline\" rel=\"nofollow\">\"Broken Ranks\" by Amy Graham and Nicholas Thompson</a><br><br>While she was an insider and some weight should be given to her opinion because of that, Ms. Graham's seemingly overly broad characterizations of motivation and bias need to be taken with a grain of salt given her employment history. She ran the research department for two years and then resigned. She makes many perfectly valid points but, at least in my opinion, goes over the top with her own conspiratorial explanations of motivation.<br><br>The initial survey back in the early 80s was primarily a popularity contest that relied on survey respondents' preferences for different schools. Over time more and more detail was added and the reputational survey portion was weighted less and less. There was a system from the beginning, however imperfect it was.<br><br>You do USNWR a disservice with the vulgar colloquialism and there has never been any hard evidence that the magazine's intention from the beginning was to guarantee top placement for certain schools, however popular that theory might be here on CC, and in spite of what Ms. Graham has written. In fact, if that had been the editors' intention, they failed miserably. Over the 25 years of the survey, Yale has only been given a number one ranking once hasn't it? Stanford was only ranked number one in the early days when the ranking was based entirely on the popularity poll. If the goal was to generate excitement and anticipation over who would be number one each year there would not have been anywhere near the stability that has existed over the last decade. For each of those years Princeton and Harvard have shared the top spot or were number one and number two in some order. There has actually been very little change in the rankings and when change has occurred, it can be traced to some modification of the methodology with at least a rational justification.<br>\"\"<a rel=\"nofollow\" href=\"/profile/JHS\">JHS</a> wrote:\"\"<br><br>I assume then that what you really mean is that \"the rankings are designed to measure the qualities that Princeton, and Harvard, and Yale, and Stanford, and Penn, and MIT, and Caltech, and Columbia and...\" all have, given the fact that they are all ranked so highly. How is it that you explain Harvard's typical number one ranking? If you believe that the analysis is designed to \"measure the qualities that Princeton has\" then I assume that the explanation for Harvard's ranking is that it too has those qualities? So are you suggesting, in fact, that the ranking methodology is actually designed to favor Princeton and Harvard?<br><br>At any rate, I'm glad to see you're backing off your suggestion that the USNWR rankings are being \"run\" by Princeton alumni. That was almost too ridiculous to call for a response.<br><br>None of this should be taken as a full-throated endorsement of this particular ranking. If there is a bias in the ranking it is just as Amy Graham points out, toward large research institutions. The editors have tried to respond to this by having a separate category for liberal arts colleges. There is also a legitimate criticism that the ranking fails to assess the quality of teaching, though the editors have tried to address this as well with a separate ranking (in which, nationally, Princeton is second after Dartmouth). Finally, and as you well know, there are numerous rankings available so the consumer may take his or her pick. Interestingly, a number of them also started out as simply reputational surveys and are now trying to refine their methodology just as has USNWR.<br><br>My apologies to the OP for this diversion from the primary discussion. On one point, my Yale friend (who spends a surprising amount of time on the Princeton board) and I can certainly agree. Cornell offers a fine undergraduate education and may well be preferred by some.<br><br>", "<b>Username: Marsden</b><br><br>Good Lord, another 'rankings war' on CC. Who would have guessed?<br><br>No sweat, at least I keep learning things. I never knew that Stanford ever hit #1 on USN&amp;WR. I do remember when Caltech did and thinking at the time, what <i>won't</i> they do to make a splash. USN&amp;WR, that is, not Caltech.<br><br>", "<b>Username: JHS</b><br><br>Actually, I hadn't seen the article by Graham. I have seen multiple articles talking about the initial development of the ranking rubric, which included quotes from Mel Elfin to the effect that he knew the rubric worked when it would always make Harvard, Yale, or Princeton #1, and also talking about the short-lived \"Graham era\" with its apotheosis of Cal Tech.<br><br>PtonGrad, you are the one who overcharacterizes what I said as a \"conspiracy theory\". I didn't say it was a conspiracy at all. What I said is consistent with what I ALWAYS say about USNWR rankings -- that they represent a good-faith attempt at transparent, neutral evaluation, but that they also reflect a particular argument about what makes for a good educational experience, and that argument is really subject to debate. I certainly don't have any problem with the fact that it consistently ranks Harvard or Princeton #1. (I thought Yale and Stanford snuck in there more than once, but so be it.) Like Elfin, I would regard the rubric as not credible and consistent with common sense if it didn't do something like that. On the other hand, I have some trouble with what happens not so much father down the list -- mainly the under-valuation of larger colleges, including Cornell, but much more significantly the top public universities, and the over-valuation of private universities like Vanderbilt, Georgetown, USC with comparatively weak graduate programs.<br><br>When I say that USNWR values the qualities Princeton has, I mean things like not caring about the strength of a university's professional schools. If that were taken into account -- and maybe it should, because it lends vitality to the institution and creates opportunities for everyone -- Princeton would probably never make it above #3 or #4, and Harvard and Stanford would trade #1 places all the time. Or sheer faculty size, as opposed to faculty-student ratio. Or number of courses actually conducted. Or diversity of programs. Or cultural offerings on campus and in the surrounding community. Considering such factors wouldn't make Princeton look \"bad\" by any stretch of the imagination -- it would clearly remain among the nation's great universities. But it would definitively lose a step against some of its rivals. Meanwhile some of the things USNWR values are things that Princeton historically beats everyone in, like percentage of alumni giving. That's surely a fine thing, but maybe a little tangential to educational experience.<br><br>So even though the rating rubric isn't set up so Princeton always wins -- obviously -- it is set up so Princeton always competes at the very top. That's why I believe -- and will continue to say -- that in most respects the USNWR's implicit ideal of what a university should be is Princeton.<br><br>Was that due to some dark conspiracy of Princetonians? Of course not. And I didn't say it was. Does it mean that I think Princeton is somehow secretly a bad university? Of course not. And I didn't, and haven't, and won't say that, either. Does USNWR's rubric represent a substantive, good faith vision of what a university should be that was created and maintained by a group of people with extensive personal experience with universities exactly like that, including Princeton? You betcha. Is it fair to discuss that in the context of explaining why the vast gap in USNWR rankings between Princeton and Cornell shouldn't matter so much to a student who happens to like Cornell a lot? I think so.<br><br>It's funny, PtonGrad. None of the Princeton people I know in real life is one-quarter as defensive and anxious about the university as you are. They know it's the greatest, and regard the standard criticisms -- too preppy, too suburban, eating clubs are evil, no medical school -- as the equivalent of gnat-bites on a supermodel. Sure, they're there, but so what? Everything has a flaw or two, but they remain confident this is the best-looking woman on Earth. But you regard everything as a vicious attack, overcharacterize it, and go into a frenzy. Despite your obvious deep loyalty to Princeton, your personality is a lot more in line with that of your OTHER main educational affiliation.<br><br>", "<b>Username: Wildwood11</b><br><br>\"\"So even though the rating rubric isn't set up so Princeton always wins -- obviously -- it is set up so Princeton always competes at the very top. That's why I believe -- and will continue to say -- that in most respects the USNWR's implicit ideal of what a university should be is Princeton.<br><br>Was that due to some dark conspiracy of Princetonians? Of course not. And I didn't say it was.\"\"<br>\"\"In a sense, the USNWR rankings measure how closely a college resembles Princeton, so it's no huge surprise that Princeton does very well in them. (For years, the effort was being run by Princeton alumni. I don't know if that's still true.)\"\"<br><br>Well, you didn't say it was a conspiracy, but it seems that you insinuated it.<br><br>", "<b>Username: PtonGrad2000</b><br><br>JHS, with all due respect, I think the self-justification is pretty heavily on your side. My simple correction to your statement that Princeton alumni \"ran\" the USNWR rankings \"for years\" (along with all that implied) has, once again, unleashed a torrent of corrections and clarifications along with a few more tidbits of nastiness and some backtracking. I would have been happy to stop with my one sentence correction but you seemed to want to 'prove' it to me no matter how weak the evidence.<br><br>I'm glad that you've backed off that statement though I still disagree with your characterization of the motives of the editors. While you seem committed to believing that the USNWR ranking was designed to favor a Princeton 'ideal', you don't explain then how the vast majority of the top schools on the list are heavily loaded with professional schools and are in many other ways (scale, surroundings, etc) very different from Princeton. Only Princeton and CalTech are different in that way and both are heavily research-oriented. I'm also curious about how you square your criticism of USNWR's methodology with this statement:<br>\"\"<a rel=\"nofollow\" href=\"/profile/JHS\">JHS</a> wrote:\"\"<br><br>Do you really believe that these rankings should rely mostly on reputational surveys? I don't think you'll find many who will agree with you and USNWR was roundly criticized in the beginning for being nothing more than a reputational poll. By the way, I agree with much of what you have written. I'm simply surprised that, despite your recent attempts to be a little more balanced, you can't seem to stop yourself from taking the cheap shots when it comes to Princeton.<br>\"\"<a rel=\"nofollow\" href=\"/profile/JHS\">JHS</a> wrote:\"\"<br><br>No defensiveness here and I don't think I've ever characterized your comments as \"vicious attacks\". They're simply wrong and need correcting or are shallow and unexamined stereotypes that invite a response.<br><br>By the way, my friends would find it laughable that you would associate the word \"frenzy\" with me. I have rather the opposite reputation.<br>\"\"<a rel=\"nofollow\" href=\"/profile/JHS\">JHS</a> wrote:\"\"<br><br>As a Yale man you couldn't avoid a little jab at Harvard either, eh?<br><br>Again, my apologies to the OP. These conversations with JHS here on the Princeton board too often lead the original conversation astray but our Yale friend will continue to be corrected when stating falsehoods or engaging in exaggeration (at least when he does so on this board). For some reason, we seem to get under his skin.<br><br>I suspect JHS will want the last word here so (unless it's outrageous) I'll leave it to him. I would hope, however, that he'll allow the conversation sought by the OP to continue. I think we've both said enough and this isn't a thread about rankings.<br><br>", "<b>Username: JHS</b><br><br>PtonGrad: I entered this thread, titled Cornell vs. Princeton, because some poster who named himself \"Buddy McAwesome\" had just assured a high school student that Princeton is \"much, much better than Cornell in math and science, especially physics\", another poster had told him that Harvard and Princeton were \"far apart from the other Ivies\" in those areas, and two other posters -- both Yalies, I think -- had said that Cornell was a weak college. I thought that all of that was seriously wrong, and horrible advice for someone who affirmatively liked Cornell and was wondering if he should plan on applying ED there. I do similar things on other boards, too, when I notice them. I am especially sensitive to disrespect for Cornell, because it is rampant here, and really unjustified, and also reflects a complete lack of appreciation for the importance of Cornell in the history of American higher education.<br><br>In defending my view, among other things I had to explain why I didn't see the difference in USNWR rankings as terribly important. My main argument was the one I have repeated several times -- the USNWR rankings systematically favor Princeton by valuing what it has and not valuing what it doesn't have. As a parenthetical aside, I said that Princeton alumni had run the ranking projects for years. I was referring to Sklaroff and Fallows. I mistakenly thought Fallows was a Princeton alumnus because I met him when he was living and working at Princeton in the mid-70s. You said, in no uncertain terms, that I was lying (and apparently repeating a lie others have told, which wasn't true at all -- I still don't know what you are referring to there). I didn't think I was lying. I still don't.<br><br>You decided to have a debate about USNWR. It was nice of you to say, towards the end of your last post, that you don't think there's a huge academic quality difference between Princeton and Cornell, either. I don't know exactly what we disagree on, except that I DO think reputational surveys are about the only information that actually addresses what I care about in these ratings. It would be great if people came up with better heuristics, but they haven't, at least in my opinion. And I still think that Princeton, while heartbreakingly beautiful, is perhaps a bit over-landscaped, and that Princeton NJ is a wealthy suburban community.<br><br>I have no idea when I am going to trip over one of your weird sensibilities, so I don't worry about it. I would respect you a lot more if I ever saw you step outside your role as self-appointed thought-police about Princeton. Maybe you could point me to someplace where you actually said what you thought instead of quibbling with what other people think?<br><br>"]}