{"title": "bates vs northeastern", "comments": ["<b>Username: ncelotto</b><br><br>I am currently a rising senior in high school. I am interested in running track in college, so I started looking at D3 schools. I love small class sizes to be able to engage with the professors more. I reached out to Bates and have a meeting setup with the coaches and everything. On the other hand, I have also loved the CO-OP program at Northeastern (but definitely would not be able to run track there).<br>I love the idea of small class sizes and playing a varsity sport in college, but I also am intrigued by the co-op program at Northeastern (but I could just get internships at Bates which would still be good).<br>A lot of my friends and family haven’t heard of Bates like they have Northeastern, leading me to assume it is not well known (but I believe it is still a very good college).<br>My question is, will future employers much prefer Northeastern, especially with the co-op program and experience I would get from it, or should I have no problem with Bates? (if I were to get into which ever one I apply to ED).<br><br>", "<b>Username: helpingmom40</b><br><br>What is your intended major? They are both very good schools but not necessarily for the same things. Their settings are also completely different - urban city campus or  dry rural campus. If you personally want one and not the other, that would be where I would start the thought process. The other thing I like to point out is approach every school like you may not be doing a sport because injuries happen. Plus, the whole Covid situation is having a financial impact on colleges and the ripples could impact athletic budgets and programs.<br><br>", "<b>Username: ThisNameNotTaken</b><br><br>I visited NE a few years ago with D15 and Bates last fall with D21.  I pretty much concur with @helpingmom40.  The campuses are certainly totally different.  Lewiston is best described as “faded New England mill town” (of which there are a lot of around here and which aren’t always as sketchy as they seem).  Northeastern is more “Boston but not exactly the greatest part”, although it seemed fine to me.  I suspect that they are also very different “culturally” (whatever that means).<br>I’m of a mixed opinion on the sports angle.  You definitely don’t want to base your decision too heavily on that, but on the other hand if you’re not ready to give it up quite yet you might find yourself having regrets if you do.  My D21 is also a T&F athlete and not quite ready to say goodbye to it yet.<br>Conversely, the CO-OP idea is cool and very well known here in New England, but I would also not base the decision too heavily on that.<br>NE (I believe) has a relatively small endowment and (this may be an urban myth) relies heavily on full pay international students.  If that’s true I don’t know how the COVID situation may affect that.<br>Also, I have known two recent NE students who have both been sent overseas for their first semester (one to Ireland, one to Australia).  I don’t know how much choice they had in the matter, and I don’t know how much COVID will affect that (I suspect a lot).   Housing issues with Boston colleges are another thing worth investigating.<br>If financial aid is an issue, look into the differences between them in that area.  I think of NE as very “all or nothing”, but again, I could be wrong about that.<br>At least with Bates and Northeastern there isn’t a ton of overlap.  They are both very well regarded, at least in New England.<br>Good luck with your decision.<br><br>", "<b>Username: whidbeyite2002</b><br><br>Paging @Lindagaf, Bates parent!<br><br>", "<b>Username: ncelotto</b><br><br>@helpingmom40 my intended major is mathematics/statistics/computer science with a possible minor in neuroscience/cognitive science (to go more the Artificial Intelligence route).<br>@ThisNameNotTaken I personally love track and field. Besides the sport itself, I love being part of a team and a community. It’s something that I’m committed to. I believe it will help my time management skills as well as setting my priorities. I also love the small undergrad population at Bates, allowing myself to connect with the professors there (that are top level). Again, I would have to get into these schools, but currently, I’m leaning towards Bates.<br><br>", "<b>Username: PengsPhils</b><br><br>@ncelotto<br>If you are strongly interested in computer science, Bates doesn’t even have a department for it, much less a major. Going into AI from the software side wouldn’t exactly be ideal despite the extensive math department.<br>As mentioned, Bates and Northeastern are drastically different schools in terms of the environment. If you’re looking for schools with similar environments to Bates but with greater offerings in CS/AI, I’d recommend checking out this post as a starting point:<br>https://talk.collegeconfidential.com/math-computer-science-majors/1814245-computer-science-at-some-smaller-schools-including-liberal-arts-colleges-p1.html<br><br>", "<b>Username: tkoparent</b><br><br>Bates is a great school, and if you love running track, running for Bates would be a wonderful experience.  We visited Bates and met with the coaches when my son was looking at schools, and the team has a very nice vibe.  He ended up at a different LAC and being part of the track team has been a very important part of his college experience.  As people have pointed out above, Bates and Northeastern are very different schools in very different environments - 18,000 undergraduates vs. 1800, Boston vs. rural Maine .  It sounds as though the small size and and community feel of Bates appeals to you, and I think you should pay attention to that.  We were lucky in that we were able to visit a wide range of schools when my son was looking.  He realized very quickly that he would be more comfortable in a small school environment, and that has proved to be the right decision for him.  I don’t think you need to be concerned at all about Bates not being well-known or well-regarded among future employers, as Bates is clearly among the elite LACs.  @Lindagaf may also chime in, as her daughter just graduated from Bates.<br><br>", "<b>Username: merc81</b><br><br>As suggested above, the course offerings of Bates’ two-year old Digital and Computational Studies program differ substantially from those of a traditional computer science program, and would not appear to offer a strong foundation for a student with an interest in AI. Nonetheless, if you would like to run in the NESCAC, you could find several colleges from which to choose that do offer long-established computer science departments with dedicated courses in AI, along with math departments that may also offer courses in machine learning.<br><br>", "<b>Username: Lindagaf</b><br><br>With all due to respect to Pengsphil and all that Northeastern offers, I would unequivocally suggest Bates, for a number of reasons.<br>(Full disclosure, my bias is clear.)<br>I agree with everyone else that it’s hard to compare these two schools. They are extremely different, for reasons that have already been mentioned. City vs small town. Small cohesive campus vs large urban. Lots of student/professor engagement in smaller classes from the outset vs larger classes and, being honest, not as much student/professor engagement.<br>Lewiston isn’t quite the faded mill town it used to be, but it’s not Boston, and it’s not quaint or charming. Certainly in the years that we’ve been visiting, it has improved dramatically and has plenty of fun places to eat, a nice river walk, a bird sanctuary next to the school, and easy access to outdoor activities. If being in a city is what you need, you won’t get that. However, many students go to Portland which is nearby, and it definitely has enough on offer to give you a city fix if you need it. Bates has shuttles that run to Portland, Freeport and even Boston.<br>I think the main reason for choosing Bates is pretty simple: smaller classes from the start and a lot of student/student and student/professor interaction. It’s likely you will have a superior educational experience at Bates. Getting to know professors well is a very important advantage. Good professor recommendations can be critical for research positions, scholarships, and internships.<br>I’ll address your question about name recognition and jobs. My D has a well paying job due to start in October. Meanwhile, she has a paid summer job too, doing analysis for a university. As an undergrad, she had an internship and a different summer research position, for which she received a grant from Bates.<br>Bates has an excellent reputation among those who are familiar, but like many LACs, it isn’t a household name. Though things recently ground to a halt, D’s fellow grads are being hired: a clinical research job at a hospital, an advertising agency job, a teaching job, working for an environmental group based in the West, working in biochem, and a finance job. In short, no, her friends haven’t been struggling to find jobs. One friend will be starting a prestigious year long scholarship program in the late fall. Hiring managers and grad school AO’s know about Bates.<br>You are interested in NE co-op program. My D had no trouble finding a summer internship as a sophomore, and as a junior, did summer research. Everyone she knew did something similar during their summers.<br>We know a lot of students who attend or have recently graduated from Northeastern. One had to spend her first semester in Greece. One graduated in 2019 and still doesn’t have full time employment. She did several really great co-ops as an undergrad, so I’m not sure why she isn’t employed now.<br>D’s two best friends from home have tried to graduate “on time” and every summer have taken online courses so that they can complete all their coops. (To be clear, they chose to do this because they didn’t want to get a degree in five years.) One managed it, the other is still taking summer courses online to finish her degree. All three students I know well say they disliked that their friends would disappear to do co-oops and you never knew if or when you might see them again, because everyone’s schedule is different. Two of her friends did co-ops that they felt were boring and “useless”. Of these students, only one is currently working.<br>Northeastern unquestionably has the upper hand if CS is something of interest to you. But you can check out what @merc81 was referring to on Bates’ website. https://www.bates.edu/digital-computational-studies/<br>It’s a new program, but I’m sure the standards are very high.<br>I am sorry to be negative about Northeastern, and I agree that for some, co-ops are clearly an excellent way to earn money and get necessary job experience. However, I wouldn’t say that the students I know at NE universally loved their undergrad experience, whereas the students I know at Bates have loved their experience and they are getting jobs.<br>I am not sure, at the end of the day, if the co-op programs make a big difference in students being able to get jobs over students who don’t do co-ops. Given the uncertainty of the economy at the moment, maybe co-ops will become much more important. Bates has enough of a reputation that I don’t foresee you’ll have trouble getting a job. I’m sure Northeastern grads are also getting good jobs, but I can’t help feeling that their college path may not have been quite as enjoyable.<br><br>", "<b>Username: ncelotto</b><br><br>@merc81 @PengsPhils My “ideal” job would be a Data Scientist or something similar. Couldn’t I, if I were to get in, major in mathematics at Bates and then get a Master’s degree in statistics/computational statistics? Most data scientists have a master’s degree, and mathematics, I have heard, is a very employable major, and can be combined with my career of interest. I think that even if I go to Northeastern, I would still be in the same position in terms of getting a Master’s degree if I wanted to go into Data Science. Does that sound right, or am I missing something? Also, would you recommend any other NESCAC schools that are good for statistics mainly, or computer science? All besides Amherst, Williams, Tufts, and Middlebury, as I would not be able to run track at those colleges due to my times not being good enough. Maybe Wesleyan, Colby, or Hamilton? I am basing my decision more on academics of course, but running track is a huge added bonus that I would love to take advantage of unless I am greatly missing out on an opportunity for my education somewhere else. Thank you both for your insightful responses!<br>@tkoparent I definitely believe Bates is well regarded now that I have heard from many people. And I have a meeting with the sprinting coach of Bates tomorrow. I would love to be part of a varsity track team. It’s unfortunate that COVID-19 is prohibiting myself from being able to visit college campuses, but I am trying to make the most of it!<br>@Lindagaf Thank you! Like I said earlier in this post, do you think it would be sufficient enough to major in mathematics here (if i got in) and then go on to get a Master’s degree in statistics/computational statistics, etc to hopefully become a Data Scientist or something similar? I have not gotten the chance to visit due to COVID-19, but Bates seems like it would be an amazing fit academically and athletically. The coaches seem very welcoming and great and I am highly intrigued by the small class sizes, ability to build a connection with the professors, and still the opportunity to get internships and experience during my undergrad.<br><br>", "<b>Username: Lindagaf</b><br><br>Sure, you can do that. If you enjoy stats, check this out: https://www.bates.edu/math-stat-workshop/<br>My D worked there. She has a very good foundation in stats now.<br><br>", "<b>Username: merc81</b><br><br>This brief, topical article comports with your understanding of data science, and suggests that the curricula at a range of schools, including Bates, could help you reach your career goals: https://www.hamilton.edu/news/story/shauna-sweet-03-shares-career-path-in-data-science. Note that data science appears to be a constantly evolving field, for which broader preparation may be an advantage, though even this interpretation remains uncertain.<br>With respect to NESCACs particularly strong in math/statistics, Hamilton, Bowdoin, Amherst and Williams appear in a Princeton Review sampling, “Great Schools for Mathematics Majors.” I believe Bowdoin lacks a statistics major/minor, however.<br>Among NESCACs strong in CS, Hamilton devotes significant resources to its program: https://www.hamilton.edu/news/story/comp-sci-department-hosts-college-computing-conference.<br>As additional suggestions, research Haverford and, as a geographical outlier, Carleton.<br><br>", "<b>Username: PengsPhils</b><br><br>@ncelotto<br>Data scientists come in various forms these days - there are the more math-focused ones, and there are ones that are more integrated into programming work. Basically, @merc81 hit it on the head that a broader skill set is advantageous and the field is still very much evolving.<br>A master’s degree is not a requirement to be a data scientist these days but will be helpful for more advanced work, like AI for one. I still ideally wouldn’t recommend waiting until grad school to touch that topic if you don’t have to.<br>If you know you interest is in data science and you’re planning to get a masters then yes, it would give you more time to develop those skills later and you’d be still in a decent position. If you feel comfortable doing that, go for it, but I don’t think you have to close that door to CS/AI possibilities right away if you pick a college that offers both strong math and CS/AI courses, which exist even among smaller schools that would still offer the environment you want.<br>I second the recommendations for [Haverford/b and Hamilton as schools that could offer exactly what you’re looking for.<br>LAC’s that offer both CS and AI: Trinity College<br>LAC’s that offer CS but no AI courses, a generally small CS department but likely sufficient: Wesleyan, Colby, Connecticut College<br>I did some cursory track googling but I’ll let you get into the weeds there. I also didn’t do an exhaustive search - I would again recommend looking at that link I posted and filtering by LAC’s, AI offerings, and athletic conference and see how many other matches you can find!<br><br>\"\"<br>I am highly intrigued by the small class sizes, ability to build a connection with the professors, and still the opportunity to get internships and experience during my undergrad.<br>\"\"<br><br>Bates is great in this regard of course, but so are many LAC’s in a similar caliber to it, along with offering a lot more in the way of CS/AI classes.<br>Basically, my point is this: I don’t think you need to limit yourself or lock into a school with ED, particularly if it’s not that “perfect” fit. It sounds like you need to make sure there’s a similar environment (small classes, good professor relationships, and a place you can ideally run track at) but can also then explore schools with more extensive departments in some of your possible interests. There’s no reason at this point in your search to lock into one school, and you may find that ED isn’t the right option for you for any school.<br><br>\"\"<br>On the other hand, I have also loved the CO-OP program at Northeastern<br>\"\"<br><br>Is there anything else that you liked about Northeastern? People have highlighted how different the schools are, but you haven’t said much on the matter, which might be able to help people recommend schools that offer other aspects you want.<br>As a Northeastern grad, I of course loved the co-op program too, but it was one of many parts of why Northeastern was what I wanted. So far, it sounds like those other aspects you want aren’t exactly the strength of large research universities and are best found at LAC’s, but we could all be missing details here.<br>@Lindagaf<br>I didn’t actually advocate for Northeastern in any of my posts in this case, but for what it’s worth, none of my friends have had any issues with employment in my graduating class (2019). The selection bias of successful students tends to also help paint a rosy picture in both directions though. Anecdota is just that - you have to look at the data. Both schools offer high postgrad placement rates.<br>All of this isn’t really relevant though - the question here is simply about if Bates is the right LAC depending on the level of interest in computer science / artificial intelligence given the limited offerings for the subject. Northeastern doesn’t seem to be the proper comparator here, but OP may be able to elaborate more on what they liked about Northeastern and people here can help translate that into school options that hit all the criteria!<br><br>", "<b>Username: ncelotto</b><br><br>@merc81 @PengsPhils I definitely agree with you guys. I think Hamilton would be a good fit as well, but what about Colby? I heard that they have a pretty developed mathematics/statistics program and they even have a data science minor. In terms of Northeastern, the co-op program is really the biggest factor in my eyes. Although it doesn’t have as many undergrads as most public schools, it still has a significant amount more than the LAC’s. But I am intrigued by their combined majors as well, one of which is Data Science and Behavioural Neuroscience, which I view would almost be perfect for what I want to do. I also love the Boston area, as I have been a few times. I have been in contact with one of their admissions officers since last year when he came to my school. It also has a lot of a capella groups that compete in the ICCA and others, which I am very heavily involved with at my high school (since I wouldn’t be running track at Northeastern, I would certainly join one of those). Also, they do have a club running team, which I could join, but I would definitely rather be part of a varsity team.<br><br>", "<b>Username: ncelotto</b><br><br>Wesleyan also has a data analysis minor I saw.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>If the OP were willing to look outside the Northeast, Denison has both Comp Sci and Data Analytics departments/majors, plus a Neuroscience concentration. It is 25 min from Columbus airport (for ease of transportation) as well as from lots of Columbus internship opportunities. D3 athletics. Acceptance rate is about 29%.<br>As a parent, I’d advise less worry about whether people have heard of a school (Bates, of course, is an excellent college), and more about whether a school meets a student’s needs – academically and otherwise. Framing the decision as between Bates and Northeastern seems unnecessarily narrow. Research coop programs, if those are of interest, such as Northeastern, Drexel. And research other LACs that will offer the academic programs of interest.<br><br>", "<b>Username: PengsPhils</b><br><br><br>\"\"<br>what about Colby?<br>\"\"<br><br>https://www.colby.edu/catalogue/PDF/?dept=DS<br>http://cs.colby.edu/<br>While Colby has an “official” data science minor, if you look at the requirements, you see it’s almost entirely courses from the math department that you should find analogs for at most LAC’s with good math programs, aka most schools discussed here.<br>As noted in my post and seen on the link above, Colby doesn’t have many AI-related courses, though they do have a decently extensive CS department in that they cover the basics. I did miss they have a Neural Networks class offered in Fall 2020, so based on all that, it sounds like a good option!<br><br>\"\"<br>I am intrigued by their combined majors as well<br>\"\"<br><br>Combined majors can be a bit of the same type of thing where the “official” name is more reflective of priorities than unique coursework. While Northeastern does offer extensive classes in both areas (more than LAC’s will offer), you can likely get close with a strong math/stats + CS/AI + neuroscience/cogsci department and enough flexible requirements. Most LAC’s will offer enough room to make your own combined degree there, but they need to have enough classes in all three departments.<br>To really dive into this, you can basically do what I’m doing: look up course catalogs and faculty size in all three areas and ensure they aren’t too limited. The next step is to look at degree requirements and see how much flexibility you have, or if the school offers a “make your own major” option. Even if they don’t, having all three subjects means that your college choice won’t limit your career or interests if they do change. If you take a CS course and decide you love it, you can then easily switch. Same for neuro/cogsci. It keeps your options open!<br><br>\"\"<br>Boston, acapella, etc<br>\"\"<br><br>That does sound good and maybe worth an application, but it’s worth noting how different the experience is from a LAC. Northeastern’s focus is very much on practical aspects given co-op and the preprofessional vibe isn’t for everyone,. You won’t get as much natural attention from profs, though it can be sought out. Class sizes will mostly be on the order of 50-100 (and things like gen chem goes as high as 200) rather than 10-20 or 20-40. It would seem to be in conflict with other things you want, but of course there are ways for both to be true so please consider it for yourself.<br>Point being, while you can likely find good things at a lot of schools, you have to consider the larger picture (hard to do without visiting, I know :/). I loved my time at Northeastern precisely because I wanted the practical focus, the city campus + lifestyle, and it has a great program for my major. But for example, even though there are some LAC’s with great rock climbing clubs (something I enjoy), it wouldn’t have made up for the rural locations of LAC’s for me personally. You need to find what are the most important aspects in your search and prioritize those <br>I also agree on geographic expansion if you can - there are a lot more options out there that come into play.<br><br>", "<b>Username: ncelotto</b><br><br>@PengsPhils @Midwestmomofboys @merc81 @Lindagaf @tkoparent @ThisNameNotTaken @helpingmom40 Let’s say we take Northeastern out of the picture for right now a focus on the LAC’s. I have reached out to a good amount of LAC coaches for track and field:<br>Bates: I LOVE the coaches, the campus (from what i’ve seen on virtual tours), is one of the nicest ones I’m considering, its a NESCAC school (pro for me), but it lacks a comp sci and statistics department (even though a lot of math classes includes statistics concepts, which I assume is similar to most math majors at all schools).<br>Wesleyan: It is in-state for me, so I am VERY familiar with the area, also a NESCAC school, I can major in mathematics/comp sci as well as minor in data analytics (but I’ve heard it is VERY liberal. I haven’t mentioned this yet, but I’d prefer a school that is more neutral, but it isn’t too much of a big deal; just a bonus I guess).<br>Bowdoin: Coach seems great, AMAZING campus, NESCAC, but it doesn’t have a real statistics department. It seems to be the most well-known and highest ranked school that have said “yes” to me, but I’m not too sure if that matters too much.<br>Hamilton: The coach hasn’t responded back yet (emailed him a few days ago), NESCAC, my friend is going there for tennis next year and he loved the campus and everything about the school, and it really does offer most/all the majors I’m looking for.<br>Grinnell: The coach is pretty nice (he said that if I decide to go with Grinnell, he will “help” me get in; give me assistance in admission which is super good). It has all three majors (comp sci, math, statistics). But, it is the one that is not in New England, not in NESCAC. I’m not too sure I want to leave New England, but nonetheless it is a great school.<br>I was also looking at Williams, Tufts, & Middlebury, but none have responded yet and their times may be a little bit too high anyway.<br>I believe that all of these schools are pretty similar in terms of prestige and academic rigor (maybe Bowdoin is a bit above the rest (not including Williams, Tufts, & Middlebury)). So that is not too much of a worry. But from what I’ve said about these schools, what you know (if I were to get into whichever one I choose), which looks like the best fit? Which one looks like the worst? Are there any that seem like a DEFINITE compared to the others? Any that seem like an obvious NO? Given both my athletic and especially academic interests. It’d be great if I could get responses from different people because I am currently so torn!<br><br>", "<b>Username: merc81</b><br><br>For a brief opinion-post on several of your LACs of interest, see reply #12: https://talk.collegeconfidential.com/college-search-selection/2123956-p1.html.<br><br>", "<b>Username: tkoparent</b><br><br>Maybe @homerdog can provide her perspective - her S19 runs track for Bowdoin.<br><br>", "<b>Username: ThisNameNotTaken</b><br><br>The academic fit is something only you can figure out, but Tufts is the most “one of these things is not like the others”.  Well except that Grinnell is in Iowa.  To me the others are all roughly equivalent, with the main differentiator being location.<br>One thing I will say, having visited both Wesleyan and Bates, is that Bates (and maybe this is the administration more than the students) seemed a lot more liberal than Wesleyan, which I was not expecting.  Maybe it was because we visited Bates on “Indigenous Peoples’ Day”, so they had a few events going on.  Some of the emails we have gotten from Bates also struck me as a little “out there”.  FWIW I’m a 60 year old white guy who self identifies as slightly left of center politically.  I was expecting Wesleyan to be a lot nuttier than it turned out to be.<br>40 ish years ago I was a kid from Connecticut who ended up going to college in Maine (Colby).  I just love Maine to pieces and might end up retiring (say it ain’t so) there.  If you are considering Bates you should try to visit if you can, since Lewiston is an acquired taste, and the campus is pretty much right in it.<br>Of the 3 CBB schools, Bowdoin definitely has the nicest town (Waterville is kind of “Lewiston-lite”, but a couple of miles away from the Colby bubble).  From what I have heard Hamilton, Williams and Middlebury are, in varying degrees, in the middle of nowhere.  Don’t quote me on that, though.<br><br>", "<b>Username: homerdog</b><br><br>@ncelotto Hi there. S19 is a XC and track runner at Bowdoin. Math major but really not sure what he’d like to do with that. He’s interested in physics, too, and loves the idea of doing “something” for NASA but hasn’t dug deep into that yet. He also thinks he’d consider going into consulting or working for any company that’s interesting to him in some sort of analyst role (but no finance/banking). Obviously, he’s still working on long term plans. In the meantime, he’s always been a strong math student and has really liked the math classes at Bowdoin and his professors have been great - supportive and very available for help but also to mentor him. He passed out of all Calc so started in Linear Algebra and then took a Math Reasoning class (required for the major).  Now he’s free to dabble a bit in the math department. Below is the link to the math department’s website. You can see, if you scroll down, suggestions within the major for specific interests. There is one for stats.<br>https://www.bowdoin.edu/math/requirements/index.html<br>I do not know anything about data analytics. Maybe another poster can look at the link and comment. Of course, there are lots of courses in the comp sci dept too. S19 wants nothing to do with them. He has to find out if there’s any minimum comp sci classes he should take for his career goals but, for right now, is avoiding them. Lol.<br>He loves the XC and track teams. He bonded with them immediately and they really are great kids. Bright, friendly, focused kids.<br>PM me if you have specific questions. Happy to try to answer.<br><br>", "<b>Username: homerdog</b><br><br>https://www.bowdoin.edu/computer-science/requirements/index.html<br>Here’s info for Bowdoin’s Comp Sci dept. Looks like there are a handful of AI classes.<br><br>", "<b>Username: merc81</b><br><br><br><br><br> ThisNameNotTaken:<br>\"\"<br>From what I have heard Hamilton, Williams and Middlebury are, in varying degrees, in the middle of nowhere.<br>\"\"<br><br>Note that Hamilton is classified as suburban by some sources and offers convenient access to suburban amenities and small-urban features.<br>https://www.newsweek.com/25-most-desirable-suburban-schools-71867<br>https://www.hamilton.edu/campuslife/transportation/the-jitney<br><br>", "<b>Username: CheddarcheeseMN</b><br><br>Related to @merc81’s comment #7 and the OP’s interest in data analytics and Bates, does anyone know about the future plans for the digital and computational studies minor that they were planning but it looks like it hasn’t gotten off the ground yet?  There seems to be some oddness related to the guy they brought in to start the program and after two years he left<br>Edited to add: https://www.bates.edu/news/2018/03/29/bates-digital-and-computational-studies-for-all-our-students/<br>https://thebatesstudent.com/17854/news/what-happened-to-dcs/<br>It’s strange that someone who had a named professorship and presumably was tenured (?) would describe himself on his personal website as “looking for work.”<br><br>", "<b>Username: ncelotto</b><br><br>@CheddarcheeseMN Do you think that, lets say the program is definitely growing into something good, it would be enough for the career I want to end up with? I know its hard to say, but if I paired that up with a mathematics major, do you think that would be good enough?<br><br>", "<b>Username: ncelotto</b><br><br>@homerdog I personally love the Bowdoin campus and area (from what I’ve seen online). The coach said that they don’t give any help in the admissions process to future potential athletes (only to a select few), but he said that if I were to get in then I would have a spot on the team. I’m a bit worried by their 9% acceptance rate and overall difficulty to gain admission, as the other coaches I have talked to would all like me to apply ED in order to receive help from them for admission. I’m not sure if I would want to risk that much for Bowdoin, when I would have a MUCH better chance at a school like Bates, Wesleyan, etc for they would be able to help me gain admission plus a higher general acceptance rate.<br><br>", "<b>Username: ThisNameNotTaken</b><br><br><br><br><br> merc81:<br>\"\"<br><br><br><br> ThisNameNotTaken:<br>\"\"<br>From what I have heard Hamilton, Williams and Middlebury are, in varying degrees, in the middle of nowhere.<br>\"\"<br><br>Note that Hamilton is classified as suburban by some sources and offers convenient access to suburban amenities and small-urban features.<br>https://www.newsweek.com/25-most-desirable-suburban-schools-71867<br>https://www.hamilton.edu/campuslife/transportation/the-jitney<br>\"\"<br><br><br>Now…you cut out the part where I specifically said “Don’t quote me on that, though.”  I did actually look it up on a map, though.  I stand corrected, since I guess Utica is pretty close.  North Adams is kind of close to Williams.  Middlebury, uh…<br><br>", "<b>Username: theloniusmonk</b><br><br>In terms of a college where academics and athletics are equally important,  you should probably give more consideration to colleges where you feel comfortable with the coach, maybe the team, if you have a chance to meet them, even virtually.<br>“but it doesn’t have a real statistics dept”<br>I just perused Bowdoin’s website and they may not have a stats dept but they do have this digital and computational major which has courses that cover AI, stats etc, you probably should take a deeper look at some of the college’s offerings.  I may lean to Bowdoin based on what you’re looking for.<br><br>", "<b>Username: merc81</b><br><br>@ThisNameNotTaken: I wasn’t sure how to post that diplomatically. After considering various ways to address that I was indeed “[quoting you] on that,” I decided to keep my post simple just to get the information across. <br><br>", "<b>Username: CheddarcheeseMN</b><br><br><br><br><br> ncelotto:<br>\"\"<br>@CheddarcheeseMN Do you think that, lets say the program is definitely growing into something good, it would be enough for the career I want to end up with? I know its hard to say, but if I paired that up with a mathematics major, do you think that would be good enough?<br>\"\"<br><br>Regarding Bates and the mystery behind their digital and computational studies program, yes I think it would be a great program to add to a math major.  You should ask them if that digital studies program will be an approved minor and when.<br>Many people going in to data science masters (especially the predictive analytics type programs) are not going to be CS majors.<br><br>", "<b>Username: homerdog</b><br><br><br><br><br> ncelotto:<br>\"\"<br>@homerdog I personally love the Bowdoin campus and area (from what I’ve seen online). The coach said that they don’t give any help in the admissions process to future potential athletes (only to a select few), but he said that if I were to get in then I would have a spot on the team. I’m a bit worried by their 9% acceptance rate and overall difficulty to gain admission, as the other coaches I have talked to would all like me to apply ED in order to receive help from them for admission. I’m not sure if I would want to risk that much for Bowdoin, when I would have a MUCH better chance at a school like Bates, Wesleyan, etc for they would be able to help me gain admission plus a higher general acceptance rate.<br>\"\"<br><br>These are exactly the words that were spoken to S19. He was admitted in RD. He was not recruited to run. Two of his XC friends were recruited in ED but only two. We really don’t even know how much his running mattered in RD. He will never know. He was a strong candidate otherwise.<br>But, yes, RD to Bowdoin is a risk with such a low acceptance rate. Our high school hardly ever gets anyone in. He was thrilled.<br>I do not know how much ED will help you to Bowdoin if you aren’t being officially recruited. One of the other boys on the team applied ED but wasn’t being recruited. Was deferred but got in RD. Again, he doesn’t know if running helped at all.<br>Your best bet is to get attention from a coach and he wants to support you in ED and then you really like that school. Short of that, you can take a risk and hope a coach puts a little tip in for you in admissions but you cannot count on that. I know it’s hard to make that decision.<br><br>", "<b>Username: Lindagaf</b><br><br>@ThisNameNotTaken ,<br>Knock me down with a feather, haha! That’s not the Bates I know at all. I honestly would never say I’ve had a single communication from Bates that was anything out of the ordinary. Maybe it was indeed just the day you visited. Lewiston is modest, no question. As I said before, it’s much improved over the last four years. As for the administration, they’ve been doing a great job. They have made excellent improvements in my daughter’s time there and Clayton Spencer has a superb pedigree and is the best thing that’s ever happened to the school.<br>I believe the brand new Bonney Science Center is scheduled to open in Fall 2021. They plan to offer more STEM based majors and have been actively expanding those offerings. Given the current situation, I’d call or email admissions and ask these questions in more detail.<br>Bates was founded by abolitionists and was the first college in New England to admit women. There has never been Greek life on campus. If I want to sum up Bates in one word, I’d say it’s inclusive. It is liberal, with, IMO, a good mix of kids. Some outdoorsy types, urbanites, nerds, preppy kids, arty kids, regular kids, maybe a few social justice warriors, (but not known for that). When I was last on campus, I saw guys riding longboards, and some kids were floating around in a giant inflatable flamingo on Lake Andrews. It’s know for being relaxed and friendly, and is also regarded as the more “arty” of the Maine NESCAC’s.<br>OP, you can major in Math at Bates. You could also create a Stats major. I know nothing about stats, but the link I gave earlier should give you more info. I can tell you that what my D has learned about stats has been crucial to her getting a research position and two jobs, for what that’s worth.<br>I’ll give you my daughter’s perspective on other schools you listed, which she either visited or considered. Bear in mind, academically all of these colleges are excellent. You will get a great degree from any of them, and they will all have good math departments, but they won’t all offer stats as a major.<br>I love Wesleyan, and I think it’s a great school for creative, media-minded, social justice warriors and lefty intellectuals. Back in the day, it probably would have been the place for me, but my daughter thought it was too much. She thought the campus was a hodgepodge of buildings.<br>Bowdoin is a great school. Nice town. I love the little Arctic Museum on campus. My D didn’t like it as she thought it looked like a big cemetery (go figure.) It’s going to be the hardest to get in, apart from Williams, if you decide to apply.<br>Hamilton leans a little more conservative compared to Bates and Wesleyan. Lovely campus. Has an open curriculum, academically rigorous. I liked it, but my D felt it was too preppy.<br>Colby is also excellent, but was a little too preppy for my D, which at that time in her life, she wanted to avoid. Beautiful campus. Many people, including me, would say that Bowdoin, Colby and Bates are more alike than they are different. There is a friendly rivalry between the three. Once they’ve all graduated, they respect each other as Maine NESCAC’ers. It is not uncommon to see in the Weddings section of the Bates magazine that a Bates grad has married a  Bowdoin or Colby grad.<br>Grinnell is, by all accounts, an excellent school with a cool student body that is creative and intelligent. I haven’t visited. My understanding is that the students are not dissimilar to Wesleyan students. It’s highly regarded. And as for Iowa, I think as is the case with most LACs, you will spend most of your time on campus, so it doesn’t matter too much if it’s in Iowa.<br>We loved Tufts. Great location. Nice kids. I think it has a similar student body to Bates, but obviously much bigger. D didn’t get in, sadly.<br>D never considered Williams or Middlebury. Williams is “old-money” and prestigious. Considered by many to be the Harvard equivalent of LACs. Middlebury is probably similar in vibe to Bates or Bowdoin. Quite outdoorsy, good environmental science program. Yes, both are pretty isolated, but I always think your best bet is to look at the freshman retention rate. Kids are happy, despite the isolation.<br>There is a lot of overlap in kids applying to these colleges. You aren’t going to go wrong with any of them. Get a Fiske guide and look at the website Niche to get better ideas of these colleges.<br><br>", "<b>Username: homerdog</b><br><br>For what’s it’s worth, I know two students at Midd. Both think the bro-culture at Midd is more prevalent than at the other NESCACs.<br>Also, if you are looking to run, their team is very very competitive. Certain events have won at nationals. I would check your times versus the Middlebury times. I don’t know if they have as many walk ons as the other NESCACs.<br><br>", "<b>Username: merc81</b><br><br><br><br><br> Lindagaf:<br>\"\"<br>OP, you can major in Math at Bates. You could also create a Stats major.<br>\"\"<br><br>As far as I can tell Bates’ math department offers one advanced course in probability and one advanced course in statistics. Though these courses appear to be taught at a notably high level (multivariable calculus is indicated as a prerequisite), they would fall short of the minimum of courses needed for even a statistics minor.<br><br>", "<b>Username: ncelotto</b><br><br>@Lindagaf thank you so much, very insightful. I will take everything into consideration.<br>@homerdog yes, Middlebury has won the conference for the past 2 years in mens track and field. I don’t think I would be able to run at the school (and the coach has not responded to the email I sent out).<br><br>", "<b>Username: Lindagaf</b><br><br>OP would have to talk to Bates if he is serious about pursuing stats. I know at one point my D thought about trying to pursue a major not offered at Bates and they said they could do it. She didn’t go any farther. I don’t think creating a major is ideal for most students and Bates might not be right for him if he wants to do that.<br>I don’t know what, if any, new courses might be on the horizon with the opening of the the new science center and the Covid situation. Good questions for the math department too.<br><br>", "<b>Username: merc81</b><br><br>As a general comment, I’m in favor of interdisciplinary concentrations when the requisites are present in the general curriculum. For example, a student, under guidance, could create a major or minor in data science through, if available, appropriate courses in computer science, math and statistics. For this reason, I think @ncelotto should seek colleges that offer strong academic programs across several core areas, particularly those just mentioned. Along these lines, pursuing a data science major/minor specifically may counterproductively limit his choices. For a branch of mathematics such as statistics, however, the courses essential to a major or minor would either be present in sufficient quantity and depth or not, excepting in the case of independent study.<br><br>", "<b>Username: lookingforward</b><br><br>I wouldnt call Bates rural or dry.<br>The issue is where you can satisfy your running interests while preparing for the future you want, including your other personal interests (city kid vs smaller urban area.)<br>I don’t know why discussions of Bates so often turn into pitches for Bowdoin and a few certain others. Different schools. In many cases on CC, it’s done before even seeing if a kid has a reasonable chance.<br>I’m also a Bates parent (two kids are alums) and neither of mine would have settled happily at Bowdoin.<br><br>", "<b>Username: theloniusmonk</b><br><br>I had not idea what a stats minor even looked so I just googled it at Berkeley and it’s basically five courses, which is consistent with other minors:<br>basically two required classes - Concepts of Probability or Probability for Data Science<br>Concepts of Statistics<br>3 STATISTICS ELECTIVES (at least one course must have a lab). Choose from:<br>(lab) Data, Inference, and Decisions<br>Stochastic Processes<br>Linear Modeling: Theory and Applications<br>(lab) Sampling Surveys<br>(lab) Introduction to Time Series<br>(lab) Modern Statistical Prediction and Machine Learning<br>Game Theory<br>Seminar on Topics in Probability and Statistics<br>The Design and Analysis of Experiments<br>(lab) Reproducible and Collaborative Statistical Data Science<br>The issue with the colleges being discussed would be the electives - I think the colleges with the computational major should allow you to get three from that list, especially as I saw courses in modeling, AI, to create a minor a NESCAC college.<br>A course with lab or fieldwork definitely is a good idea btw.<br><br>", "<b>Username: ncelotto</b><br><br>@Lindagaf @merc81 I sent an email out to the admissions office, asking them about the opportunities I would have with statistics, mathematics, and computer science. They are out of office during the weekend so I’m hoping to get a response back tomorrow.<br><br>", "<b>Username: merc81</b><br><br>As part of your research, make sure you read, in particular, the second article that @CheddarcheeseMN posted in #24 (if you haven’t already done so) for inside perspectives on Bates’ Digital and Computational Studies program. Keep in mind that DCS — even if it were fully implemented — and CS represent different types of programs. If you would like access to a range of traditional CS courses, note that Bates does not appear to offer this in its curriculum.<br><br>", "<b>Username: tkoparent</b><br><br>In case it’s helpful to your thinking process, I remembered this article I read in the most recent issue of the magazine my son’s school (Denison) sends to parents.  It profiles some of the students who have participated in the school’s relatively new Data Analytics program and how they are combining data analysis with their other areas of interest.  https://denisonmagazine.com/current-issue/  I understand you are focusing on schools in the Northeast, but I thought the profiles were very interesting.   It’s kind of an LAC approach to data!<br><br>", "<b>Username: bremcclarey</b><br><br>@ncelotto Hi! Northeastern student here (3rd year, also work for admissions)…even though I’m late to the conversation. Not sure if NU is still top on your list but if you’re interested in CS/data science or BNS, NU is extremely strong in those programs. NU had the first college ever in the nation dedicated to computer science, and recently received a $50 million endowment to the computer science college. My boyfriend studies computer science with a concentration in AI, and he loves the program here. The professors are top notch and the co-ops within CS are AMAZING. Also, I think its worth noting that wile CS classes at NU might be higher than at Bates, the average class size at NU is only 24, so you still really get to know your professors and other students. There is also a CS Living Learning Community if you’re interested in living with other people within your major. Like I mentioned, the co-ops for CS students are absolutely incredible (not to mention they pay up to $40/hr). I have a friend who is CS and his second co-op is at NASA out in California where he’s working with data that’s coming back from the Mars Rover. There are great opportunities to work with companies that are well established (Google, Amazon, NASA, etc.) or smaller, start-up companies.<br>Obviously there’s more to consider when choosing schools than JUST academics, but realistically you’re there to get an education. In terms of how big the schools feels, it honestly feels like the PERFECT size. Technically there are around 18,000 undergrads, but I promise you it does NOT feel that big. With students coming and going for study abroad, co-op, etc, not all of those 18,000 are ever on campus at the same time. Especially when you join clubs and make friends in your classes and dorm, the university will not feel that big. While walking to class I always see people I know!<br>Hope this helps at all, feel free to reach out with any more questions!<br><br>", "<b>Username: ncelotto</b><br><br>@bremcclarey thank you so much! I LOVE Northeastern and it is still one of my top schools, this is very helpful.<br><br>"]}