{"title": "barnard vs northwestern vs jhu ed", "comments": ["<b>Username: kmmysrdscrnnm</b><br><br>Hey all, I’m conflicted on what school I want to apply to ED1. Barnard is the only one of the three that I’ve visited and I loved it, but b/c of COVID I probably won’t be able to visit any more. Assume cost is not an issue, and my stats give me a good shot, but not a definite at getting into any of the schools ED. I’m interested in double majoring in English and Chem or CS on a pre-med track. I really want an urban campus (I grew up in a really big city and I don’t want to spend time stuck on campus).  Thank you so so so much.<br><br>", "<b>Username: Publisher</b><br><br>3 great target schools assuming that your stats are in line.<br>For double majoring, Northwestern University is among the best for double or triple majoring & for ease of switching majors. Strong in all of your areas of interest. Spectacular setting on the shores of Lake Michigan. However, NU is not urban; it is suburban with very easy access to Chicago. NU’s law & medical schools are located in a very upscale area in Chicago across the street from Lake Michigan.<br>Barnard College has NYC & Columbia University.<br>JHU has the least desirable location among the three, but outstanding students, reputation, & academics.<br>No wrong choice based on your desire to have access to a major city.<br><br>", "<b>Username: happymomof1</b><br><br>Why do you feel you must apply anywhere ED?  Start with that.<br>You have three top-ish places on your list.  One would need to be your far-and-away first choice in order to merit an ED application.<br><br>", "<b>Username: Bill_Marsh</b><br><br><br><br><br> happymomof1:<br>\"\"<br>Why do you feel you must apply anywhere ED?  Start with that.<br>You have three top-ish places on your list.  One would need to be your far-and-away first choice in order to merit an ED application.<br>\"\"<br><br>Stats suggest that chances for admission are better ED.<br>I agree that all 3 are great choices. For someone who wants to be in a big city, Barnard makes the most sense to me.<br><br>", "<b>Username: Publisher</b><br><br>Much better odds of admission to Northwestern for ED applicants.<br><br>", "<b>Username: merc81</b><br><br><br><br><br> Bill Marsh:<br>\"\"<br>For someone who wants to be in a big city, Barnard makes the most sense to me.<br>\"\"<br><br>I concur.<br><br>", "<b>Username: momofsenior1</b><br><br>NU is in a super location but definitely not downtown Chicago.     If you are looking for urban, that’s not it.<br><br>", "<b>Username: IWannaHelp</b><br><br>Between NU and Barnard, I guess it really depends on how important you need to be in the middle of the city 24/7.  Evanston is a suburb but it’s a fairly urban and walkable one (there are a few high-rise buildings and many restaurants/retails in its small downtown). There are subway or intercampus shuttle to Chicago (NU has a downtown Chicago campus for its law/med schools) so you wouldn’t be stuck on campus.<br>I wouldn’t recommend JHU if you need to be in/near a major city. Baltimore would probably be too small for you…<br><br>", "<b>Username: kmmysrdscrnnm</b><br><br>Hey y’all, thanks for ur advice.  I’m planning to apply early to a school because it increases my odds of admissions. Anyway, I think I probably will not apply early to JHU based on what you guys said about Baltimore + I’m looking to major in English too, and JHU is certainly more STEM oriented. So I have a follow-up question, do you think northwestern’s name recognition/“prestige” is a lot higher than Barnard?<br>Based on rankings they’re obviously very different, but in y’all’s perspective would I be remiss to ED to Barnard instead of NU?<br><br>", "<b>Username: bluebayou</b><br><br><br><br><br> merc81:<br>\"\"<br><br><br><br> Bill Marsh:<br>\"\"<br>For someone who wants to be in a big city, Barnard makes the most sense to me.<br>\"\"<br><br>I concur.<br>\"\"<br><br>Me too.<br><br>", "<b>Username: theloniusmonk</b><br><br>“So I have a follow-up question, do you think northwestern’s name recognition/“prestige” is a lot higher than Barnard?”<br>A lot of prestige comes from the grad schools , and I don’t think Barnard has any grad programs that aren’t tied to Columbia or other universities.  However even in these covid times, you don’t want to ED a place you haven’t visited.<br><br>", "<b>Username: happymomof1</b><br><br>At the undergrad level, yes Barnard has nearly unbeatable prestige.  But if you like NU better for your potential major, or if you are iffy about the whole notion of a women’s college, then NU could be a better choice.<br><br>", "<b>Username: Publisher</b><br><br>With respect to prestige, Northwestern & Johns Hopkins are more prestigious because they are research universities with renowned graduate / professional programs.<br>But, in my opinion, prestige should not be a significant factor in your decision based on your postings. If it is, then consider that Barnard is affiliated with Columbia University.<br>If you prefer Barnard College, then apply ED to Barnard.<br><br>", "<b>Username: whidbeyite2002</b><br><br>A lot of people think of JHU for its STEM and premed programs. However, JHU has renowned humanities and writing programs as well. That said, I would probably lean toward Barnard for ED if you believe you must apply ED and the smaller, all-women, very urban campus is for you. Still, you would be able to take courses at coed Columbia. Wishing you the best!<br><br>", "<b>Username: Bill_Marsh</b><br><br>Not only is Barnard affiliated with Columbia, but the degree for Barnard grads is awarded jointly by both Barnard and Columbia, so it is legitimate to list your degree as from Columbia.<br><br>", "<b>Username: theloniusmonk</b><br><br>Looking at both English and Chemistry, I think Northwestern would be better, especially if you want to double major.  Again, I’m not a big fan of ED in general as it only benefits the college at the expense of the student, but I would be even less of a fan if a student didn’t visit the college.  I’ve been to Evanston and Morningside Heights in NYC a few times, they’re different campus feels.<br><br>", "<b>Username: collegemom3717</b><br><br>I really wish JHU would post stats on the # of first year pre-meds and the number of actual who actually go to med school. About 12 or 13% of the class goes to Medical/Dental/Vet school- so, ~190/~1475 student. Any guesses as to how many of those ~1475 started out as pre-med??<br><br>", "<b>Username: merc81</b><br><br><br><br><br> whidbeyite2002:<br>\"\"<br>A lot of people think of JHU for its STEM and premed programs. However, JHU has renowned humanities and writing programs as well.<br>\"\"<br><br>Note JHU’s inclusion in this article: https://contently.net/2014/11/06/resources/10-best-colleges-creative-writers/amp/.<br><br>", "<b>Username: kmmysrdscrnnm</b><br><br>Although I’m planning to go to grad school, I want to spend some time working between undergrad and grad school. Do you think Barnard or Northwestern would have better connections/job preparedness?<br><br>", "<b>Username: theloniusmonk</b><br><br>\"Any guesses as to how many of those ~1475 started out as pre-med?? \"<br>It’s hard to get information for a private university as they don’t typically declare majors until sophomore year and don’t release that kind of info either.  You have to use student surveys, I recall one for Stanford that said about 20% started out as pre-med.  I would think for JHU that number could be higher, maybe 25 or 30%, putting the pre-med at say 300, so 190 would mean 35% were weeded out.  Also the AAMA had 420 or so applicants from JHU to med school in 2019, but that includes grads who took gap years before applying.<br>“Do you think Barnard or Northwestern would have better connections/job preparedness?”<br>Northwestern for sure, but if you can use Columbia alumni, it would even out.<br><br>", "<b>Username: collegemom3717</b><br><br><br>\"\"<br>Do you think Barnard or Northwestern would have better connections/job preparedness?<br>\"\"<br><br>No.<br>Both will have more than you could ever take full advantage of, and for both it is up to you to make the most of them.<br>Trying to figure out the quantitatively “better” choice between those two schools is a fool’s errand: irl you are the relevant variable. Make your best estimate, based on what you know about yourself- your strengths / weaknesses / preferences -and then commit to making that choice be the best choice for you- which is the only thing that matters.<br><br>", "<b>Username: Bill_Marsh</b><br><br><br><br><br> collegemom3717:<br>\"\"<br><br>\"\"<br>Do you think Barnard or Northwestern would have better connections/job preparedness?<br>\"\"<br><br>No.<br>Both will have more than you could ever take full advantage of, and for both it is up to you to make the most of them.<br>Trying to figure out the quantitatively “better” choice between those two schools is a fool’s errand: irl you are the relevant variable. Make your best estimate, based on what you know about yourself- your strengths / weaknesses / preferences -and then commit to making that choice be the best choice for you- which is the only thing that matters.<br>\"\"<br><br>Well said!<br>I second that emotion.<br><br>", "<b>Username: Publisher</b><br><br>I agree in part & disagree in part with the above statement.<br>While it is most important to find a school which is a fit for your goals, interests, and personality, often those goals include job placement & career opportunities and there clearly are schools which offer superior job placement & alumni connections.<br><br>", "<b>Username: collegemom3717</b><br><br>absolutelyl, @Publisher - but not the case for these two schools, for this student.<br><br>", "<b>Username: theloniusmonk</b><br><br>“Make your best estimate, based on what you know about yourself- your strengths / weaknesses / preferences”<br>Sure, but one of her preferences is connections and job preparedness, in fact job opportunities is one of the biggest factors in choosing a college.  Here are the top 5:<br>academic reputation<br>colleges graduates get good jobs<br>FA<br>cost<br>campus visit<br>\"Trying to figure out the quantitatively “better” choice between those two schools is a fool’s errand: \"<br>That’s what lot of people do, a fools errand would being judging a kid based on his or her priorities.  The first four are all quantitative, it’s only the campus visit that gets into fit.<br>\"best choice for you- which is the only thing that matters. \"<br>The OP came here asking for advice between three colleges, two of which she hadn’t visited, throwing it back to the OP is not helpful, imo.<br>“but not the case for these two schools, for this student”<br>The OP asked which school was better for connections, so it is somehwhat important to her.  My suggestion was that for pre-med, reputation was a wash, connections would favor Northwestern and campus fit would favor Bernard.<br><br>", "<b>Username: collegemom3717</b><br><br><br>\"\"<br>connections would favor Northwestern and campus fit would favor Bernard.<br>\"\"<br><br>Ok, show your work: why, in your view, are connections better at NU than Barnard?<br>The point is that the OP has narrowed her choice down to 2 places, and then asked specifically about which was better for connections and job preparedness. In my  opinion, there is no significant difference between those schools on those metrics: both schools will be excellent in both categories. At that point, trying to identify one as quantifiably “better” in those categories is a fool’s errand- a pointless task.<br>Making a choice of college is scary for most kids: it is a huge deal in their life. A lot of students are anxious about making such a big decision, and especially about making the “right” decision. No applicant ever has perfect information, and this year many will have less than they expected.<br>But at the end of the day, the OP will have to trust herself. Suggesting that she think- hard- about what kinds of environments have worked for her, and what haven’t /  what things she knows about herself that she can hold up next to each place and see if one ‘fits’ better than the other / thinking about what she prefers-  isn’t ‘throwing it back’ on the OP. It says  \"there is no ‘wrong’ answer here, and 'you know more than you think you do about what works for you-  trust yourself<br><br>", "<b>Username: theloniusmonk</b><br><br>“Ok, show your work: why, in your view, are connections better at NU than Barnard?”<br>Barnard says it has 31,000 alumni, I couldn’t find the same stat on NU’s website, but other say sources say it’s around 200,000.  On LinkedIn, the number of Barnard alumni and students is around 22,000, Northwestern is at 161,000.    NU is a bigger school so you have to take that into account, and how many alumni come from the grad schools.  ex - the NU school of medicine has 6500 alumni on L/I…  And quality of connections is not only how many, but are they in the field you plan to get a job in, how helpful they are.  That, I can’t really comment on for both schools.<br>My other statement is that Barnard is the better fit campus because OP wants a more urban campus and OP has visited and really liked the campus.  You didn’t want me to defend this statement though, any reason or is it as obvious to you that Barnard is better for campus fit as it is to me that NU is the better choice for connections?<br>“there is no significant difference between those schools on those metrics: both schools will be excellent in both categories”<br>but the schools have different strengths and weaknesses, NU would be more pre-professional, larger, suburban, Barnard, smaller, in the city and a broad liberal arts and science education.<br><br>", "<b>Username: Bill_Marsh</b><br><br>Columbia.<br><br>", "<b>Username: IWannaHelp</b><br><br>@Bill Marsh<br><br>\"\"<br>Not only is Barnard affiliated with Columbia, but the degree for Barnard grads is awarded jointly by both Barnard and Columbia, so it is legitimate to list your degree as from Columbia.<br>\"\"<br><br>I am not so sure about the legitimacy. You never know how others may feel about that if they find out.  Technically, it’s really not part of Colubmia.  I don’t know why you are so into the idea of a Barnard student pretending to be a Columbia student.  If you were that Barnard student, not only would Columbia students dislike you for perpetuating that “lie”, but your fellow Barnard students would dislike you for not being proud of your own school.<br><br>", "<b>Username: IWannaHelp</b><br><br>@theloniusmonk<br>I agree with you that it’s hard to compare “connection”.  That said, certain employers only recruit in schools that are large enough for them to recruit. It’s about making the most out of limited recruiting resources they have. I just did a LinkedIn search for Apple, Amazon, Microsoft, Bain & Co, Boston Consulting Group and I noticed that even adjusted for size, Northwestern is noticeably more represented in those company.<br><br>", "<b>Username: Publisher</b><br><br>Agree that the Barnard / Columbia connection is not as smooth as some suggest.<br><br>", "<b>Username: momofsenior1</b><br><br>Just a side comment that these schools are all reaches.    OP should be spending the majority of their time finding match and safety schools if ED doesn’t pan out.<br><br>", "<b>Username: bluebayou</b><br><br><br>\"\"<br>Technically, it’s really not part of Colubmia.<br>\"\"<br><br>Barnard claims that it is ‘part’ of Columbia (but its not owned by Columbia, i.e., Barnard makes up its own curriculum and owns own buildings):<br><br>\"\"<br>Founded in 1889 as a college for women closely affiliated with the then all-male Columbia University, Barnard College is a self-sustaining entity under the Columbia umbrella. Located right across Broadway, we’re one of the University’s four colleges,…<br>\"\"<br><br>The diploma references both Barnard College and Columbia University…<br>That said, Barnard College is plenty prestigious on its own.<br>btw:  I believe Columbia Teacher’s College is also quasi-independent, with its own admissions and finances.<br><br>", "<b>Username: Publisher</b><br><br>@monydad had a daughter transfer out of Barnard College. @monydad has posted about the Barnard / Columbia relationship & has suggested that readers research “Barnard” on the Columbia University thread.<br>Do Barnard College students have access to Columbia University’s placement office ?<br>Are Barnard students claiming to be graduates of Columbia University when seeking employment ? (Really a question for Barnard College’s placement / career counseling office.)<br><br>", "<b>Username: Bill_Marsh</b><br><br><br><br><br> IWannaHelp:<br>\"\"<br>@Bill Marsh<br><br>\"\"<br>Not only is Barnard affiliated with Columbia, but the degree for Barnard grads is awarded jointly by both Barnard and Columbia, so it is legitimate to list your degree as from Columbia.<br>\"\"<br><br>I am not so sure about the legitimacy. You never know how others may feel about that if they find out.  Technically, it’s really not part of Colubmia.  I don’t know why you are so into the idea of a Barnard student pretending to be a Columbia student.  If you were that Barnard student, not only would Columbia students dislike you for perpetuating that “lie”, but your fellow Barnard students would dislike you for not being proud of your own school.<br>\"\"<br><br>A lie? You’re “not so sure,” but you’re calling it a “lie” anyway? Your argument isn’t with me, it’s with Batnard College.<br>It’s Barnard who advises its students to list on their resumes “Barnard College, Columbia University” or “Barnard College of Columbia University”.<br>If an employer asks to see their diploma, a Barnard graduate can show them theirs with the Columbia seal on it and signed by the Columbia president as well as the Barnard president.<br>The front gates through which you enter the Barnard campus include “Barnard College of Columbia University” in large, permanent metal letters.<br>Barnard faculty are evaluated jointly for tenure bu both Columbia and Barnard.<br>It is so integrated into the university as a whole that when Barnard students choose a major, their options include those offered across the street at Columbia College as well as those offered on their own campus.<br>A lie? These battles were fought years ago and were resolved years ago.<br><br>", "<b>Username: theloniusmonk</b><br><br>Ok then you’re basically saying that Barnard cannot stand on its own against a school like NU or JHU, you have to include Columbia to make it a more equitable comparison.  I think that’s reasonable, but then you’re relegating Barnard to be just a college of Columbia, like the Arts and Science college at Berkeley.<br><br>", "<b>Username: merc81</b><br><br><br><br><br> theloniusmonk:<br>\"\"<br>I think that’s reasonable, but then you’re relegating Barnard to be just a college of Columbia, like the Arts and Science college at Berkeley.<br>\"\"<br><br>In this sense, that’s what Columbia College represents, the arts and sciences college of Columbia University, with Barnard representing a parallel, predominately autonomous arts and sciences college of the same university.<br><br>", "<b>Username: IWannaHelp</b><br><br>@Bill Marsh<br>That’s why I put the quotation marks. Certain Columbia students do view it as a “lie” because it’s not part of Columbia. That’s not my argument.  I merely stated how some felt based on what I read on-line.<br>The OP asked specificly about job prospect and connection. Barnard college students cannot utilize Columbia University’s career resources.  This is from Columbia’s website for employers:<br><br>\"\"<br>At the Center for Career Education, we serve students and alumni of five schools within Columbia University:<br>Columbia College<br>Columbia Engineering<br>School of General Studies<br>Graduate School of Arts & Sciences<br>School of the Arts<br>Please contact additional Columbia University Career Centers to reach populations not represented by CCE.<br>\"\"<br><br>Barnard may look pretty integrated into Columbia to you but apparently, Barnard students don’t have full access to everything in Columbia.<br><br>", "<b>Username: kmmysrdscrnnm</b><br><br>Hey all, thank you again for your inputs. Just to clarify, I’m really looking to get the best out of Barnard (Columbia College being there is definitely a perk, but def not the reason why I want to go to Barnard…I fully don’t expect to access Columbia’s career center/alumni events/etc.). Can anyone speak on grade deflation/inflation at either schools. I happen to be very blessed and attend a T10 American Prep school, and grade deflation is super severe at my school, meaning I have very subpar grades. I’m looking for a school that essentially will help me earn a higher GPA. Do you think it would be easier to succeed academically more at Barnard or Northwestern?<br><br>", "<b>Username: Publisher</b><br><br>OP: I reread your original post which started this thread. In my opinion, it seems clear that Barnard is the best fit school for you since you wrote:<br>“I really want an urban campus. (I grew up in a really big city and I don’t want to spend time stuck on campus.)”<br><br>", "<b>Username: monydad</b><br><br>Hi I got flagged here by #33.<br>My D2 did transfer from Barnard, found it was not her cup of tea, as it were.<br>But there are people who transfer from virtually every college. IIRC Barnard has a high retention and graduation rate. The kids of the other CC parents who posted at the time all said their kids loved it. One of them married a Columbia grad.<br>OP says she wants a school in the city, and less of a campus, that’s just what is on offer. For better or for worse. My D2 might say “Be careful for what you wish for”. But it is exactly what many others want. Evidently.<br>I imagine that at most selective universities that have colleges with separate and  different admissions protocols, if one college there is significantly more selective than the others,  some subset of its students will deem themselves “better” than the less selective ones. It’s probably human nature, to an extent. But it may be more culturally permissible to express these sentiments at some universities than at others.  Sadly my D2 did experience some of this attitude( though that alone was not why she left). But most of the other CC parents said their kids did not.<br>As mentioned by others above, Barnard is an “affiliate” of Columbia. Exactly what this means in terms of degree of “belonging” can be quite ambiguous, for those inclined to look for distinctions.  Barnard itself emphasizes their integration, but not everyone at Columbia shares this view.<br>One can indeed find legions of past discussions on all these issues by searching on the CC Columbia and Barnard subforums on the name of the other school.<br>To the extent all of this was a concern then, it might well be less so now. IIRC Barnard has become yet more selective. The Columbia administration has taken steps to make Barnard appear to be more “part of the team”, eg by including it in certain places on its website  where formerly it did not. Also the Athena Center is now completed, so hopefully the Barnard women have at least someplace to go now, besides their dorm rooms or traipsing into the city.<br>My D2 took English courses at Barnard, I think,  and thought they were very good.<br>One has to evaluate the whole package at every situation, and they all have relative good points and less good points.<br>Other points:<br>-Northwestern has separate colleges too, at least some (The seminaries) are also “affiliates”.  But the stats for its different colleges are not that different, or that available, and this relative snobbery is not much of a “thing” there. As others have pointed out, it is in a suburb. When you go out routinely, you will likely almost always be going out in Evanston.<br><br>JHU's English department is good, from what I could tell when I looked.<br><br>-None of these three schools are “easy”.<br><br>", "<b>Username: theloniusmonk</b><br><br>\"I’m looking for a school that essentially will help me earn a higher GPA. Do you think it would be easier to succeed academically more at Barnard or Northwestern? \"<br>On gradeinflation NU’s GPA is 3.48 (2014) and Barnard is not there, though Columbia is at 3.45 (2010), so no real way to compare either the gpas or the trend, which is probably more important.   However these are GPAs for all majors and you’d have to try and find out how hard the chemistry and maybe the math classes are.<br><br>", "<b>Username: IWannaHelp</b><br><br>@monydad @kmmysrdscrnnm<br>The seminary (only one) monydad thought of is Garrett–Evangelical Theological Seminary. It is a grduate school located on NU campus and is not affilated with NU. The seaprate colleges at NU have virtually the same admission standard and transferring among four of them is very easy.  The only exceptions are schools of journalism (very limited enrollment) and music (conservatory-caliber).<br>Evanston is bordered by Chicago to the immediate south; the subway and intercampus shuttles make Chicago pretty accessible (NU’s law/med schools are in downtown Chicago).  How often students go to Chicago really depends on each individual and the people he/she socializes with.  Dorms often organize trips into Chicago that one can take advantage of if he/she wants.<br>Many students don’t feel the need to go to Chicago every weekend because downtown Evanston is often enough for them. Shopping isn’t great. But there are plenty of eateries and a movie theater complex. The top-notch performing arts programs at NU offer many shows throughout the academic year. They are no professional like those in the Theater District in Manhattan but if you are on student budget, you’d get more bang for your buck.<br><br>", "<b>Username: monydad</b><br><br>@IWannaHelp , The seminaries I was referring to were whatever ones Northwestern grad  @WildLion82  was referring to in this post<br>https://talk.collegeconfidential.com/discussion/comment/2251282#Comment_2251282<br>to wit:<br>“I went to undergrad at Northwestern, which with 6 undergraduate schools, was disjointed in its own right, but never was any student in, say, the School of Music or the School of Education or even the affiliated seminaries made to feel as though he or she was not welcome in his or her own academic community.”<br>I relied on that comment. If @WILDLION82 was mistaken, or things have changed, so be it.  I seem to recall that when I lived in Chicago there was a seminary there that was affiliated with Northwestern, but I may be mistaken.<br><br>", "<b>Username: cmillerusarmy</b><br><br>Yeaaaaaaaaaa I would be careful with that.<br><br>", "<b>Username: monydad</b><br><br>re #42: I did some research because I was curious, and in case anyone cares, “things have changed” is correct, and “mistaken” may well also be correct.<br>Western Theological Seminary was invited to relocate from Chicago to Evanston  in 1929 by Northwestern,  and stayed there as Seabury-Western Theological Seminary until about 2013.  That was the “other” seminary.<br>“things have changed”= They sold their land to Northwestern and then moved back to Chicago in about 2013 as Bexley Seabury Seminary.<br>“mistaken may also be correct” because there’s nothing I can find suggesting that the seminaries were actually affilates of Northwestern.<br>The Northwestern alum who asserted it may have made the assumption due to  subsequent attendance at Columbia, whose nearby seminaries (Union and JTS) are indeed affiliates of the university.<br><br>", "<b>Username: IWannaHelp</b><br><br>@monydad<br>Thanks for the research and clearing that up.<br><br>"]}