{"title": "rice vs upenn vs columbia ed", "comments": ["<b>Username: ATL547</b><br><br>Hi everyone! I am a current Junior in Atlanta, Georgia deciding between Rice, UPenn, and Columbia to apply with ED. I have done extensive research on all three schools and wanted to gain additional insight as to which school to go with. I plan on majoring in Political Science and attending graduate school to earn an MBA and JD to become a corporate attorney. All three schools will apparently offer similar amounts of aid, as per the net price calculator. Please help me with my decision with the criteria below. Thank you!<br>Criteria to Consider:<br>-School Atmosphere and Culture<br>-Overall Student Life<br>-Social Life<br>-Stress and Course Difficulty<br>-Using/Accepted AP Credits<br>-Academics<br>-Professors<br>-Extracurricular Activities<br>-Study Abroad Opportunities<br>-Campus Safety<br>-Research and Internship Opportunities<br>-Alumni Network<br>-Ranking<br>-Better Chance of Admission<br>(I have a 1530 SAT, 3.95 weighted GPA. I am ranked 7th of 857 students. I will have 18 AP classes by the end of Senior year and have solid extracurricular activities (Junior Class President (and elected to be Senior Class President), President of FBLA, Regional FBLA Officer, President of MDJunior (an organization empowering students to pursue medical careers in the future), President of Spanish National Honor Society, Vice-President of National Honor Society. I have also interned with a local law firm, and I volunteer with the American Red Cross, local food co-op, and library. I am also a President’s Volunteer Service Gold Award recipient and recipient of the National Leadership Award. I have placed in the top five in two national FBLA competitions.<br>I would also like to attend an Ivy-League graduate school after earning my undergraduate degree and earn my MBA and JD graduate degrees, so which school would help me be admitted to such a school?<br>By the way, how accurate are the net price calculators listed on each university’s website? I’m using the longer and more detailed one, but is that an accurate indication of how much aid I will receive?<br>Thank you all so much!<br><br>", "<b>Username: cptofthehouse</b><br><br>I like Rice the best. But then, that’s personal taste.<br><br>", "<b>Username: merc81</b><br><br>Based on the totality of your post, Columbia seems to be your best match from this group. Though you would have to be attracted to big cities, of course, for this to truly be the case for you.<br>With respect to estimating cost of attendance, this alternative source can be helpful: https://myintuition.org/.<br><br>", "<b>Username: ATL547</b><br><br>What do you think my chances of admission are for each school? I am a first-generation African American male and the first in my family to go to college.<br><br>", "<b>Username: penguin2</b><br><br>As long as you nail the essays, you have a far above average chance at each one. Your stats, ECs, and personal information are very sought after by colleges.<br><br>", "<b>Username: circuitrider</b><br><br>Rice - Like Houston, it is very identified with NASA and astrophysics. Likes to boast about its “house” residential system where students are divided by dorm for all for years.  Humidity makes Atlanta feel like a picnic in the Poconos.<br>Columbia - An iconic McKim, Mead and White designed gathering place surrounded by apartment buildings. Probably the best way to experience New York City short of moving there permanently.<br>Penn - Similar to Columbia but with a lot more institutional sprawl and not all of it particularly attractive.<br><br>", "<b>Username: Publisher</b><br><br>@ATL547: As a first generation African-American male with a top 1% class rank, impressive SAT score, outstanding GPA, and exceptional leadership roles, you may want to reconsider applying ED if you do not have a clear-cut first choice school.<br>Based on your posted profile, you would be a strong candidate for admission to Princeton, Harvard, Stanford, Yale, Chicago, Columbia, Penn, Northwestern, & Rice. Duke & Vanderbilt as well, but it seems that you want to experience a different region of the country based on your target schools.<br>With respect to stress & difficulty of courses, what are you afraid of ? You have an outstanding background & excellent qualifications.<br><br>", "<b>Username: Publisher</b><br><br>@ATL547: The most sought after URM by elite law schools is a well qualified African-American male.<br>You do not need both a JD degree & an MBA in order to practice corporate law in biglaw. (\"Biglaw refers to law firms with at least a total of 500 attorneys when counting all office locations.) Most biglaw firms pay on the Cravath scale (Cravath, Swaine & Moore is a very prestigious NYC based law firm.)<br>If you like to work alone doing research & analytical thinking, then pursue law school. But, despite what others may speculate, a law degree is only good for the practice of law or if one wants to be a career politician. Law school is a 3 year program.<br>If you like to work as part of a team, then an MBA may be the better option for you. MBA programs are 2 years long & it is best to have at least 2 years of post undergraduate school work experience before enrolling in a full-time MBA program.<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>If you like to work alone doing research & analytical thinking, then pursue law school. But, despite what others may speculate, a law degree is only good for the practice of law or if one wants to be a career politician. Law school is a 3 year program.<br>\"\"<br><br>Lawyer here and nothing could be further from the truth. The only way you are going to get through law school alive is to figure out how to divide up the assigned readings, share notes and to study in groups.  Very different from what you will become accustomed to in undergrad where - yeah - you can afford to be a lone snowflake in the humanities and to some extent in the social sciences.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> ATL547;d-2179046:<br>\"\"<br>Hi everyone! I am a current Junior in Atlanta, Georgia deciding between Rice, UPenn, and Columbia to apply with ED.<br>\"\"<br><br>I normally suggest that if you are not sure which college is a no regrets first choice, you probably do not want to apply ED anywhere.<br><br><br><br> ATL547;d-2179046:<br>\"\"<br>I would also like to attend an Ivy-League graduate school after earning my undergraduate degree and earn my MBA and JD graduate degrees, so which school would help me be admitted to such a school?<br>\"\"<br><br>For law school, LSAT score and college GPA.  Take a look at http://schools.lawschoolnumbers.com/ (and other parts of that web site for more information on preparing for law school admission).<br><br><br><br> ATL547;d-2179046:<br>\"\"<br>By the way, how accurate are the net price calculators listed on each university’s website? I’m using the longer and more detailed one, but is that an accurate indication of how much aid I will receive?<br>\"\"<br><br>If you have accurate financial numbers from your parents, and they do not have particularly unusual finances, then they are likely to be accurate.  Some things to watch out for:<br><br>If there is substantial non-W-2 income (e.g. self employment, small business, farm, rentals, etc.), then some colleges may add back some deducted expenses, using a higher income than tax forms calculate.<br>If your parents are divorced, some colleges' net price calculators are less accurate.  Even those that are accurate in this case can be made inaccurate if the parents are less than fully cooperative in giving full financial information (many divorced parents do not want to give their ex-spouses that information).<br>If you will have other siblings entering or graduating from college, be sure to rerun for all scenarios of number of college students.  For example, if a sibling currently in college graduates while you are in college, your net price could go up after s/he graduates.<br><br><br>", "<b>Username: Publisher</b><br><br>@circuitrider: Disagree with everything in your post #8 above. It may have been your experience, but certainly not all law students study in groups.<br>While forming a study group happens very early during one’s first year of law school, in my experience, study groups are very inefficient, a waste of time, and poor preparation for the practice of law.<br>There are so many study aids and commercially available case briefs which follow the text books, that the only reason that I can imagine for studying in a group in law school is to quell one’s anxieties.<br>OP: The practice of law involves a lot of research & analytical thinking & analytical writing.<br>P.S. Law students do, however, often obtain class notes from past students who took the same course from the same instructor. But, studying in a group was only among first year law students, and typically lasted for just one semester.<br><br>", "<b>Username: Publisher</b><br><br>OP: MBA programs require students to work in groups as part of a team with individual responsibilities.<br>During law school, this may never be required of a student unless involved in moot court or mock trial.<br>Another reason that working in groups rarely occurs during one’s law school years is that law students compete against one another for high grades & high class rank in order to compete for the best jobs (federal clerk or biglaw).<br><br>", "<b>Username: PrdMomto1</b><br><br>What type of culture, social life, atmosphere do you think would be the best fit for you?<br><br>", "<b>Username: ATL547</b><br><br>Thank you all for your advice and wisdom! I really appreciate it! I have personally visited Rice and used virtually toured UPenn and Columbia and I liked all three campuses. One of the benefits that Rice has over the UPenn and Columbia is that I can graduate in three years with the number of AP credits that I have, however, I know that Columbia and UPenn have better opportunities and programs related to my major and future career. I also saw that Rice built the Kraft Hall for their School of Social Sciences which was a nice addition considering my intended major. I honestly do not mind moving to the Northeast, even after living in Georgia my entire life and I would prefer a school with at least some aspects of a social life. With how competitive RD is, I think ED would be my best shot at being admitted to one of these schools, but there are many factors to consider in choosing which school to apply to with ED.<br><br>", "<b>Username: Publisher</b><br><br>Another poster wrote:<br>“You want to be an entrepreneur, go ahead and pursue an MBA. You want to be a partner, go to law school.”<br>If interested in working for a large law firm, partnerships are rare–even non-equity partnerships.<br>Entrepreneurship is not the only career path for an MBA.<br>These type of generalizations made by another poster are misleading and over simplified. There are many specialties offered in MBA programs beyond entrepreneueship.<br>If you want information about salaries & bonuses for graduates of the top 50 MBA programs as well as for salaries & bonuses for biglaw associates paid on the Cravath scale, I started another thread on the MBA forum a few days ago which lists this information.<br><br>", "<b>Username: Publisher</b><br><br>@ATL547:  Saving a year of undergraduate school might be a wise decision financially as law schools & MBA programs are expensive.<br>If you are certain about a career in corporate law, then it might be helpful to take some business related courses.<br>“Corporate law” covers a broad range. What is your understanding of what one who practices corporate law does ?<br>Do you envision yourself at a large law firm, as an in-house counsel for a corporation, or working in a small to medium sized law firm ?<br><br>", "<b>Username: Publisher</b><br><br>Several law schools offer a combined JD/MBA degree program. Usually it takes 4 years to complete, but there may be some law schools which offer a 3 year joint degree program.<br>Do you prefer to work alone or to work with a small group ?<br><br>", "<b>Username: ATL547</b><br><br>I read about the combined JD/MBA degree programs before and was actually intending to apply and enroll in a 3-year program after finishing my undergraduate degree. As my intended career is to become a corporate or M&A attorney, I thought having an MBA would supplement my law degree when working for a corporation. I prefer to work in groups, rather than working alone.<br><br>", "<b>Username: circuitrider</b><br><br>OP - You are the first generation in your family to attend college; you’re a URM. You’re going to wind up with a lot of good  choices comingyourway, some not even on your radar right now. Any T50 college or university will get you where you want to go. Don’t get too wedded to one career path; see what internships are available once you get your bearings. Take a few classes outside your comfort zone. And, have fun.<br><br>", "<b>Username: Publisher</b><br><br>Interesting that you mention M&A work. The higher up one ventures among biglaw firms, the more corporate law becomes synonymous with M&A work.<br>If you prefer to work in small groups as opposed to working alone, then I urge you to consider working for two years after finishing undergraduate school, then apply to MBA programs.<br>Most biglaw associates only last 4 to 5 years before being asked to leave or leaving on their own due to job dissatisfaction.<br>If open to another undergraduate major, then consider economics as it will prepare you for either path that you decide to take with respect to graduate school.<br><br>", "<b>Username: Publisher</b><br><br>If you attend an elite LAC or National University, you should have the option to work as a paralegal at a major law firm in Wash DC or in New York City.<br>Typically, the firms request a 2 year non-binding committment. Working as a paralegal in a major law firm in a major city such as NYC, Wash DC or Chicago, will give you insight as to life in biglaw & expose you to others with similiar aspirations to attend law school & work for a major firm.<br>While paralegals do not make a great salary, if you work in litigation & a case that you are working on goes to trial, you can make in the vicinity of $100,000 due to overtime.<br>Typically you start work with your class or cohort of other paralegals & are given instructions & work assignments by the head of the paralegal dept.<br><br>", "<b>Username: Eeyore123</b><br><br>If you want to go to one of the very elite law schools, I would go to an Ivy. Half of the students at Yale Law School came from the 8 Ivies + Stanford + UChicago. Columbia has 34 students at YLS. JHU has 7 and Rice has 3. If don’t want to go to the very top, it likely doesn’t matter much.<br><br>", "<b>Username: merc81</b><br><br>As something of which to be aware, accelerated (6-year) law programs may not be that rare. Hamilton, for example, offers one with Columbia Law for students who pass the bar of admission.<br>https://www.hamilton.edu/academics/pre-law<br><br>", "<b>Username: Publisher</b><br><br>Another undergraduate school to consider is Claremont McKenna College. Great curriculum for a career in business or in law.<br><br>", "<b>Username: ATL547</b><br><br>Would I be at a disadvantage when applying to a top 10 law school if I went to Rice for my undergraduate degree as opposed to UPenn or Columbia?<br><br>", "<b>Username: merc81</b><br><br>If you would like, you can search “Top Lawyer Producer Schools – Infographic” for a sampling of 20 colleges with good track records in law school admission.<br><br>", "<b>Username: Publisher</b><br><br>No, you would not be at a disadvantage when applying for a top 10 law school if you attend Rice University.<br><br>", "<b>Username: penguin2</b><br><br>Is there a reason you’re restricting yourself to these three? As said above, you have a good shot at HYPS too. You really don’t want to get into Rice ED and later get into Harvard, if you don’t withdraw your apps.<br><br>", "<b>Username: tchit87</b><br><br>One thing I will say: PLEASE DO NOT APPLY TO A COLLEGE ED UNLESS YOU ARE CERTAIN YOU WANT TO GO. Speaking from experience.<br><br>", "<b>Username: PrdMomto1</b><br><br><br><br><br> Publisher:<br>\"\"<br>No, you would not be at a disadvantage when applying for a top 10 law school if you attend Rice University.<br>\"\"<br><br>Agreed.  I don’t think it’s that simple to say there are less grads from Rice (or any other school) at Yale than from the Ivies, therefore Rice is not a good choice.  There are likely some other factors at work too.  Rice is smaller than many of the other top schools, with less than 4,000 undergrads.  Rice also has a high percent of STEM major undergrads.   In 2019 about 1450 of their undergrads were engineering majors.  That doesn’t mean the non-STEM get a bad education or the programs are not well respected.  It just means that there are less of them entering non-STEM related graduate programs.<br>When our daughter was trying to decide on a school we told her that ALL the schools she was trying to decide between had good programs in her major and all had good opportunities in the things she thought she was interested in.  We suggested she focus on what school had an environment where she felt she’d be comfortable taking advantage of the opportunities (i.e. focus on the culture, environment, etc.).  We also suggested she not focus TOO much on her specific major.  While that was important, we thought she should consider where she’d get a good education should she decide to change majors.  I would say a large number of her friends have changed majors freshman year, some more than once.<br><br>", "<b>Username: Publisher</b><br><br>OP: Since you mentioned M&A (mergers and acquisitions) as an area of law in which you are interested, you may find it interesting that during the past end of year bonus season partners at Cravath, Swaine & Moore received $5 million dollar bonuses of which $4 million was attributed to the firm’s M&A practice. (This law firm has offices in NYC & London). (I have no inside knowledge as this was published in one of the national legal newspapers.)<br>Life as an associate in a biglaw firm is not pleasant for most during the first few years as client contact is rare and others control your work life which is often 10 hours or longer per day. But the pay is great & enables most associates to pay off their sizable student loans in 4 or 5 years.<br>Entering the corporate world as an MBA is a much different experience than that of a young attorney entering biglaw as an associate. In short, more respect & more involvement.<br><br>", "<b>Username: Publisher</b><br><br>M&A involves three main players:<br>Investment Banks (IB) finance & economics backgrounds are helpful as are accounting courses. Lots of work on Excel spreadsheets (modeling) & on putting together PowerPoint presentations. IB firms put together deals. Often have to find target firms to match the buyer’s interests.<br>Major law firms do the documents. Also, lots of review of existing documents at target entities. Usually billing is based on an hourly basis.<br>Accounting firms do valuations & tax work. Accounting firms typically get paid the least, but do the work that no one else wants to do or can do. Lots of Excel spreadsheet work. Lots of document gathering, assembling, & interpreting. Billing is done on an hourly basis.<br>Law Firms & Investment Banking firms make the most money off of M&A deals. Accounting firms make the least, but it is still lucrative.<br>One reason to attend an elite school (college or university) is that investment banks are very prestige conscious & tend to hire &, more importantly, tend to offer internships to, students at the most prestigious colleges & universities (target schools for hiring).<br><br>", "<b>Username: Publisher</b><br><br>Of course, investment bankers do valuations work as well as putting deals together.<br><br>", "<b>Username: theepicrager</b><br><br>I may be slightly biased, but Rice is an amazing school!<br><br>", "<b>Username: Bill_Marsh</b><br><br>Two years ago Rice initiated a new program called The Rice Investment, deigned to make Rice more accessible to middle and lower income students. Those with incomes under $130K who qualify for financial aid will be eligible for full tuition scholarships. Those with incomes under $200K will be eligible for half tuition scholarships. Check it out.<br><br>", "<b>Username: OneMoreToGo2021</b><br><br>African American male, rigorous academics, fantastic scores, significant ECs, and first generation too?<br>Columbia, Rice and Penn are all great schools, but IMHO you are setting your sights too low.  RD to all the Ivies that appeal to you, and Duke and Rice too.  Best of luck, and congrats on your impressive achievements!<br><br>", "<b>Username: Bill_Marsh</b><br><br>His choices might have something to do with the locations. Just a hunch.<br><br>", "<b>Username: theloniusmonk</b><br><br>“I am a first-generation African American male and the first in my family to go to college.”<br>Don’t ED anywhere, you’re an excellent candidate, a 1530 first-gen AA will do well even among the colleges you’re considering.   Don’t get locked into a college with ED especially if you have to compare financial aid packages, go with EA or SCEA colleges, you may be pleasantly surprised.  If you want to stay on the east coast, you can SCEA to Harvard, Yale, Princeton or EA to Georgetown since your major is poly sci.  You can also EA to you flagship (UGA) for a safety.  As for your list, for poly sci, I’d go with Columbia, their poly-sci program is one of the best in the country.<br>“I would also like to attend an Ivy-League graduate school after earning my undergraduate degree and earn my MBA and JD graduate degrees, so which school would help me be admitted to such a school?”<br>If your preference is for ivies that’s fine, however you should note that Stanford, Chicago and Northwestern all have higher ranked grad schools than most of the ivies.<br>“No, you would not be at a disadvantage when applying for a top 10 law school if you attend Rice University.”<br>What are you basing that on?  Columbia grads do much with top law schools than Rice, if you look at the data.  Yale e.g. doesn’t publish how many from each undergrad school, but when they did, Columbia was usually 5th behind HYPS, Rice didn’t even have enough to be in the top-10.<br><br>", "<b>Username: AlwaysMoving</b><br><br><br><br><br> theloniusmonk:<br>\"\"<br>“I am a first-generation African American male and the first in my family to go to college.”<br>Don’t ED anywhere, you’re an excellent candidate, a 1530 first-gen AA will do well even among the colleges you’re considering.   Don’t get locked into a college with ED especially if you have to compare financial aid packages, go with EA or SCEA colleges, you may be pleasantly surprised.  If you want to stay on the east coast, you can SCEA to Harvard, Yale, Princeton or EA to Georgetown since your major is poly sci.  You can also EA to you flagship (UGA) for a safety.  As for your list, for poly sci, I’d go with Columbia, their poly-sci program is one of the best in the country.<br>…<br>\"\"<br><br>I agree that you have an excellent chance at all of the top 20 schools, and you should think about EA (not binding like ED) to Harvard, Yale, Princeton, or Stanford, and then RD to others.  Right now is good time to reach out to the admission rep for Atlanta from each school with an introductory email.   Tell them you are interested in their school, your stats, first gen, and that you are an African American.  A great way to bring up the URM is to ask about support and clubs aimed at URMs.  Also, you can probably get application waivers from some schools.<br><br>", "<b>Username: juillet</b><br><br>Standard disclaimer that you should only apply ED if you are really, really sure you want to go somewhere. That’s what ED is for.<br>All three of these are excellent schools; they won’t differ much in terms of internship opportunities and the quality of their alumni network (although Columbia’s will be bigger than Rice’s; and UPenn’s will be bigger than Columbia’s). Research opportunities will be - well - different. All three are Research 1 universities - with the highest level of research activity among universities in the U.S. - but Rice is small university with just over 3,000 graduate students, whereas Columbia and Penn have much larger graduate student populations and research arms that span a very wide area. That doesn’t mean Rice’s are worse (students at LACs can get excellent research experiences, for example), just they’re going to feel and be different.<br>Personally, I thought the research opportunities and resources at Columbia were fantastic, and there were many great research opportunities and programs for undergraduates.<br>They’re all in large urban areas, but New York is one of the largest cities in the world with a multicultural population and (usually) trains that run 24 hours a day; Philadelphia is also a large city, but not as dense and with fewer amenities than New York; Houston is large and sprawling, and most places are probably accessed by car. Penn and Columbia may offer more extracurricular activities simply because of their size and location, but that doesn’t mean that they are better or the kinds of activities you specifcally want to be.<br>I went to Columbia for graduate school (2008-2014) and worked in undergraduate student services while there. The undergraduate culture is very stressy and competitive - but many of the students who are there tend to thrive on that, and they form tight bonds and are pretty supportive of one another. It’s a pretty diverse undergraduate body, both in terms of identity and personality/interests. There are a ton of niche EC activities to do on campus and around the city, but if you’re looking for school spirit and sports games, this is not the place for you, heh. Campus always felt very safe, but there are some less safe neighborhoods that border Morningside Heights.<br><br>", "<b>Username: theloniusmonk</b><br><br>once a student mentions EFC and is looking to compare FA packages, then ED is out.<br><br>"]}