{"title": "u mich vs purdue engineering", "comments": ["<b>Username: PCyeol</b><br><br>I got into the Engineering branch (undergraduate) of both U Mich and Purdue. But I’m not exactly sure which university to attend. I plan on pursuing Electrical Engineering. Overall, U Mich is around $12,000 more expensive than Purdue after 4 years.<br>Would it still be worth going to U Mich instead of Purdue? Is there a large difference in job opportunities and salaries?<br>Also, what is the atmosphere like at both colleges?<br>It would be great if you guys could help me out a bit in deciding which college to go to… All opinions are welcome <br><br>", "<b>Username: momofsenior1</b><br><br>Both super options!!!   IMO, peer schools for engineering.<br>Purdue and Michigan were my D’s #1 and 2 schools.    Both have great internship opportunities, study abroad programs, and amazing facilities.   Campus vibe felt similar as well.   Very collaborative, and Midwest friendly.<br>D’s in the honors college at Purdue.   She committed before hearing back from Michigan, although they ultimately wait listed her( which she did not stay on their list since she committed a to Purdue).<br>The differences for her were very small. The couple of things she didn’t like about Michigan were the split campus with engineering on north campus, and that Michigan didn’t accept as many AP credits so she would have needed three semesters of going back and forth between campuses.   Not a big deal for most students but my D had a big commute to her private HS and was over being on a bus for anything.    Being from OH may also have played a small psychological role ?<br>I give Michigan the edge on location and having one of the best college towns in the country.<br>Is one school worth $12k/year more than the other?   For engineeering, I say no.    Go to your less expensive option.  Boiler up!<br><br>", "<b>Username: PCyeol</b><br><br>Thank you so much for replying!<br>Michigan is around $12,000-16,000 more expensive than Purdue, but not per year… Overall. My main concerns about Michigan are the weather and travelling from the dorms to the engineering campus…<br>I have a few questions about Purdue.<br>In order to choose which engineering major I want, I would need a GPA above 3.0, right? Is choosing a major based on rank? Like the students with the highest GPA choose first or can anyone with a GPA above 3.0 choose their major…<br>I’ve also heard about the intense workload placed on students… Is it really that bad (pulling all-nighters to complete assignments) or is it manageable?<br>Last one, what is the student community at Purdue like?<br>I’ll wait for your reply <br><br>", "<b>Username: momofsenior1</b><br><br>$12-16K over the course of all four years isn’t that much.     You have a hard decision!<br>Weather at Purdue is not going to be too different than that at Michigan.    That said, everything is within walking distance and the engineering mall is the very center of campus (helps to have a STEM focused university).<br>To be guaranteed your first choice of major you will need an engineering index of 3.2.    That’s basically your GPA for your stem courses.<br>The only major during my D’s year that had to move to a more complicated system was BME because they capped the major at 100 students.     Then it was based on grades in certain courses and other criteria:  https://engineering.purdue.edu/Engr/InfoFor/CurrentStudents/enrollment-policy<br>Engineering courses at any school are going to be challenging.    You will need good time management skills.   My D has never needed to pull an all nighter.   She’s been on the Dean’s List every semester so has done well academically while still having time to do theater, SWE, mentoring, dating, and having plenty of fun with friends.<br>My D feels the students are down to earth and generally happy.     48% of students are Indiana residents.   The rest are from OOS and international.   Purdue has one of the largest international student populations in the Big 10.   Lots going on all the time on campus and great school spirit.    (I’m sure that’s the same at Michigan).<br>I’m going to page @Knowsstuff to give you the Michigan perspective. <br><br>", "<b>Username: sushiritto</b><br><br>First, they’re both excellent engineering programs and schools. The differences will be minute. @Knowsstuff can fill you in on the engineering specifics at UMich, since his S is an engineering student.<br>I have a kid in LSA at UMich, but I believe first year engineering students at UMich will have 3 of their 4 (or so) courses on Central Campus. So, a freshman student could take the bus to North Campus for their one course, if living on Central Campus, or they could just request North Campus for freshman dorms and take the bus to Central for their other 3 courses.<br>After freshman year, just live on North Campus when most of your courses will be there.<br>The weather has got to be a push. However, Ann Arbor is one of, if the best, college towns in the US. It’s not that dissimilar to the SF Bay Area, where we live.<br>And then you fabulous athletics program at UMich. Just in terms of football attendance, based upon 5-year averages, UMich is #1 and Purdue is #54. My kid is a big sports fan, so that was certainly a factor in her decision.<br>5-year Average Attendance for football:<br>UMich  110,000 fans<br>Purdue  41,000 fans<br>https://collegefootballnews.com/2019/07/college-football-attendance-rankings-no-1-130-2019-cfn-five-year-program-analysis/2<br>So, UMich is a huge sports school which typically comes with huge spirit.<br>In order to declare your major in the CoE at UMich, you will need a 2.0 or greater. No caps currently.<br>If you have any designs on coming to Silicon Valley, Michigan (#11) rates higher than Purdue (#19) in terms of hiring in Silicon Valley:<br>https://qz.com/967985/silicon-valley-companies-like-apple-aapl-hires-the-most-alumni-of-these-10-universities-and-none-of-them-are-in-the-ivy-league/<br><br>", "<b>Username: ucbalumnus</b><br><br>Michigan currently allows frosh engineering students to declare their majors with a 2.0 GPA and C grades in prerequisites.  Purdue may require higher GPA for some majors.<br>https://talk.collegeconfidential.com/engineering-majors/2174743-first-year-engineering-programs-secondary-admission-to-major-criteria.html<br>You need to decide whether greater assurance of getting into your major is worth the extra cost of Michigan over Purdue.<br><br>", "<b>Username: momofsenior1</b><br><br>The football stadium analogy is a bit disingenuous because Ross Aide capacity is half of what the Big House.     And basketball is a bigger draw at Purdue.  But there is great team spirit at all sporting events.   D goes to see volleyball on a regular basis and it’s amazing!<br><br>", "<b>Username: Knowsstuff</b><br><br>@PCyeol.<br>So I guess it’s my job is to convince you to spend an extra $4,000/year on Michigan. ???.<br>First off these are clearly peer institutions for engineering. Both are national brands for engineering. ROI will be identical or close enough. Internships /coops will be similar but coops are more common at Purdue vs Michigan. Both will have cool clubs and opportunities.<br>Both are going to be damn hard for engineering. Very hard.<br>Michigan is more forgiving with minors, changing majors and switching majors. Many change majors just because something else excites you as you learn more about it. This will be easier at Michigan.<br>My son’s in Industrial engineering junior. But if he wanted to change to nuclear or whatever not an issue (of course you want to do this sophomore second semester).Not as easy at other schools.<br>My son grew up in a major city taking subway train to bus to school 40 minutes each way everyday. Going from north to central campus is less then 15 minutes. Not really a big deal and it’s a social thing also. Not everything in life will be given to you cleanly. My kids go to New York and San Fransisco and get around using their mass transit. Guess it’s what you grew up with.<br>My son lived on central as a freshman and went to North for 1 class with other like minded students. Again, it’s also a social thing. His job was also on north campus… His choice…<br>As a sophomore and junior he is on North campus and it’s very quiet. It’s mostly engineers, dance, theater, medical, design students They want right and left brain mixed. Many universities do this on purpose . You will see deer on your way to classes ?.<br>All the engineering building are together. World class facilities! Every major company wants to be part of the campus.<br>You have engineering, dance, theater, medical design all on North campus. School of Information is moving there and they are building a brand new student housing also.<br>Central is more urban. North is more suburban to me. Both with good restaurants. No question more lively vibe on Central but depending on your attitude that can get tiring also. Bus system at Michigan is superb and free so that is not an issue.<br>So why did my son pick Michigan over Purdue, Wisconsin and Illinois and others? He went to the top public school in Illinois which was pretty much run like a private school. Needed 99.6 % on various tests to be considered for entry.<br>He honestly wanted to be surrounded by students, the whole student body, that were like at the same educational level and curiosity. This was actually put into one of his essays. He wanted to be pushed and tested, if you will. The LSA population at Michigan is 3.9 unweighted GPA with a 32-35 Act. Engineering is a 34 avg. So the whole school in theory could be competitive at these other schools engineering departments… In theory…<br>Getting a “B” in engineering is not easy. Every school grades differently. You will be pushed at any of these schools.<br>Rank in electrical. Michigan #6 and Purdue #9. This is a non factor.<br>Campus life… All campuses have their plusses and minuses but the minuses are tough to find at Michigan. It’s part of a thriving city typically rated as one of the best to live in and go to school in. It’s really a special place.<br>Both schools will have students working together. Both will have strong Midwest presence but Michigan seems to have heavy East and West coast as well.<br>On these threads in the last week, I have answered similar threads like yours for Wisconsin and Illinois for engineering comparing it to Michigan. Why do you think that is?<br>Again, normally I would just say go with the cheaper college if money matters especially in this new reality. But if your family is able to spend the extra money cleanly, to me, Michigan can be a better choice.<br><br>", "<b>Username: sushiritto</b><br><br><br><br><br> momofsenior1:<br>\"\"<br>The football stadium analogy is a bit disingenuous because Ross Aide capacity is half of what the Big House.     And basketball is a bigger draw at Purdue.  But there is great team spirit at all sporting events.   D goes to see volleyball on a regular basis and it’s amazing!<br>\"\"<br><br>I don’t think so.  First, the link lists football attendance as a % of capacity:<br>Purdue  72% of capacity<br>UMich  102% of capacity<br>It’s the old “If you build it, they will come.”  If you fill the stadium to capacity, and there’s still demand,. then they’ll likely increase the size of stadium. Money! Basketball is big at UMich. Hockey is big at UMich.<br>In terms of the Director’s Cup (20 sports, 10 men’s and 10 women’s), UMich finished #2 for 2018-2019 and Purdue finished #55:<br>https://nacda.com/documents/2019/6/27//June28DIOverall.pdf?id=3678<br>As I said above, UMich is a BIG sports school with huge spirit.<br><br>", "<b>Username: momofsenior1</b><br><br>Didn’t clink the link, was just responding to the attendance figures.   Hard to have 110K fans when the stadium only holds 50.    No doubt that Michigan has big sports spirit, but so does Purdue…  Northwestern sports…not so much ; )<br><br>", "<b>Username: sushiritto</b><br><br>Forget about attendance, look at capacity. UMich is over capacity, Purdue is not.<br>If Purdue had been selling out their current stadium football tickets for years, then Purdue would build a bigger stadium. Period. Football profits are important, beyond just the athletics department. Purdue could build a 100,000-seat stadium, but Purdue fans can’t even sell out they’re existing 50,000 seat stadium. So they don’t bother to expand.<br>We could argue all day long, but I’d like to think most sports fans would agree with me, UMich has a bigger sports culture than Purdue. Whether that’s important to the OP, I don’t know. Was it important to my kid? Absolutely.<br>One of the biggest rivalries in all of sports is the Michigan-Ohio State rivalry. There’s really nothing else like it here in the US. Maybe Auburn-Alabama.<br>I’m moving on now.<br><br>", "<b>Username: sushiritto</b><br><br>The other factors to consider is endowment and research expenditures, which may or may not impact any admissions decision:<br>Endowment<br>Purdue  $2.5 Billion<br>UMich  $12.0 Billion<br>Research Expenditures:<br>UMich #2<br>Purdue #37<br>https://ncsesdata.nsf.gov/profiles/site?method=rankingBySource&ds=herd<br><br>", "<b>Username: mom517</b><br><br>Are you including the increase in tuition % each year in that 12-16K? What does Michigan’s tuition increase each year? I believe Purdue has tuition rate lock of some kind?<br><br>", "<b>Username: ucbalumnus</b><br><br>Purdue has frozen tuition since 2012, but the years since then up until very recently have been during economic growth.  State university budgets tend to be more stressed during economic downturns, so the risk of large tuition increases at any state university is greater now than it was before.<br><br>", "<b>Username: PCyeol</b><br><br>Thank you so much @momofsenior1 <br><br>", "<b>Username: PCyeol</b><br><br>Thank you so much @Knowsstuff . One factor that I’m trying to look at a bit more is the job opportunities and salaries after going to either of these universities. If they are the same or similar, then I won’t take an extra $12,000-16,000 in student loans to go to UMich (my family isn’t financially well off) and will head to Purdue.<br>However, if there are better job opportunities and placements at UMich, then the extra cost would be justified. I need to look a bit more into this.<br><br>", "<b>Username: PCyeol</b><br><br>@mom517 I am including the tuition increase of UMich. Purdue does have a tuition rate lock. If I ignore the tuition increase, UMich is around $3,000/year more expensive than Purdue<br><br>", "<b>Username: PCyeol</b><br><br>@ucbalumnus Thank you for telling me this. I’ll keep that in mind.<br><br>", "<b>Username: ucbalumnus</b><br><br>If the extra $12-16k is debt, how much debt would it be on top of?  If it would push the needed debt over about $27k, then that would exceed the amount you could borrow without a cosigner.<br><br>", "<b>Username: bluebayou</b><br><br>Both are top tier and job opportunities would be similar.  If you can afford it, Michigan is worth the extra $3-4k per year, IMO.  AA is the quintessential college town, so I vote for the educational community.<br>That said, if the money would be a stretch for your family, Purdue is a fine choice.<br><br>", "<b>Username: PCyeol</b><br><br>@ucbalumnus I will be taking a loan of approx $80,000 … My family isn’t financially well off so my major concern is if the extra debt is worth going to UMich.<br>According to what I’ve researched and the replies I’ve gotten, the job opportunities are similar, so I’m leaning towards Purdue now…<br><br>", "<b>Username: PCyeol</b><br><br>@bluebayou Thank you! I am leaning towards Purdue now as it will be difficult to pay more money per year because that would mean more debt.<br><br>", "<b>Username: PCyeol</b><br><br>@momofsenior1 I had another question. Do the college counselors at Purdue help you with deciding which courses you should take or do you have to do that on your own?<br><br>", "<b>Username: Knowsstuff</b><br><br>Sorry, I was under the impression that both schools were affordable for you. So go to your less expensive school if it’s a strain on your family. Outcomes will be similar for most schools at this level.<br>All school counselors will guide you through the process no matter which school. But it’s a good idea to look at the proposed schedules for your field of study<br>Most colleges will have a 4 year plan to download. There are essential classes you have to take then there are electives. Those can be based on your interests. If getting a minor that can be added to those. Most will require a set amount of humanities etc but you get to choose which class topic appeals to you. No school is expecting you to do this alone. In fact I would argue to meeting with your advisor once a year or more often could be a really good idea.<br>https://engineering.purdue.edu/ECE/Academics/Undergraduates/UGO/Curriculum_Resources/index_html<br>Boiler up! (what does that even mean… Lol ?)<br><br>", "<b>Username: Knowsstuff</b><br><br>Keep in mind like my kids you can work during the year part time and make $3,000-4,000 depending on how many hours you work. Both find it as a nice break. My son’s current job at Michigan, which is basically meetings so doing it currently online is paying him $16/hour. Most jobs are like $9/10.00/hour<br>Also I would of normally say but this year is the exception… Over the summer if you get one internship in sophomore/junior year you might be able to make $10,000/or more over the summer. Co-ops are a bigger thing at Purdue and can directly lead to industry jobs. There should be some pay that will help defer your costs. I would look into those opportunities for any summer you can get them.<br><br>", "<b>Username: momofsenior1</b><br><br>Purdue has a great advising program!    Registering for your first semester happens through a process called STAR Summer Transition Registration Advising.   This year it will all be done virtually but Purdue always has V STAR option for students who live too far to travel to campus.  https://www.purdue.edu/orientation/vstar/<br>You will discuss with your advisor which  courses you need for FYE and the electives suggested for your intended major.   Also what AP or DE credits will transfer.  Course registration is officially at the end of July where the computer system will figure out how to maximize everyone’s schedule.<br>You can also look up the four year plan of study for your major to get a broader sense.  Usually FYEs take engineering design, physics, Calc, English and then for an ECE, a CS class.<br>That all said about Purdue, do you have any more affordable options on the table? 80k is a lot of debt for an undergraduate degree.<br><br>", "<b>Username: ucbalumnus</b><br><br>$80k would require a cosigner or be parent loan beyond $27k.  This is generally a bad idea.<br>Did you get into any other colleges that require under $27k in debt and have your major?<br><br>", "<b>Username: PCyeol</b><br><br>@momofsenior1 I have my safety schools where I’ve gotten scholarships… But I think I’ll be able to reduce the 80,000 debt by working part-time and doing internships or co-ops during college.<br><br>", "<b>Username: PCyeol</b><br><br>@ucbalumnus I did, but they’re my safety schools.<br>I’m looking a bit more into the loan-taking process. If I’m unable to take a loan or it’ s too risky, I’ll head for one of my safety schools.<br><br>", "<b>Username: momofsenior1</b><br><br>Just food for thought - while co-ops and internships typically  pay well for engineering, what happens if there is another wave of COVID -19 or some other catastrophe?   The majority of my D’s friends have had their jobs rescinded this summer.<br>I would think long and hard before taking out any debt right now.<br>If you have a lower cost option at an ABET accredited program, go there.<br><br>", "<b>Username: Knowsstuff</b><br><br>@PCyeol. For the experts here to help you fully, you might want to let them know that your safeties are and what your costs will be roughly. You might gain knowledge that you never thought about.<br>As a note from a school like Michigan /Purdue vs Michigan State /Iowa State your not going to see a huge ROI. All are really good engineering schools. Rank only gives you some of the story . At any large engineering company, you will have first year engineers from Michigan, Purdue, Georgia Tech and Illinois Institute of Technology, Kettering and UIC to name a few. At some point it’s more about ability then rank.<br><br>", "<b>Username: PCyeol</b><br><br>@momofsenior1 I understand… I’ll keep that in mind!<br><br>", "<b>Username: PCyeol</b><br><br>After careful consideration of both colleges, University of Michigan and Purdue, I have decided to go to Purdue! Thank you all so much for helping me, I really appreciate it!<br>@momofsenior1 @sushiritto @Knowsstuff @ucbalumnus @bluebayou<br><br>", "<b>Username: mom517</b><br><br>Congratulations @PCyeol !!!<br><br>", "<b>Username: momofsenior1</b><br><br>Boiler Up!  Congratulations!<br><br>", "<b>Username: bluebayou</b><br><br><br><br><br> ucbalumnus:<br>\"\"<br>$80k would require a cosigner or be parent loan beyond $27k.  This is generally a bad idea.<br>Did you get into any other colleges that require under $27k in debt and have your major?<br>\"\"<br><br>Methinks its a terrible idea to borrow that kinda money for undergrad.   Many are speaking of potential internships etc that are normally available but these are not normal times.   Who knows when intern hiring will come back.<br>Better to find less expensive options, and/or considered a community college for two years and then transfer to Purdue (to cut the debt in half).<br><br>", "<b>Username: theloniusmonk</b><br><br>“I will be taking a loan of approx $80,000 … My family isn’t financially well off so my major concern is if the extra debt is worth going to UMich.”<br>Then you definitely made the right choice, as others have mentioned I thought the colleges were both affordable with one a little more affordable than the other.   Good luck!<br><br>", "<b>Username: Knowsstuff</b><br><br>congrats<br><br>", "<b>Username: decisions02139</b><br><br>Congratulations! Boiler Up!<br><br>", "<b>Username: csnpm1</b><br><br>To everyone on this thread: relatively new to CC (first one going to college this fall) and have basically just been a stat poster but wanted to say this is an exceptional thread and thank you to you all. Knowledgeable posters providing really good advice without any real bias.<br>@PCyeol - you got some excellent advice and good luck at Purdue.<br>Thanks to all of you that contributed.  These are the types of threads that make CC so valuable to students and parents going through the college process<br><br>", "<b>Username: Knowsstuff</b><br><br><br><br><br> csnpm1:<br>\"\"<br>To everyone on this thread: relatively new to CC (first one going to college this fall) and have basically just been a stat poster but wanted to say this is an exceptional thread and thank you to you all. Knowledgeable posters providing really good advice without any real bias.<br>@PCyeol - you got some excellent advice and good luck at Purdue.<br>Thanks to all of you that contributed.  These are the types of threads that make CC so valuable to students and parents going through the college process<br>\"\"<br><br>Well I wouldn’t say non bias but at least fair…LOL…Go Blue!!<br><br>"]}