{"title": "rpi vs case western", "comments": ["<b>Username: livn487</b><br><br>Can anyone who is familiar with RPI and Case Western please share their perspective? My d is looking for a mid sized school strong in Engineering and Economics. She wants an intellectual environment that has a vibrant, fun campus (but not too much partying etc). It does not need to be sport centric but, IMs or club sports would be a huge plus. She's visited Case and thought it was good but not great. We will likely visit RPI this spring. We are also hoping for some merit aid.<br><br>", "<b>Username: sweetheart1</b><br><br>Definitely visit RPI. We saw a one hour tape of Case and while it is an academically excellent school, the campus did not seem attractive to us. On the other hand, we visited RPI and the buildings and campus were very nice and inviting and the student union was great with various places to eat and hang out; we talked to quite a few students who were all involved in activities and seemed happy to be there.<br><br>", "<b>Username: livn487</b><br><br>@Sweetheart1: Thank you for your response.<br><br>Anyone else with any feedback on these two schools? I suppose I should post this in the Case forum.<br><br>", "<b>Username: ttparent</b><br><br>This is from someone who does not intimately know the schools but have researched both a little bit.<br><br>- Overall, they are very similar tech schools with similar academic credentials.<br>- Similar sized school in terms of #s of student.<br>- Male/female ratio is a little extreme for RPI, Case is a little bit closer to 50/50.<br>- Case is a big city school and the surrounding neighbourhoods can be a little bit rough and generally have higher crime. RPI surrounding is not great either but probably not as worrisome as Case. But with Case, you get a real big city with all the cultural benefits that go with it.<br>- If Biomedical Engineering, Case is the school to go.<br>- Case seems a little more generous with merit aid.<br>- Slight nod for weather to RPI.<br><br>", "<b>Username: livn487</b><br><br>Thanks! I wonder how the student body differs in personality. We've visited several campuses where the engineering schools and sciences are small in comparison to the rest of the school. It's may be concerning from an academic standpoint but it may match her personality better. She also wants to be able to take classes in economics. Biomed is probably not the field of engineering she is going for but, things can definitely change.<br><br>Now, she is researching some of the tech schools. Both my husband and I are encouraging her to keep an open mind:)<br><br>@ttparent: what are your favorite sources for researching schools?<br><br>", "<b>Username: muckdogs07</b><br><br>In deciding between Case v. RPI, I would look at whether your child wants an education grounded in the liberal arts or not. If so, choose Case, which has an extensive core curriculum (I think it is called CORE). If not, I think RPI has a bit better reputation as a pure science/math school (although both are quite good).<br><br>Another factor is money. Case competes for students against Carnegie Mellon and has been known to throw $ at promising students. I do not believe RPI is as generous with its scholarships.<br><br>Finally, I have been to Case several times and do not believe it is in a bad neighborhood. That area of Cleveland is developing and vibrant, with the Cleveland medical center as the hub. I would not make the choice based on safety.<br><br>", "<b>Username: Hockeydude664</b><br><br>This is from a high schooler's prospective who has visited RPI and isconsideeing Case also: I feel the RPI campus is in a way a gem as it is tucked away in Troy, yet is still just 25 mins from the center of Albany. However, one aspect I think you need to address with your daughter is whether or not she has interest in greek life. Sororities and frats are HUGE at RPI (my dad by the way went there and was in a frat so i guess you could say this is a\"personal\" exp.). If that is not of interest she might prefer Case but I will contend there IS stuff to participate in at RPI even if she doesnt join a sisterhood. Hope this helped! :)<br><br>", "<b>Username: livn487</b><br><br>Yes, your post is very helpful! Thanks for your point about greek life. She is somewhat interested in learning about greek life and will probably join a sorority. She likes the social aspect as well as being involved in philanthropies. I liken aspects of sororities to some of the student council functions at our high school. We will ask more about it when we tour RPI in April.<br><br>Do the girls on campus participate in IM's? My d would like to play sports but probably will not go the varsity sport route as academics are her priority (m&amp;d approve:)).<br><br>Who does RPI compete with for students? RIT and WPI?<br><br>", "<b>Username: AeroRPI</b><br><br>Yes, but I'd say more with Georgia Tech and Purdue. That is the caliber of school most of my friends turned down to come here. Greek life is big, but not essential. You can definitely have a great time and never set foot in a house... although it's probably better if you do.<br><br>Don't major in Biomed... there are no jobs. You're much better off to be an ME or an EE undergrad and specialize later, or just apply for Biomed jobs with an ME or EE.<br><br>Intramurals are surprisingly popular for a school full of geeks. There are multiple leagues too (D league ice hockey is a hilariously good time). There's hockey, softball, soccer, basketball, ultimate, and fun stuff like dodgeball and walleyball too. There are club teams that split the difference between IM and varsity for some sports like lacrosse and hockey as well.<br><br>I've taken a bunch of econ classes, only not picking up the minor because I already have a job lined up, and for the most part they've been really interesting. I've heard the same thing from people who've taken some of the classes I haven't. I'd highly recommend Structure of Industry and Money and Banking.<br><br>Also the weather is typically not good, and the area is a little sketchy. Public Safety does a pretty decent job though.<br><br>I'm very pleased with the education I got, but I think I think the social aspect could stand to improve. It isn't awful, but it certainly isn't the best.<br><br>", "<b>Username: livn487</b><br><br>We've visited Georgia Tech and Purdue. They are both not appealing to her- mostly due to the size of the school and campus layout. She did not like the \"vibe\".<br><br>@AeroRPI: Congrats on your job. Did RPI's Career Services help you land the job? I imagine there are many many companies who recruit at RPI. She looked into Biomed and your comments confirm her findings. Chemistry was always a favorite subject but now she is really enjoying Physics so EE is a potential in addition to Chem E.<br><br>She loves all of the sports you mentioned! Playing with geeks (or closet geeks) is great fun:) Thank you for not mentioning quidditch! We've heard enough of it- usually mentioned in some weird way on many campus tours.<br><br>Thank you for your honesty about the social aspect. It is one of the concern areas for her. Does the university host school sponsored events? Are they well attended? I'm not sure that hanging out at a stereotypical frat party would be appealing for her. BUT, I realize I'm thinking of the frat parties from my days in college maybe it's different now or at RPI:)<br><br>Lastly, I know she'd like to see the surrounding areas where students like to go. What/where are the popular hangouts?<br><br>", "<b>Username: GraniteStateMom</b><br><br>Livn 487: Who does RPI compete with for students? RIT and WPI?<br><br>I think that the schools that RPI competes with may vary depending on where the applicant is from. Here in NH, WPI is a huge competitor. Most of the kids that we know that go to RPI are, interestingly enough, not engineering majors. Many engineering kids choose WPI because of its strong regional reputation and large regional alumnae network.<br><br>My D has been accepted to both RPI and WPI and is having a hard time choosing. RPI offered more merit money but she's not sure that she gets that same friendly feeling from the school. She has relatives that graduated from both (dad an uncle from WPI and aunt from RPI) so it's sure to be a fun month with decision time approaching!<br><br>", "<b>Username: livn487</b><br><br>@GraniteStateMom: Do you think RPI was lacking in the friendly feeling or was it that WPI went above and beyond during your particular visit? It's a qualitative element describing the vibe. I want to be somewhat informed of your experience because we are travelling far across NY and MA with just over 24 hours in town to check out RPI. We live in the midwest and do not know any current students attending or looking at RPI or WPI. I'll have my d look into WPI to see if she wants to swing by to take a look at the campus.<br><br>", "<b>Username: fauxmaven</b><br><br>Well,my son is a senior at CSW .He is graduating in ME ,and going into a PhD programming at OSU or Perdue . Perdue is paying for him to fly out there . Case has the most generous aid packages ,IMO . He started with 17k as a freshman ,and it went up from there . He loved the school,but did not enjoy Cleveland . We are from NJ .Only 17 kids came his year as freshmen from NJ .<br><br>", "<b>Username: AeroRPI</b><br><br>\"\"@AeroRPI: Congrats on your job. Did RPI's Career Services help you land the job? I imagine there are many many companies who recruit at RPI. She looked into Biomed and your comments confirm her findings. Chemistry was always a favorite subject but now she is really enjoying Physics so EE is a potential in addition to Chem E.<br><br>She loves all of the sports you mentioned! Playing with geeks (or closet geeks) is great fun Thank you for not mentioning quidditch! We've heard enough of it- usually mentioned in some weird way on many campus tours.<br><br>Thank you for your honesty about the social aspect. It is one of the concern areas for her. Does the university host school sponsored events? Are they well attended? I'm not sure that hanging out at a stereotypical frat party would be appealing for her. BUT, I realize I'm thinking of the frat parties from my days in college maybe it's different now or at RPI<br><br>Lastly, I know she'd like to see the surrounding areas where students like to go. What/where are the popular hangouts?\"\"<br><br>Thanks! Not really. The company I was hired by has RPI as a target school, so they hire a bunch of people from here every year. My name somehow got on a list and they actually asked me for a resume -- but I have no idea who put my name on that list. I did go there for a resume critique once, but I had done a bunch of research online on how to do it right and they only had a little bit of advice. It was nice to have someone say \"that looks about right\" though. They also hand out padfolios if you visit them during your sophomore year, and it's nice to get a free one.<br><br>I have seen people making a fool of themselves on the '86 field playing Quidditch, but uh... just nope.<br><br>I'm not sure what you mean by university sponsored events. I mean we have sports (although really the only one we care about is Men's Hockey), and we do host the occasional concert, but it is certainly not an every weekend occasion.<br><br>RPI's Greek scene really runs the gamut. While we have some that are fairly close to the stereotypes, we have quite a few that are really quite different. It depends on the house, and during rush the frats try pretty hard to get the girls to come hang out too, so you can really get a feel for what places are like and where you might want to go in the future.<br><br>I'm not really sure if there are \"hang-out\" places in Troy for the under 21 crowd. Basically most people will be good friends with their hallmates, and maybe the people in clubs or frats/sororities they join. RPI really does do a great job during SO and Orientation getting you meeting people, doing things, and making friends, so basically you'll find a group of people and bomb around for a week. Then school and work starts, and you fit the fun stuff in on the weekend.<br><br>There is a ton of stuff in Albany, if you have friends with a car, or come in with AP credit and get labelled a sophomore 2nd semester.<br><br>", "<b>Username: GraniteStateMom</b><br><br>@livn487 - I replied via PM so as not to hijack the thread!<br><br>", "<b>Username: 1214mom</b><br><br>My son has both RPI and CWRU on his final list. We went to RPI last fall and really liked it. The kids were very nice and very helpful. We wanted to see a lab so one student spent about 15 - 20 minutes trying to help us. Even my son noticed how nice the students were. The students seemed very smart but pretty laid back. The dorms were pretty old but functional. Case gave us more scholarship money but I think my son's final decision will be either RPI or Georgia Tech. He won't consider Maryland College Park, even though it would be half the cost. If you care, Case is actually ranked higher overall in US News. RPI comes up high on producing students who get PHDs and on making the most money. They are both great schools.<br><br>", "<b>Username: cptofthehouse</b><br><br>They are both excellent schools and I know kids in both. My personal preference is for Case because of the city of Cleveland and the better balance that the school has. However, kids have preferred RPI. I suggest your daughter spend a day or so shadowing a student to get the feel of each school, and if neither is a big difference to her, go with the one with the lesser cost.<br><br>", "<b>Username: livn487</b><br><br>Hi Everyone, Just wanted to thank you again for your replies. We visited RPI last week (it was 1 of 4 schools) and the visit exceeded my d's expectations:) She received a warm welcome and the academics on the technical side sound solid. Only one concern for us was an undercurrent that \"writing and liberal arts classes are a nuisance.\" I know, I know it's a tech school....We know that stereotypically engineers may not enjoy writing BUT effective communication is needed throughout work and social life. Our d is a very well rounded student who enjoys foreign language and english class almost as much as her science/math and economics. We know that econ is a common minor at RPI so no concerns there. Any perspective on if RPI is a good fit for our d?<br><br>On the social front, she has no concerns. The students at RPI seemed happy, interactive with one another, and full of school spirit (with their RPI colors and school clothing). We visited the athletic facilities and the staff and students were informative and every place we looked all was inviting. We ate in a school cafeteria and it was enjoyable to grab lunch, people watch and talk to some of the students.<br><br>Our tour guide was informative and quite funny. We appreciated the snarky posters around campus for the student gov elections.<br><br>Our d will likely add RPI to her list of schools. I'm thankful that she is finding/visiting many schools that she likes.<br><br>", "<b>Username: 1214mom</b><br><br>I worry a little about the lack of foreign languages at RPI. However, I've convinced myself that it's OK bc my son will likely have a double major, so he won't have many credits left to take electives anyway. Just food for thought.<br><br>", "<b>Username: GraniteStateMom</b><br><br>I agree about the lack of foreign language. My daughter has taken 4 years of Arabic in high school and was hoping to continue in college. It won't be a deal breaker for her though.<br><br>", "<b>Username: gsmomma</b><br><br>When we visited RPI, my D was told that she would need to attend a community college to take a language class. She wanted to minor in Spanish, and major in engineering, so it was a deal breaker for her. She attends another college now, and likes the ability to have a non-science or engineering class each term.<br><br>She has several friends who attend RPI, since they didn't want to take humanities classes. They are all very happy.<br><br>It all depends upon what your child wants and what is a good fit.<br><br>", "<b>Username: jujumak</b><br><br>My son is admitted to both. Here's some stats from U.S. News Rankings and reviews<br>RPI endowment 2010 $629,728,000, Case $ 1,462,627,000. Case has more $ for scholarships and aid. Classes with less than 20 students, RPI:42.9%, Case: 60.4%,<br>from Collegeboard.com: Student/Faculty ratio: RPI: 15/1 Case: 9/1.<br><br>My son was offered $12k more from Case than RPI. Case's campus seem prettier and nicer, newer. Cleveland was really nice with cool architecture and restaurants. Troy was depressing and falling apart. RPI has lower acceptance rate. Dr. Jackson, president of RPI's welcoming address was uninspired, canned and sleep inducing. Did not meet Case's president.<br>Albany is not that close, and as a city, has alot of boring looking cement type buildings. Cleveland's architecture was mind blowing! Case has newer, nicer facilities, dorms, dining hall, lounges, RPI has better rep for engineering? Case has better lifestyle, free printing, free rides on buses, free laundry, free software installed on your computer. RPI encourages you to buy their laptop and \"clicker\" for classes at $1800, albeit with 4 year warranty.<br><br>If RPi comes up with better aid, it would be harder for me to choose right now, but as of now Case is winning.<br><br>", "<b>Username: livn487</b><br><br>Thanks for sharing the info. All great info...<br><br>My d is a junior so we are in the mid stages of defining the list of schools to apply to. We visited Case during the summer so it was hard for her to get a feel for the personalities of the students.<br><br>It sounds like you might be asking RPI to come up with better aid (to match Case's offer)? I'd be interested in hearing the outcome.<br><br>Lastly, would you mind sharing what other schools your son applied to? My d is also interested in Lehigh.<br><br>", "<b>Username: 1214mom</b><br><br>My son applied to Georgia Tech, CW, RPI, and University of Maryland, our state flagship school. I've heard Lehigh is very preppy. not sure what your location is, but Virginia Tech is very good for engineering, and I hear Purdue is also very good.<br><br>", "<b>Username: originaloog</b><br><br>Our son is an alum of RPI Class of '08 and during his senior year visited both CWRU and RPI among others. We had a very good visit at CWRU and visited the CompSci department in Olin on our own. We were greeted by a professor as we roamed the hallway and was invited to a department picnic outside Olin that noon. Nice. Similarly at RPI he met with aProf Krisnamorthy and attended a compsci 1 lecture. He noted after the RPI visit that he could see himself attending college there.<br><br>The choice boiled down to finaid, distance from home(which he visited zero time other than breaks), and program(CompSci-CogSci interdisciplinary AI). He enjoyed his 4 years at RPI a lot, made a number of close friends, got a top notch education and is now working in LA for one of the major computer gaming companies as a game designer. He was also able to graduate with a double major(CompSci-Psych) and a double minor(Philo-Games and Simulation Sci), something that intrigued job interviewers.<br><br>If your student has a specific major in mind I would recommend that she research the department of colleges she is considering. What are the faculty resources, course offerings, lab facilities, seminars/colloquia, undergrad research/internship opportunities? I know that our son attended some of the brown bag seminars featuring outside speakers held monthly, worked as an undergrad assistant in the RAIR Lab, and participated in the annual Gamefest competition several years, things that enriched his undergrad experience greatly.<br><br>Good luck!<br><br>", "<b>Username: 1214mom</b><br><br>Great post Original, and I'm happy to hear your son is doing well because my son accepted at RPI yesterday.<br>One other thing to consider is the possibility of changing major, and if the school would be as good in another major. For example, my son is planning on engineering, but I'm guessing he may actually wind up with a degree in math or physics. RPI seems to have really good programs in those areas. However, if you're looking for a more liberal arts feel, Case seems more like the place to be.<br><br>", "<b>Username: jujumak</b><br><br>Livn487:<br>My son applied to Georgia Tech, RPI, Northwestern, Cornell, Tufts, Carnegie Mellon, Upenn, Dartmouth, Vanderbilt, Duke, Safeties: Umass, Udel, Boston, Binghamton, Stonybrook and Case Western. He was accepted to Case, Georgia, RPI, Boston, Bing,Stony, Umass and Udel. The final choices ended up to be RPI, Case, Boston and Georgia Tech.<br><br>I appealed all the aid that was initially offered and received more in response. With RPI, they wanted a copy of my award letter from Case (since this was the one I cited). I asked if they could match their aid. In essence, they offered $4k more in grants and lots more in loans (which I didn't really want). Financially speaking, Boston U was the worst to deal with in terms of their responses (I met with FA on an admitted students day and basically, she said they don't match aid/grants/scholarship and handed me a pamphlet on loans and told me that although their school was expensive, it was worth taking out more laons for.... duh! I also felt she sounded condescending and that she was tired of repeating the same messages over and over to all who had meetings with her.. I wonder why they even offer such meetings.<br><br>Anyway, in the end, so far my son is going to Case. over 30k in grants/scholarships and about $13k in loans.<br><br>btw, Georgia tech FA person always sounded like I just woke her up and spoke really really slowly. After a couple of weeks of no response, I called, and found out she no longer worked there, but no one bothered to tell us! I could only chalk this up to them being a State school. This turned me off since I felt administrative-wise, they were not on top of things. Plus their admitted student website looks so amateurish, that I'm not sure technologically speaking, how up to date they are.... again, state school traits?<br><br>good luck to you!<br><br>", "<b>Username: livn487</b><br><br>jujumak:<br><br>Thanks for sharing the details and best wishes to your son. We continue to hear many good things about Case.<br><br>My d enjoyed her visit to RPI very much so it's probably right in the running for her along with RPI and probably Lehigh. She decided to pass over Boston U and she did not care for Georgia Tech. In fact Georgia Tech cancelled our visit with them after we bought plane tickets to Atlanta last year. It was in Dec and they decided to \"shut down\" for the holidays and they did not return any of our phone calls for requests to arrange to meet with a grad student or someone. We visited anyways and found many people on campus....it was hard for any of our family to be positive. Then, we trekked over to Emory (but they have no engineering program-- only a 3/2 with Georgia Tech) which was quite nice and very appealing.<br><br>Many of her other schools of interest are ones that your son applied to--Northwestern, Cornell, Tufts, Carnegie Mellon, Vanderbilt, Duke and there are a few others. All very selective and difficult to get into.<br><br>Thanks again. Enjoy the rest of his senior year and graduation!<br><br>", "<b>Username: my3gr8boyz</b><br><br>HI!<br><br>I'm new to this thread and found my way here because of a poster whose son seems interested in the same schools we are interested in. Then I came here and found that many kids (boys and girls!) have the same lists of schools! My son is still a Junior, so we are earlier in the process. We have seen RPI, WPI, and Lehigh, and Tufts. Still plan to see Penn, Cornell, Carnegie Mellon, and Case. He is VERY interested in Duke, but we don't know enough about it yet. So where did everyone decide? Our vibe from our RPI visit was not a good one, unfortunately. Kids were not outside, dorms were very old and drab, friendliness was not there. I find it so ironic that 4 years can come down to a particular day or a certain tour guide. Ever seen the thread of \"stupidest reasons a kid did not apply to a certain school?\" or the one entitled, \"Schools that were crossed off the list after the tour\". Pretty funny stuff!! I may PM some of you to pick your brains as to good classes to take as Seniors, financial aid, test scores, etc. Good luck to the future engineers!<br><br>", "<b>Username: livn487</b><br><br>Hi my3gr8boyz: Feel free to PM me or we can hijack this thread if we want to talk about RPI. Yes, the lists of schools look the same:) I've got a junior d and we've been on many tours so we are starting to get past the tour guide and info session first impression and a little beyond the gothic and georgian architechure. We skipped over Penn so I'd love to hear what you think.. and she was not interested in WPI. Otherwise, we've toured all that you mention and then some.<br><br>School is still in session afor her and i've been waiting to talk to her about her list of potential colleges. It is way too long in my mind.<br><br>", "<b>Username: 1214mom</b><br><br>Hello,<br><br>Sorry to hear you didn't chave a great experience at RPI. We actually had a great visit to RPI, everyone we have encountered along the way has been very helpful, and my son will be going there in the fall. We never visited Case, but it seems like a very good school, and they have great merit aid packages. We visited GT and the visit was wonderful (my son spent the night with a student and GT and RPI were his final 2 choices, but engagement<br>after the visit was terrible, which is why my son won't be going there in the fall. (As someone indicated, sometimes it's small things that make a huge impact). Feel free to PM me also if you'd like to discuss anything. Other parents from CC have been very helpful in this process.<br><br>", "<b>Username: jujumak</b><br><br>1214mom:<br>what do you mean \"that engagement<br>after the visit was terrible\"?<br><br>", "<b>Username: 1214mom</b><br><br>At Georgia Tech, I often had trouble getting the people on the phone that I needed, people didn't give correct information, they didn't return e-mails promptly, if ever, things like that. Actually, on about April 30th I reached out to a couple of people not within admissions or financial aid, and they were more responsive. I have had several e-mail dialogues with RPI, and people have always been helpful, considerate, hooked me up with other people as necessary, things like that. Even on the last day when my son was deciding between GT and RPI, and waiting to hear final scholarship amount, RPI said take extra timeif you need it... Their \"customer service\" has just been far superior to that of GT, and GT is NOT a cheap school for those of us out of state.<br><br>", "<b>Username: livn487</b><br><br>@1214mom: It is disappointing to hear about your experience with Georgia Tech. As my earlier post indicated, GT was very unhelpful and rather dismissive with us. Anyhow, thanks for elaborating about them. My d did not enjoy the visit and crossed the school off. Our d did not like Purdue and she has not shown any interest in Virginia Tech. She is somewhat interested in UVa but we do not know much about their engineering program. She will likely apply to many schools and because she will be heavy into a fall varsity sport I'm STRONGLY encouraging her to begin brainstorming and drafting some of her college essays:) At this point she is definitely going to apply to RPI but I'd say it's not at the tippy top of her list of schools. Our state flagship, just feels way too big for her even though there's an honors program. She visited there last year and has been on campus for various science and sports competitions. It's in a nice city but it's all too familiar. She would prefer to venture out of state.<br><br>We have only good things to say about RPI and all the people we met on campus:) Congrats to your son on his choice!<br><br>", "<b>Username: rockvilledad</b><br><br>From a parents perspective RPI is very attentive. My son needed to choose a major and was able to set up appoints with two department chairs and meet with them, all in the span of three days.<br><br>My son is not in a fraternity but does go to their parties as it is the only social scene available to students. There are lots of nerds/gamers who stay in their rooms and play video games. Thus the frat parties are welcome on the weekends.<br><br>He does play Club ice hockey and that is fairly involved with practices, games and travelling. But it is a great group to bond with and a good activity to stick with.<br><br>", "<b>Username: my3gr8boyz</b><br><br>So did a google search today on RPI vs. RIT vs. WPI or something like that and got tons of 3 page CC threads. I've been reading for quite a while. I noticed on this particular thread that I had actually posted way back in May of '12! The really ironic thing is that I did my search tonight for my son who is now a junior, a different kid from the one I originally posted about. That son ended up being accepted ED at Duke into the engineering school.<br><br>My DS14 actually attended a robotics camp at WPI last summer. He didn't love it, but I don't know how accurate it was to what school is really like there. This son plays racquetball and would love to go to a school that has an active team (albeit at the club level). We just met two RPI grads at a recent r-ball tournament who really loved RPI and their r-ball program. They did not deny, though, that it is quite a nerdy place! They met (they are actually married) freshman year in the dorms (they say Barton is the best. That is also what our tour guide had told us. It's very new and also has A/C) The housing is based on admission time, so ED kids can get better housing, or are at least more likely to get their housing choice. RIT also has an active racquetball program and there are some schools south of us that have racquetball, but those are larger schools, which I don't think would fit this son (VTech, UVA, UNC Chapel Hill - UNC has 9% admit rate from our school!) I also think he should be a decent drive from home (RIT is farthest at 5 1/2 hours) Have thought about Case, but that is 11 hour drive. Purdue has R-ball, but is also large and is a 11-12 hour drive... RPI is looking best to me personally, but I guess it's really where HE wants to go, right? ;) We definitely need to visit again because of the dreary first visit we had. Maybe meet some professors this time, sit in on a class?<br><br>So livn487 and 1214mom - do you guys have any decisions yet? Did either of your kids do ED/EA? Where are you waiting to hear from? My inbox is almost full, or I would've PM'ed you both... ;)<br><br>", "<b>Username: deerpathdave</b><br><br>My daughter applied Early Decision and was accepted. I think the visit that made up her mind was the Engineering Open House. It gave her the opportunity to tour the labs and talk with a number of the students on a more one on one basis. And yes, I am also hearing that Barton is a good choice in dorms.<br><br>The other big differentiator for her is they do Division III sports. She is a softball player and should have a good chance of making the team.<br><br>", "<b>Username: 1214mom</b><br><br>My son is currently a freshman at RPI and is doing well. RPI has been a really good fit for him. He is currently a math major and will likely pick up another major as well. From the parent perspective, RPI has also been great.<br><br>", "<b>Username: Midhelper</b><br><br>My D loves RPI. As for housing though, she didn't put her forms in until April and chose Barton as her 10th choice and that's what she got...realizing now that Barton is awesome!!<br>She always thought she would go to a big school but she loves the size of RPI.<br><br>", "<b>Username: espacio123</b><br><br>I'm an undergrad at Case but also spent a summer at RPI doing research. RPI and Case are both very strong schools, but I do think that Case is much more balanced. In addition to a strong engineering program, we have a good number of students studying nursing, management, and the liberals which leads to a much more diverse and fun social environment. We're also in a city, albeit it's not as great as Boston or NYC, there is still plenty to do downtown and near campus. I remember frequently getting bored while at RPI because there was so little to do with Troy.<br><br>Case is also a school that seems to be going places. The university is shooting up in the rankings (higher than RPI in many things) and is getting a ton of donations from alumni to improve facilities and higher top notch faculty.<br><br>You're going to get a great education and a valuable degree in either school, but I think you will be much happier at Case.<br><br>Feel free to PM with any questions!<br><br>"]}