{"title": "big three liberal arts colleges vs lower ranked", "comments": ["<b>Username: Columbiyeah</b><br><br>How do the ‘Big Three’ LACs (Amherst, Williams, Swarthmore) really compare to those a notch lower (e.g. Grinell, Colgate, Davidson)?  I’ve read that the top three have lower teaching requirements for their professors, and more allowance for research.  And they have more faculty who are prominent internationally.  But are the students on average noticeably brighter?  Is it a more truly intellectual atmosphere?  Coursework any more rigorous?<br><br>", "<b>Username: OneMoreToGo2021</b><br><br>Yeah, the kids at the “big 3” are a little smarter, a little more accomplished, a little “better” on average than at the other schools mentioned.<br>But the difference is not enormous, in fact it’s pretty small. At any of those schools named, the individual student is going to be the single biggest factor in determining her overall college experience.<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>And they have more faculty who are prominent internationally.<br>\"\"<br><br>If you were to consider faculty scholarship in, for example, economics as an indicator of faculty prominence in this field, you would find overlap across categories of schools as you represented them.<br>https://ideas.repec.org/top/top.uslacecon.html<br><br>", "<b>Username: Hapworth</b><br><br>By “a notch lower” I assume the OP is referring to US News or overall prestige.  My take?  For the schools in the top 50 (and even this is a somewhat arbitrary cutoff), there’s no significant difference among schools.  Two years ago, Mount Holyoke dropped down to 41, but I never thought of it as some lesser version of Bryn Mawr or Barnard.  Honestly, Pomona is “hot,” but Macalester not so much, but you’re going to have a tough time convincing me that those poor Macalester kids are getting a lesser education.<br>I don’t know.  Do high school seniors in the LAC market really think in these terms?  I mean, sure, I guess it would be a rare student who chooses, say, Juniata over Swarthmore, but don’t most LAC kids worry more about finding the right place?  I’ve never met someone who says, “Gee, I love everything about Grinnell, but it’s lower than Amherst.”  Or, “I really want to go to Bates, but Williams is supposedly #1.”<br><br>", "<b>Username: ucbalumnus</b><br><br>The traditional differences may shrink, and the more important difference may be how well each one handles distance / online education.<br><br>", "<b>Username: tk21769</b><br><br><br>\"\"<br>But are the students on average noticeably brighter?<br>\"\"<br><br>Hard to say.  Judging solely by average HS GPAs, test scores, and admit rates, maybe.<br>Schools at the very top of the rankings tend to have more money;  more money tends to buy more stuff (presumably stuff that students/parents/faculty want, more or less). However, one reason those schools have more money probably is that they focus on attracting and admitting many students with high earnings potential, who will make big alumni donations to sustain/grow the endowment. How do they recognize applicants with high earnings potential?  Not necessarily by sheer intellectual brilliance (relative to other applicants).<br><br>", "<b>Username: circuitrider</b><br><br>There seems to be a lot of confusion in this regard. First of all, no one over the age of sixteen refers to the top LACs as the “Big Three”. That’s a term that historically has been reserved for Harvard, Yale and Princeton and for more reasons than the mere fact that they appear at the top of a magazine poll year after year. But, that is the universe most h/s students live in and that explains the various attempts over the years to capture what you mean when you want to say “The three LACs that appear at the top of the USNews poll every year.”<br><br>\"\"<br>Schools at the very top of the rankings tend to have more money; more money tends to buy more stuff (presumably stuff that students/parents/faculty want, more or less).<br>\"\"<br><br>This is true. Or, to put it even more bluntly, the USNews tends to filter for money, specifically money spent per student, which accounts for about 7% of a college’s score.<br><br>\"\"<br>However, one reason those schools have more money probably is that they focus on attracting and admitting many students with high earnings potential, who will make big alumni donations to sustain/grow the endowment.<br>\"\"<br><br>Not necessarily. Sure, having generous donors over the years counts for a lot. But, all it takes is one or two high-rollers at strategic points in a college’s history for an endowment to take-off. After that, it’s all about careful management. Ask Harvard, they have one of the lowest alumni giving rates among wealthy universities in the country.<br><br>\"\"<br>How do they recognize applicants with high earnings potential? Not necessarily by sheer intellectual brilliance (relative to other applicants).<br>\"\"<br><br>True. In fact, I would say the opposite: Sheer intellectual brilliance is probably a hindrance to becoming a high-rolling donor and there are rankings that tend to support this. Of the three LACs that habitually occupy the top three spots on the USNews poll, Swarthmore (#3), is probably the best known for its hot house intellectual atmosphere. But, according to collegescorecard, its alumni barely earn more than Wesleyan (currently #17 in the poll) grads six after graduation. Why? IMHO, because super smart kids tend to go into academia, the arts, and government service none of which are known for their high pay.<br>I’m only familiar with the Little Three, Wesleyan, Williams and Amherst which - like The Big Three - have been playing round-robin varsity athletics with each other for well over a century and share certain features with each other like colorful tail-gate parties, hilly campuses and snowy winters. The dirty little secret is that each one has a formula for attracting smart kids who excel in sports, will major in Economics and groom themselves for internships in i-banking and management.<br>Hope this helps.<br><br>", "<b>Username: happy1</b><br><br>For LACs I think fit is very important.  We visited a number of LACs with my D and each one seemed to have its own personality/vibe.  Some she felt very comfortable at in terms of the students, academic strengths etc. and a few she couldn’t wait to leave.  Personally, I would value fit over perceived prestige.<br><br>", "<b>Username: Columbiyeah</b><br><br>I just came up with the term ‘Big Three’ since I always see those same three schools at the top of US News rankings.  I suppose very few people have firsthand experience of one of those three as well as a lower ranked LAC.  I actually graduated from an LAC that usually ranks around 15 to 20.  While most kids were pretty bright, there were plenty who came across as mediocre or nothing special intellectually (though that’s relative, and I don’t mean to sound snobbish).  A lot of legacy admits I guess (though I was a legacy myself  ).<br><br>", "<b>Username: theloniusmonk</b><br><br>“Do high school seniors in the LAC market really think in these terms?”<br>They definitely do, maybe not to adults, but to each other.<br>“I mean, sure, I guess it would be a rare student who chooses, say, Juniata over Swarthmore, but don’t most LAC kids worry more about finding the right place?”<br>LAC students are, not surprisingly,  similar to non-LAC students in that they also consider prestige, maybe even more than fit.  Here are Amherst college applications overlaps from Fiske:<br>Williams, Middlebury, Colby, Yale, Brown, Harvard, Princeton, & Stanford.<br>Those are the #1, 7 and 11 ranked in LACs, ivies and Stanford.<br>“Gee, I love everything about Grinnell, but it’s lower than Amherst.” Or, “I really want to go to Bates, but Williams is supposedly #1.”<br>I’m not sure it would even get to that, Grinnell and Bates don’t show up on the overlap lists for Amherst and Williams, at least in the most common schools.  If you’re basing your applications on ranking then you’re not applying to Grinnell or Bates.  Don’t the top-5 have the most applications among LACs?  Maybe not causation, but correlation for sure.<br><br>", "<b>Username: ucbalumnus</b><br><br>On these forums, LAC-interested students do tend to chatter more about the higher USNWR-ranked LACs, just like how students looking at universities tend to chatter more about higher USNWR-ranked universities.  Similar with parents.<br>While non-ranking/prestige fit factors are in reality more important for LACs (due to their small size, they are less likely to be able to offer “something [sufficiently good] for everyone”), it is not clear that LAC-interested students and parents necessarily consider such non-ranking/prestige fit factors more than those interested in larger schools.<br><br>", "<b>Username: Publisher</b><br><br>Attending a highly ranked LAC should result in more & better job/career opportunities than attending a lower ranked LAC.<br>Why ? Because LACs educate students across a variety of disciplines without specialization in a profession so employers want the best & the brightest because they will need to be trained. (This is overly simplistic, however.)<br>Grinnell, Colgate University, and Davidson College are all highly ranked LACs. But for the most prestige conscious positions–such as consulting & IB–Amherst. Williams, & Swarthmore (the Little Ivies) are the best schools among all highly ranked LACs–at least for East Coast placement.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> Publisher:<br>\"\"<br>Attending a highly ranked LAC should result in more & better job/career opportunities than attending a lower ranked LAC.<br>Why ? Because LACs educate students across a variety of disciplines without specialization in a profession so employers want the best & the brightest because they will need to be trained. (This is overly simplistic, however.)<br>\"\"<br><br>This does not seem to be unique to LACs, as opposed to being generalized to any type of college if the job is not strongly associated with a particular major and the employer is college-prestige-conscious.<br>However, some liberal arts majors at some LACs are somewhat pre-professional (e.g. economics (especially with “managerial economics” electives) for many “general business” jobs, or math and statistics for finance).<br><br>", "<b>Username: PurpleTitan</b><br><br>When it comes to endowment/resources, yes, it’s generally true that higher-ranked LACs have bigger endowments, but not universally true.  Grinnell has a per capita endowment roughly equal to WASP, for instance.<br>Colgate and Davidson aren’t exactly poor either, as Colgate has a per capita endowment figure on par with Cornell and Wesleyan and Davidson isn’t far behind, with an endowment in the range of JHU.<br><br>", "<b>Username: merc81</b><br><br>Some of the discussion on earnings results seems anecdotal. Colgate grads earn more in their early careeers (according to U.S. News) than those from any of Williams, Amherst and Swarthmore; By the same standard, Hamilton grads earn more than those from any NESCAC LAC; etc.<br><br>", "<b>Username: merc81</b><br><br>Correction, #14: “more than those from any [other] NESCAC LAC.”<br><br>", "<b>Username: collegemom3717</b><br><br>A lot of these posts are hypothesizing in the abstract:  For example, “Attending a highly ranked LAC should result in more & better job/career opportunities than attending a lower ranked LAC” (emphasis added)<br>But irl…how much does it really? Compared to say, the difference between actual achievement / experiences? How meaningful / substantial are the differences in outcome between these schools really? Even setting aside grad schemes at IB & consultancies (who are known to value brand names), and individual ties to a school (ie, a hiring manager who is a fellow alum), do other posters believe that employers really differentiate substantially between these schools? That they pay a Williams grad more than a Colgate grad?<br>In my direct experience, no. In the companies where I have done hiring (which include a top 4 consulting firm and a Fortune 50 manufacturer) universities exist in broad bands- and even so, the college was never an important selection criteria. Experience - albeit in the form of internships at the entry levels- trumped everything else. School name might be seen as a plus, a validation, but I never saw a good CV from a no-name school put behind an ok CV from a top name. And between 2 strong candidates, where they went to college was never the decider. But: that is a random sample of 1. Anecdotal.<br><br>", "<b>Username: Publisher</b><br><br>@collegemom3717 : What are the top (4) consulting firms ? I know MBB, but what do you consider to be the fourth–Deloitte ?<br><br>", "<b>Username: Publisher</b><br><br>@collegemom3717 : Again, regarding your post #16 above, no one has asserted that Williams College grads are paid more than Colgate grads, just that, as we agree, the Williams college name is more valued than almost all other LACs by IBs & the top 3 consulting firms.<br>Hiring managers are reputed to favor alums from their alma mater as reflected in actual hiring / placement stats.<br>With respect to OP’s post which started this thread, there is more job placement value & opportunity in a degree from Williams College, Amherst or Swarthmore than the other listed schools. Not a hypothosis, but based on actual placement stats. Of course, AWS have a regional recruiting advantage not enjoyed by Grinnell or Davidson.<br><br>", "<b>Username: monydad</b><br><br>re #13,  @PurpleTitan, Colgate’s endowment per capita is not directly comparable to Cornell’s, because three of Cornell’s undergraduate colleges receive funding from New York State in lieu of funding from an endowment . As such they are called “Statutory colleges”. The other colleges there are called the “endowed colleges”.<br>Colgate does not receive funding of this sort from New York State.<br><br>", "<b>Username: PurpleTitan</b><br><br>@Publisher: “the Williams college name is more valued than almost all other LACs by IBs & the top 3 consulting firms.”<br>I think @collegemom3717 point is that companies evaluate the individual, not the school. And I’m not going to agree with your assertion. Williams grads do well at placing in to IB and MBB, but Williams also has a greater proportion of bright high achievers than most other LACs. If you switch the student bodies and Williams and Colgate, would Williams still do better? I’m not so sure, so I wouldn’t say it’s the name. I mean, Williams is a top LAC, but it isn’t HBS or the GSB. Honestly, no undergrad college (either a LAC or within a uni) is.<br>BTW, I’ve never heard of Swarthmore as a top target for IB or MBB.  It’s more of a PhD factory. Colgate probably places more in to IB than Swarthmore.<br><br>", "<b>Username: Publisher</b><br><br>Of course, employers evaluate individuals. I never suggested otherwise. But employers select which campuses at which to interview & to solicit resumes.<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>With respect to OP’s post which started this thread, there is more job placement value & opportunity in a degree from Williams College, Amherst or Swarthmore than the other listed schools. Not a hypothosis, but based on actual placement stats. Of course, AWS have a regional recruiting advantage not enjoyed by Grinnell or Davidson.<br>\"\"<br><br>Not sure what @Publisher means by “actual placement stats”, but here is what I have been able to find on four websites.<br>About 37% of Amherst seniors were gainfully employed in what it broadly refers to as “Business and Finance”, the highest rate of the three:<br>https://www.amherst.edu/system/files/media/YearInReview1718.pdf<br>About 18% of Wesleyan seniors go into Financial Services and Consulting with another 10% choosing careers in Media and Communications:<br>https://www.wesleyan.edu/careercenter/career-outcomes.html<br>About 26% of Swarthmore seniors go into what it refers to as 'Finance and Consulting\" (which parenthetically includes everything from Sales and Trading, i-banking, as well as Advertising and Marketing):<br>https://www.swarthmore.edu/career-services/post-graduation-statistics.<br>Sorry, couldn’t find comparables on the Williams website. But it does have this rather remarkble interactive graph:<br>https://web.williams.edu/Mathematics/devadoss/careerpath.html<br><br>", "<b>Username: Jon234</b><br><br>I would suggest Carleton kids  are the academic peers of those at the three schools the OP mentioned. Maybe it is slightly lower in those ridiculous rankings on account of its location rather than anything pertaining to the academics there and the intelligence of the student body?<br><br>", "<b>Username: privatebanker</b><br><br>With the changing ethos of the younger generation, using ib and consulting as the yardstick of undergraduate excellence is very 1990s.<br>It’s also boring when every thread discussing school prestige and employment prospects always devolves to this single narrative.<br>The top lacs and there are many more than 3, have awesome resources and opportunity.  The students and professors are universally bright, accomplished and    full of promise.<br>Apply to all and go to the one that accepts you, you can afford and you personally like the best. It’s really that simple.<br><br>", "<b>Username: PurpleTitan</b><br><br>@Jon234, Carleton kids definitely match WAS kids in pure intellect. Carleton probably offers less in East Coast IB/MC opportunities, but as @privatebanker noted, that’s a rather narrow way to look at things and in any case, the difference in opportunities in even those industries among all these LACs discussed just isn’t as big as some folks make them out to be. We’re not comparing a top 10 LAC with a 100-110 range LAC after all.<br><br>", "<b>Username: PurpleTitan</b><br><br>And honestly, even attending a top 10 LAC vs. 100-110 LAC just doesn’t make all that much difference if you’re fundamentally a smart, hard-working, driven person with people skills. I see people who graduated from non-selective no-name LACs that nobody outside of their low-population Midwestern state has ever heard of retire as MD at an investment bank (yes, picking up a M7 MBA along the way, but that just shows that where you go for undergrad isn’t as momentous as many people on here make it out to be on here).<br><br>", "<b>Username: Jon234</b><br><br>The discussion has moved on a bit (not in a bad way) from the OP’s Initial questioning.<br>”But are the students on average noticeably brighter? Is it a more truly intellectual atmosphere? Coursework any more rigorous?”<br>I’m not familiar with Davidson and Grinnell, the other two colleges mentioned.<br>I’d imagine the likes of Haverford, Bowdoin and Wellesley just to throw three more names into the ring, would be equal to WAS in terms of student smarts, intellectual atmosphere and rigour.<br><br>", "<b>Username: Jon234</b><br><br>Really sorry. I misread Colgate as Carleton in the OP. Stressful day.<br><br>", "<b>Username: mom2jgd</b><br><br>@Jon234  Funny that you misread the comment – thought you brought Carleton into the conversation because it’s a much more respected institution. And IMO, it is.<br><br>", "<b>Username: privatebanker</b><br><br>Much more respected than Colgate? Near peers aren’t much more anything compared to each other.<br>On the east coast.  It’s probably inverse anyway.  Colgate has great cache.  No skin in the game.  FWIW.<br><br>", "<b>Username: merc81</b><br><br>Yes, I didn’t think Carleton was out of place in this discussion. And it is one of the few LACs that have finished among the top three in U.S. News’ annual ranking.<br><br>", "<b>Username: privatebanker</b><br><br>Carleton is fantastic.  Colgate appears to be pretty great too.<br>All top tier imho.<br><br>", "<b>Username: Lindagaf</b><br><br>Where is Pomona in this conversation? Bowdoin? Big Three is meaningless in LACs.<br>Having watched far too many college decisions reactions videos, it would appear that the overwhelming majority of those high achieving kids (at least the superstar students who are posting their videos on YouTube) are ALWAYS applying to most Ivies, Stanford, Williams and Pomona. And funnily enough, they rarely get into Williams or Pomona. Maybe that’s more indicative of the type of kid who wants to rack up subscribers not being a great fit for those schools.<br>As so many of these posts go, this one is evolving into a case of splitting hairs.<br>I won’t name this LAC, which is reasonably highly ranked, but not WAPS. It has consistently had more Fulbright Scholars for the last five years than any other LAC. Many grads go into Big Four accounting firms. I know kids with jobs already lined up at JP Morgan. I know a girl who’s been offered a job post grad at nearly six figures, not in banking or accounting or management consulting.<br>My point is that once you’re talking about the top 20 or so LACs, many grads are going to have excellent outcomes and there is a fair bit of overlap among applicants at all of those schools.<br><br>", "<b>Username: OneMoreToGo2021</b><br><br>Pomona is decently strong.  I’d put it up there with Williams, Amherst and Swarthmore.  Bowdoin is a tiny bit lower in terms of sheer intellectual horsepower.  Still a great school, and for the right person, it could be the best LAC of course.<br><br>", "<b>Username: Lindagaf</b><br><br>What about Reed, @OneMoreToGo2021 ? It’s not even in the USNWR rankings because it refuses to provide them with the info. Many here would argue that Reed has more intellectual horsepower than any of them. Yet few would suggest that its grads go on to highly paid jobs.<br>What about Harvey Mudd, whose grads make more money post grad than Harvard or MIT grads.<br>Is the point that to be successful, the college must produce money-makers?<br>More splitting of hairs.<br><br>", "<b>Username: OneMoreToGo2021</b><br><br>Reed is below all those schools mentioned @Lindagaf.  Not enough money there to attract the best.<br>These are all just opinions of course.  But perceptions do shape reality to some extent.<br><br>", "<b>Username: Mwfan1921</b><br><br><br><br><br> OneMoreToGo2021:<br>\"\"<br>Reed is below all those schools mentioned @Lindagaf.  Not enough money there to attract the best.<br>These are all just opinions of course.  But perceptions do shape reality to some extent.<br>\"\"<br><br>These sound like opinions of someone who is not fully informed. And yes, I am sure your perceptions do shape your reality.<br><br>", "<b>Username: privatebanker</b><br><br>I would suggest the notion any of these so called top 3  having more intellectual horsepower than the students at the top 20 or 30 lacs is horse… something else.<br>Perhaps slightly better high school academic profiles.  If one believes that is totally indicative of ultimate academic prowess or ability, I politely disagree.  Most people, thankfully don’t peak at 17.<br>Also ,academic profiles of high schoolers are a combination of many factors including economic backgrounds and home life.<br>Many flourish and prove to be world leaders in science and academia even from, gasp lol, state schools.<br><br>", "<b>Username: OneMoreToGo2021</b><br><br>@Mwfan1921 - I will admit my perceptions are shaped to some extent by the lengths Reed went to to recruit me some 30 years ago…<br>Today, Reed has middling SAT scores combined with a very poor 17% yield for admits.  Hard to shape your class with those stats.<br><br>", "<b>Username: Lindagaf</b><br><br>@OneMoreToGo2021 , Reed is certainly NOT below those schools intellectually.  I think Reed has the highest percentage of PhD candidates of all LACs.<br>Is Harvey Mudd “better” than WAPS because its grads earn more? I think most would say perhaps not, but if money earned is the deciding factor, then it surely must be better. And rightfully, some people would disagree with that.<br>I think, particularly, Williams and Amherst have the reputation they do because they have long histories of being associated with boarding schools and old money New England families. They are two of the oldest colleges in the country, and the fact that they are still around testifies to their excellence. Reed and Harvey Mudd haven’t been around anywhere nearly as long. Many people haven’t heard of them. It doesn’t mean they aren’t great colleges.<br><br>", "<b>Username: PurpleTitan</b><br><br>Reed and Mudd dominate all other LACs in terms of per capita PhDs produced. Reed is top 10 in virtually all subjects. In STEM fields, it Caltech way above everyone, then Mudd, and then a huge drop. As in near an order of magnitude difference between Mudd and whoever is #3.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> Lindagaf:<br>\"\"<br>Is Harvey Mudd “better” than WAPS because its grads earn more? I think most would say perhaps not, but if money earned is the deciding factor, then it surely must be better. And rightfully, some people would disagree with that.<br>\"\"<br><br>Of course, the actual explanation for Mudd graduates’ higher pay is the distribution of majors there (heavy on better paid engineering and CS majors, light on lesser paid majors like biology).<br><br>", "<b>Username: merc81</b><br><br><br><br><br> Lindagaf:<br>\"\"<br>[Reed is] not even in the USNWR rankings because it refuses to provide them with the info.<br>\"\"<br><br>U.S. News ranks Reed 68th in its category, but appears to penalize it for noncompliance:<br>https://talk.collegeconfidential.com/reed-college/2151423-reeds-usn-rank-estimated-at-54-places-higher-under-a-fair-evaluation.html#latest<br><br><br><br> OneMoreToGo2021:<br>\"\"<br>Today, Reed has middling SAT scores combined with a very poor 17% yield for admits.<br>\"\"<br><br>Reed’s current standardized scoring profile places it near the most selective schools in the nation. It does face yield challenges, however.<br><br>", "<b>Username: apple23</b><br><br>If looked at by ACT middle ranges, Reed seems much like a top-end NESCAC, especially at the 75th percentile:<br>Reed: 30 to 34<br>Wesleyan: 31 to 34<br>Bowdoin: 31 to 34<br>Amherst: 31 to 34<br>Hamilton: 32 to 34<br><br>", "<b>Username: OneMoreToGo2021</b><br><br>Average Reed SAT is 1413.  That is with fairly low URM enrollment (black is 3%, Hispanic 7%).  This is a totally different league from practically all T10 universities of course, and when adjusted for URM enrollment, quite a lot lower than top NESCAC.<br>To me, those are middling numbers when we are talking about “top” intellectual horsepower.  Others may disagree.<br><br>", "<b>Username: vonlost</b><br><br>Reed is known for the relatively high percentage of grads who later earn a PhD:<br>https://www.reed.edu/ir/phd.html<br><br>", "<b>Username: PurpleTitan</b><br><br>@OneMoreToGo2021:<br>\"Average Reed SAT is 1413. That is with fairly low URM enrollment (black is 3%, Hispanic 7%). This is a totally different league from practically all T10 universities of course, and when adjusted for URM enrollment, quite a lot lower than top NESCAC.<br>To me, those are middling numbers when we are talking about “top” intellectual horsepower. Others may disagree.\"<br>I do disagree. I don’t see why URM enrollment should matter at all when evaluating sheer brainpower of a student body as I have seen zero indication that a non-URM with high stats is somehow dumber than a URM with the exact same stats.<br>So that’s why I prefer to go by alumni achievements when tiering colleges:<br>https://talk.collegeconfidential.com/college-search-selection/1893105-ivy-equivalents-ranking-based-on-alumni-outcomes-take-2-1-p1.html<br>If you use that methodology, all the dumb things like adjustments and gaming the rankings don’t matter. You either produce a high proportion of alums who achieve something or you don’t.<br>Reed is an Ivy-equivalent by alumni achievements. On par with Caltech, Georgetown, UPenn, Bryn Mawr, Carleton, CMC, Oberlin, Smith, and Wellesley<br><br>", "<b>Username: OneMoreToGo2021</b><br><br>@PurpleTitan  -<br>Thanks for the link to your earlier thread outlining your methodology for “ranking” the schools.  Very interesting, and I want to spend some time going through the thread.<br>But your argument is sort of weak here isn’t it, on the question whether Reed is comparable to Willams, Amherst and Swarthmore (WAS)?   You assign a score of 8 to “HYPSM + WAS LACs and Brown” and only a 5 to the group including Reed.  That’s the only point I am making here, originally in response to a challenge about Reed somewhere upthread: Reed is not in the same category as WAS, and your scores seem to support that view.<br>About minority representation and average SAT scores, I am sorry if I was not very clear.  URM at NESCAC will have much lower SAT scores than non-URM.  It is not difficult to find support for this fact (ephblog for instance contains some sources from an Amherst professor showing a 200 point difference).  Given the higher percentage of URM at WAS (particularly Amherst, which is more than double the URM representation Reed has), the higher overall scores at WAS are even more remarkable.  Of course, SAT scores are only one metric, and nowhere did I say (or believe) that \" a non-URM with high stats is somehow dumber than a URM with the exact same stats.\"<br>On average I think scores are pretty good indications of ability, especially in aggregate, with the understanding of course that any individual will evidence all sorts of idiosyncratic factors that presumably wash out when aggregated with others.  That is why I am very confident saying that a large student body with an average SAT score of 1500 is “smarter” than a similar size student body with an average score of 1400, while I would not necessarily make the same claim if comparing a single student with 1500 versus another with 1400.<br>As I said above, others can disagree whether scores are a decent proxy.  Some have suggested Ph.D production.  Well, maybe…  I can think of many reasons why the best and brightest do not necessarily get Ph.Ds…<br><br>", "<b>Username: vonlost</b><br><br>PhDs are occasionally associated with top intellectual horsepower.<br><br>", "<b>Username: OneMoreToGo2021</b><br><br>^ Social science Ph.D’s??  Education Ph.Ds?  As I have said, others may disagree with me…<br>I saw in the data that Reed is #3 in social science Ph.Ds…  #2 in Psychology…<br>Just so I am clear, I am not saying that there are not brilliant people who get Ph.Ds in any field.  But I would not weight a Ph.D in Psychology for instance the same as I do one in mathematics, if I only had that data point to guess the intellectual horsepower of the degree holder.<br><br>", "<b>Username: vonlost</b><br><br>^ You didn’t mention biology or physics, #2 and #3, in case you consider them legitimate.    Yes, math is at lowly #5.<br><br>", "<b>Username: OneMoreToGo2021</b><br><br>^ All the smartest physics students went to Goldman Sachs and Renaissance Tech before completing their Ph.Ds…  Just kidding, sort of <br><br>", "<b>Username: PurpleTitan</b><br><br>@OneMoreToGo2021:<br>“About minority representation and average SAT scores, I am sorry if I was not very clear. URM at NESCAC will have much lower SAT scores than non-URM. It is not difficult to find support for this fact (ephblog for instance contains some sources from an Amherst professor showing a 200 point difference). Given the higher percentage of URM at WAS (particularly Amherst, which is more than double the URM representation Reed has), the higher overall scores at WAS are even more remarkable. Of course, SAT scores are only one metric, and nowhere did I say (or believe) that \" a non-URM with high stats is somehow dumber than a URM with the exact same stats.”<br>OK, so if you believe what you said, then it doesn’t matter what the percentage of URM are in a student body if you are talking solely about intellectual horsepower, so why bring it up?<br>Some schools may or may not willingly take in URM with lower scores. I don’t give them bonus points just because they do. We aren’t comparing “non-URM intellectual horsepower”, after all. At least, I have no interest in a discussion that segregates racially like that.<br><br>", "<b>Username: suteiki77</b><br><br><br><br><br> ucbalumnus:<br>\"\"<br><br><br><br> Lindagaf:<br>\"\"<br>Is Harvey Mudd “better” than WAPS because its grads earn more? I think most would say perhaps not, but if money earned is the deciding factor, then it surely must be better. And rightfully, some people would disagree with that.<br>\"\"<br><br>Of course, the actual explanation for Mudd graduates’ higher pay is the distribution of majors there (heavy on better paid engineering and CS majors, light on lesser paid majors like biology).<br>\"\"<br><br>I think also if schools are located in higher COL areas that plays a roll.  You can live very well on a much lower salary in Maine, for example, than you could in much of Southern California.  Colby, Bates, and Bowdoin grads might be more likely to settle in Maine or NH, and other NE states where the COL is less than other parts of the country.<br><br>", "<b>Username: suteiki77</b><br><br><br><br><br> OneMoreToGo2021:<br>\"\"<br>@PurpleTitan  -<br>About minority representation and average SAT scores, I am sorry if I was not very clear.  URM at NESCAC will have much lower SAT scores than non-URM.  It is not difficult to find support for this fact (ephblog for instance contains some sources from an Amherst professor showing a 200 point difference).<br>On average I think scores are pretty good indications of ability,<br>\"\"<br><br><br><br>Asians (from Asia) and Asian Americans are URM at many NESCACs and often have higher SAT scores than non-Asians and non-Asian Americans.<br><br><br>I think that a high SAT score indicates a type of intelligence but doesn’t mean a person is smarter than someone with a lower score.  The smartest kid I know around here has a score that I think is just above what you get for putting your name on the test.  Brilliant and if you met him in person you would be certain this is so.  But he has severe test anxiety and doesn’t test well.  He is mature beyond his age and is charismatic to the extreme.  People want to talk to him, hear him talk, follow him.  He is a natural leader.  He talks with ease with adults and has since he was in middle school, now in Sophomore or Junior year in HS.  He is an amazingly talented writer.  He has done so many things in leadership in his school and community.  He is in an elite school (at least for our area) and top classes and getting As.  He is very academically capable.  His score shows to me that there is no doubt that judging people just by SAT scores will miss incredibly talented and brilliant students.<br><br><br>My child has very high SAT scores and is very bright but lacks the charisma of this other young man.  Of the two, the other boy has a head start on being successful in life as his outgoing personality, quick wit, and personality that attracts others along with his leadership skills make him a stand out and someone easy to picture as a great success in the future.  He would just have to get an interview anywhere to make anyone interviewing him want to admit him to school, hire him, etc.<br><br>", "<b>Username: OneMoreToGo2021</b><br><br>@suteiki77  - Asians might be underrepresented at some LACs but for purposes of score comparisons will never be categorized as URM (and that is consistent with the sources cited at ephblog).<br>About scores in general I do not disagree at all.  It’s crazy to use a single score solely to judge the intellectual ability or potential of a particular student, because of idiosyncratic factors.  That does not mean the scores do not have relevance for comparing two student bodies (say, at different schools) because the idiosyncratic factors wash out.<br>Also, I totally agree that people skills, charisma, drive - these are all important qualities, none of which can be captured by something like an SAT score.  Again, though, even in your story, the other kid you describe would have even greater potential if he had your son’s scores.<br>@PurpleTitan - Fair points about average SAT if your criterion for determining intellectual firepower is average scores, which I implied (at least in part).  I need to think a little more on this.  Intuitively, I feel like the intellectual firepower of a school vis a vis any other is determined by no more than a small fraction of its students, maybe 20% at most.  Maybe I have internalized too much Pareto <br><br>", "<b>Username: suteiki77</b><br><br>All of those are excellent schools where someone would get a great education.  It is so very competitive to get a job as a professor at any school, even schools who admit most all students, that I think it is very wrong to think one school has ‘better’ teachers than another because it is rated higher on whatever rating scale.  Also, many schools now are test optional, another flaw with the idea that you can tell how intelligent by the average SAT scores when many are not reporting their scores and in some cases that could bring down those averages quite a bit if all were counted.<br>A student would be fortunate to get into any of these schools.  All of them have very good rates for grad school placement.  Colgate stands out as having a high return on investment.<br>I have seen many here who got into a more competitive school after getting rejected from several supposedly less competitive schools.  Schools use holistic evaluation of applicants, not only test scores and GPAs.<br>Also, if it were true that students at those 3 have higher SAT scores and a student with equally high scores went to a school where their average would be among the highest, they could be slight ‘big fish in a small pond’ and being that seems to have a positive effect on both college and career success.  Students who stand out at a college can get more research and other special opportunities and gain confidence and more skills and go onto a better career.<br>I have posted this elsewhere but I know someone who got tenure at one of the top Ivy league schools who was denied tenure at a local regional state college.  He is the same person now as when he was at the local regional school.  I had to take some classes at a local regional school for my job after having had an undergrad degree from a high ranking small liberal arts college and I found the classes at that local regional school to be better.  The best professors I ever had were there!!  This idea that higher ranked = better isn’t an exact thing.  In many cases it’s flat out wrong, I believe.<br>higher rank is often tied to the size of the endowment.  Endowment size can be tied to having one or a small number of very wealthy alumni rather than an overall high earning power of all grads.  It can give a false impression of the results of a degree from said college.<br>I know so many people with great careers who went to so called ‘no name’ schools.  I know people who went to top schools who don’t make a lot of money, and all sorts of people in between.  A top school can help get interviews and in some fields, it does seem to matter.  Some schools are feeders for certain grad schools, careers (finance, etc).  But all the schools you mentioned would help grads get interviews at least in areas where people have heard of those schools, and all should give a great education.  I would not pick one of the higher-ranked 3 over the other great 3 schools you listed if I didn’t like it more.<br><br>", "<b>Username: suteiki77</b><br><br><br><br><br> OneMoreToGo2021:<br>\"\"<br>Also, I totally agree that people skills, charisma, drive - these are all important qualities, none of which can be captured by something like an SAT score.  Again, though, even in your story, the other kid you describe would have even greater potential if he had your son’s scores.<br>\"\"<br><br>I don’t think that kid’s scores are going to stop him from being successful at whatever he does in life.<br>I think SAT is one measure to consider.  However, I wish our country would make funding for schools and resources and other aspects of education much more equal than they are now.  People who site the lower test scores of certain groups do not seem to be very interested in change so that all Americans can get an excellent education, no matter if they are wealthy or poor or in between.  Having high class sizes, small budgets, insufficient materials, etc, and then judging those schools as ‘failing’ and those students as less than is wrong.  And those students are not less intelligent. Given the same advantages of students in wealthier districts, they would achieve as much.  When I taught high school I often got the students no one wanted, the ones in the lowest level classes along with one middle level class.  I would often find those middle level (college prep class) students looked down on the students in the general education classes.  They were sometimes pretty snotty about it, too.  I remember lecturing the class after they called those kids, “scummy” because, truly, the main big difference between those kids in the college prep classes and those in general ed classes was money and family situation.  Those kids had more money, had parents that were more involved, bought them nicer clothing.  Often times they were not any brighter and quite a lot really in my opinion had lower IQs those a bunch in the general ed classes.  Those kids in the general ed classes often had a lot of family stuff that was weighing them down and also didn’t feel that school and trying hard had meaning to their futures.  There were so many who I felt could have been in Honors classes if they tried, if they had different childhoods, if they had more money, less chaos at home, etc.  Not all, but a good number of them.  And there were almost no kids in the college level who I felt could have been in Honors and a good number who would have been in general level if not for their families.<br>Our education system doesn’t treat students equally.  I personally think it is very wrong and immoral that people can buy a better education.  And I think it is short-sighted to waste the great potential of people who are not in school districts that get the deluxe treatment or average treatment others in America get.  Those people could all contribute more to society and achieve more and maybe discover the cure to cancer or Covid 19 or whatever if we allowed them to develop their abilities to the fullest.  That isn’t to say that there are not great schools in poor districts but they are great in spite of lack of sufficient funding and resources often times.<br>Judging students on the end result of years in an unfair school system without looking at fixing the unfair school system itself is short-sighted.  Unless one believes in eugenics, which would make a person a racist, then one has to think that there are a lot of factors that go into SAT scores.<br><br>", "<b>Username: merc81</b><br><br><br><br><br> suteiki77:<br>\"\"<br>Colgate stands out as having a high return on investment.<br>\"\"<br><br>Forbes thought so a few years ago as well:<br>https://www.forbes.com/sites/nataliesportelli/2017/04/26/10-expensive-colleges-worth-every-penny-2017/<br><br>", "<b>Username: Lindagaf</b><br><br>@OneMoreToGo2021 , Harvard might be the most famous university in the world (though I’m sure Oxford would have something to say about that), but most people know that it doesn’t necessarily have all the most intelligent students. Different colleges value different things.<br>In USNWR, Swat is tied with Wellesley at #3. There is no #4. Pomona is #5 and Bowdoin is #6. You cannot say that Bowdoin kids are less accomplished or intelligent or lacking in some way compared to kids at Williams or Amherst, and completely ignore Wellesley in this discussion.<br>Forbes puts Pomona at #1, Williams at #2, and Amherst at #6. Another list might rank differently. I think we all know that Williams and Amherst are possibly the best known among the general public (if they have heard of them at all), but people who know these colleges aren’t going to think a Bowdoin grad is second rate to a Williams grad. Too much hair splitting.<br>ETA: Re SAT/ACT scores, I don’t hold much store by them. I’m a test prep tutor and have helped plenty of kids get a really high score. They aren’t intelligence tests, and people who can afford test prep are usually going to do better than people who can’t.<br><br>", "<b>Username: OneMoreToGo2021</b><br><br>@Lindagaf - Fair points, I don’t disagree with most of them.<br>But we are not talking about Wellesley or Harvard or even Pomona here (although if you look back through the posts, I already answered you that I thought Pomona belonged right up there with Williams, Swarthmore and Amherst).<br>We’re all just talking opinion based on our experiences and perceptions.  I do not place Bowdoin in the same category as WAS, although obviously it is a great school.  Test optional is a fudge.  Schools always have the ability to disregard scores in any holistic admissions process, and since most selective schools are not test optional, practically all potential applicants have them.  I do not believe the rationale that the mere requirement of providing scores is somehow scaring off oodles of qualified applicants.<br>ETA - about test prep and being a test prep tutor.  I have no idea about that.  I never had a tutor, nor have my kids.  Just curious, what percentage of your students score, say, 1570+ would you say?  What do you mean by “really high”?<br><br>", "<b>Username: PurpleTitan</b><br><br>Completely agree with @suteiki77. I don’t think most people even on CC realize how deep academic talent in this country is.<br>Because of all the funded PhD programs and the resources and name of American research U’s (that draw scholars from all over the world), academic talent in this country is deeper than near anywhere else (though the other Anglophone countries also benefit).<br>Plus which, undergraduate education just doesn’t cover subjects extremely deeply.<br><br>", "<b>Username: Lindagaf</b><br><br>@OneMoreToGo2021 , just as in real life, a very small percentage of kids score above 1570/35+. But I have plenty of students who score above 1500/33. The point is that without test prep, most kids won’t get those scores. IMO, scores of about 1530/34 and above are “really high”. Typically, students need to meet the threshold of 1480/32 for tippy top schools, but higher is better, of course.<br>It’s the rare unicorn who can get a perfect score on either test without any prep whatsoever, including self-study. I’m sure a unicorn is out there, but I have never met one.<br><br>"]}