{"title": "swartmore vs grinnell vs carleton vs vassar", "comments": ["<b>Username: lin123</b><br><br>Hey guys,<br>I am an athlete and my commitment deadline is around the corner. I intend to take computer science and also complete pre-med requisites as well. I am keeping CS as a backup, as getting into medical school as an international is tough. I would like a mild social scene(not too dull) with strong academics so that a job after school is in my list? HOW SHOULD I GO ABOUT IT?<br>sorry I am nervous, this is urgent.<br>THANKS!<br><br>", "<b>Username: tk21769</b><br><br>All 4 are good. All 4 are rather similar to each other with respect to size/curriculum/quality/atmosphere.  If you have any hope at all for admission (as an international) to a US medical school, they won’t care which of these you attend.<br>Especially for CS, Swarthmore has 2 things going for it.  The consortium relationship (with Haverford, BMC, Penn) potentially expands the number of available CS professors and courses. The suburban Philadelphia location potentially expands your access to internships.<br>Computing skills are very marketable.  This fact (probably more than the intrinsic appeal of the subject) has made it a very popular major.  Small colleges (even rich, selective ones) may have a hard time attracting and retaining enough professors, or offering enough courses, to meet demand. So review faculty rosters and course schedules carefully.<br><br>", "<b>Username: merc81</b><br><br>@tk21769: Swarthmore has had some issues with respect to over-demand for CS courses. Though the OP may want to read the included article for general reference, I nonetheless wouldn’t recommend that he base his decision on a situation that simply may have received less notice elsewhere.<br>https://www.nytimes.com/2019/01/24/technology/computer-science-courses-college.html<br><br>", "<b>Username: warblersrule</b><br><br><br>\"\"<br>Especially for CS, Swarthmore has 2 things going for it. The consortium relationship (with Haverford, BMC, Penn) potentially expands the number of available CS professors and courses. The suburban Philadelphia location potentially expands your access to internships.<br>\"\"<br><br>Additionally, Swat has an engineering program that offers several classes of interest to CS majors. The other three, especially Carleton, are strong in the sciences but do not offer engineering.<br>That said, Swarthmore is a tough place to be pre-med. These are all top-notch schools, but Swat is rightfully (in)famous for its rigorous academics.<br><br>", "<b>Username: Hapworth</b><br><br>I wish that I could remember where I read it, but a Swarthmore grad talked about how he wanted to be pre-med but Swat definitely had weeding-out courses (courses designed to be so difficult that many pre-med students end up changing their focuses).  He talked about a chemistry course, I believe, where the professor skipped the first 120 pages in the textbook because he said, “You already know this from high school.”  The problem?  The Swat grad–now very successful in another field–hadn’t learned those “basics” in his high school chemistry course.  The grad’s takeaway was that sometimes one should look outside the “elite” colleges if one wants to be pre-med, as it’s more important to be in an environment that truly supports its pre-med hopefuls.  Anyone else familiar with the article that contained this anecdote?<br>Anyhoo, there are probably CS professionals on this board, but I wonder if it matters that much where one earns a CS degree if A) the CS program is solid, and, B ) the overall reputation of the college is strong (the OP is looking at four excellent schools).  My advice: choose the college that offers you the best financial aid package and that feels like it will be the best fit.  Really, all four schools are peer institutions.<br><br>", "<b>Username: 57special</b><br><br>Am familiar with 3 of the 4 schools, as S1 was recruited by Swat, Carleton, and Grinnell for athletics.<br>-First of, you haven’t mentioned your sport…makes a difference. You will be spending a lot of time practicing, training, and playing, so the ambience surrounding your sport is important.<br><br>All three have excellent reps academically, with Swat and Carleton having superb reps. Not sure that Carleton would be any less rigorous than Swat. CS seems to be a work in progress at a lot of schools, both big and small. Not sure that CS would be a strength of a LAC, in any event.<br>S1 preferred Carleton to Swat(was offered to both). Felt that Swat had a strong SJW minority that was antagonistic towards athletes, and prevalent on the campus in general. Not his thing. This attitude wasn’t present at Carleton. Also felt that Carleton was more laid back in general, which suited him.<br>-Grinnell was too isolated for him…he knew that area of Iowa. Great facilities, though.<br><br>In asking around at Swat, S1 said it was rare for any students to take advantage of the “consortium”. They are simply to busy to take a train to Penn, and most felt that the courses at Swat would be better than most that they could have at any of the other schools. An athlete would have even less time. Some might take courses at Bryn Mar for non academic reasons.<br>A place like Grinnell or Macalester would be a slight notch down in academic intensity, though they are both still excellent schools with excellent facilities. If you are a very strong student then they might be places that are in a \"sweet spot’ - rigorous, yet allowing one to excel marks wise, which is key for med school. My wife went to a “lesser” LAC as an international, aced her courses, and got into a renowned Medical school.<br>I know nothing about Vassar.<br>I don’t know that Swat would be more exciting than Carleton. The latter has a larger student body, and shares the town with St. Olaf, which has 3,000 students. St. Olaf is much closer than either Haverford or BMC is. Swat is in a quiet suburban spot. Grinnell is pretty much out on it’s lonesome.<br><br><br>", "<b>Username: lin123</b><br><br>Sorry but I forgot to mention, I play tennis and have been offered spots at all of the above colleges. I have been offered places at Occidental, UMW, Bates, Oberlin and Skidmore if that changes anything. Only Bates,Swarthmore, and Vassar have told me that financial aid will not be possibility. One more thing I’ll have to add is that Carleton’s coach is also the biology professor and a member of the pre med committee as well ;). Kindly give your updates on the same.<br>Thank you so much for helping me out, sitting far away from The Sates places me at a tough situation on making a commitment to all of the above mentioned prestigious colleges.<br><br>", "<b>Username: AlmostThere2018</b><br><br>My D18 did not apply to Swat but her closest friend did and now attends.   She’s had a good experience, but reports everything is ‘extra.’  ‘Extra’ activism, ‘extra’ academics, ‘extra’ . . . you name it.  Amazing educational opportunities and beautiful campus, but my D didn’t apply b/c she felt it was too intense – the people more so than the classes.<br>My D was accepted to and considered Carleton and Grinnell (though she ended up choosing another college.)  Carleton was a real contender, and I think she would have thrived there.  Laid back, smart kids with so much to offer.  She never made it to actually visit Grinnell. The cold winters at both were turnoffs.<br>Don’t know anything about Vassar.<br>If it were me, I’d pick Carleton.<br>Congrats to you and good luck!!<br><br>", "<b>Username: Midwestmomofboys</b><br><br>All 4 of those schools will allow you to get you where you want to go for med school/career. Possible considerations: Swarthmore is known as a fairly intense academic community while Carleton is on a trimester so that can affect the timing between academic terms and sports seasons. Vassar and Grinnell were two schools my D3 kid really liked – warm communities, great academics, beautiful campuses. Grinnell is known for excellent sciences, in part because its massive endowment has allowed it to invest in infrastructure and programs for quite some time. If it were my kid being recruited for those schools, he would have chosen Grinnell in a heartbeat. Bates and Oberlin would be close runners up.<br><br>", "<b>Username: lin123</b><br><br>This is a very difficult call for me. Swarthmore has a beautiful campus and is a suburban campus which is a positive however the academics there are very intense and it will be tough to do CS+pre med there. Carleton is a good school and its giving me financial aid as well which is good thing. Grinnell is a rural campus but has a good science department. Vassar I don’t think is that good right?? Bates coach told me that they have a very good medical school acceptance rate. I would need help from you guys. Sitting far away makes it difficult<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>Vassar I don’t think is that good right??<br>\"\"<br><br>On its surface, Vassar might appeal most to students interested in fields such as fine arts and literature. Nonetheless, at its core it’s a tradition liberal arts college with a wide array of majors and programs as well as a nicely intellectual atmosphere. However your other choices resolve, I’d recommend you keep Vassar in your top two.<br><br>", "<b>Username: merc81</b><br><br>https://www.forbes.com/sites/nataliesportelli/2017/04/26/10-expensive-colleges-worth-every-penny-2017/<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Academically, they are peer schools  – I wouldn’t say any of them are of a different caliber of school than the others, so it comes down to factors like financial aid/affordability, team and coach vibe, campus vibe, and ability to manage academic goals and athletic commitments. Am I understanding correctly that you said Swat, Vassar and Bates each said you will get no aid? Unless your family can easily pay $250,000 for college without blinking and still help with medical school, then consider removing any school which you will not get merit aid from the list. That leaves Oberlin, Skidmore, Grinnell and Carleton – all of which are terrific schools and will prepare a student for med school. Of those 4, Grinnell and Carleton have a slightly stronger academic reputation. Grinnell sciences are top notch with amazing facilities amazing and we loved Grinnell’s flexible curriculum, collaborative campus community, and the gorgeous facilities. The Carleton coach’s role in pre-med advising seems like opportunity to keep both parts of your college experience “in sync.” I’d dig more deeply with conversations with coaches, teams at Carleton and Grinnell, particularly comparing pros and cons of trimester and spring sport.<br><br>", "<b>Username: circuitrider</b><br><br>Speaking of infrastructures, Vassar has recently completed a rather handsome new science center.<br><br>", "<b>Username: lin123</b><br><br>Thank you first of all for your deep analysis. Yes you are right, swat etc are not giving any need based aid. Financial aid is not a deciding factor in my application however as a child I would like my family to go through as less financial burden as possible. If we don’t give any preference to financial aid then among Swat, Carleton, Oberlin, Bates and Grinnell which one will have strong job prospects and also a chance of getting into med school.  Also the social scene plays a little part in my choice. I do believe that Swat is not known for its social scene.<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>among Swat, Carleton, Oberlin, Bates and Grinnell, which one will have strong job prospects . . .<br>\"\"<br><br>U.S. News reports information for early career salaries. Of the above schools, Swarthmore places highest by this measure. However, the information for Oberlin is not available, and all of the schools may need to be adjusted for regional variations in the cost of living as well as for personal career choices that may not be driven primarily by salary considerations.<br>https://www.usnews.com/best-colleges/swarthmore-college-3370<br><br>", "<b>Username: circuitrider</b><br><br>^Swarthmore is also the only college of the three with an engineering school which, I’m pretty sure skews the results. In fact, unless the OP plans on being an engineer, none of the numerous ROI rankings out there hold much water.<br><br>", "<b>Username: doschicos</b><br><br>“consider removing any school which you will not get merit aid from the list. That leaves Oberlin, Skidmore, Grinnell and Carleton – all of which are terrific schools and will prepare a student for med school.”<br>The only merit aid Carleton gives is $2K for National Merit Scholarships.<br>It sounds like OP won’t qualify for need based aid anywhere.<br><br>", "<b>Username: cinnamon1212</b><br><br>I wouldn’t include Oberlin with Swarthmore,  Vassar, Bates etc (in terms of reputation). Its enrollment,  I believe,  is declining (from reading on CC).<br>Perhaps one way for you to narrow it down is to decide what kind of setting you would like, as that is something that’s different between some of the schools.<br><br>", "<b>Username: lin123</b><br><br>One update: Swarthmore is ready to give me CS along with pre med requisites as well.<br><br><br><br> doschicos:<br>\"\"<br>\"<br>It sounds like OP won’t qualify for need based aid anywhere.<br>\"\"<br><br>I have already talked to coaches and my family qualifies for need based aid at Carleton and Grinnell<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>One update: Swarthmore is ready to give me CS along with pre med requisites as well.<br>\"\"<br><br>Not sure what that means. Are you talking about AP credit or something similar?<br><br>", "<b>Username: lin123</b><br><br><br><br><br> circuitrider:<br>\"\"<br><br>\"\"<br>One update: Swarthmore is ready to give me CS along with pre med requisites as well.<br>\"\"<br><br>Not sure what that means. Are you talking about AP credit or something similar?<br>\"\"<br><br>Someone earlier in the thread mentioned that choosing courses at swarthmore is tough and thus I was mentioning my stand on the same<br><br>", "<b>Username: Sue22</b><br><br>Have you run the NPC for each school? I wouldn’t rely on financial aid information from a coach, no matter how well meaning.<br><br>", "<b>Username: Publisher</b><br><br>OP: Limit your choices to Carleton College & to Grinnell because they are both offer excellent academics & financial aid. Medical school is expensive. Student debt can be a heavy burden.<br>Of course, if you want to pursue CS rather than pre-med studies, then you really need to consider whether or not Swarthmore is an affordable option for you.<br><br>", "<b>Username: doschicos</b><br><br><br><br><br> Publisher:<br>\"\"<br>OP: Limit your choices to Carleton College & to Grinnell because they are both offer excellent academics & financial aid. Medical school is expensive. Student debt can be a heavy burden.<br>\"\"<br><br>So does Swarthmore which makes me skeptical about how much need based aid the OP will get from Carleton if Swarthmore is unwilling to give any. I think @Sue22’s suggestion of running the NPC for each school is excellent advice.<br><br>", "<b>Username: lin123</b><br><br>I don’t understand what you mean by NPC. But, I think I’m getting 40% of need bases financial aid from both carleton and grinnell (confirmed that with the financial aid department)<br>Swarthmore is a more academic rigorous than either of the colleges so the only question I have is will it be worth it to give the full fee to swarthmore. I think carleton’s CS ranking is better than Swats.<br><br>", "<b>Username: doschicos</b><br><br>NPC = Net Price Calculator<br>https://www.carleton.edu/admissions/apply/afford/aid-estimators/npc/<br><br>", "<b>Username: lin123</b><br><br>Thank you for sharing this with me  .I’ve calculated my financial aid <br><br>", "<b>Username: elena13</b><br><br>Why isn’t Vassar offering any financial aid? They are known for being generous with aid and I would have thought it would be comparable to Carleton’s.<br><br>", "<b>Username: lin123</b><br><br>Vassar doesn’t offer financial aid yo international students I believe so<br><br>", "<b>Username: circuitrider</b><br><br>^Oh.<br><br>", "<b>Username: circuitrider</b><br><br>OP, what you are asking is a very subjective question. All I can say is, that for many Americans, the answer would be obvious:  go with the more generous financial aid offer. Carleton and Swarthmore are not that different from each other.<br><br>", "<b>Username: Publisher</b><br><br>If OP is set on pre-med, then the answer is quite easy since all offer strong academics; simply go with the most affordable option.<br><br>", "<b>Username: doschicos</b><br><br>The international student aspect should have been mentioned in the initial post. <br><br>", "<b>Username: circuitrider</b><br><br>Also, the OP has to be careful about what competing tennis coaches are telling her. Vassar does offer financial aid to internationals: https://www.vassar.edu/admissions/financial-aid/faqs/#international<br><br>", "<b>Username: lin123</b><br><br>@circuitrider I do agree this is subjective. A very tough decision for me indeed. Sorry, I meant that Vassar is competitive for financial aid with internationals, my application might go down due to that. Therefore it is not advised.<br>@doschicos sorry I forgot to mention that<br>@publisher, I also would like a strong CS program as well. Just to have good job opportunities available. I would like to keep both pre med and CS options available<br><br>", "<b>Username: Publisher</b><br><br>Definitely limit your choices to those schools which offer meaningful financial aid as medical school is very expensive.<br><br>", "<b>Username: lin123</b><br><br>Any further suggestions? commitment   deadline coming soon? Can’t go wrong with this? Sorry I’m Nervous.<br><br>", "<b>Username: cornelldad10</b><br><br>Oberlin’s reputation may have fallen on CC, but it remains as strong as any of these other schools for medical school and grad school admission.  That is what matters to the OP.<br><br>", "<b>Username: TheGreyKing</b><br><br>None of the colleges you named are need blind/ meet full need for internationals:<br>From Wikipedia (https://en.wikipedia.org/wiki/Need-blind_admission):<br>“There are currently only seven U.S. higher learning institutions that are need-blind and meet full demonstrated need for all applicants, including international students. These are:<br>Amherst College<br>Curtis Institute of Music<br>Harvard College<br>Massachusetts Institute of Technology<br>Minerva Schools at KGI<br>Princeton University<br>Yale University”<br>Vassar is famous for generous financial aid, so that should not be a minus for it relative to your other choices.<br><br>", "<b>Username: renaissance101</b><br><br>I am also being recruited at the above schools but narrowed it down to Swat, Vassar, and Wes due to their access to more urban areas. Out of the three I have had the most name recognition through Vassar when it is mentioned. Wesleyan follows closely behind the latter school. Yet Swat gets blank stares amongst peers. In the end this should not be a deciding factor in picking and I am just sharing my experience. Right now I am leaning towards Vassar for various reasons. If anyone ever questions its prestige compared, just look at some of the alumni. Some include Elisabeth Murdoch and Jeffrey Soros, who chose Vassar over schools like Harvard and the other elites, seeing they are the heirs and heiresses of some of the biggest media moguls I am sure they had many other choices (like HYP)! The list goes on and on but that is just an example.<br><br>", "<b>Username: renaissance101</b><br><br>Also, Vassar athletes sometime list schools they chose Vassar over. I have seen almost every Ivy, Pomona, Swat, MIT, and the NESCACs.<br><br>", "<b>Username: doschicos</b><br><br>@renaissance101 All three LACs you mention are well-known and respected by those who matter - grad programs and employers. The average American is quite ignorant about colleges and universities, usually knowing those institutions in their backyard, a few of the Ivies, and those schools that excel in sports at a national level.<br>Ignore name recognition and prestige among the hoi polloi and instead focus on what is the best fit for you and your academic and sports interests. You’ll get a stellar education at any one of them.<br><br>", "<b>Username: twinsmama</b><br><br>I wouldn’t avoid the application to Vassar (or any other excellent choice) unless the financial aid department has told you there will be no aid. When you inquire, you can mention that peer schools told you that you were eligible for aid, so you want to make sure you didn’t make a mistake on your application. My son is a happy athlete at Vassar. We never visited Carleton, but my daughter loved it from a distance. Grinnell also sounded great but was too remote from us. Swarthmore is near us. It is smaller than the others and very intense in a way my kids did not like. I would guess the others are better places to be both pre-med and an athlete. You would be best served by a collaborative environment. Good luck!<br><br>", "<b>Username: twinsmama</b><br><br>But don’t choose a school based on your impression of how prestigious it or its graduates are! Your priority should be finding a college where you can be both happy and successful, and where it is possible to balance pre-medical studies with the demands of a varsity sport - and with other activities.<br><br>", "<b>Username: doschicos</b><br><br>“Also, Vassar athletes sometime list schools they chose Vassar over. I have seen almost every Ivy, Pomona, Swat, MIT, and the NESCACs.”<br>I’ve seen that and I’ll admit I really dislike it and find it off-putting.<br><br>", "<b>Username: cinnamon1212</b><br><br><br><br><br> doschicos:<br>\"\"<br>“Also, Vassar athletes sometime list schools they chose Vassar over. I have seen almost every Ivy, Pomona, Swat, MIT, and the NESCACs.”<br>I’ve seen that and I’ll admit I really dislike it and find it off-putting.<br>\"\"<br><br>I know, right? To me, it smacks of insecurity on Vassar’s part (or any other college that does that – and almost no other peer institutions do!).<br>OP, have you visited these schools? I wouldn’t weight a bunch of internet strangers’ opinions very heavily, you know yourself best.<br><br>", "<b>Username: renaissance101</b><br><br>@doschicos It seems they have stopped doing that as I agree it is a little pretentious.<br><br>", "<b>Username: renaissance101</b><br><br>@doschicos I didn’t mean for it to sound like I was putting down Swat or Wesleyan because like you said, the people that matter know who they are. I 100% agree with that and that’s why the OP should choose the best fit, not for the “name recognition” as that is damaging to ones experience. Once again I apologize I was just sharing my experience with these schools so far, take it with a grain of salt as I am only one person.<br><br>", "<b>Username: renaissance101</b><br><br>.<br><br>", "<b>Username: 57special</b><br><br>Swat and Carleton take a back seat to no LAC when it comes to academics.  I’m sure Vassar is a fine school also, but to say that it a better school is just flat out wrong.<br>Also puzzled about Swat costing more than Carleton. We found Swat to be much more generous than any other LAC with need based financial aid. I’m also not aware of Carleton giving merit money. Grinnell does, I believe.<br>A student can do very well for themselves at any of the schools mentioned, which range from Excellent to Outstanding. It’s really about finding the right fit.<br><br>", "<b>Username: lin123</b><br><br>Thank you everyone. I’ll ask vassar wether they’ll give me aid, as I have received estimates from peer schools. Even Swat has told me not to apply for aid as the most competitive batch of applicants they have there is the financial aid international students one.  Sadly, I won’t be able to visit either of them as I am an international and travelling will not be possible now. I’m leaning towards Carleton as it is sounding like the best fit among all academically. How are the girls and boys like at carleton? I heard that they are quirky? Is it so? How is the party scene?<br>Grinnell is sounding too rural and I don’t think so I want corn Fields right next to college. However the academics and the new science building are still fascinating me.<br>One update: Oberlin might give me aid. Does that influence my decision?<br>Kindly guide me on these questions.<br><br>", "<b>Username: circuitrider</b><br><br>^Oberlin, despite some recent controversies, is still a good college.  We’re not discussing an Early Decision choice, right? There’s really no reason not to consider a college that will offer you financial aid.<br>Also, what are you being recruited for? Why are there no NESCAC schools under consideration?<br><br>", "<b>Username: circuitrider</b><br><br>^My bad. I’m still waking up in the U.S. Of course, as an athlete, this is an Early Decision choice. Never mind. Stick with Carleton.<br><br>", "<b>Username: AlmostThere2018</b><br><br>Yes, I think Carleton is a great choice given all the factors. You will have between (US) Thanksgiving through Christmas (about six weeks!) off of school which is a nice perk for international students b/c you can have a long visit home.<br>Keep us posted on your final decision!<br><br>", "<b>Username: lin123</b><br><br>@circuitrider we are discussing ED here lol, no problem at all. I know about Oberlin controversies but I think the others(Carleton, Grinnell, Swat, Vassar) are more academically renowned. I’m still being second minded, i dont know why. Do you know about the job prospects of CS after Carleton? Just wanted to clarify that.<br>And, I do have some NESCAC options as well like Bates, Colby.<br>@AlmostThere2018 what about Grinnell? Are you so sure about carleton?<br><br>", "<b>Username: AlmostThere2018</b><br><br>Both great!  My D was accepted to both Carleton and Grinnell – she was drawn more to the former b/c it’s in a bigger town and less remote.  But Grinnell does have fabulous resources, especially in the sciences, and I think it would have been great too.  Grinnell has real emphasis on international students so that’s a plus – they have goal of 20% in a few years.<br>I realize how hard it is to pick a college on paper since you can’t visit.  I suggest reading student reviews on places like Niche and some of the Reddit sites for more student views.  Also look at youtube videos that students do – those might give you more of a flavor of each campus.  It’s more important to hear from students about their experiences than parents (like me!) who have less direct information.<br>How much time do you have before you have to make  a decision?<br><br>", "<b>Username: lin123</b><br><br>Even I am leaning towards Carleton because I don’t want to spend my college years next to corn fields(sorry my opinion, no offence). As people are suggesting here both are top tier schools so comparing academics isn’t worth it.<br>How is your D doing? Is she into socialising or wishes to focus more on academics and spend time by herself?<br>I have this week probably and it will be really nice if you can help me out. You really seem to be the parent that can help me solve this riddle.<br><br>", "<b>Username: AlmostThere2018</b><br><br>My D actually doesn’t attend Carleton. It was a top choice for her, but she ended up choosing a similar liberal arts college that offered her more aid.<br>I wish I had more to say that could help.  Have you posted on the Carleton and Grinnell sections of College Confidential?<br><br>", "<b>Username: lin123</b><br><br>Oh, I thought she attends Carleton.<br>I haven’t posted anything on Carleton or Grinnell’s sections of CC. However, I have started another thread asking about the social scene.<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>Do you know about the job prospects of CS after Carleton? Just wanted to clarify that.<br>\"\"<br><br>I don’t have first-hand knowledge. What I have is my own little, highly fallible resource, a Linkedin account that allows me to explore the number of employees at a company like Google with credentials from various colleges. It’s a very “nervous” platform; I can never duplicate the same results from one day to the next and sometimes not even within the same hour.  But, with those caveats in mind, they show Carleton and Grinnell to be broadly comparable in that both colleges appear to have dozens of employees employed by Google, in both San Francisco and New York, the overwhelming majority of whom appear to be as engineers (I’m assuming software engineers.)<br>However, what emerges after about half an hour of playing around with the site (I even compared the results with a couple of NESCACs for comparison), is that Carleton while only a few  hundred students larger, has twice as many alumni working as engineers at Google.  Again, I do not swear by the results. Obviously, it depends on the number of graduates from each school who have Linkedin accounts. But, since you tagged me - this is the best I can come up with.  <br><br>", "<b>Username: merc81</b><br><br>Though it was created several years ago, the chart in reply #26 can give you an ideas as to what courses to look for in a LAC CS program:<br>https://talk.collegeconfidential.com/math-computer-science-majors/1814245-computer-science-at-some-smaller-schools-including-liberal-arts-colleges-p2.html<br>In deciding between Carleton and Grinnell, you might want to consider the comparative breadths of their general curricula. For example, Carleton offers an extensive geology program, so if you think you might want to explore in that field, then you would have that option.<br><br>", "<b>Username: merc81</b><br><br>As suggested earlier, you can check early career salary data through U.S. News.<br>https://www.usnews.com/best-colleges/carleton-college-2340<br>https://www.usnews.com/best-colleges/grinnell-college-1868<br><br>", "<b>Username: lin123</b><br><br>Thank you @circuitrider for your concern. All your research is shedding light on the positives of Carleton, I’m trying to find negatives but am unable to do this.<br>Thank you @merc81<br>Could you PLEASE tell me about the social scene at Carleton, Grinnell and Vassar. I would like a chill environment where I can socialise and balance my academics and tennis as well.<br><br>", "<b>Username: santorini</b><br><br>Carleton does HAVE a social scene (as I’m sure they all do) S is currently pre-med at Carleton. He is friends with athletes (as well as international pre-med students) that have successfully balanced their sport with academics. Being an international, you will need stellar grades if you plan to attend a US medical school. The professors (effort put into teaching) at Carleton is truly top notch. S has found having ample resources & dedicated professors makes a difference in successfully tackling/understanding some of the more challenging courses.<br>Good luck with your decision. Do not worry about the social scene. All the LACs you mentioned will have more social activities each week than you can attend (& successfully balance sport/academics).<br><br>", "<b>Username: lin123</b><br><br>@santorini thank you so much for your feedback. I’m glad that your S is doing pre med and also enjoying the same. Carleton does have good professors and ample resources. Are drinking and drugs also prevalent on campus? What about peer pressure?<br><br>", "<b>Username: santorini</b><br><br>@lin123 There is drinking & drugs (marijuana/molly) on all (or at least most) college campuses. Carleton is no exception. However, I would not call it prevelant. Nobody will care if you decide to go to a party and NOT DRINK. Many call Carl’s quirky, which people often interpret as “nerdy”. I would characterize them as dedicated students (perhaps where the nerdy comes from?), comfortable in their own skin, and with a playful sense of humor. Hope that helps.<br><br>", "<b>Username: austinmshauri</b><br><br>Since OP is an international the job prospects they should focus on should be in their home country. There’s no guarantee they can work in CS in the US. If they’re interested in medicine and need financial aid I don’t know how US med schools would work out for them either.<br><br>", "<b>Username: lin123</b><br><br>@santorini thank you for your feedback.<br>@austinmshauri I’m interested in financial aid only for undergrad. Won’t be needing it for medical school. I’m keeping CS just a back up, if I don’t get into medical school. I’m leaning in on carleton, and as soon as I make my decision I’ll be starting a new thread where hopefully you guys can help me with my major.<br>All of you have been really helpful, I’ll surely keep you informed with my decision.<br><br>", "<b>Username: DadIDJAME</b><br><br>My daughter was accepted to both Carleton and Grinnell and chose Grinnell. Ten years ago maybe I’d have encouraged her to choose Carleton, but Grinnell is attracting very high achieving students these days and the stats are going up. When my daughter applied, ACT scores at Grinnell were actually a little higher than at Carleton. Grinnell has become very academically rigorous. We did a serious comparison of course rigor while she was trying to decide. We felt that Grinnell was at least equal to, if not slightly ahead of Carleton. Students get a lot of homework at Grinnell. It’s not busy work. It’s seriously academic and in many cases graduate level. We also thought Grinnell had better facilities. The labs are pretty amazing. Grinnell has a big endowment and the students definitely benefit. Carleton and Grinnell are both fantastic schools . You’ll do great at either.<br>P.S.: We visited Swarthmore too. Beautiful campus. Didn’t apply because kids looked unhappy. Great academics though. I don’t think you’ll get lesser academics at Grinnell or Carleton. They’re all top-notch schools.<br>P.P.S.: I don’t think Grinnell does FA for international students. You might want to check. They do merit aid though.<br><br>", "<b>Username: dvm579</b><br><br>Go to Grinnell! They have amazing academics and, for a school of its size, it is incredibly well connected. Most of its graduates have placement in a job or graduate school right out of college. My sister went to Grinnell and, purely through a college program, secured a job at Goldman Sachs, where she has been working and doing well for the past few years.<br><br>", "<b>Username: lin123</b><br><br>@DadIDJAME that’s true Grinnell is working on it’s infrastructure. On the other hand even Carleton has come up with a new science building which will play to my favour. Grinnell’s endowment does help students plan Research.<br>How is the GPA stats like at Grinnell, i would really have to keep my GPA around 3.9s or 4 in order to be a competitive applicant for medical school? Are students able to do that with the academic rigrour?<br>Yes, Swarthmore has a beautiful campus but the students are not happy there because of it’s tough academics. That’s one reason why Swarthmore is very low on my list now.<br>I’ve already checked that, Grinnell is offering me aid based on my academic Portfolio.<br>Kindly shed some light on the GPA at Grinnell.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>@lin123   to be clear, Grinnell is not working on its infrastructure. It already has superb science facilities, in large part because its endowment was an early investor in Intel and the gains over the past decades meant it had much more money to invest in infrastructure than its peers. Other schools are catching up to it.<br>You face a fortunate decision, to be deciding on ED as a recruit at some of the top US small liberal arts colleges. As a parent who visited Grinnell numerous times and knows several current and recent Carleton alum – I would suggest that the biggest differences will be in team culture at each school and the impact of trimester at Carleton vs. semester at Grinnell. The education, the support, the peer group, the opportunities at Carleton and Grinnell will be comparable. A current tennis player parent has shared with you on another thread about her student’s Grinnell experience. I really don’t think you are going to get new information here which will push the decision one way or the other. As the parent of an athlete at small liberal arts college, I would suggest you make your decision based on where you get the vibe of being “at home” from the coach and teammates.<br><br>", "<b>Username: Dustyfeathers</b><br><br>I haven’t read all of the comments but my general impression is that Swarthmore is uber competitive. Someone upstream described it as “extra” this and “extra” that. I’ve personally met several Swatties and not one that I know ended up enjoying their experience. One is currently there, started out loving it because it’s stimulating, but then crashed and burned from the pressure. This is the same thing I’ve heard over and over – needlessly competitive spirit among the students. Also the consortium thing with Swat is overplayed. While you CAN go to Haverford and BMC because of bus schedules, Swat is much more isolated. BMC and Haverford easily can go from campus to campus. And the train to Philly is easy from there. Swatties report feeling much more isolated–there’s no little town outside of Swat. It’s more like being in the country.<br>Vassar is not competitive among the students. It’s got a high level of students and academics and has a more relaxed atmosphere. It’s super easy to get into NYC from there on the MetroNorth commuter train – a day trip to and from the City is easy. Poughkeepsie, while not the most astonishing city on the planet, is still a city with real opportunities – music venues off campus, internship opportunities that have led to several jobs of graduates that I personally know. NYC obviously offers great opportunity too.<br><br>", "<b>Username: doschicos</b><br><br>“And the train to Philly is easy from there. Swatties report feeling much more isolated–there’s no little town outside of Swat. It’s more like being in the country.”<br>SEPTA station on the edge of Swat’s campus.<br>Plenty of happy Swatties. <br><br>", "<b>Username: HarrietMWelsch</b><br><br>Here to counter everything @Dustyfeathers likes to say about Swat. Two of my own children, many of their friends and classmates, the children of other friends, and my own classmates and I would argue against every single point except that it is stimulating and yes, intense at times.<br>Whether or not it feels even the slightest bit competitive (let alone “needlessly competitive,” which I’ve never heard) depends on the major(s).  Most are truly cooperative.<br>Unless you live in a major city, there is no sense in which being at Swat is like “being in the country,” in the way that a school like Kenyon or Oberlin or (we can go on and on) could feel. The train station to Philly is literally at the edge of campus. It runs to other small boros/villages with livelier restaurant scenes, like Media, as well as into Philly.<br>Can speak to plenty of students, distant and recent past, successfully participating in the full consortium, both academically and - wrt the Trico - socially.<br>If you’re not feeling Swat, OP, that is absolutely fine. I agree with @Midwestmomofboys (and many other posters), all of the schools you’re weighing offer terrific opportunities! But it’s not actually true that “the students are unhappy” at Swat because of the tough academics.<br>And PS, Vassar is lovable in dozens of ways but to say that it’s easy to get to NYC from Vassar is a little misleading. The train trip is easy, but you still have to get from school over to the train station, and it’s not really walkable.<br><br>", "<b>Username: JHS</b><br><br>Sorry I missed this thread while on vacation.<br>I have a virtual niece (child of our best friends; I’ve known her since before she was born; the families had at least one meal per week together while our children were growing up) who was a 2014 CS graduate from Carleton (actually, a double major in Linguistics and Computer Science).  Carleton was by far the weakest college on her final list in CS.  She chose it over others (including Carnegie-Mellon SCS and the University of Chicago) because she liked the feeling on campus and because she thought it would give her more opportunities (vs. CMU and vs. engineering-school programs elsewhere) to double-major.<br>Things worked out perfectly for her.  She got exactly the job she hoped she would coming out of college.  Carleton in fact did not have the faculty to meet her needs fully, but what it did was to fund her to do summer research with CS faculty at a major university elsewhere.  She continued to work with them remotely when she returned to Carleton, and they helped her enormously in taking the next step in her career.<br>She is not a hard partier by any stretch of the imagination, but she enjoyed the social life at Carleton.  She’s shy, more than a little nerdy, and not flirty at all; none of that prevented her from making good friends and feeling satisfied with her life there.<br>In my community, liberal arts colleges are very popular and well respected.  Carleton, Swarthmore, and Vassar are all basically seen as peers here.  Swarthmore is the snootiest of them, and the most high-pressure, but Carleton is also seen as a very high-quality academic environment, and Vassar, too.  Oberlin is also very popular, and well-respected, but somewhat less intense than the other three (not necessarily a bad thing).  I probably know more people, ages 30-65, who went to Oberlin than people who went to Swarthmore, notwithstanding that Swarthmore is a 20-minute commuter train ride away, and Oberlin is about 600 miles away.  People are aware of Grinnell, but I don’t know anyone who has gone there.<br>My sister-in-law was a visiting professor at Swarthmore a few years ago.  Her home institution is a large public university, and she found Swarthmore very staid and boring, with mainly wealthy, privileged students.  It’s true that Swarthmore students don’t actually take much advantage of the consortium for classes, but it would definitely be possible to take the train in to Penn periodically to work at a lab or hospital there.  I think it’s significantly more awkward to get anywhere interesting on a regular basis from Carleton (Minneapolis-St. Paul), Oberlin (Cleveland), or Vassar (NYC), but weekend day-trips are doable.  Grinnell . . . there’s no place easy to get to from there.<br>Fundamentally, though, there’s no academic/reputational difference among the schools that would be worth spending a lot more money for, or going with a coach you like less.<br><br>", "<b>Username: Coloradomama</b><br><br>Socially, Carlton may be the most friendly and you still have Minneapolis close to enjoy a city,  and also easy to fly in and out of Minneapolis as an international student.    Vassar is remote, on the Hudson River, way north, so weather is actually more cloudy than cold Minnesota, of weather could help push you one way or another.  Carlton shines for teaching and friendliness of the midwestern type of student.    The quarter/trimester calendar means you only take three classes at a time at Carlton.<br>Philadelphia is still one of the highest crime cities in the USA, much more dangerous compared to Minneapolis/St Paul, although certainly Swarthmore is very very safe.<br>Swarthmore’s motto used to be “Where fun comes to die”.  Also, one time a friend of mine was on the Swarthmore campus and asked where to buy an ice cream cone.  The answer was “We don’;t have time for ice cream”.     Also, about 1/3 of Swarthmore undergrads choose a masters like thesis project and do a lot of one on one time with a professor, while 2/3’s of Swarthmore students just take classes as at most universities.   I find Swarthmore too intense.   Its a Quaker school, originally and its also very negative about religion, atheism reins at Swarthmore, moreso than at Cartlon College or your other choices, if that matters at all to you.<br><br>", "<b>Username: HarrietMWelsch</b><br><br>I wonder if there is some prize for the school with the most ridiculous exaggerations and misconceptions attached. It’s likely Swat would win.<br>Swarthmore’s motto has never been “where fun comes to die.” (That’s Chicago, and even they’re joking.) <br>And there’s always ice cream in the dining hall.<br>Atheism reigns? I don’t even know what would cause somebody to say that. There’s a very active Newman community, a Muslim Students Association, a vibrant Chabad and a Kehilah, a Sangha (Buddist), a Quaker Society, a Christian Fellowship, and a Progressive Christian group. Plus a Gospel Choir, though that’s more about talent than faith.  And I’ve probably left somebody out.<br>Again, if you don’t like Swarthmore, that’s perfectly fine. But why the need to bash it with false and misleading info?<br><br>", "<b>Username: doschicos</b><br><br>Several posts here prove that no one can truly help OP make this decision. People are posting without knowledge.<br>“Philadelphia is still one of the highest crime cities in the USA, much more dangerous compared to Minneapolis/St Paul, although certainly Swarthmore is very very safe.”<br>Students at Swat have zero need to visit the bad bits of Philly so I think this comparison is a stretch.<br><br>", "<b>Username: lin123</b><br><br>@Midwestmomofboys sorry I meant Grinnell already has amazing facilities in the science department. The one thing I haven;t looked at are the courses being offered at both Carleton and Grinnell, I’ll look into that.<br>Even I am not considering Swat right now because it has extra rigorous academics where I wont be able to maintain a a high GPA. That in turn will affect my med school application.<br>@JHS even I love Carleton primarily because of its beautiful campus and well informed professors. Do you have any idea about the new sciences building at carleton?I could not find pictures of that on the internet.<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>Do you have any idea about the new sciences building at carleton? I could not find pictures of that on the internet.<br>\"\"<br><br>Photos may be scarce because the project has not been completed. This site offers architectural drawings and descriptions for the complex at its expected completion:<br>https://www.carleton.edu/inside/2017/science-on-display/<br><br>", "<b>Username: MadcityParent</b><br><br>My daughter is starting at Carleton next week. Her father, her mother, and an aunt also attend back in the 1990s so my opinion is obviously biased. It is academically challenging, and there are a variety of social scenes. When my daughter visited as a prospective student, she stayed on a quiet floor, but a number of people living on the floor still met up in the lounge for a while to unwind, talk, and play cards. So they socialized, but didn’t really party. Of course, it was a Monday night.<br>Weekends are the time when actual parties are more likely to take place. Different dorms have different reputations for parties, though there are none that are party all the time. The academics tend to be too intense for most students to party every day, though there are always some students who do their best to try partying all the time. There are also substance free floors where those who want to avoid drinking and other substances can live. Basically, if you want to party, you can find one. If you don’t want to party, it is not hard to avoid it and still find people to socialize with.<br><br>", "<b>Username: 57special</b><br><br>I wouldn’t expect Carleton to be much, if any easier than Swat academically. Both schools (and Grinnell), are known for their outstanding teaching. In other words, if you are willing to learn, they will give you all the attention in the world in order that you succeed. That is not always true at other schools, where it’s more like Ninja school, where only the strong survive(talking to you, McGill!).<br>The admissions guy at Carleton said, \" We (Carleton) were nerdy before it was cool to be nerdy.\"<br>I dunno- when I’ve been there I’ve seen some pretty good looking, healthy, smart looking young adults.  BTW, Rochester, MN is about an easy 50 minute drive from Carleton. It is the home of the Mayo clinic, which dominates the city. Thought that might interest you with your interest in Medicine.<br><br>", "<b>Username: lin123</b><br><br>All the best to your @MadcityParent. I like socialising be it partying or playing cards. Sort of a weird combination.<br>@57special yes true, the Mayo clinic is something I am very excited out. Hopefully I’ll be able to do an internship or something there <br><br>", "<b>Username: JHS</b><br><br>Swarthmore is so rural and isolated there’s a regional mall within easy walking distance of campus (&lt; 1 mile).  And train service from Center City Philadelphia to the on-campus train station runs through midnight most days, and until after 1 am on Saturday night.<br><br>", "<b>Username: merc81</b><br><br>Newsweek appropriately included Swarthmore in this article on desirable suburban colleges:<br>https://www.newsweek.com/25-most-desirable-suburban-schools-71867<br><br>", "<b>Username: TheGreyKing</b><br><br>I would not have considered either Hamilton or West Point to be suburban. More rural. Beautiful settings at both!  The little village of Clinton where Hamilton is exudes charm.<br>Swarthmore, Haverford and Wellesley, on the other hand, yes, are in quintessential suburbs.<br><br>", "<b>Username: Dustyfeathers</b><br><br>Well, some Swatties liked their experience but several found it oppressive – and I seem to have met the group of folks who found it overly competitive and oppressive. One Swattie I know is an interviewer for Swat and s/he told me that s/he debates whether to tell prospective students how much s/he hated Swarthmore. But hey, there’s all sorts of people and some people love it.<br>As for Vassar folks finding it hard to get to the City, yes the train station is not walking distance from Vassar, but the taxi is simple and not so expensive. Also: NYC! It’s a whole different world from other cities in the US. Often there are other Vassar people at the train station and you can split a taxi back to campus. It’s not that hard.<br>That sort of edgy competitiveness that the Swattie fans’ comments show, is just what I mean – Swatties have to compete, have to show they’re the “best”, have to push push push, have to “be right” about you know everything! I’m not saying that’a bad, especially if you thrive in a go-get-'em environment (to what end?) if you however want a calmer and more pleasant live-and-let-live environment, I’d choose any other school but Swat.<br><br>", "<b>Username: doschicos</b><br><br>“One Swattie I know is an interviewer for Swat and s/he told me that s/he debates whether to tell prospective students how much s/he hated Swarthmore.”<br>Why the heck is she interviewing for them then?!<br>“That sort of edgy competitiveness that the Swattie fans’ comments show, is just what I mean – Swatties have to compete, have to show they’re the “best”, have to push push push, have to “be right” about you know everything!”<br>I am one who has posted here re: Swarthmore. I have no skin in the game or connections to the school other than having visited a couple times and knowing alums that were happy there.  I just dislike inaccurate info and bold exaggerations, and the constant harping on Swarthmore by some here is unwarranted - and notice it is by folks with no first hand experience at the college.<br><br>", "<b>Username: TheGreyKing</b><br><br>^Yes, I think that, while reputations have a grain of truth, they also get exaggerated and become an unfair caricature.  Swarthmore somehow got a reputation for an overwhelming workload and posters really emphasize that. But it may be true of many other top schools, too.<br>It certainly is true of Williams. Two of my son’s courses this year will require an entire book to be read every single week. This is on top of all the writing assignments from those classes and his work for his other two classes. Not to mention the time students put into clubs/ sports/ music and similar commitments on top of that, as well as planning for the future with the necessary searches and applications for study abroad or an internship, etc.<br>Our son also commented, during the days before school started, that the campus looked so different at that time because there actually were people walking all around the grounds. The campus looked like it had a lot more people than usual. He joked, “During the year, they are all inside studying.”. Everyone works pretty much around the clock at Williams. There is no other way to survive. What happened to a peer who did not study as much?  He is on leave after failing two classes.   Yet, a vision of everybody studying all the time is not the Williams reputation; it’s the Swarthmore and U of Chicago reputation.<br><br>", "<b>Username: circuitrider</b><br><br>Williams, Wesleyan and Haverford all have reputations for enrolling lots of athletes and studio/fine/performing artists, none of which anyone really associates with Swarthmore. Helps to know the class curves have some balance to them. <br><br>", "<b>Username: DadIDJAME</b><br><br>“Kindly shed some light on the GPA at Grinnell.”<br>It’s not the place to go if you’re looking for easy A’s. The curriculum is rigorous and students at Grinnell work extremely hard. The workload is as tough as it is anywhere.<br><br>", "<b>Username: lin123</b><br><br>Hey guys. I wanted to tell you that I have verbally committed to Carleton College. Your suggestions and feedback have helped me make this tough decision look easy. You guys are amazing :). Hopefully I’ll be part of the Carl class of 2024 family. Keep doing the good work<br><br>", "<b>Username: AlmostThere2018</b><br><br>Thank you so much for letting us know, and I wish you the best success!<br><br>", "<b>Username: 57special</b><br><br>@lin123  good luck at Carleton.<br><br>", "<b>Username: NoelCat</b><br><br>Toured Swat with my son in April.  The worst vibe of any of the colleges we visited – ( Swat, Haverford, Lafayette, Amherst, Williams.   AO made it clear that the main thing that they are interested in is an Activist.  All the students were very grumpy and walking around with their heads down.  It was a nice day but no one was enjoying it.  None of the usual jokes with the tour guide.  Our tour guide was a nice guy, athlete, and stressed how everything was free, didn’t really to seem to have much of a grasp of economics.<br><br>", "<b>Username: lin123</b><br><br>@NoelCat thanks for your view. I really dont want to be in a school where people are not happy. Vibes play a big role in your efficiency and therefore Swat will not be the right place for me. Do you know about carleton college? Hoping to hear your views on the same.<br><br>", "<b>Username: NoelCat</b><br><br>HI -<br>We didn’t visit any of the other schools on the list – but I have heard good things about Carleton.   There is a book called the college finder that has lists of colleges arranged by topic.  Example – college where the students report being happy.  Also on here, you might be able to find information by searching for Carelton comments.  Also reviews on Niche…<br><br>", "<b>Username: Mothersv</b><br><br>My daughter is going to Carleton<br>Class of 2024!<br>So excited for her,<br>She is thrilled!<br><br>"]}