{"title": "duke vs vanderbilt vs northwestern", "comments": ["<b>Username: mdawgggggggg</b><br><br>I need to apply ED somewhere ASAP. My parents want me to have the best shot at a top tier college and I cannot decide. Please share any thoughts/opinions/statistics/experiences you have! it’ll help me so much!<br><br>", "<b>Username: northwesty</b><br><br>What’s most important to you?  What do you want/like in a college?<br>Big/small?  Urban/suburban/rural?  Geography?  Weather?  Which one can your family afford?  What is your planned field of study?<br>All three of these schools are known for providing a nice boost to ED applicants.  But if you are picking these three schools just because of that, that’s about as dumb a reason to pick a school as you could come up with.<br>Unless the only only only thing you care about is attending a T20 school.  :   )<br><br>", "<b>Username: collegemom3717</b><br><br>Do you have the stats for these schools?<br>Why each of these three?<br>Pretty sure you won’t like my opinion, but you need to decide this for yourself. YOU are the one who is going to live there for 4 years.<br><br>", "<b>Username: mdawgggggggg</b><br><br>I’ve looked at the stats, my stats fall in range but are not exceptional. I like these three because they seem like a good balance of work hard-play hard. I was settled on Duke but my gut is not speaking to me at the moment.<br><br>", "<b>Username: mdawgggggggg</b><br><br>It is the main thing my parents care about. I am perfectly happy with UT Austin. I either want International Relations or at Vandy the law and society major. I choose these schools because they seem like a rigorous course load that people still enjoy and have a social life at<br><br>", "<b>Username: mdawgggggggg</b><br><br>The other questions are hard. I have lived in CA then TX so I am not experienced with the cold of Chicago and my brain thinks i can handle it in theory. I really liked NW location but the quarter system scares me.<br><br>", "<b>Username: collegemom3717</b><br><br>So, stats are ok, but not great - lower half of the middle 50%?<br>Do you have something that makes you stand out to them? What do you bring to the party- ie, what do you have that would make you a positive asset to the college community?<br><br>", "<b>Username: mdawgggggggg</b><br><br>Yeah bottom 50% I have 1490 SAT. The rest of my applications is strong in terms of extracurriculars(particularly founding United Sound- teaching special needs students to play musical instruments), great GPA, top 3% of my class, rigorous course load, my essay is strong- one of the best things i’ve written and unique, and my recs should be strong as well. I sell my pottery and donate 70% of the proceeds and reinvest the 30% but all three of these schools have 1-2 short answers so it was hard to fit that in rather than just mentioning it in my essay<br><br>", "<b>Username: collegemom3717</b><br><br>Have you visited any/all of them? If so, what stood out?<br><br>", "<b>Username: mdawgggggggg</b><br><br>So I just visited NW, loved the campus but tour was not the best, did not feel like I saw everything or got too much info I couldn’t get online. I visited duke when I was entering my freshmen year with older my sister and loved it, but that was a long time ago. I normally have good gut feelings but I have not had a clear idea yet.<br><br>", "<b>Username: PrdMomto1</b><br><br>These are 3 somewhat different schools (certainly different in terms of campus atmosphere and weather) and all very challenging to get into, even applying ED.  I think it’s nearly impossible for someone to tell you where to apply to ED since it is a binding decision.  You need to really be sure.  I assume your family can afford them all since they are all quite expensive?<br><br>", "<b>Username: sushiritto</b><br><br>I wouldn’t base your selection on a tour or the tour guide.<br>What I’d focus on is the two characteristics you mentioned in your OP. Weather and quarter system. Can you overcome both “fears”? My kid steered away from a school or schools with quarter systems. As for weather, that all depends if you can adjust to NU’s winter. My kid is from CA and now goes to school in Ann Arbor.<br>Durham, Nashville and Evanston are VERY different environments. Also, Duke is NUTSO about their basketball team. Does that matter to you, one way or another?<br><br>", "<b>Username: mdawgggggggg</b><br><br>yes, they have been saving for college since before my conception lol…I am very realistic about it, I know the odds are that I don’t get in- especially because my scores are meh for these schools, but there is always a chance and that freaks me out! got a lot to think about in a short period of time!<br><br>", "<b>Username: collegemom3717</b><br><br>Strongly advise against applying ED to someplace you haven’t visited &/or don’t have a strong sense of. It is a binding commitment.<br><br>", "<b>Username: mdawgggggggg</b><br><br>I love sports. thats another reason for my top three. Most people tell me quarter system is good because I am not 100% dedicated to one subject. I am very flexible, I’m applying to Michigan! I NW is still in the running bc I did like it and have the highest chance of getting in<br><br>", "<b>Username: mdawgggggggg</b><br><br>Thank you,  that helps<br><br>", "<b>Username: collegemom3717</b><br><br>Since the budget is there, get yourself on a plane (asking why you haven’t done that already is tempting but pointless). It makes no sense to commit to a $275,000 investment w/o doing the due diligence.<br><br>", "<b>Username: mdawgggggggg</b><br><br>Ok thank you, the problem at the moment is time& frugility, it’s a top 20 school or in state at UT, but thank you, I will look at flights to nashville<br><br>", "<b>Username: collegemom3717</b><br><br>Frugality over a few hundred $$ vs $275K is penny wise/ pound foolish!<br>Come back after you have been to Nashville & let us know how your thinking is evolving…<br><br>", "<b>Username: mdawgggggggg</b><br><br>ok thank you for your help, and i know, we are a foolish folk, as you can see by my last minute attempts to decide haha<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>My parents want me to have the best shot at a top tier college and I cannot decide.<br>\"\"<br><br>Well, I grabbed the ED rates from the CC Class of 2023 admissions statistics thread for Duke and NU. I googled Vandy’s and took their ED rate from their website:<br><br>Duke 18.2%<br>Vandy 19.8%<br>NU 25%<br><br>The answer is NU. I’m kidding of course, since I have no idea how many recruited athletes and developmental cases are accepted into each school. And how you would fit into each class, in the view of the college.<br><br>", "<b>Username: mdawgggggggg</b><br><br>thank you, those stats are helpful. I love this site! I am waiting for an epiphany but am ultimately going to have decide over the little things, acceptance being an important one!<br><br>", "<b>Username: northwesty</b><br><br>A quick trip to Nashville is recommended.  If necessary, just go visit the town and campus on a weekend and don’t sweat going on an official tour.  You could easily do it in one day (if you needed to) without staying overnight from Texas.  So no excuse not to do it as a full pay family.<br>Since your base option is UT, I’d offer that Vandy (where my kid goes) would have the most similar look/feel to UT.  Southern, cool town, music scene, warm weather, state capitol, river runs through the middle of the town (but no bats under the bridges), and big time college sports.  The Vandy football team is usually bad and the games are lightly attended; the football tailgates, however, are first class.<br>If you like one of those schools pretty well, no harm in throwing your one ED dart.  I wouldn’t try to overthink the relative admit chances.  Even with ED, each of these schools is pretty reachy.<br><br>", "<b>Username: mdawgggggggg</b><br><br>Thats very helpful. I had the most interesting tour guide at UT and i think it made me like it more because I related and connected to a student there. My dad says Vanderbilt bc he is convinced there is some sort of geography calculation that determines were students get in (rolls eyes). I have calmed down a bit by grounding and reminding myself that this is not a likely possibility, but worth a shot. Hopefully Nashville works out, my next two weekends are booked so I am hoping for a monday or tuesday trip in and out… I will let you guys know how everything turns out!<br><br>", "<b>Username: juillet</b><br><br>How much push back can you offer to your parents?<br>I ask this because you seem uninterested in the three options you’ve listed. By your own admission, you’d be perfectly happy with UT-Austin, and the things you have said you want (a work hard/play hard culture, big sports, nice social life) are present at UT-Austin. There are also other fine schools in the Texas public university system - Texas A&M comes to mind as a big one, and Texas Tech, too.<br>From your post, it seems like you say the top 20 status is the main thing that your parents care about. Choosing a college is (or should be) the first major decision you make in your new adult life for yourself - with guidance and support from your parents, of course. But you are the one who has to attend and live with your choice every day for your college career and beyond. ED is, as others mentioned, a binding decision. Do you like any of these schools enough to definitively state right now, or by the ED application deadline, that you definitely want to go there over UT-Austin?<br><br>", "<b>Username: Testingearly</b><br><br>Vanderbilt really cares about high standardized test scores and focuses on that much more than NW and Duke. Your best shot at an ED acceptance is NW. Good luck!<br><br>", "<b>Username: coolguy40</b><br><br>Keep in mind that you’re in school to gain marketable job skills, so you’re major is going to be more important than the school you go to. Take a good look at your interests and choose something that has a list of potential majors you might find interesting. You want a school that has both interest and flexibility. NEVER choose a school based on rankings. That’s the fastest way to find a mismatch, and 4 years of misery.<br><br>", "<b>Username: Publisher</b><br><br>Most recent US News rankings:<br>Northwestern #9 National University<br>Duke #10 National University<br>Vanderbilt #15 National University<br>For the best chance at a highly ranked school under ED admissions: Consider the #1 ranked LAC–Williams College which has an ED admit rate of about 34%.<br>17 ranked Davidson College in North Carolina is another LAC to consider for ED admission.<br>My suggestions are simply based on schools with outstanding academics & high ED admit rates. Curious to read your response to my suggestions in order to better understand your preferences.<br>Also, for a work hard / play hard environment for a potentional International Relations or Law & Society major, Claremont McKenna College in California, ranked #7 LAC, might be of interest as it is part of a group of outstanding colleges which offer cross registration privileges.<br>I love the idea of UT-Austin, but it might be interesting to experience a different region of the country during your college years.<br><br>", "<b>Username: Publisher</b><br><br>Also, I do not think that a resident of Texas would have any advantage regarding admission to Vanderbilt as Vanderbilt receives a lot of applications from Texas residents.<br><br>", "<b>Username: PrdMomto1</b><br><br><br><br><br> mdawgggggggg:<br>\"\"<br>My dad says Vanderbilt bc he is convinced there is some sort of geography calculation that determines were students get in (rolls eyes).<br>\"\"<br><br>At most schools geography helps only if you’re in-state (and they are the large public school in-state) or if you are from a state where they have few students apply and they want to improve their geographic diversity. I would not think being from Texas and applying to Vandy would apply here. If you were from North Dakota and applying to Vandy you’d probably have a much better shot based just on geography.<br>Another option is to talk to your school guidance counselor and see if she has any insight regarding whether any students in the recent past have gotten into those 3 schools and how your application stacks up compared to theirs.<br>Is there any reason you’re not considering Rice since it’s a top school and closer to home so you could probably visit?<br><br>", "<b>Username: northwesty</b><br><br>Texas is a huge state.  So TX geography isn’t going to help you at any of these schools (and probably at no schools in U.S. frankly).  At Vandy, the top sending states are TN, FL, IL,NY, TX, CA.  Any chance your family is moving to ND, SD or WY soon?  :  )<br>All these schools like high test scores, but Vandy seems to dig the high numbers a lot.<br>But again, don’t overthink it.  Even applying ED, all of these schools are reach-ey – 25% or less.  And those stats will include some hooked applicants (legacies, URMs and a few athletes).  So if you are unhooked, the admit rates are even lower/reach-ier.<br>Applying ED maybe doubles your chances of admission, but the odds are still very long.<br><br>", "<b>Username: BKSquared</b><br><br>You are going to college for you, not your parents’ bragging rights.  The 3 you listed are great schools, but will be very different experiences.  UT is no slouch school.  I assume you got auto-admitted to UT.  Did you apply to one of the honors programs? Let’s also look at the costs of attendance, assuming you live on campus:<br>UT in state: $28K<br>Duke:  $73K<br>Vandy: $73K<br>NW: $79K<br>So we are looking at around $200K over 4 years.  Even if your parents have this saved away, this could be applied to grad school or other uses.  Now some families choose to make this expenditure for perfectly rational reasons (debated endlessly on CC), but this type of decision is normally based on some aforethought on the benefits of $$$$ college vs State U, especially if this is where the kid wants to go.  Here your parents are asking you to potentially get locked in to a school that you don’t necessarily prefer (or at least prefer strongly) over your in-state school.  At least make this decision with due deliberation based on your own research/diligence.<br><br>", "<b>Username: Publisher</b><br><br>@BKSquared :  I think that full pay students at any of Duke, Vanderbilt or Northwestern are looking at a $300,000 COA for four academic years. However, is OP a full pay applicant ? If in need of financial aid, all three universities are generous.<br>The real issue remains: What are the OP’s primary interests, likes & dislikes ? That is why I am trying to draw out a response regarding elite LACs.<br><br>", "<b>Username: BKSquared</b><br><br>^ Believe OP said he was full pay up thread.  The $200K is the 4 year differential between UT in state and the other 3 assuming full pay.<br><br>", "<b>Username: momofsenior1</b><br><br>If you don’t have a clear favorite, do not apply ED.      There is no rule that you need to have an ED school.     Many kids do not.<br><br>", "<b>Username: mdawgggggggg</b><br><br>]<br>From your post, it seems like you say the top 20 status is the main thing that your parents care about. Choosing a college is (or should be) the first major decision you make in your new adult life for yourself - with guidance and support from your parents, of course. But you are the one who has to attend and live with your choice every day for your college career and beyond. ED is, as others mentioned, a binding decision. Do you like any of these schools enough to definitively state right now, or by the ED application deadline, that you definitely want to go there over UT-Austin?<br>\"\"<br>Not really, however when I have pushed back they think it is due to a lack of ambition and work ethic.<br><br>", "<b>Username: mdawgggggggg</b><br><br><br><br><br> Publisher:<br>\"\"<br>Most recent US News rankings:<br>Northwestern #9 National University<br>Duke #10 National University<br>Vanderbilt #15 National University<br>For the best chance at a highly ranked school under ED admissions: Consider the #1 ranked LAC–Williams College which has an ED admit rate of about 34%.<br>17 ranked Davidson College in North Carolina is another LAC to consider for ED admission.<br>My suggestions are simply based on schools with outstanding academics & high ED admit rates. Curious to read your response to my suggestions in order to better understand your preferences.<br>Also, for a work hard / play hard environment for a potentional International Relations or Law & Society major, Claremont McKenna College in California, ranked #7 LAC, might be of interest as it is part of a group of outstanding colleges which offer cross registration privileges.<br>I love the idea of UT-Austin, but it might be interesting to experience a different region of the country during your college years.<br>\"\"<br><br>I do not want a Liberal Arts College…a slightly bigger college with sports is ideal. I totally get the UT Austin and I think I like it so much because it is comfortable<br><br>", "<b>Username: mdawgggggggg</b><br><br><br><br><br> PrdMomto1:<br>\"\"<br><br><br><br> mdawgggggggg:<br>\"\"<br>My dad says Vanderbilt bc he is convinced there is some sort of geography calculation that determines were students get in (rolls eyes).<br>\"\"<br><br>Another option is to talk to your school guidance counselor and see if she has any insight regarding whether any students in the recent past have gotten into those 3 schools and how your application stacks up compared to theirs.<br>Is there any reason you’re not considering Rice since it’s a top school and closer to home so you could probably visit?<br>\"\"<br><br>Our guidance counselors are notoriously bad at getting students into good schools. I looked at Rice and as soon as I stepped on campus I was treated rudely. I did not even finish the tour because the ladies who checked us in were being so rude - talking loudly about us.<br><br>", "<b>Username: mdawgggggggg</b><br><br><br><br><br> northwesty:<br>\"\"<br>Texas is a huge state.  So TX geography isn’t going to help you at any of these schools (and probably at no schools in U.S. frankly).  At Vandy, the top sending states are TN, FL, IL,NY, TX, CA.  Any chance your family is moving to ND, SD or WY soon?  :  )<br>All these schools like high test scores, but Vandy seems to dig the high numbers a lot.<br>But again, don’t overthink it.  Even applying ED, all of these schools are reach-ey – 25% or less.  And those stats will include some hooked applicants (legacies, URMs and a few athletes).  So if you are unhooked, the admit rates are even lower/reach-ier.<br>.<br>\"\"<br><br>I am unhooked and agree completely!<br><br>", "<b>Username: mdawgggggggg</b><br><br><br><br><br> BKSquared:<br>\"\"<br>You are going to college for you, not your parents’ bragging rights.  The 3 you listed are great schools, but will be very different experiences.  UT is no slouch school.  I assume you got auto-admitted to UT.  Did you apply to one of the honors programs?<br>\"\"<br><br>Yes auto admit and applied to Liberal Arts Honors Program.<br><br>", "<b>Username: mdawgggggggg</b><br><br>Sorry it took long to respond. A couple of clarifying points: my dad believes schools use an algorithm to accept different students based on geography, so not all the top applicants are admitted to the same place. We know TX has no advantage. I choose the three schools because of their combination of rigorous academics, social lives, and sports. UT is my safety school. I am an unhooked full pay. My parents are sounding much harsher than in actuality, they just want me to get the best education  I can and since my scores are average, ED will help a lot.<br><br>", "<b>Username: mdawgggggggg</b><br><br>Thanks for all the feedback!<br><br>", "<b>Username: brantly</b><br><br>If you’re really not into these schools, apply to the one you are least likely to get into.<br><br>", "<b>Username: collegemom3717</b><br><br>Imo, your Dad is more wrong than right on the amount of bump ED brings at those schools, the algorithm & that you are lazy   but - Sonia the person who suggested applying to the one you are least likely to get into: it’s a bad approach to like and could backfire badly. Visit Vandy, review the 3 options & ask yourself which- if any! - would be most likely to be a happy place for you.<br><br>", "<b>Username: momofsenior1</b><br><br>If sports is important, NU doesn’t cut it.    While they play in a great division, the school spirit around sports is lackluster.    The running joke in Evanston is the football team plays all their games “away” because generally the opposing team’s fans out number the NU fans.     It was a sea of OSU fans here last night.<br><br>", "<b>Username: Mwfan1921</b><br><br><br><br><br> momofsenior1:<br>\"\"<br>If sports is important, NU doesn’t cut it.    While they play in a great division, the school spirit around sports is lackluster.    The running joke in Evanston is the football team plays all their games “away” because generally the opposing team’s fans out number the NU fans.     It was a sea of OSU fans here last night.<br>\"\"<br><br>That’s so harsh momofsenior! I actually think school spirit is fine at Northwestern, but yes, especially at football games there can be many more fans from the opposing teams…NU has about 8K undergrads, OSU 55K…kind of crazy to be in the same conference with such a size difference, yet in some sports in some years NU is actually competitive.<br><br>", "<b>Username: momofsenior1</b><br><br>@Mwfan1921 agreed that it makes no sense that NU plays against OSU, Iowa, Nebraska, etc…<br>They had a decent run last year in football but attendance still wasn’t  good.<br>I find the students here to be more passionate about the arts.     They come out in droves to support their friends in master classes and recitals.   That’s where you hear the cheering.    I love that!<br><br>", "<b>Username: mdawgggggggg</b><br><br>Very Helpful, I love all sports and want school spirit!<br><br>", "<b>Username: Publisher</b><br><br>Northwestern students definitely support their basketball team. Football, lacrosse, wrestling & soccer receive attention & experience success. No track & field team.<br><br>", "<b>Username: Riversider</b><br><br>Information provided by you:<br>You live in TX, love sports schools with good social life, size doesn’t matter, UT auto-admit, high income family, parents willing to pay for T20 advantages/prestige, unhooked, bad SAT scores but good grades/rank, not too keen on harsh winters, strong ECs and essays, school counselors suck, intended major IR, intended track pre-Law.<br>Information needed:<br>What’s your race? What are your PSAT, AP and SAT subject test scores? Do you have good LORs?<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>NU has about 8K undergrads, OSU 55K…kind of crazy to be in the same conference with such a size difference, yet in some sports in some years NU is actually competitive.<br>\"\"<br><br>For comparison, Stanford has about 7,000 undergrads and finished #1 in the Director’s Cup standings. #1 in the Pac 12. NU finished 45th, but not last in the B1G. MSU and Rutgers were at the bottom.<br>School spirit will depend a lot on winning. I’m sure the year NU went to the B1G title game (2018), NU school spirit was high. And I remember an NU alumnus paid for lots of buses to send NU students to that B1G title game.<br><br>", "<b>Username: Riversider</b><br><br>If you don’t get in Duke as ED, take a bus to Rice and visit again for RD, they admit lots of Texans so your odds are fair there, don’t reject whole school based on couple of “rude tour registration ladies“.<br><br>", "<b>Username: PrdMomto1</b><br><br><br><br><br> Riversider:<br>\"\"<br>If you don’t get in Duke as ED, take a bus to Rice and visit again for RD, they admit lots of Texans so your odds are fair there, don’t reject whole school based on couple of “rude tour registration ladies“.<br>\"\"<br><br>Yeah, that whole situation surprises me.  I am a bit biased (I have student there) but we did LOTS of tours at lots of schools and never experienced anything but friendliness from staff and students.  But, I know it’s easy for one person to impact your feelings about a school, especially when you’re having a hard time making decisions and looking to differentiate schools.  We had a bad tours at both Vandy and NW. Vandy was my daughter’s top choice prior to the tour and had we left right after I’m not sure if she would have applied.  But we spent a lot of time walking around campus and around the area after the tour and she started feeling more positive about it again.<br>Did you say somewhere you don’t like harsh winters?  Have you ever been on the Chicago lakefront in winter?  Yikes!<br><br>", "<b>Username: northwesty</b><br><br>“The running joke in Evanston is the football team plays all their games “away” because generally the opposing team’s fans out number the NU fans.”<br>This is true for all of N, V and D football.  They are all mid-sized elite privates in Power 5 conferences whose other members are big state schools.  The only other schools with that combo in the USA are ND, Stanford and perhaps USC.<br>Chicago/NU is the favorite road trip for fans of other B10 schools.  Nashville/VU is the favorite road trip for fans of other SEC schools.  Duke football is decidedly meh in the ACC.<br>But all three have a lot of fun around sports – football gamedays are lots of fun regardless of whether you go to the game or the team wins.  My Vandy kid rarely attends a football game, but never misses a tailgate.  And there’s plenty of other sports the kids get into – hoops, baseball, lax, etc.  Lots of kids wearing spirit gear on all three campuses.<br><br>", "<b>Username: elena13</b><br><br>Too bad you couldn’t get to Nashville this weekend, as Vandy had a great upset win against Missouri. My freshman son is very happy so far at Vanderbilt. He was accepted RD as an unhooked applicant and has been surprised that almost all of his friends (fairly large group) applied ED.<br><br>", "<b>Username: theloniusmonk</b><br><br>“For comparison, Stanford has about 7,000 undergrads and finished #1 in the Director’s Cup standings. #1 in the Pac 12. NU finished 45th, but not last in the B1G. MSU and Rutgers were at the bottom.”<br>That’s a little misleading, Stanford finished first, as it usually does on sports that don’t really have many people watching it - water polo, tennis, rowing, golf, track & field, lacrosse, softball, baseball, among others.<br>“But all three have a lot of fun around sports – football gamedays are lots of fun regardless of whether you go to the game or the team wins.”<br>Exactly, well said.<br>“If sports is important, NU doesn’t cut it.”<br>Sports is not that important as the OP’s ED choices are Vandy, Duke, NU, so it looks like academics, rigorous course load,  may be more important.  Why not apply to OSU or Alabama then?  The OP said he wanted to work hard, play hard in a good social environment.  The work hard part is missing in a lot rah rah schools.<br><br>", "<b>Username: sushiritto</b><br><br><br><br><br> theloniusmonk:<br>\"\"<br>“For comparison, Stanford has about 7,000 undergrads and finished #1 in the Director’s Cup standings. #1 in the Pac 12. NU finished 45th, but not last in the B1G. MSU and Rutgers were at the bottom.”<br>That’s a little misleading, Stanford finished first, as it usually does on sports that don’t really have many people watching it - water polo, tennis, rowing, golf, track & field, lacrosse, softball, baseball, among others.<br>\"\"<br><br>Not misleading at all. Actually a lot of those sports, including soccer, water polo, baseball, softball, volleyball, track & field, tennis, etc. are extremely well attended at Stanford by locals including me. I’ve taken my kids to almost all those sports plus gymnastics since they were very little as do many parents here locally. Why? Stanford is quite successful across lot of sports. And a winning sports program brings out fans.<br>But Stanford is off topic.<br><br>", "<b>Username: mdawgggggggg</b><br><br>[quote=“PrdMomto1, post:53, topic:2069791”]<br><br><br><br> Riversider:<br>\"\"<br>If you don’t get in<br>Did you say somewhere you don’t like harsh winters?  Have you ever been on the Chicago lakefront in winter?  Yikes!<br>\"\"<br><br>I dont know if I like them as I am a native Californian moved to Texas<br><br>", "<b>Username: mdawgggggggg</b><br><br><br><br><br> Riversider:<br>\"\"<br>Information provided by you:<br>Information needed:<br>What’s your race? What are your PSAT, AP and SAT subject test scores? Do you have good LORs?<br>\"\"<br><br>White, no PSAT recognition, 1490 SAT, 800 US History, 710 Math II. Stats are not great. LOR (US History and Calculus teacher, have had both two years and am very close with them) and Common App essay( nice metaphor, good points) are very good. Writing will have to set me apart.<br><br>", "<b>Username: dreambig55</b><br><br>I can see why Northwestern and Vandy could be appealing (Duke isn’t on the list, so we’ve never visited).  My S20 has visited both and they are both pretty neck and neck on his “list.”  Even though for his major, Northwestern seems to have a little bit better ranking than Vandy, they’re still neck and neck just because of the great feel he got for the Vandy campus and atmosphere.  I’m not sure if this has been mentioned, but Vandy also has ED II.  You could apply at Northwestern EDI if this is something you feel strongly about doing and have your Vandy app in as RD.  You can see what happens and if you don’t get into Northwestern, you can email your Vandy admissions counselor right away and switch it to ED II to have that option before 1/1.  Of course, the weather is quite different between the 2.  I know my son could hack the winters at NU, so that isn’t as big of a concern for him.<br><br>", "<b>Username: dreambig55</b><br><br>But yeah, now seeing up there somewhere that Chicago winters may not be for you…maybe that’s not a great idea.   My son is quite familiar with them, so Northwestern is pretty high on his list.<br><br>"]}