{"title": "duke vs penn sneak in amherst", "comments": ["<b>Username: MrClutch007</b><br><br>I have the grateful opportunity to choose among these colleges as my place of study for the next four years. I’ve looked at previous threads and they all say these two are so alike. They all are quite similar in what they present overall imo so I am quite torn by which one I should choose to attend. Some facts I am specifically looking for:<br><br>Strong economics (business track) and premed programs. I am currently applied as econ major at both Duke and Penn (Arts and Sciences), but there is still a very strong possibility I may look into premed / Biology as my future. The key is that I would like the option to switch between economics and premed should I need to do that. Overall seeking opinion on which departments are stronger of the two and provide better opportunity<br>Collaboration and faculty interaction. This is why I also brought up Amherst though its location does makes me slightly hesitate. I want to have good communication with my professors and know me relatively well. Duke has excellent FLUNCHes program that seems awesome, but both universities aren't humongous so I believe reaching faculty wouldn't be too difficult. Also, just want a quick two cents on how competitive both colleges are. I've heard high praise of collaborative work to nightmares like UC weed out classes cutthroatism..<br>Location does kinda matter. By campus Duke is far and away the best with the most pleasant weather but Durham seems much less exciting and engaging as a big city like Philly. I have visited both Duke and Penn on day trips, so I wanted an opinion of student life and if Philly has a massive advantage over Durham.<br><br>Also, please do NOT factor cost into this discussion, it will not affect my decision. I appreciate your comments.<br><br>", "<b>Username: merc81</b><br><br>In terms of faculty scholarship, Penn places somewhat higher than Duke in economics: https://ideas.repec.org/top/top.usecondept.html.<br>Though not directly comparable to the above, this will give you a sense as to where Amherst places among its peers: https://ideas.repec.org/top/top.uslacecon.html.<br>Economics itself would be a perfectly suitable major for a pre-med student at any of your choices.<br><br>", "<b>Username: AlmostThere2018</b><br><br>Congrats on great options!<br>Duke is not known for being competitive – in fact they have grade inflation.  I don’t know about competitiveness at Penn but I’m guessing it’s not bad.  I think Cornell is the only Ivy that works students really hard…<br>Duke has the nicer atmosphere and amenities – the campus is immaculate.  Durham is not large but it’s a very hip and cool city with a strong night life, art scene, very progressive politics, etc.  It’s the Brooklyn of the South, in my opinion – lots of hipsters and facial hair, lol!<br>Penn is more ‘authentic,’ urban and slightly gritty – though tbh I haven’t been there in years.  Philly is a great city and proximity to NY is a plus for me.<br>Amherst would be totally different – it’s surprising that you’d be interested in it if you are so interested in Duke and Penn so if you really are you might want to explain the ‘whys’ more.<br>If you want great school w/ excellent faculty, facilities, and support/opportunities choose Duke.  If you want more ‘old school’ high brow, slightly crusty Ivy,  choose Penn.<br>Hope this helps and let us know what you decide!!<br><br>", "<b>Username: KLSD</b><br><br>You can complete premed requirements as an economics major. Our pediatrician did this at Brown and DH’s oncologist has an MBA, there are many links for a career in medicine.<br>Philly offers a lot of opportunities as an undergraduate: city opportunities affordable to students, good cheap eats at family owned restaurants, University City as a whole and Penn’s campus. Penn students tend to work hard and then play hard within the academic club, sports club team, D1 team and Greek life social structures. Many many events are organized and scheduled. You will always have opportunities for fun and at the same time an understanding that research and academics come first. Exhausting, but a healthy way to explore, make wonderful life long connections and become an adult. Penn is referred to as the social Ivy for a reason. I would say that my children have a better experience in Philly (the gritt makes everything more affordable) than they would have had in Boston. Don’t know the Durham area.<br>The STEM core classes are graded on a C curve especially SEAS and premed science classes. SEAS students say that premed CAS students tend to be more competitive for their A grades but that may be because engineering students learn early on that collaborating on problem sets and labs is the best way to learn their only survival path.<br><br>", "<b>Username: MrClutch007</b><br><br>@AlmostThere2018 Thank you for your insight on both of these schools! To answer your question, I was still somewhat considering Amherst because of the opportunities with faculty I am able to engage in. I was just concerned that at these larger research universities that I would receive little to no interaction with my professors. Bottom line is I want to have strong letters of recommendation for Grad School, etc, and also just to have a stronger understanding of the material I am learning in class. Overall, it may come down to location. From your post it seems Durham is a little more lively than I thought, but I still feel like Philly would have more to offer. Overall it seems as if Penn is the better city but Duke offers the better college experience? Might have to flip a coin on this!<br><br>", "<b>Username: MrClutch007</b><br><br>@KLSD Thank you for your response! I just want to understand a little more about being a economics major and taking premed courses. Overall does that open the up the options to choose either a career in business or medicine later down the path, or is it mostly just “easier” to complete premed requirements as a econ major as opposed to, say a Biology major? It is my wish to be able to explore in college a little, maybe the first (maybe second) year before committing to a track, so I just want to know by that premise if Duke or Penn jumps out more. Also, in terms of grit, would this be more of the overall student culture at Penn or is it the toughness that you need to obtain in order to be successful in Philly? Thanks a lot!<br><br>", "<b>Username: AlmostThere2018</b><br><br>Just fyi re: Durham!  <br>https://www.vogue.com/article/durham-travel-guide-north-carolinas-hippest-city<br><br>", "<b>Username: KLSD</b><br><br>You will have endless options to explore before declaring a major.  Research may be a good way for you to explore, CURF is the office at Penn. There are no specific premed courses because the requirements are general science and math courses. Science and engineering majors take the same courses.<br>Grit refers to Philly as the poorest of the largest US cities. This opens many more affordable options for students. Student lead organizations of all kinds (club, academic, Greek) rent resturants, a river cruise, museum, rooftop venue for events.  There are plenty of affordable concerts, festivals, Reading Terminal market and theatre events.    Food trucks on and near campus provide good affordable ethic eats.  Yes, Philly has a higher crime rate, but Penn police dept is the second largest private police force and they do a terrific job of enforcing a wide area around University City.  There are multiple Philly public transportation options plus Uber.  I’m not sure you can even compare a large northeast working class city to Durham. Philly is very different than Boston which is filled with universities and hospitals.<br>Student body is larger at Penn and sports events are not comparable to Duke.<br><br>", "<b>Username: Fifty</b><br><br>MrClutch, have you visited Amherst College yet?  If not, please do so.  I think that you will find far more “collaboration and faculty interaction” at the undergraduate level at Amherst than at either of the large universities you are considering.  Also the town of Amherst, with UMass on one side and Amherst College on the other, has plenty student-oriented businesses and activities.  Nearby Northampton is another vibrant college town.<br>Amherst College offers both a strong economics major and excellent premed advising.  Since you are undecided about your major and your eventual career, you should keep your options open while exploring your interests.  As a first-year student you could start with an economics course and one or more of the recommended premed courses.  After a few semesters you will learn where your strengths and interests lie.  Then you can choose a major and decide whether to continue the premed courses.<br>Give Amherst some serious consideration.  In my opinion it is your best option for your undergraduate education.<br><br>", "<b>Username: circuitrider</b><br><br>Are you an international?<br><br>", "<b>Username: JenniferClint</b><br><br>I don’t think you can go wrong between Duke and Penn. Trust your gut.<br>I will say that Durham is quickly becoming a nice college town with excellent restaurants etc. People have outdated perceptions of what it is like.<br>Penn is definitely a grittier campus but Philly is an underrated city. Duke probably offers a more “conventional” college experience.<br><br>", "<b>Username: MrClutch007</b><br><br>@KLSD Thank you for your insight on Philly! I visited last summer and walked around Penn both during the day and in the evening. It definitely has a large city feel and though crime can be a concern, I saw the many police patrolling the area and residential halls being required to have card swipe. Safety isn’t my concern in regards to attending Penn, its just the overall feel of living in a large, cosmopolitan city in addition to the academic aspect.<br><br>", "<b>Username: MrClutch007</b><br><br>@Fifty I haven’t visited Amherst, sadly when I went on my Northeast tour of colleges :(. And that lies the root to my reservations about choosing the college. Of course, I’ve heard with the college consortium and a fairly large institution nearby in UMass it wouldn’t feel isolated at all. I just don’t know if it is somewhat comparable to Durham in feel, though Durham is larger in size. Yes, this is precisely why I am still seriously considering Amherst in my options, due to the wide liberal arts education that sets up success in whichever field I choose. Do you know how well Amherst places into med school and business school? I’ve heard it is highly recruited by Wall Street, just not sure about grad school admissions. Thanks!<br><br>", "<b>Username: MrClutch007</b><br><br>@circuitrider No, I’m from the Pacific Northwest.<br><br>", "<b>Username: MrClutch007</b><br><br>@JenniferClint I agree and this is kind of the crux of my debate. Looking at whether I should have a quintessential college experience or be well set up and connected for graduate school and career wise. This is no knock on Duke at all, I just have seen through overall trends Penn seems to find a little more success placing its students into elite grad schools and careers.<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>Do you know how well Amherst places into . . . business school?<br>\"\"<br><br>With respect to colleges that send high proportions of their graduates to highly regarded MBA programs, you have captured 15% of the market (from College Transitions):<br><br>\"\"<br>In contrast to other professional degree programs, such as those in law or medicine, MBA programs strongly encourage applicants to possess at least a couple [of] years of work experience . . . Still, the competitiveness of one’s undergraduate institution is considered in the MBA admissions process . . . we were able to identify the colleges and universities sending the highest percentage of graduates to a top-ranked business school . . .<br>Amherst College<br>Bates College<br>Claremont McKenna College<br>Columbia University<br>Cornell University<br>Dartmouth College<br>Duke University<br>Georgetown University<br>Hamilton College<br>Harvard University<br>Middlebury College<br>Northwestern University<br>Pomona College<br>Stanford University<br>University of Chicago<br>University of Michigan<br>University of Pennsylvania<br>University of Southern California<br>Yale University<br>Yeshiva University<br>\"\"<br><br><br>", "<b>Username: privatebanker</b><br><br>OP. Just remember much of the great advice here is naturally shaped by selection bias.<br>Please use the tremendous intellect and leadership traits all of these super elite schools recognized in you to make a reasoned decision.<br>You know what you like and what seems most aligned with your goals and aspirations. What school just popped into your head after reading that sentence? Choose that one.<br>Best of luck, congrats and take a minute to smell the roses.<br><br>", "<b>Username: merc81</b><br><br>You might also find it interesting that you have the option to attend the top college in this Forbes article: https://www.forbes.com/sites/nataliesportelli/2017/04/26/10-expensive-colleges-worth-every-penny-2017/.<br><br>", "<b>Username: JenniferClint</b><br><br>@MrClutch007 That is not true at all actually. Look at the outcomes section of the recently released Wall Street Journal rankings. Duke is tied for first with Harvard.<br>https://www.dukechronicle.com/article/2017/12/sr8uhqahjt1zoag<br>“For graduate outcomes, the rankings take into account graduation rates, the salaries that graduates own and the debt they carry.”<br>You will also get slightly more personal attention at Duke since it is a smaller school.<br>If you were committed to finance and were picking between Wharton and Duke, you might have a point.<br><br>", "<b>Username: circuitrider</b><br><br>OP - You’re making this way harder than it needs to be. The academics and grad school/business school placement between virtually all the colleges mentioned so far are a wash. What sort of campus are you looking for?<br><br>", "<b>Username: AlmostThere2018</b><br><br>First, I would not recommend attending a college you’ve not visited so if Amherst is an actual contender make plane ticket reservations today.  If you’re not able/willing to to do that – take it off the list and move on.<br>Between Duke and Penn – I agree with advice to go with your gut and not overthink it.  No wrong answer here – where feels right to you?  Do the old flip a coin trick and see if you’re immediately happy or sad with what side (college) that wins.<br><br>", "<b>Username: OHMomof2</b><br><br><br>\"\"<br>Do you know how well Amherst places into med school and business school? I’ve heard it is highly recruited by Wall Street, just not sure about grad school admissions.<br>\"\"<br><br>All true. Fewer PhD programs than professional schools (medical, business, law). And yes it is highly recruited by finance/banking/consulting. But I think all 3 probably are.<br>It really comes down to what you want in the 4 years you are there. And perhaps to support in choosing your path and doing what is needed to successfully embark upon it.<br>I know little about Penn and Duke in terms of general and career-specific advising or competitive vs collaborative encouragement in/out of the classroom, support for summer and other internships and funding. I know Amherst does well on all those metrics.<br>But I agree - you really should visit.<br><br>", "<b>Username: Penn95</b><br><br>@MrClutch007 In terms of quality and opportunities is is a wash but i personally would go with Penn over Duke (actually had to make that choice) for the following reasons:<br><br>Overall Penn is ranked higher in most fields <br>-The ivy league tag (neither Penn nor Duke have super strong brands like HYPSM but by being part of the ivy league Penn gets a boost in that department. Duke doesnt have anything similar to prop it up) <br>As a CAS Econ major you can supplement your degree with as many Wharton classes as you want and get involved in really cool business clubs and research opportunities <br>-Location: philly is a great city for a college student. Tons of stuff do to (bars, restaurants,  theater, music etc). Also it is rather close to NYC. Penn is super close to the city but it has its own distinct, well-defined  campus so you can have both the college campus and city experience <br><br>At the end of the day visit with during admit days and go with your gut!<br>Amherst is a whole different story. If you want go the LAC route then its easy just go there.<br><br>", "<b>Username: MrClutch007</b><br><br>Thank you everyone so much for your input! All of you make valid points that makes it even harder to narrow down my choice haha  I think first order of business as pointed out by @AlmostThere2018 and @OHMomof2 is for me to either travel to Amherst Massachusetts asap or to take the college off the running. I’ll try my best to do this in the next two weeks.<br><br>", "<b>Username: MrClutch007</b><br><br>@JenniferClint I totally agree with your assessment. Just to know I would be matriculating into Penn Arts and Sciences, though I would be able to take some Wharton classes. I knew a good friend of mine whose sister transferred from A&S to Wharton, though I fathom it is quite difficult. Since you and @OHMomof2  seem to know Duke a little more, what do you both think about Duke’s Focus and Engage programs and if they are valuable? I’ve heard high praise for both.<br><br>", "<b>Username: MrClutch007</b><br><br>@circuitrider In truth until I visit Amherst (in which it may sway my view) it would be a campus that has lots of activities and some social atmosphere/entertainment nearby. If I could go to a large for a weekend that would be great also. This puts a certain amount of flux into Durham in my mind. Charlotte is nearby (1.5 hours) but imo it doesn’t offer the options like a Philly or Boston in Amherst’s case. Admit days should clear more of this up.<br><br>", "<b>Username: MrClutch007</b><br><br>@Penn95 Thank you for your insight! I was thinking quite closely along the lines as you mentioned. Philly just seems to have more to offer overall. For you, how is your experience at Penn and has it met/exceeded the expectations you looked for? I heard the social Ivy is magnificent but sometimes a little lacking in community culture and maybe too geared towards professional schooling and career outcomes.<br><br>", "<b>Username: MrClutch007</b><br><br>@privatebanker I appreciate the advice. This past week has had me thankful of being able to have the opportunity to choose between these wonderful colleges and though I wished my instinct would choose one over the others, right now a three sided die would probably be the best solution <br><br>", "<b>Username: JenniferClint</b><br><br>@MrClutch007 I do have an undergraduate degree from Duke but I have also been a student at Penn and I am quite familiar with the school (I don’t like to go into more detail for the sake of preserving my anonymity).<br>Penn may be marginally higher ranked in a plurality of fields but we should really focus on the fields you are interested in. According to US News, Penn is ranked 6 spots higher for Econ but Duke is ranked 13 spots higher for Biology. These are graduate rankings so take them with a pinch of salt but they speak to the strength of certain departments.<br>If you are desperate for Ivy cache, you should go to Penn. I would argue that the Ivy label is becoming less important as people are starting to recognize the value of individual institutions. There may have been a time when people would reflexively pick Dartmouth or Brown over a school like Chicago or Northwestern because of the Ivy cache. That is no longer the case.<br>Duke has a world-class medical school in Singapore and an up-and-coming liberal arts college in China. It is a school with global ambitions (Penn is too but Duke has always been less risk averse than its staid Ivy peers). This willingness to push the boundaries and try new things has always appealed to me.<br>Taking classes at Wharton is a nice touch and is something that should influence your decision. You will also be competing against Wharton students in the internship/job market. That is also something to consider.<br>Unfortunately, I did not take advantage of either of those programs. I do know several people who participated in Duke Engage. Most of them had very rewarding experiences in interesting parts of the world. The FOCUS program allows you to take a multidisciplinary approach to understanding a broad topic like “Genetics and Genomics” or “Global Energy”. If you are interested in any of the topics covered, it is probably a great way to learn more about the topic in question (in a small group setting). A program called Bass Connections allows multidisciplinary teams of students to work on real-world problems in a semi-structured setting. It is worth checking out. https://bassconnections.duke.edu<br>Finally, since Penn95 pitched Penn to you, let me end by listing a few reasons why I’d lean towards Duke as a pre-frosh. 1). Smaller student body - more personal attention; 2). Greater undergraduate focus (think Yale vs Harvard); 3). More resources per capita - nicer facilities on average, etc.<br>I am partial to Penn and to Philadelphia. I definitely won’t begrudge you for picking Penn. Having said that, you will have your entire life to experience a cool city but it’s going to be hard to recreate the quintessential college experience after you graduate. Let your heart lead the way!<br><br>", "<b>Username: OHMomof2</b><br><br>You tagged me about Duke but I don’t know anything about it other than a visit my own senior year (didn’t apply).<br>As far as Amherst visits, there are two in April, one is a day and one is a weekend. I’m sure you have  info on those.<br><br>", "<b>Username: havenoidea</b><br><br>If you are considering IB at all, I think you’d be better off at Duke, as you’d be competing against Wharton kids for spots. I’ve looked at placements from CAS and it doesn’t look like they do that well, and I know there are lots of Econ kids at Penn who would rather be at Wharton, but apply to CAS as it’s easier to get in.<br>If that’s not a consideration, I think @JenniferClint is correct re, the undergrad experience. H went to Duke undergrad and loved it, had great faculty interactions (still talks about a famous author who taught there at the time who he kept in contact with), switched majors with ease, and loved the sunshine and school spirit.  I went to grad school at Penn, so don’t have the undergrad experience to compare. As an adult in my mid/late 20’s, I appreciated the city much more than I think I would have as a young undergrad.<br><br>", "<b>Username: MrClutch007</b><br><br>@OHMomof2 I’m sorry, that is my mistake. Yes, I will try to make it to an Amherst day.<br><br>", "<b>Username: MrClutch007</b><br><br>@JenniferClint Wow. Thank you for your comprehensive analysis! I would say the central reason behind my tough decision between these two colleges is that they are so similar to each other overall. I don’t think the Ivy prestige sways me at all now, and I agree in 2019 these strong non-Ivies are equal if not more prominent in career outcomes than those colleges. Both you and @havenoidea mentioned the advantage of being able to take Wharton classes but also having intense competition from them. I would agree, but in a sense I feel that recruiting will also trickle down to more opportunities in Penn CAS as a result of the talent in the ever-connected Wharton. I’ll be attending both of the admit days later this month, so I hope a decision can be solidified from my visits. I appreciate all of your insights and I’ll let you all know which college I chose May 1st!<br><br>", "<b>Username: AlmostThere2018</b><br><br>Going back the cities piece of this, a few thoughts.<br><br><br>If you go to Duke don’t think of Charlotte as a relatively nearby big city to visit. Except for a concert perhaps, you’ll never go.  Even w/ concerts, you’d be more likely to go to Raleigh.<br><br><br>Besides, Charlotte is not substitute for Philly.  It’s new urban and suburban – like Atlanta.  Totally different vibe from Philly and if East Coast gritty is what you’re looking for, Chartlotte is not it.<br><br><br>Durham has old tobacco warehouses and early 20th century ‘bones’ in its downtown  – much more gritty than Charlotte but also funky and cool.  I’ll say it again – Brooklyn of the South.<br><br><br>You’ll be surprised what a bubble college life is for most undergrads and your college experience will be 85% defined by your campus experience.<br><br><br>Keep us posted!<br><br>", "<b>Username: MrClutch007</b><br><br>@AlmostThere2018 Thank you for your insight! I do agree that Charlotte isn’t going to be a place I’ll visit often, since I probably won’t have a car my first year in college. I really haven’t been around Durham yet, but from what you’re saying it is, along with Raleigh a vibrant community that satisfies most of the “wants” from a college student. Btw even Chapel Hill is quite nice when I visited UNC. And that’s fine with me  To your third point, I would say for Penn the college is basically integrated into Philly, so that bubble college life is going to feel drastically different from this standpoint. The campus experience would be heavily influenced by downtown Philly and all of its unique offerings. I guess this is what admit days are for- to visit and see which lifestyle I prefer. Thanks again and I’ll definitely keep you all updated!<br><br>", "<b>Username: Publisher</b><br><br>@MrClutch007 : Absolutely no wrong decision between Penn & Duke for undergraduate study. Nevertheless, if you pick Penn (other than for Wharton), I would encourage you to rethink your decision.<br><br>", "<b>Username: Penn95</b><br><br>@havenoidea said<br><br>\"\"<br>I’ve looked at placements from CAS and it doesn’t look like they do that well, and I know there are lots of Econ kids at Penn who would rather be at Wharton, but apply to CAS as it’s easier to get in.<br>\"\"<br><br>I did my undergrad at Penn and I think this is not true. Penn CAS still does very well for business recruiting compared to other ivies/elites. Comparison with Wharton is apples to oranges because Wharton is a very self-selected group, everyone at Wharton is aiming for these jobs. CAS is also more self-selected than the equivalent majors at other ivies and elites. A lot of CAS students who discover their interest in business later on (after freshmen or sophomores) end up transferring to Wharton. Those who do stay at CAS though and are interested in business to rather well.<br>@MrClutch007<br><br>\"\"<br>but in a sense I feel that recruiting will also trickle down to more opportunities in Penn CAS as a result of the talent in the ever-connected Wharton<br>\"\"<br><br>This is true. This has been my experience at Penn. At Penn you are able to benefit a lot from Wharton through taking classes and being part of the various business clubs available. In fact this is a strategy used by a  lot of CAS students who are interested in a business career but have different academic interests (i.e. don’t wanna study business). Also recruiting opportunities are in no way restricted to Wharton students and employers like having candidates with diverse backgrounds. A Penn CAS kids who has had some business exposure and understanding through participation in Wharton clubs and having taken Wharton classes in in no way in any disadvantage over a Duke Trinity kid.<br>At the end of the day as a mentioned before it is a wash. Visit both and I m pretty sure you ll make up your mind then (the schools are quite different).<br><br>", "<b>Username: HPTD12</b><br><br>MrClutch007 indeed it would be good to visit Amherst as well.  You will almost certainly get more attention from professors there and the town is nice, but much smaller than Durham.   I would not put much stock in the college consortium as you would likely spend 99% of the time at Amherst.<br>Duke and Penn anre both great and a toss up academically  I went to Penn for grad school and had a great time, but West Philly can be challenging.  At a place like Amherst, people often don’t even lock their doors - not West Philly.   The above said , Penn President Amy Gutman (and her predecessor Judith Rodin) have done a great job developing the area around campus to give Penn a better sense of place and community.<br><br>", "<b>Username: MrClutch007</b><br><br>@Publisher Could you elaborate on why choosing just Penn would be a worse option than going to Duke?<br><br>", "<b>Username: MrClutch007</b><br><br>@Penn95 Thank you! I agree with your points and overall it is a wash on which college is better than the other. I was briefly interested in how Duke has nearly 3000 less undergrads, but I found out that surprisingly Penn’s student faculty ratio was a healthier 6:1 as opposed to Duke’s 8:1. I’ll have to see how I feel about each place after the admit days!<br><br>", "<b>Username: MrClutch007</b><br><br>@HPTD12 Thank you for your insight! Yes, the community around Penn and Amherst are certainly quite different! I will try my best to visit Amherst, though getting there will be a little more difficult than the other two. I hope that though West Philly was challenging, did you feel safe most of the time around the immediate vicinity of Penn? I visited in late July of last year and walked around campus both during the day and at night. I was pretty comfortable and understood that I need to be somewhat street savvy in the city.<br><br>", "<b>Username: CupCakeMuffins</b><br><br>These are three great schools with totally different personalities. You’ll get good education and opportunities at all three.<br>Amherst is best for undecided undergrad but it can get claustrophobic due to athlete focused divide, small town location with harsh winters and difficult air travel.<br>Penn is Ivy, bigger city, more opportunities but too big and impersonal. Ironically, Duke even though not as awesome as other two, can be a balanced compromise for you.<br>Is there any cost difference? Travel is going to add some extra expense. I believe Amherst is most generous if you have demonstrated financial needs, most expensive if they don’t understand it.<br>If you want global name recognition then Penn is an Ivy.<br><br>", "<b>Username: Fifty</b><br><br>Do make an effort to visit Amherst College.  Though smaller than the City of Durham, the Town of Amherst is a classic college town that caters to undergraduate students.  If you want to cultivate close relations with faculty and your fellow students, you will not lack things to do in Amherst.<br>All three of the colleges you are considering send lots of their graduates to medical school and into careers in business and finance, so I see no point in arguing that one is better than the others for career success.  What you wind up doing after college will depend you, not on the name of your college.  What is more important is to find the college that will encourage you to explore your interests and to succeed in your studies.<br>From a practical perspective, Bradley Airport (BDL) near Hartford is about 50 minutes by shuttle van from Amherst.  If you are traveling from Philadelphia with a parent, it might be easiest to rent a car and drive.  In any event travel to and from Amherst is manageable.<br><br>", "<b>Username: MrClutch007</b><br><br>@CupCakeMuffins Thanks for your post! I’m thinking along the same lines too about Amherst’s town and the other, large-scale environment that is Philly. I’ll get a feel about how Durham is when I visit in a few weeks. For cost, there is basically no difference here among these colleges, although Amherst may have not fully understood my financial need. I think at this level of institutions we are talking about an Ivy or not won’t make or break any career application, so that brand prestige alone is a non-factor imo.<br><br>", "<b>Username: MrClutch007</b><br><br>@Fifty Thanks for the tip, I’ll definitely do my best to check out Amherst! Yes, with these colleges I agree it’s more on individual performance as opposed to what the institution offers for future success. I’m just carefully evaluating where my next four years should be spent <br><br>", "<b>Username: austinmshauri</b><br><br><br>\"\"<br>For cost, there is basically no difference here among these colleges, although Amherst may have not fully understood my financial need.<br>\"\"<br><br>Do any of these schools require parent loans?<br><br>", "<b>Username: Publisher</b><br><br>@MrClutch007 : Re: your post #38 above: While there is no wrong, poor or bad choice among your three options, I think that Duke University offers an experience that mixes the best of all three schools.<br>There will be plenty of time to enjoy big city life after your undergraduate years.<br><br>", "<b>Username: MrClutch007</b><br><br>@austinmshauri All have unsubsidized Stafford loans.<br><br>", "<b>Username: MrClutch007</b><br><br>@Publisher I agree with your point. It was probably one of the reasons I didn’t apply to any schools in NYC since I knew that I was likely going to spend quite some time in the city when I graduate. Compromises are good!<br><br>", "<b>Username: HPTD12</b><br><br>Yes certainly around the immediate campus area at Penn I felt safe.<br>I do strongly encourage you to visit Amherst too.  It is very different and you may really like the vibe.   Even if you do not attend, years later you will be glad you made the journey.<br><br>", "<b>Username: MrClutch007</b><br><br>@HPTD12 Good point. Live a life with no regrets. Amherst will be on my priority list!<br><br>", "<b>Username: scalable</b><br><br>Tough choice, but go with fit! Opportunities from all three will be essentially the same, so the differentiator will be the environment. If you want a bigger city, think about Penn, although most graduates from Penn/Duke/Amherst go to the city anyways so you may enjoy this time in your life to enjoy something more serene and collegial. Duke and Amherst will be more collegial for sure, with the edge in terms of school spirit and campus energy and community going to Duke. In terms of student body size and subsequent undergrad attention, Penn is the largest with slightly less attention, followed by Duke, then Amherst with the smallest size and most attention. It looks like it depends what you want. Big city, more people in college years but sacrificing some intimate academics would be Penn. Small area, tight knit community and personalized experience would be Amherst. If you like aspects of both, probably Duke is the winning fit.<br><br>", "<b>Username: HPTD12</b><br><br>so @MrClutch007  what have you decided?<br><br>", "<b>Username: MrClutch007</b><br><br>Hello everyone and @HPTD12!! Sorry for the hiatus on replying, but it is only fair for me to tell everybody what I have decided after all the advice I have received. That being said, I’m so thrilled to attend Duke next year! Overall, I judged size of school with location and ability to help reach the careers I want to pursue. Duke was a balanced blend of all of these factors, and the Research Triangle is among the fastest growing regions in the United States. With a favorable location and a medium sized undergrad enrollment, I feel that I will be able to access my professors without problem.<br>To all of you at CC, thank you so much for all of your help in this process. This community is often labeled by outsiders as “toxic”, but I really feel that everyone is here to help each other navigate through one of the most trying, but also rewarding endeavors in life. I’ll try to employ some of what I’ve learned these past few years to help others, just like you all have helped me  Have a great summer y’all!<br><br>", "<b>Username: AlmostThere2018</b><br><br>Appreciate you coming back to let us know your decision!<br>Congrats to you!  I predict you’ll love it for all the reasons you mentioned, and Durham really is an awesome city. Have a great four years and do pay it forward.<br><br>", "<b>Username: Defensor</b><br><br>You made an excellent choice! Congratulations!<br><br>", "<b>Username: elena13</b><br><br>Congratulations and best of luck!<br><br>", "<b>Username: JenniferClint</b><br><br>Congratulations! Make us proud <br><br>", "<b>Username: HPTD12</b><br><br>Congratulations!<br><br>"]}