{"title": "columbia college vs carnegie mellon cs and music", "comments": ["<b>Username: deadgirl</b><br><br>I feel like I’m back every week with a new college thread asking for help and I’m extremely sorry for that! But I literally just got admitted of the waitlist at Columbia College (I’m pretty disappointed it’s not Stanford). I can’t decide between these two colleges (shocker!)!!<br><br>So my initial concern with CMU was that I would be unable to double major in music but I would be able to do this at Columbia college very easily because there's no audition! :-) I'd also be able to do this awesome concentration in jazz and learn from some of the greats by taking jazz composition lessons. I'm not sure if they offer classical voice lessons though?? Also not sure if their chamber choir is any good???<br>I would be getting a B.S. from CMU and a B.A. from Columbia. I'd prefer a B.S. because it would involve more tech oriented courses but you cannot double major between SEAS and CC at columbia.<br>The core curriculum at CC is nasty if you don't enjoy it LOL. I've heard nightmares. The physical requirements and music/writing requirements are fine to an extent, but I despise studying stuff I won't use. <br><br><br>", "<b>Username: happymomof1</b><br><br>BS vs BA is meaningless.  What matters is the specific coursework that you take.  Match the course lists for the two programs.  Are there truly any critical “tech oriented” courses that you would be absolutely unable to get at CC that you would be able to get at CMU?  Likewise, it won’t matter that you can’t formally declare a double-major if you can still fit in the classes that you want to take. Ask CC whether any of the classes you want are restricted to majors only.<br><br>", "<b>Username: Longhaul</b><br><br>@deadgirl , can you specify the location of Columbia College as there are several.<br>If you are referring to the one in Chicago then:<br>Columbia College Chicago doesn’t have a cohesive residential experience.   They are working hard to change that.  Columbia courses are taught by working musicians and through that you’ll get to know the scene in Chicago.   This is a great choice if you want to perform off campus as early as possible.<br>CMU has a more serious reputation and will hone your craft before releasing you to perform.   More technical.<br><br>", "<b>Username: deadgirl</b><br><br>Columbia College the ivy league<br><br>", "<b>Username: deadgirl</b><br><br>Please help! I don’t have much time to decide!<br><br>", "<b>Username: CardinalBobcat</b><br><br>Congratulations on your acceptance off the waitlist! From your post, you do sound much more excited about Columbia than about CMU. If that’s accurate, go with your gut. I agree with happymomof1 that it absolutely doesn’t matter between BS and BA. Being sure that you don’t want to take classes you “won’t use”… that’s tough to determine before you’ve completed them. Some of my most interesting and memorable college classes were unrelated to my major or future plans, and thank goodness they were required or I might not have had the chance to fondly look back on them years later. <br><br>", "<b>Username: privatebanker</b><br><br>@CardinalBobcat amen to that!<br><br>", "<b>Username: deadgirl</b><br><br>I sort of feel strange turning down the #1 computer science school in the nation though! I love being challenged. But at the same time, Columbia is good in all aspects.<br><br>", "<b>Username: vpa2019</b><br><br>i would definitely make sure you are ok with the Core i agree that taking classes you don’t “need” for your major can be enlightening and interesting but it can also be annoying when they take up space you’d like to use for classes you do want to take.  The vibe at those schools is very different as well. Hopefully you had the chance to visit them in person.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> deadgirl:<br>\"\"<br><br>The core curriculum at CC is nasty if you don’t enjoy it LOL. I’ve heard nightmares. The physical requirements and music/writing requirements are fine to an extent, but I despise studying stuff I won’t use.<br><br>\"\"<br><br><br> Take a look at the core and see if all of the requirements are acceptable to you.<br> If you want to do two majors like CS and music, count up requirements to see if you can fit both majors and any non-overlapping core requirements into the number of courses you would take in eight semesters.<br><br>https://www.college.columbia.edu/core/<br>http://bulletin.columbia.edu/columbia-college/departments-instruction/computer-science/#requirementstext<br>http://bulletin.columbia.edu/columbia-college/departments-instruction/music/#requirementstext<br><br>", "<b>Username: deadgirl</b><br><br>I’m very sorry. This post comes off a little bit disrespectful, ungrateful and I truly feel terrible about it. I was in a bad headspace this afternoon after getting my waitlist results! The core curriculum may actually be a good thing because it would allow me to explore interests I may not know I have! I’ll have to see when I visit soon!!<br><br>", "<b>Username: Lindagaf</b><br><br>@deadgirl it’s Columbia University.<br><br>", "<b>Username: bluebayou</b><br><br>^^well, technically, its Columbia College at Columbia University, as the latter also offers the College of General Studies (which many on cc have discussed) as well as Barnard and an Eng school, among other schools.  <br><br>", "<b>Username: CU123</b><br><br>If you have more than one undergraduate college then it should be called a University according to “standard” nomenclature.  As an example Harvard college is the only true undergraduate college at Harvard university (which includes its graduate schools).   Of course its all very convoluted when colleges have separate “schools” within them.  Personally I think if you have to apply to a schools within a college then it really is a University.  If you are in a college and can major in any of the undergrad degrees offered (including engineering) without having to apply to the school separately, that is a true college IMO,  how about that for a convoluted explanation.<br><br>", "<b>Username: tk21769</b><br><br>(I take it we’re talking about this place:<br>https://www.college.columbia.edu/about)<br>IMO, choosing Columbia if you don’t like the Core is almost like buying a pickup truck if you don’t like that cargo thing in the back.<br><br>", "<b>Username: deadgirl</b><br><br>I actually took a look at some of the classes and they actually seem very interesting! I think the core would give me the opportunity to find what I really like.<br><br>", "<b>Username: leiden</b><br><br>Go to UMD, unless Columbia offered you financial aid.<br><br>", "<b>Username: aquapt</b><br><br>It does seem as if Columbia may offer a better balance and a more blended program for your mix of interests than CMU.  You haven’t said how much Columbia would cost, but perhaps you’re just more excited about Columbia and therefore less ambivalent about having your parents pay.  Assuming that Columbia and CMU are similarly expensive, I would make a firm decision as to your preference between the two, and then weigh whether that front-runner is worth the extra expense over UMD, which is still a good option as well. My sense is that you weren’t excited about either of your options before, and Columbia is filling the excitement void now - if so, and if the cost is manageable, then go for it and congratulations!<br><br>", "<b>Username: merc81</b><br><br>If, by reading the course descriptions, you think you   would benefit from classes such as CC and Lit-Hum, then I think you would benefit from the Core in general.<br><br>", "<b>Username: deadgirl</b><br><br>UMD is actually no longer in the picture. I committed to Carnegie Mellon and now have to decide between Columbia and Carnegie Mellon.<br><br>", "<b>Username: DadTwoGirls</b><br><br>“Carnegie Mellon has the best computer science school in the country and very possibly, in the world.”<br>It is definitely up there with MIT and Stanford. CMU is really, really good for CS. Columbia is not at the same level.<br>“One of the things they told me when I visited was that they don’t teach specific languages, they teach CS so that even as the field constantly changes over time, the information learned remains applicable.”<br>Exactly. The language is not the big deal. Data structures, the structure of the program, computational complexity, …, these are important.<br>“Both schools have private musical lessons”<br>I think that this is very common for schools that have good music programs. I would not worry about getting music lessons at either CMU or Columbia.<br>I know some music majors, and someone who had intended to be a music major but changed their mind. A major in music is sort of like being pregnant only more so, you can’t do a little bit of it. Music is their life. One even has a poster on their wall that states “Music = Life”. On the other hand, a minor can be more reasonable. You can be excellent at computer science and dabble in music (one of the very best software engineers that I have ever worked with does dabble relatively successfully in music – I have seen a few others at open mic’s).<br>I think that you might be underestimating Pittsburg.<br>Personally I would stick with CMU. The strength of their CS program is the clincher IMHO. I would not want to give that up.<br><br>", "<b>Username: deadgirl</b><br><br>Update: Someone told me that Carnegie Mellon is very trade school-y and that sort of worries me.<br><br>", "<b>Username: MYOS1634</b><br><br>I would stick with CMU. The music opportunities are similar or better and the CS program is in another category entirely.<br>In addition, CMU + girl in CS = you can get any CS internship in NYC if that’s what you want, so that you benefit from both college life in Pittsburgh and a summer paid gig in NYC (with free time and money, v. Homework and occasional expensive outings).<br><br>", "<b>Username: RookieCollegeMom</b><br><br>You seem quite indecisive.  You’ve posted this question here and under CM.  And you just recently picked CM over UMD.  In addition to your posts about should you take a full ride at UMD and one about your concern that you were only accepted to CM because you were black.<br>I don’t remember your financial situation (other than your post on how you disagreed with how your parents spend their money).<br>No more FOMO.  No more doubts about yourself.  Make a decision - you can do it.<br><br>", "<b>Username: bopper</b><br><br>Read this about the Double Degree Dilemma:<br>https://talk.collegeconfidential.com/music-major/1948726-double-degree-dilemma-essay-written-by-david-lane.html#latest<br>I would also ask in the music major subforum…<br>CMU is not very trade-schooly.<br><br>", "<b>Username: SkepticalOfMost</b><br><br>I’ll echo @DadTwoGirls re Pittsburgh, my daughter loved the food/bar scene there.<br>https://www.nytimes.com/2016/03/16/dining/pittsburgh-restaurants.html?mcubz=2<br>https://www.nytimes.com/2017/07/22/style/pittsburgh-tech-makeover.html?nytmobile=0<br><br>", "<b>Username: Lynnski</b><br><br>If you look through your own comments on this thread, you’ve made a very strong case for attending CMU. Imagine this scenario as if it were a choice a friend was making between two potential suitors. What advice would you offer your friend? It seems like suitor #1 is a better match, but suitor #2 has a new appeal because they were harder to get.<br>How do you think your friend should proceed?<br><br>", "<b>Username: deadgirl</b><br><br>I committed to CMU’s school of computer science, but was let off the WL for Columbia University in NY (the College, not SEAS) recently. At both of these schools, I plan on studying computer science and something related to music. I’m pretty dead set on these subjects and I’m pretty much completely certain I won’t be changing majors or anything. In the future, I hope to have a career both working as a software developer (e.g. making websites/applications/software or pen testing) and working in music professionally (e.g. professional choirs and city music or composition gigs) or possibly somehow combining the two fields with a job that encompasses both (not sure yet).<br>I would really appreciate if people who are in similar situations to me, have children who were in similar situations to me, or know a lot about each school would help me out because that’s usually the advice I find most helpful. Without further ado, here are my qualms about each school.<br><br>I am not interested in Carnegie Mellon's BCSA / Music and technology degree programs. I don't like how the major requirements are cut in half. I feel like it won't allow me to get enough of an education in both. Carnegie Mellon would require me to internally transfer into their music program for me to double major or double degree. There's always the chance I could be rejected and have to apply again and again. Apparently, speaking to students who go there, the faculty is pretty understanding and will help me with portfolios/auditions through private lessons. At Columbia, their music program accepts everyone because it's a BA. It has similar classes in theory, ear training, etc and it also has a jazz concentration. I know that they also have professional-level voice repertoire classes taught at Barnard which I most likely would not be good enough to take at CMU.<br>Both schools have private musical lessons (Is CMU's faculty better?). Carnegie Mellon has a fully produced opera which would have been cool to do. I don't think Columbia has that though. <br>At CMU, a double major would likely take 4-5 years depending on if I decide to take summer classes (I feel like those would be boring in Pittsburgh). At Columbia, I would most likely try and transfer into the 3-2 program which is a B.S. and a B.A. but I would be forced to do all the major requirements for both SEAS and CC which seems like a lot of work. Alternatively, I could just double major in CC. I would again possibly take summer classes for Columbia.<br>Financially, I haven't received my FA package from Columbia yet, but as long as it's around the same as Carnegie Mellon, it doesn't really matter. The main thing I'm concerned about is the student life. I'm assuming people at Columbia enjoy going to expensive restaurants and clubbing in the city for social activities rather than chilling in dorms and going to different house get-togethers at Pittsburgh. Financially, I don't think I can afford to go out every weekend and do crazy expensive things. I feel as though maybe I'd miss out at Columbia but I'm not sure about this.<br>Carnegie Mellon has the best computer science school in the country and very possibly, in the world. One of the things they told me when I visited was that they don't teach specific languages, they teach CS so that even as the field constantly changes over time, the information learned remains applicable. I don't know if Columbia does this. I also like CMU's teaching style: they use note packets rather than textbooks a lot of the time. I feel like Columbia's teaching of CS would be more old-school since it's an ivy. I'm not sure if this is correct, however. I think I like CMU'S SCS better.<br>Someone from Columbia said they had no trouble getting interviews.. but that they failed their interviews.. I don't know if they're credible though, but that worries me.<br>The core curriculum at Columbia for the college takes up 14-16 classes. Apparently, a student from Columbia laughed at someone from Brown's (open curriculum) writing sample because it was terrible writing and they never had done any core English classes. I fear not being a good writer and having a condensed outlook on the world. A Columbia alum told me that the majority of people who haven't read the works they were forced to read in CORE are truly missing out intellectually. The problem is that I'm truly terrible with the humanities. Particularly, my analytical writing has always been bad and I'm a very slow reader and have a lot of trouble understanding the language and literary devices used in old anglo-saxon works. In school, when reading Shakesphere, I would always have to use resources such as \"No Fear\" to help me understand my readings. This wouldn't pass at Columbia.. Also, the thought of taking 14-16 humanities classes is something I'm not 100% sure I'd enjoy because truly, I've never done something like that. A lot of double majors at Columbia have expressed on college confidential that they'd rather be more involved in their major classes and I fear I won't have the opportunity to take all the classes I want.<br><br>I feel like the core curriculum is the same for Carnegie Mellon, however. I know that there are gened requirements that I’d have to take in the humanities and literature (Barely any AP credit). Does anyone know if it’s the same amount as Columbia? Because, if so, then the core curriculum really won’t be that big of an issue since it’s the same for both schools!<br>I have limited time to respond to their waitlist offer. Please let me know your thoughts! I’m not really sure how to determine my “fit”. I love NYC and would love to live there, but at the same time, I want the flexibility to travel across the country and even across the world. I’m really really stressed trying to decide this because I’m scared I’ll make the wrong choice! Thank you very much for all your wonderful help! I really cannot thank you enough. I apologize in advance for any grammar mistakes.<br><br>", "<b>Username: 1NJParent</b><br><br>You seems to to be committed to a CS career and you’re not sure about the Columbia Core (a lot of other people aren’t either). If that’s the case, I too think you should stick with CMU SCS.<br><br>", "<b>Username: aquapt</b><br><br>I don’t think “trade school-y” is the way to describe CMU. It does, however, have a very “corporate” feel, with a lot of the excitement linked to both the ties and opportunities with large, top-tier corporate employers, and also the many entrepreneurial and startup ventures to which CMU students, grads, and faculty are linked. This is not a bad thing if you’re set on a CS career and want a vast array of opportunities where coming out of CMU’s CS program will give you a foot in the door that even an Ivy like Columbia can’t quite match.  However, if you’re more of an intellectual-exploration, life-of-the-mind, four-year-in-an-academic-bubble kind of person, you may savor the experience at Columbia in a different way from what you’d experience at CMU. Things are much more in silos at CMU (the whole BXA “interdisciplinary” initiative notwithstanding - my impression when we visited was that this was a top-down mandate that a lot of the departments don’t fully buy into)… which is fine if you like your silo - and the CS silo does indeed offer a state-of-the-art CS education that surpasses what you’d get at Columbia.<br>It really depends what you want, and most of all how sure you are about CS. IMHO, the worst possible outcome here (still not tragic, but undesirable relative to the great options you have) would be to go to CMU and then decide that CS wasn’t for you after all.  Of course you can get a fine education in almost any major at CMU, but for the most part Columbia would be a better choice for you if it weren’t for CMU’s preeminence in CS. If you went to CMU for CS and then changed your mind about the field, you could legitimately feel regretful that you passed up Columbia. If you’re sure about CS and want to propel your CS career forward to the greatest possible extent, then go to CMU - you will find the music opportunities there, and find your tribe, and craft the college experience that you want.  If your heart is in a wide-ranging liberal arts education and you’re just doing CS because you want an employment-worthy skill-set in the mix (but you might drop it if something you’re more passionate about comes along), then Columbia may be the place for you.  (I have gotten both impressions, variously, at different points in your threads, so it’s hard to tell where your head and heart really are.)<br>Setting-wise, sure, Pittsburgh is not NYC, but there are pros and cons to both and I wouldn’t make this decision based on one city over the other. Both offer more than enough for as much of a rich, urban college experience as you want. The differences between the institutions themselves are more important.<br><br>", "<b>Username: mamaedefamilia</b><br><br>@deadgirl   I wrote a response and it got lost when this thread was merged.  In case it does not reappear, to summarize: CMU’s core can be tailored to be more math/science/social science oriented than Columbia’s.  Columbia also requires four semesters of foreign language and two of PE in addition to the humanities courses about which you are feeling some trepidation.<br>For what it’s worth, one of my engineering parents went to Columbia many decades ago and still vividly remembers and appreciates the core for its breadth, exposure to canonical works outside the discipline, and the inculcation of writing skills.  However, your comments suggest that you want the freedom to dive deep rather and find a structure that requires breadth to be limiting, and perhaps even stifling.<br>Either will prepare you well for your chosen career path.  While there is really no bad choice, it sounds CMU might fit your academic preferences and goals better.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> deadgirl:<br>\"\"<br>Financially, I haven’t received my FA package from Columbia yet, but as long as it’s around the same as Carnegie Mellon, it doesn’t really matter.<br>\"\"<br><br>When will Columbia deliver the FA package?  Seems like that will be an important factor in your decision.<br><br>", "<b>Username: deadgirl</b><br><br>I think I’ll make a decision based off of who gives the most FA.<br><br>", "<b>Username: CountingDown</b><br><br>Please remember that the COL between NYC and Pittsburgh varies considerably! Look at FA within the context of where you’ll be living. Does Columbia offer guaranteed housing for all four years? Off-campus rent could be quite a shock.<br><br>", "<b>Username: whidbeyite2002</b><br><br>COL will differ quite a bit. That said, Columbia is pretty generous with financial aid, and the university guarantees housing all 4 years.<br><br>", "<b>Username: SlowPop</b><br><br>You really answered your own question. 1) You don’t look forward to the Core Curriculum. 2) You “despise” learning stuff you won’t use 3) You are “pretty disappointed” that you won’t be in Palo Alto. That is a pretty clear rejection of Columbia College’s entire undergraduate educational philosophy and it’s biggest asset, NYC.<br><br>", "<b>Username: CardinalBobcat</b><br><br>@SlowPop I would have said the same, but her feelings have evolved quite a bit since that first post. Seems she’s in a different place now.<br><br>", "<b>Username: kaukauna</b><br><br>OP - the people at Columbia who said they had no trouble getting interviews but then failed the interviews are on to something.  If you are truly interested in CS, then CMU is the school for you.  CMU has a great Fine Arts school with lots of opportunities for playing and the study of music, so I believe you can develop in that area as well. And you won’t have to worry about failing the CS interview at all or at least as much if you went to CMU.<br>If you are not that committed to CS, and you could see yourself doing something else (academia in a non-related field, professional school), or if you are truly interested in an excellent and broad education than maybe Columbia is for you.<br>Getting admitted to the CMU CS school is quite an achievement.  At CMU you would be at the forefront of the technology which is leading some of the most exciting and widely applied discoveries in science, engineering and commerce in the world right now.<br>Best of luck to you whatever you decide.<br><br>", "<b>Username: kaukauna</b><br><br>OP - I wouldn’t weight location that heavily.  You’ll have many decades to travel the world.  CMU or Columbia will get you started on your lifetime adventures.  The question is which one will help you most.<br><br>", "<b>Username: kaukauna</b><br><br>Another comment OP, I don’t think the humanities at CMU are nearly as competitive as Columbia.  This is not to denigrate CMU, it is a compliment to Columbia.<br><br>", "<b>Username: psycholing</b><br><br>CMU is very pointy, even in the humanities and social sciences.  There are departments that are stronger than Columbia’s, and departments that are weaker.<br><br>", "<b>Username: privatebanker</b><br><br>OP is on another thread she started dealing with an issue. Probably won’t be back for a few days.<br><br>", "<b>Username: anon145</b><br><br>@deadgirl  visited CMU for different major w kid.  Have lived in great US cities - that part of Pittsburgh is way underappreciated as a place  to live.  All the things about Columbia and NYC that are plusses for most people are negatives for you.  CMU’s LAC Dietrich college is underappreciated to for its arts programs.   Columbia WILL give you more financial aid or should, but will likely not be a difference maker from CMU.<br>Far better for someone who doesn’t like taking outside interest area classes to go where they aren’t sure if they are required to take enough classes for a double major, than the other way around.  Your own thoughts suggest CMU; also if you do well in CS at CMU pretty sure you can do grad school at stanford or work in silicon valley.<br><br>", "<b>Username: parentologist</b><br><br>First of all, congratulations on getting into Columbia!  Be happy!  The most difficult choices are often between two excellent options.<br>There are a TON of cheap places to go out in NYC.  Sure, you can spend lots of money if you have it, but you can also have a great time very, very cheaply in NYC.  There will be lots of other people NOT spending a fortune going out clubbing, too.  If you are interested in music, especially jazz, you have far, far more going on in NY than in Pittsburgh.  Jazz at Lincoln Center has made NYC a major center for jazz music.<br>You just turned down a free ride at a great state flagship.  You say that your parents have put away plenty for college, so much that they’re telling you not to worry about the price.  And yet you’re worrying about what is essentially pizza money?  (BTW, pizza is really good, and cheap, in NYC).  You forget how incredibly LAZY college students are, and that everyone has been living their lives on social media for years now.  Most of college life is going to take place on campus anyways, whether it’s in NYC or Pittsburgh.<br>As for the core curriculum, it’s about getting a real education, as opposed to training in a particular area.  If you were ONLY interested in computer science, and had no other love in life, and severe trouble learning anything else (you know, like that guy from high school whose only interest was computer science and who probably was probably way over to one side of  the autistic spectrum), then sure, you would not be able to succeed at a school which required you to get a broad education.  But it doesn’t sound as if you are that person.<br>It’s exam week right now at Columbia.  If you could hop on a plane/bus/train today, and go take a look, you should.  But maybe you’ve already visited there, and certainly you liked it well enough to have applied.  Another positive thing about going to school in NYC is that you will develop tremendous confidence, living in NYC for four years, so much so that no city in the world will intimidate you.  Of course, I’m prejudiced.  I’m a native New Yorker!  I’d choose Columbia!<br><br>", "<b>Username: cptofthehouse</b><br><br>If you are truly dedicated to the CS field, then there is no question that CMU is the place.  It is the best. It will be a huge commitment and you may not have time to do music there, let alone double major.  The performing arts are conservatory level at CMU with acceptance rates close to the CS school’s. Top of the top in both schools so double majoring not permitted. Too many not making it in the one discipline. It’s for your protection that CMU does not permit this combo. There are plenty of PA opportunities at CMU outside of the School of Arts however that are world class. Scotch’n Soda is a club there that has been the birthplace of a number of musical and drama giants.  Anyone can join   They have a non major orchestra and many other venues for music. All high quality.<br>Columbia is an Ivy and in NYC. The program you are looking at there is more general. But it’s a great overall school.<br>It comes down to personal choice. If not that dedicated and if that worried about going to the best of the best in CS where, yes, it’s going to be very tough, then Columbia is the way to go. It’ll be easier than CMU CS.<br><br>", "<b>Username: deadgirl</b><br><br>Wait, is double majoring or double degreeing between CFA and SCS really not allowed at CMU? I thought it was with summer classes or taking 5 years? @cptofthehouse<br><br>", "<b>Username: anon145</b><br><br>@deadgirl you are driving yourself crazy; Columbia will give you more FA than CMU I would think, but NYC is very expensive.  You seem like you will really resent having to take classes outside of your area; that plus there are twice as many kids at Columbia as CMU that come from households making &gt;$630,000 a year.  Can you really handle roommates and friends spending lots of money having fun in NYC if you can’t?  There are no wrong choices really, and something about your situation seems weird, since most families with income of 115,000$ would immediately take the full ride to UMD, which is more than fine for CS, and not look back.<br><br>", "<b>Username: cptofthehouse</b><br><br>Back when my son was there, being in both programs did not happen. You could do it with Tepper and PA,  but not CS and PA.<br>With your doubts about CS, and you are right to have them, it would absolutely not be recommended. Both schools have people in the top single digit of qualification in that specialty. To do both?  Not likely.  But CMU has excellent opportunities for both outside of the Schools themselves.<br>The way Im reading this is that if you aren’t of the mindset and readiness to jump at the chance of going to the best CS program in the country, then you shouldn’t. Those who go there are mostly clear in their direction. You clearly are not. It’s not that you are not good enough, but that you don’t want it enough which is what your classmates do. I know kids who turned down HPY for CS at MIT or CMU.  One of our old timers here has a son who did.  Wavering as much as you are pretty much tells me that a more general slate of studies at Columbia is where you’d do better.<br><br>", "<b>Username: vpa2019</b><br><br>Also given your prior posts concerning FA I would definitely consider which school will provide a better package for you.<br><br>", "<b>Username: CountingDown</b><br><br>When is your deadline for making a decision? Can’t imagine you’d have more than a week to let Columbia know.<br><br>", "<b>Username: deadgirl</b><br><br>Tomorrow. I can’t decide at all… I don’t know what I’m going to do.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> deadgirl:<br>\"\"<br>Tomorrow. I can’t decide at all… I don’t know what I’m going to do.<br>\"\"<br><br>Did you get the financial aid offer from Columbia?  If so, how does its net price compare with that of CMU?<br><br>", "<b>Username: deadgirl</b><br><br>I’m going to be getting it (hopefully) tomorrow morning is what they said over phone.<br><br>", "<b>Username: vpa2019</b><br><br>You are receiving your FA package the same day you have to decide? Seems suspect…what is taking so long?<br><br>", "<b>Username: MYOS1634</b><br><br>Ask Columbia for 3 days to talk it over with your parents from the day you get your FA package.<br><br>", "<b>Username: deadgirl</b><br><br>Ok!<br><br>", "<b>Username: deadgirl</b><br><br><br><br><br><br>", "<b>Username: CardinalBobcat</b><br><br>I’m sure this decision wasn’t easy! Fortunately, these are wonderful options. Which did you choose?<br><br>", "<b>Username: deadgirl</b><br><br>My time has been extended since my financial aid package is still being decided!<br><br>", "<b>Username: MYOS1634</b><br><br>Good news.<br><br>", "<b>Username: deadgirl</b><br><br>Someone from Columbia sent me this article:<br>https://www.theatlantic.com/business/archive/2014/03/which-college-and-which-major-will-make-you-richest/359628/<br>How is Columbia’s CS #2 and CMU #10 for the second bar graph? I’m so confused.<br><br>", "<b>Username: privatebanker</b><br><br>It’s just another set of assumptions.<br>It just demonstrates that we are talking about two fine schools and programs.<br>The student herself determines success ultimately at this level of excellence.<br>Don’t get too caught up in the rankings rat race.<br>Price. Passion. Place.<br>Net costs are affordable and wise<br>It will bring out the best in you.<br>The location, facilities, culture and activities suit you well.<br>Rank each category 1 to 5. Add them up and see what it says to you.<br><br>", "<b>Username: bouders</b><br><br>Columbia grads are probably more likely to live in a high cost of living area (eg NYC) than CMU grads. Higher pay does not necessarily translate into a better lifestyle. The cost of living in NYC is 2.2X that of Pittsburgh.<br><br>", "<b>Username: mdphd92</b><br><br>The numbers in the PayScale study seem to be too low.  The highest values for a 20-year return are reported at about $1.5 million, which translates to $75,000 per year.  However, the average mid-career salary for all workers in computer science is above $100,000.  Also, CMU reports statistics on their own graduates here<br>https://www.cmu.edu/career/about-us/salaries_and_destinations/2018.html<br>and the average starting salary for a B.S. graduate of SCS in 2018 was $113,630.<br>So I would have some doubts about the validity of the PayScale study.<br><br>", "<b>Username: vpa2019</b><br><br>First it’s a self serving article that is 5 years old. Second, the methodology described seems a bit loose, especially as the income levels are self reported and we don’t know where the reporters are living/working so COL isn’t accounted for. Third, the difference in return on investment  between Columbia (little under $1.6million)and CMU (little under $1.2 million) over 20 years is around $400,000. The author of article doesn’t really explain what that means specifically but assuming he’s referring to income that equates to an $20,000 extra per year in salary over the 20 years. A difference for sure but not a meaningful one IMO.<br>Still comes down to where you feel you’ll fit best given the various factors…I.e. Pitt vs NYC, curriculum requirements, other opportunities if you decide you don’t like CS or want to double major, or minor or double minor, student body vibe etc…<br><br>", "<b>Username: deadgirl</b><br><br>They cost literally the same ): I have NO idea what to do.<br><br>", "<b>Username: CardinalBobcat</b><br><br>@deadgirl, although it might have been easier if the dollars ended up dictating your decision, the good news is  that you get to decide with your own mind and heart! The especially good news is that you simply can’t make a wrong choice here.<br>One of the things I think people forget to think about in this sort of situation is that you will be in one or the other of these two excellent programs for a handful of years, and you will be an alumna of the institution forever. Have you had a chance to look into opportunities provided for alums? These vary significantly at colleges and universities around the country, and many people never realize this because their choice is more clear and they do not need to consider it as a factor. Also, if you ended up making a deep connection with the institution, and ultimately either staying additional years for graduate work or being hired on as an employee, which location is preferable to you?   Are there particular clubs or intramural sports or annual social events on campus that excite you when you read about them? Lastly, do you have friends and/or family in the areas adjacent to either university?<br>Again, these are questions the students don’t necessarily need to consider if their choice is clear. But you have, in my opinion, two equally fantastic opportunities. Each has separate reasons why it might be the better choice, but you have considered these and have come away from the thought process seeing them as equally excellent. So, you have the luxury of considering other things, such as what I’ve offered above.<br>And you have the supreme luxury of knowing that, as long as you 100% set your mind to the choice you ultimately make and firmly decide to thrive there, you cannot go wrong.<br>Congratulations on your wonderful options. I look forward to hearing your decision.<br><br>", "<b>Username: privatebanker</b><br><br>My guess is that you want to attend Columbia and the cs prowess of cmu is giving you pause.<br>The ivy brand and nyc can be hypnotic to many at your age.<br>It really shouldn’t be that hard of a choice. In less the objective best choice is not the the subjective romantic choice.  Imho.<br><br>", "<b>Username: vpa2019</b><br><br>Are you certain you want CS?  How do you feel about living in NYC? Do you like the core?  For my D the core was a huge turn off even though she loved other things about the school.  Do you look better in light blue or red? Do you prefer lions or cute Scottish terriers ( just a little light humor there ?). I’m excited to hear your decision…either way it’s going to be a fantastic 4 years!<br><br>", "<b>Username: deadgirl</b><br><br>At Columbia, I’d most likely be doing the 3-2 double degree program between CC and SEAS so I would be able to do music and computer science and that would mean I would not only have to fulfill one core, but two cores for both CC and SEAS in addition to classes required for my major. Maybe summer classes would help me do it in a shorter amount of time? At the same time, I feel as though taking such a wide breadth of classes is good especially if I want to go to graduate studies (I don’t want to do them right now, but I might later?? :/).<br>At CMU, I’d be doing only CS and music and a few core classes. But I likely wouldn’t be able to double degree. But does a degree in music even matter? I looked up some Columbia music alumni and an alarming majority of them were now in finance and one was even a Starbucks barista. I feel a bit disillusioned. ):<br>Location wise, I love NYC! But I feel reluctant: Will I get bored of it after being there so long? Are most Columbians just stuck in their bubble? Is there a sense of “unity” or “community” on campus?<br>To be honest, I’m truly indifferent to the choice of which college to go to. I wanted to go to Columbia for literally my entire life because I visited NYC a lot and thought it was so cool. But is location a trivial reason to like a school?<br>I’m not sure which one is worth the money. I feel sort of bad having my parents pay for me to study stuff not related to my major.<br><br>", "<b>Username: bouders</b><br><br>Location is not a trial reason to like a school. You will be living there.<br>Finance is big business in NYC. It makes a lot of sense that Columbia’s grads are working in finance.<br>Both schools are worth the money. Which one do you want to go to? It sounds like Columbia to me.<br><br>", "<b>Username: NJWrestlingmom</b><br><br>You poor thing.  You are tormenting yourself over this!  You can’t lose - both are excellent schools.  Sounds like Columbia, but go with your gut!<br><br>", "<b>Username: CardinalBobcat</b><br><br>Another important note: even these wonderful programs/institutions have drawbacks and flaws. Literally everything does, and if you are looking for perfection, you will not find it. Your final decision may need to be a leap of faith based on your own gut instinct. After that, it will be entirely up to YOU to make the most of whichever place you select. Make a choice and don’t look back. Get off CC and move forward happily and gratefully into your college adventure! And consider yourself warned: if you choose to do so, you can ruin everything once you’re there by wondering what might have been elsewhere and/or noticing and bemoaning the negatives of wherever you ended up. I guarantee there will be plenty. It’s a deliberate decision to focus on the good things; your life will be the better for it. This is an exciting moment for you. There are two amazing options in front of you, and there is no wrong choice.<br><br>", "<b>Username: cptofthehouse</b><br><br>Go to  Columbia.  Less likely to get bored in NYC than Pittsburgh. You can enjoy your music at Columbia without going for a degree in it abc the CS program there will not be as strung out as at CMU but it’ll get you an excellent job, I’m sure. You’ll have more flexibility at Columbia.<br><br>", "<b>Username: vpa2019</b><br><br>@deadgirl I agree with the other posters…you sound like Columbia is your preference and why not?! It’s an amazing school in an unmatched city.  One quick response to your comment about taking summer courses: those course do cost extra and I don’t know if they would be covered by your FA package…my guess is they are not.<br>Location isn’t a trivial reason…you will be living there for a a period of time, but that argument goes both ways… You can live any where for 4 years (and actually its more like 2 1/2 yrs unless you stay at the school year round).  Also if you find yourself “bored” at either school there’s always study abroad :).<br>As far as community and school spirit goes at Columbia and CMU, I’m not either school is a first rate example. However, I do think the kids that attend are extremely proud of their schools, it more that the type of student that chooses to attend doesn’t rank those qualities as highly desirable as perhaps kids that attend UVA, Duke or UMichigan.<br>I think your parents are funding a college education, not just your major.  Many kids change their majors, at least once, if not more.  Often subjects that seemed interesting in HS don’t maintain their appeal, or as my nephew who switched from CS to econ stated “CS got really tough after the first 2  years”, or you might change your  mind as to career you want to pursue. Columbia will provide you with a wider breadth of subjects to choose from and you might appreciate that flexibility as you journey through your 4 years.<br>Lastly, one other exercise that might help, if you haven’t done it already, is to map out potential classes for your 4 years at both schools and see if the courses offered and/or available might give you additional info to break the tie.  Additionally, although many classes at Columbia are taught by TAs, you can also take classes at Barnard which is more like an LAC with smaller classes and more direct contact with professors.<br><br>", "<b>Username: MYOS1634</b><br><br>You could minor in music, or just take the classes you want after you’ve completed th pre-requisites (in addition to the CS major). This way you could get your degree in 4 years.<br><br>", "<b>Username: Rivet2000</b><br><br>After reading all your posts I’d recommend Columbia for you. CMU is definitely not for everyone.<br><br>", "<b>Username: deadgirl</b><br><br>@Rivet2000 Really? How come?<br><br>", "<b>Username: theloniusmonk</b><br><br>It’s possible in the Engr and CS schools at CMU, that you pretty much have to be a STEM major.  If you decided not to stay in CS, and you wanted to major in something like econ or poly sci or international relations, you’re better off at Columbia.  If you know that CS is what you want to do, then it’s really hard to top CMU, wrt cutting edge research, faculty, placement in high tech.  There is an opportunity, imo, and I mentioned this in the CMU vs UMD thread to make an impact above your job, as a woman CS grad from CMU.  Columbia may be more intense than CMU as well and is less of a cohesive campus.<br><br>", "<b>Username: MWolf</b><br><br>Although I think that @privatebanker is correct, and that you are letting the romantic notions of city and college name determine your choice, I think that Columbia’s excellent CS program, while not as good as CMU’s (because no  CS program is as good as CMU’s), will still provide almost all the opportunities that CMU’s will.<br>So, if you choose CMU, and have regrets about not being in NY, it will stay on your mind. If you attend Columbia and regret not going to CMU, you can always tell yourself, “well, the CS program is still amazing”.<br>Basically, no matter what you choose, you will have buyer’s remorse and second guess yourself. That is simply who you are. I think that the regrets you will have from not attending CMU will be easier for you to silence that those from not attending Columbia.<br><br>", "<b>Username: Rivet2000</b><br><br>@deadgirl After reading through several of your posts, the following things jumped out to me. It does not seem like you are singularly driven by desire to deep dive into CS. Music and social considerations appear to weigh heavy on your decision making process. You have many posts talking about music, composing etc but few, if any, that detail your focus on CS. Competing and sometimes conflicting wants appear to make your decision making very complex. Because of this, it seems that at Columbia it would be easier for you all-around. If it was only about CS my recommendation would be CMU as it is, IMO, far superior for CS.<br>Here’s a CS kind of thing to do. Copy and paste all of your CC posts into a doc and apply that text to a word cloud generator. Analyze what your words and phrases focus on. This may give you some insight.<br><br>", "<b>Username: CardinalBobcat</b><br><br>@Rivet2000 I love that idea! I hope the OP considers it.<br><br>", "<b>Username: privatebanker</b><br><br>@mwolf is 100 percent correct. I suggest Columbia for all the reasons mentioned. Regret of a road not taken is a powerful thing.  No need to feel that way.<br><br>", "<b>Username: vpa2019</b><br><br>@deadgirl any decision yet ??<br><br>", "<b>Username: deadgirl</b><br><br>No, I have until tonight. I’m just scared that if I go to Columbia, I’ll have a subpar education in CS and not be able to travel for a job and not be able to pass my interviews or work with companies like Google or find people to make start-ups with. Also, the core is quite daunting.<br><br>", "<b>Username: 1NJParent</b><br><br>@deadgirl You aren’t going to have a subpar CS education at Columbia. Yes, a CS education at CMU is better and offers more options. But that’s only true if you can take advantage of it. You won’t be able to take advantage of it if you aren’t passionate about it and dedicated to it. Are you?<br><br>", "<b>Username: bouders</b><br><br>One thing I like about Columbia’s core for a STEM student is that it forces you to take courses in the humanities. The ability to communicate well is far more important to passing interviews and getting that job at Google etc than taking the highest level CS course at the highest ranked CS program.<br>Columbia’s CS program is not subpar. It’s ranked 18th in the world.<br><br>", "<b>Username: CardinalBobcat</b><br><br>If we were speaking in real life, I would tell you that words matter, and that you, in particular, would be very well served during this decision process (and throughout your life) to change words like “scared” and “worried” and “terrified,” all of which I’ve seen you using with great frequency here, into “concerned.” I mean it. It may not seem like such a small linguistic change could make a big difference, but it can and does.<br>Concern is intellectually constructive. Having concern is the impetus for finding a solution and acting on it. Fear is emotion-based and is the precursor to seeking help. You want to be in a position of strength, and focusing on your fears undermines this. There is nothing scary or terrifying about making a choice between two fabulous options.<br>Either of these two fine institutions will provide you with an excellent education and a promising future, unless you make it turn out otherwise. The burden of your own success at either place will fall entirely on your shoulders. Of course you will not get a “substandard” education in either of these fine programs at world-class universities. As I wrote in an earlier post, however, both are imperfect — as is everything in life — and it will be your job to focus on all the positive aspects once you’re there, or you will ruin it all for yourself.<br>Also, be aware of the possibility that you may have become addicted to the “rush” that can accompany indecision, and know that that once you make a choice, all of the drama and suspense will be gone. You will simply move forward like all the other hundreds of thousands of students looking forward to starting undergraduate work in the fall. This may be contributing to why you are having trouble making a final choice. But you do need to make one, and the time is now.  It is actually good and healthy to be out of the state of indecision, even though it will take some getting used to.<br>Whichever program you pick will give you unique benefits and will have drawbacks, some of which you know about now and some of which will be a surprise to you. But that’s just life and, again, your job is to forget about your other options once you have chosen your path, and to move forward with confidence and positivity.  Thousands of students would be envious of your choice. Good luck with your decision. Whichever way you go, don’t look back.<br><br>", "<b>Username: rjkofnovi</b><br><br>Go to CMU for CS.<br><br>", "<b>Username: Coloradomama</b><br><br>I have a strong sense that you will get additional education as well, in music, CS or another subject, so don’t worry so much about your undergraduate education.  Compare CS class by class at Columbia, and CMU. Its really not that different.  CMU also requires humanities and social sciences.  You are not doing a PhD in CS, yet.  If you were,<br>still Columbia is on the map for CS, and for certain Google hires Columbia Grads!  I just heard<br>a Colorado State grad got a starting offer of $120K at Google, so its not that hard to get a job at Google,<br>but that grad had a triple major in math, CS and physics,  all bachelors degrees. Google likes physics students !<br>Take it step by step.<br>Buy Bling on line, T shirts, hats, coasters, and celebrate your chosen university !  Good luck.<br><br>", "<b>Username: deadgirl</b><br><br>Coloradomama, you are great! Thanks for all the PMs. @Coloradomama And same for all the other dedicated parents on this forum!!<br><br>", "<b>Username: ewho</b><br><br><br>\"\"<br>I just heard<br>a Colorado State grad got a starting offer of $120K at Google, so its not that hard to get a job at Google,<br>but that grad had a triple major in math, CS and physics, all bachelors degrees. Google likes physics students !<br>\"\"<br><br>Interesting. I remember Google said something like they would hire the valedictorian of some unknown school or top 50 graduates of MIT. In general, they may have a list of schools they want to hire their graduates, and CMU should be on the list.<br>Columbia may be the choice here, but not for CS.<br><br>", "<b>Username: theloniusmonk</b><br><br>“The ability to communicate well is far more important to passing interviews and getting that job at Google etc than taking the highest level CS course at the highest ranked CS program.”<br>That is generally not true, and I’d be wary of giving that kind of advice for an entry level job.  You have to absolutely know your CS in and out for Google, and it doesn’t have to be from the highest ranked CS program.  If your goal is Google, CMU is the clear choice, trust me on this, you just need a 3.0 from a place like CMU to get an internship interview. That’s how well regarded that program is out here. But if you’re not sure of CS or STEM in general, Columbia would be my recommendation.<br>As someone said on another thread bout CMU vs UMD, what if it was MIT vs Columbia, would people really be saying go to Columbia like they are now.  Probably not, and for CS, MIT and CMU are the same wrt prestige and opportunities.<br><br>", "<b>Username: deadgirl</b><br><br>@theloniusmonk Is a CMU degree as versatile as a Columbia degree if I want to do stuff with journalism, foreign service or go to grad etc?<br><br>", "<b>Username: anon145</b><br><br>hey @deadgirl  I think everyone is basically giving you the same advice 1) both great choices 2) if you know you really want to do some amount of CS and a bit of stress go to CMU 2) if you are unsure of what you want to do columbia.   They both have lots of great other programs,  e.g. Carnegie Mellon is also one of the worlds top acting undergrad schools too… how many people know that…  they both can prepare one adequately for anything to follow<br><br>", "<b>Username: 1NJParent</b><br><br>Practically all CMU SCS graduates went into software engineering (which obviously covers a broad spectrum of jobs in tech firms):<br>https://www.cmu.edu/career/documents/2017_one_pagers/scs/BS_SCS_One_Pager_2017_%20rev.1.18.pdf<br>https://www.cmu.edu/career/documents/2018_one_pagers/scs/1-Pager_SCS%20BS%202018%20rev%202.1.19.kc.pdf<br>Columbia, on the other hand, sent many of their graduates to financial and consulting services, but relatively few to tech firms:<br>https://www.careereducation.columbia.edu/sites/default/files/2017%20GSS–CC%20%26%20SEAS-UG.pdf<br><br>", "<b>Username: theloniusmonk</b><br><br>“Is a CMU degree as versatile as a Columbia degree if I want to do stuff with journalism, foreign service or go to grad etc?”<br>No it’s not as versatile as you put it, if you’re thinking journalism, foreign service, Columbia is the choice, imo.<br><br>", "<b>Username: Rivet2000</b><br><br>As OP posts grow there is more and more about music and now journalism and foreign service. No mention about goals and objectives for CS. Points to Columbia.<br><br>", "<b>Username: deadgirl</b><br><br>Sorry, I should have been more clear so it didn’t sound so random. I was thinking foreign service as in Developers/Engineers w/out Borders.<br><br>", "<b>Username: CardinalBobcat</b><br><br>What did you decide? Wasn’t your deadline last night? I’m excited for your future!<br><br>", "<b>Username: vpa2019</b><br><br>Yes! Did you decide? ?<br><br>", "<b>Username: privatebanker</b><br><br>@deadgirl    Was this for real?<br>Please let us know what you ultimately decided. We all are rooting for you.<br><br>", "<b>Username: deadgirl</b><br><br>: ( So far, I haven’t committed to Columbia, so I guess I’m CMU right now… The option still remains open on my portal, and I was going to tonight but I don’t know… People from Columbia keep reaching out… A part of me wants to, but tbh, I don’t know. I’m sooo, sooo stressed. I’m really worried about wasting $ so I’ve been researching both schools non-stop… like literally all day this past week. I’ve received soooo much conflicting information and people keep pulling me in different directions… The 3-2/4-1 CC BA/SEAS BS programs are daunting and I’m scared I won’t get in.<br><br>", "<b>Username: MYOS1634</b><br><br><br>if you go to Columbia, major in CS. Music should be a minor, just take whatever classes you have the pre-reqs for. No need to double degree.<br>there’s no wrong choice. Really.<br><br><br>", "<b>Username: 1NJParent</b><br><br>It’s a tough choice, but life is about making tough choices. You need to be decisive. Indecision won’t serve you well. You have two good choices. Why stress yourself out over these good choices? You’ve done enough of your own research and got plenty of good advices. Make your decision and move on. Enjoy your next four (or five) years in college and never look back.<br><br>", "<b>Username: Coloradomama</b><br><br>Think more about music and what you want to do with that.  .   You may get more clear which school is better for you if you get more clear what your music goals are right now. Do you want private lessons, and is there any chance you will go the performance route?   Did you find a private teacher in both cities already?   Which is your favorite private music teacher?    Or is music more of a hobby and you will go into a high tech career? What do your parents do and love, you may be similar to them, as an example. Do you know any professional musicians and have you talked to them about that path?   Do you want a PhD in music and to become a professor and a performer, with a private studio?   Do you want to teach music?  Even Hillary Hahn teaches now, as I understand it, so if you are to become a professional classical musician or jazz musician, teaching will be in your future.  Music involves hours and hours of practice time daily, time you spend alone with your instrument, or practicing voice.<br>If you major in CS, there is a wider range of careers.  You can go into patent law, engineering, teaching, big data analysis, business, or medicine.   CS can prepare you for a wider range of careers these days.  That does NOT make it better than music, but just think about what you like to do.<br>College is a time to explore majors too, so you really have time to figure this out.  I think music in NYC or CMU<br>are both excellent.  There are fantastic music teachers in both cities, so you cannot go wrong.<br>You seem to be indicating that you did not audition at CMU so you are worried about that.  Take that out of the equation, you cannot change your status, if you are meant to be a professional musician, it will become obvious once you audition.  Don’t worry about that piece, more about which city is better for you and which school is more appealing.    The more techy school, CMU or the more well rounded school, Columbia, in a bigger world class city.  (my bias coming out, I like NYC a bit better)<br><br>", "<b>Username: Coloradomama</b><br><br>Also see well known CS researcher Jonathan Katz got his Phd in CS at Columbia. He is pretty darn famous in cryptography.  See Moti Yung at Columbia , very well known in cryptography/CS.   Columbia’s program for undergrad is just as strong as CMU’s for classwork.  The only advantage CMU has is IF you want on campus robotics research, but you seem more interested in summer work in California, so that will boil down to your coding skills, at either school.<br>Undergrad CS is very very similar at both schools. The ranks are about graduate school and breadth in fields like combinatorics, and other subfields were CMU shines brightly.  CMU has a BREADTH similar to GaTech for research work and the very top research scientists. That does NOT make them better teachers.<br>The student body at Columbia and CMU is similar, but Columbia students may be a bit higher scoring and more diversity there too. Columbia is the more well rounded school, probably, although CMU is strong in business, and musical theatre too.  Engineering, probably about the same, actually, I don’t care for CMU engineering as much as most people, EE is sort of strange there, and materials science is about the same at both schools.<br>For sciences, maybe Columbia is stronger actually than CMU, for physics say.  But they are roughly comparable for most undergraduate fields, with somewhat more strong techy students gravitating towards CMU.<br>The students are more well rounded and diverse at Columbia, with top English, philosophy and history  majors choosing Columbia.   So the subject interest diversity is larger at Columbia.<br><br>", "<b>Username: Coloradomama</b><br><br>Here is another way to view Columbia and CMU.<br>Look at their ranks in subfields of math and CS. You will see that Columbia is PHENOMENAL in mathematics<br>and CS.  Top ranks in artificial intelligence and theory at Columbia  and ranked in many other subfields in CS.<br>https://www.usnews.com/best-graduate-schools/top-science-schools/columbia-university-190150<br>Most fields of mathematics are ranked LOWER at CMU, except for discrete math–<br>https://www.usnews.com/best-graduate-schools/top-science-schools/carnegie-mellon-university-211440<br>As is well known, CMU is at the very top rank for most but not all subfields of computer science. (MIT is<br>higher for a few, GaTech higher for combinatics, UC San Diego is ranked HIGHER THAN CMU for combinatorics<br>as well.   So don’t believe the people that say CMU is better across the board, it depends on the subfield.<br>I think the averaged rank for computer science is totally meaningless for undergrads, and also really for grad students, it all depends on exactly what you want to do inside of CS and since you don’t know, a dart will suffice for choosing between these two, or other criteria like, your  favorite city.<br>Believe in yourself and choose the city you like.<br><br>", "<b>Username: Lindagaf</b><br><br>Hasn’t the fact that OP still hasn’t committed to Columbia an indicator of reluctance to do so? Stick with the place that offers the best program for you.<br>People can study anything they like at CMU. It’s also well-rounded. Pittsburgh is more affordable than NYC. When you move off campus, that will be easier to manage financially.<br><br>", "<b>Username: suzyQ7</b><br><br>^ It’s more of an indication of extreme indecisiveness. The OP really needs to work on that. A simple, detailed, pros/cons list for each plus DEEP analysis of course schedule at each school should have make the choice clear.<br><br>", "<b>Username: SkepticalOfMost</b><br><br>@suzyQ7 – totally agree re the prevarication. Or are we being taken for a ride in a creative writing exercise? My spidey-sense says this drama has gone on for way too long. Unfortunately if it’s not an act the indecision doesn’t bode well no matter what school is selected. Apologies for being blunt if it offends but sometimes cold water in the face helps one wake up.<br><br>", "<b>Username: ewho</b><br><br>If I understand correctly the OP chose CMU . For $80,000 a year, I would seriously consider what to study rather than which school to attend. If you have taken AP Stats, you should know using outliers to make general believing is how people abuse statistics. Which one is better? – the best one should be the one that you stop saying it but start believing it.<br>For a freshman at any school, the best or the wannabe will start CS as the 1st attempt major, no exceptions at CMU or Columbia.<br>CMU has many entry level weedout classes for CS, make you are aware of that.<br><br>", "<b>Username: Lindagaf</b><br><br>Columbia surely has weed-out classes too?<br><br>", "<b>Username: privatebanker</b><br><br>Don’t over stress about this.  Go to the professor pages on CMU and Columbia.<br>First observation is how bad most webpages are for CS experts. Lol. Bad.<br>But if you dig into CVs you will realize the people who are the ones leading your education and are the best in the world -it’s comforting to see how few started out getting a BS from that school. It’s such a wide range and goes to my ongoing point about outcomes driven by people not schools.<br>Please Go where you will be happiest and don’t be shopping for predetermined and unknowable outcomes or physic income (prestige).<br>A quick summary off the top of my head from over 30 at Columbia I reviewed.<br>Majority from overseas.  2 from China Italy Israel and Australia. 1 from several others.<br>3 Brown and Columbia.  One from brown was a literature major of all things. The other two appeared to be later in their careers.<br>2 from UCLA MIT CAL<br>1 CMU Harvard then CMU. UW Penn Magill Yale (music major) and several others.<br><br>", "<b>Username: theloniusmonk</b><br><br>lol, you could consider your entire four years at Columbia as weed-out, it’s pretty intense there.<br>“I think the averaged rank for computer science is totally meaningless for undergrads,”<br>as with any rankings they should not be taken too literally (#1 is definitely better than #2), maybe as a starting point to get a general idea, but not sure they’re meaningless.<br><br>", "<b>Username: whidbeyite2002</b><br><br>@deadgirl, I think @privatebanker gave you good advice. My daughter carried out a similar process (without our input) for all the schools she had considered. It really helped her narrow her choices. Good luck!<br>PS I know it’s best to pick right the first time, but we told our daughter that if she finds she made a mistake, she can always transfer. She’ll be at Columbia in the fall.<br><br>", "<b>Username: Rivet2000</b><br><br>I would be remiss if I did not provide a link to CMU’s directory for SCS.  Their faculty is truly impressive in background, accomplishments, publications, and diversity. One reason, among many, why CMU is widely considered as one of the best CS schools in the world.<br>https://www.cs.cmu.edu/directory/mld<br>That said, I still recommend Columbia for the OP as more aligned to her various interests.  <br><br>", "<b>Username: merc81</b><br><br>It should be stated that U.S. News, at least, does not rank undergraduate computer science departments. Nor does it even hint that its graduate department rankings should be used as a tool for selecting an undergraduate college. If the OP believes that CMU is “#1” for undergraduate computer science, then this must be based on a source other than USN.<br><br>", "<b>Username: CardinalBobcat</b><br><br>Rooting for you @deadgirl.<br>As William James wrote, “When you have to make a choice and don’t make it, that is in itself a choice.”<br>I hope you’ll be able to feel that you OWN this important decision, because you WILL own it, even if you just passively let time run out.<br>Accept that either program/institution will be imperfect and that your experience at either university will inevitably be filled with joys and challenges and frustrations big and small – and that’s okay – and then move optimistically toward your future and don’t look back.<br><br>", "<b>Username: happy1</b><br><br>@deadgirl Final decision?<br><br>", "<b>Username: Ste11arstar</b><br><br>Didn’t read the entire thread, but to add onto CMU–there actually is a double major, dual degree, and BXA Intercollegiate program. If you audition you could get into these programs. I’ve never heard of Columbia College as a music school, so that’s also something to consider. CMU’s music school is very small and everyone there is a pretty good musician to an extent.<br><br>", "<b>Username: Coloradomama</b><br><br>OP was worried about auditioning at CMU, did not think she would make it into the music program in some of her posts.   But she also talked about taking 5 years to double major in music and CS.<br>Columbia offers Columbia Julliard<br>https://undergrad.admissions.columbia.edu/apply/first-year/juilliard-program<br><br>", "<b>Username: CardinalBobcat</b><br><br>@deadgirl, you’ve written sixteen original threads asking for help and advice, sometimes desperately, and received over 500 thoughtful, well-considered replies. Many of us here on CC came to care about you and are very interested to know how your story turned out. The last we knew, there were only a few hours until the deadline, and you were still unsure and had even started to question whether to get a degree at all. You’re under no obligation to follow up, of course, but people have been asking politely asking for a while now, and you keep visiting CC without responding. If you’re willing to share, what final decision did you make?<br><br>", "<b>Username: privatebanker</b><br><br>Or was this just a strange CC version of being “Catfished”.  lol.<br>I hope not, but it doesn’t really matter because the wonderful advice posters shared will apply to others over time.<br>But I was really invested in things working out for the OP.<br><br>", "<b>Username: deadgirl</b><br><br>PM me to know where I committed. It’s not set in stone though. I’m taking a gap year and possibly reapplying and everything. I’ve applied for some jobs etc. A lot isn’t set in stone.<br><br>", "<b>Username: deadgirl</b><br><br>I don’t want my threads to have identifiable information and I feel as though saying my plans pretty much makes me even more identifiable.<br><br>", "<b>Username: happymomof1</b><br><br>Enjoy your gap year!  <br><br>", "<b>Username: suzyQ7</b><br><br>You don’t have to discuss your plans but it would be nice if you shared how it went from can’t decide between 2 schools to gap year and reapply.<br><br>", "<b>Username: aquapt</b><br><br>Gap year sounds like a great decision. There’s so much you can do to gain ground both in coding experience and as a musician, that need not have anything to do with earning college credit; and also just take the time to process and work through all of the emotions and issues that have come up through this process. My hope for you is that this will become a very positive, forward-looking experience, which is to say that it will NOT become fixated on a Stanford-or-bust oriented re-application process. (Hopefully the deferral agreement at the school you chose permits you to file the applications you do want to attempt… but if you really want to give The Tree one more Hail-Mary try, I’d urge you to at least apply REA and resolve to walk away and move on if it doesn’t happen in the early cycle.)  Congrats on getting through this challenging process with an ace-in-the-hole admission nailed down and time to step out of the rat-race and bring your own aspirations and passions into focus. Well done, and best of luck!<br><br>", "<b>Username: Coloradomama</b><br><br>I would disagree, math skills get slack on a gap year.   If you want to major in music, why not just get started with the fine faculty you have access to at CMU or Columbia?    It makes no sense to take a gap year, when you got into two top schools!  You may risk  that both Columbia and CMU reject you,on reapplication, after a gap year.  unless they approve your gap year.  If they approve it then OK, but still back to , your math will go stale, and you may be bored and lonely unless you go travel or go to a specific coding or music program, but you already have that at both CMU and Columbia, so its makes no sense to wander aimlessly for a year!    Gap years are for kids who really don’t have other options.   You have options. .<br>Its very unlikely you can get into Stanford after a gap year, so close that chapter.  A gap year makes you look stale and you actually get stale on math, unless you go ahead and take math classes, but why not just do that at CMU or Columbia?<br><br>", "<b>Username: MYOS1634</b><br><br>^Actually, gap years are tremendous growth experiences, which is why top universities recommend them (to the point Princeton actually funds one for its admitted students).<br>A gap year is not “wandering aimlessly” BTW but it needs to have structure, which a student as smart as OP can surely create.<br><br>", "<b>Username: happy1</b><br><br>A gap year that is planned out is perfectly fine.  However, I would caution the OP not to take a gap year if the sole purpose in her mind is to reapply to Stanford hoping to get a different outcome than she had this year.<br><br>", "<b>Username: CountingDown</b><br><br>Some colleges won’t permit a second application if the first round was a rejection. If OP wants to put Stanford in play again she should make sure they will accept a new application.<br><br>", "<b>Username: austinmshauri</b><br><br><br>\"\"<br>Gap years are for kids who really don’t have other options.<br>\"\"<br><br>I think you misunderstand the purpose of a gap year. They don’t make students look “stale.” People take them for all kinds of reasons and colleges encourage them.<br><br>", "<b>Username: Rivet2000</b><br><br>University of Chicago? University of Maryland? Columbia or CMU? Gap year or is it really worth it? I’m halfway convinced this thread has been a hoax.<br><br>", "<b>Username: vpa2019</b><br><br>@Rivet2000 she did make a decision if you see post #124.<br><br>", "<b>Username: Rivet2000</b><br><br><br>\"\"<br>It’s not set in stone though. I’m taking a gap year and possibly reapplying and everything. I’ve applied for some jobs etc. A lot isn’t set in stone.<br>\"\"<br><br>Not much of a decision.<br><br>", "<b>Username: deadgirl</b><br><br>My gap year will be spent doing academic work in the area of where my college that I chose is located. I won’t be applying to any schools. This thread is NOT a hoax. There’s not that many people in the world who have an undying love for music so much that they want to double major in it, have gotten a full ride at their state flagship, and are choosing between CMU and Columbia (which they got off the waitlist for). People from my high school have found these threads and have sent them around a bit and I’d honestly rather have them deleted and answer any concerns in my PMs because some of my past threads are simply embarrassing.<br><br>", "<b>Username: aquapt</b><br><br>I’m sorry that has happened, @deadgirl - it’s not an uncommon problem, and unfortunately CC isn’t accommodating, as a matter of policy, about deleting past content.  I hope the cc-related gossip blows over quickly.<br>As I understand it, it’s also a policy not to allow direct accusations that threads are hoaxes (hence the banning of the related word beginning with t) - I have seen members put in “time-out” for questioning another poster’s authenticity, but then again sometimes it is allowed to stand.<br>I’m sure you would have thought twice about some of your threads, if you had it to do over again; but then again you’ve been very gracious and thoughtful about accepting a range of feedback, some of which hasn’t been as kind as it could have been. That kind of resilience and willingness to learn even from criticism that may not be 100% fair will serve you well in your education and in life. Keep pushin’ forward!<br><br>", "<b>Username: deadgirl</b><br><br>Thank you aquapt and all those who helped me finally make this college decision and end this stressful process once and for all! I do agree that some of my posts were made quite impulsively, but the guidiance that I received through here (e.g. that anecdote about the person and the race) really helped me make my college decision and pushed me to question my aspirations!<br><br>", "<b>Username: privatebanker</b><br><br>Guess what. Schools over.<br>You’ve posted honestly and who really cares that some students have read your posts.<br>Nothing to be ashamed about as this is a big decision for you. And quite honestly most people are really focused on themselves.  You didn’t put anything out there that would remotely be worthy of concern. And no reason to crater to the juvenile mob at school. Literally who cares.<br>It’s water under the bridge. Two months from now they’ll be a distant memory. And when you come back for your 10th year reunion they’ll all be talking about how successful you’ve become and this process won’t even be a blip on the radar.<br><br>"]}