{"title": "hamilton vs bates vs oberlin vs bard franklin and marshal", "comments": ["<b>Username: HCatmom</b><br><br>Help! My DS is deciding between Bates and Hamilton, Oberlin and Bard. He also got into Franklin and Marshal. He loves theatre and is in the choir otherwise he has alot of interests which all these schools seem to fit into. He is a little worried that the Bates theatre program might not be strong enough although he is not majoring in theatre(probably) Thoughts?<br><br>", "<b>Username: privatebanker</b><br><br>Congrats to your family!<br>Oberlin and Bard - Awesome schools but they are clearly the most artistic and free spirited oriented type culture of the four.<br>Hamilton and Bates.  Awesome mix of the all types of students and a bit more mainstream, comparatively.<br>I would say Bates - would be my selection based on your brief post.<br>But all are so good, it’s easy to see why it’s a hard  choice!<br>Bates for the outstanding academics along with Hamilton and a bit of the artsy vibe that is part of its current scene.<br>Portland is a very hip coastal city near Bates and Hamilton is much more remote.  That’s might be fun for your son to have access to as well as the campus.<br>But not the dominate the culture of the other two.<br>It’s your best mix.   Hamilton a close second, if not the same.  I could see choosing either.<br>My niece who want more of the other vibe chose Bard.  Oberlin is well regarded as well.  Its just a bit less known to me here in my New England bubble.<br><br>", "<b>Username: merc81</b><br><br>If your son would like a strong fine and performing arts veneer laid over his academic experience, then Bard might suit his desired atmosphere. Oberlin, a school similarly noted for its music conservatory, would offer a variation of this, but with broader underlying academic programs. Hamilton offers balance across academic disciplines, but nonetheless indicates an appreciation for performing arts through an incredible theatre and studio arts building near the center of campus. Bates offers a friendly campus, and compares fairly directly to Oberlin by student profile.<br><br>", "<b>Username: Publisher</b><br><br>Have you visited all of these schools ? I suspect that you have not visited because Oberlin & Bard have very distinctive cultures and most would know whether or not either was a fit.<br>The primary issue with Bates College is the location.<br>Hamilton College has outstanding placement, while F&M is a very solid school academically.<br>Any significant cost difference among your options ?<br><br>", "<b>Username: HCatmom</b><br><br>Thanks! He has visited all of the schools Twice! Last night he said he wished he could find a school a similar distance to Hamilton, with Oberlin’s theatre, Bates people and Bards teaching. Or something along those lines. Hamilton was always his first pick but gave the least money and somehow his experience of the classes was not stellar. He found less interesting teaching a student engagement but they may have been a fluke. The teaching at Bard and Oberlin along with lively discussions impressed him! But the student body was a little less vibing with him. Loves Bates but theatre is old he says. And choirs are minimal. Oye!  Most money from Bard but he is not convinced he fits the extreme liberal look. Although ideologically he is there.<br><br>", "<b>Username: HCatmom</b><br><br>Also, Though he has been a great student at a great public high school, we have always encouraged balance over extreme academia. I limited his APs and encouraged theatre lab over the IB program. ( I Know!) what kind of mother does that. So i am worried that at Bates, say, it will be all work and no play or clubs and hoping the academic support is atrong.<br><br>", "<b>Username: HCatmom</b><br><br>Also i would say he is interested in theatre, education, environmental studies, social and political issues, and is a sort of middle path fella with a fairly unique life( meditation, spiritual community, community oriented living)<br><br>", "<b>Username: merc81</b><br><br>Based on CDS stats, for high schools that provide the information, Bates enrolls 45.2% of its students from outside the top 10% of their HS classes, 11.3% from outside the top quarter, and 1.7% from outside the top half. On paper, this wouldn’t seem to contribute to an “all work and no play or clubs” environment. Bates’ SAT score profile also registers a bit lower than, for comparison, Oberlin’s.<br>If the primary attraction to Hamilton lies in its distance from home, then I’d recommend your son eliminate the choice. However, for students for whom the school would be the right fit, Hamilton would appear to be worth an extra cost: https://www.forbes.com/sites/nataliesportelli/2017/04/26/10-expensive-colleges-worth-every-penny-2017/. I would say though that, based upon your son’s deeper interests, he’d contribute a valuable perspective to the Hamilton community.<br><br>", "<b>Username: Mwfan1921</b><br><br><br>\"\"<br>Based on CDS stats, for high schools that provide the information, Bates enrolls 45.2% of its students from outside the top 10% of their HS classes, 11.3% from outside the top quarter, and 1.7% from outside the top half. On paper, this wouldn’t seem to contribute to an “all work and no play or clubs” environment<br>\"\"<br><br>Only 21% of matriculants reported class rank, so one can’t draw meaningful conclusions about the general environment at Bates from those stats.<br>FWIW when I read post #6, Bates and Bard seem better fits, than Hamilton and Oberlin. But I believe OP’s S can find his peeps at any of those schools.<br><br>", "<b>Username: SpiritManager</b><br><br>Bard has a wonderful choral program that many don’t know about. The head of the music department is James Bagwell, who is also the director of the The Collegiate Chorale. http://insigniaartists.com/james-bagwell/ The choirs get to sing with all three orchestras, as well as the American Symphony Orchestra.<br>Some of the opportunities for singing at Bard: Chamber Singers and Opera Workshop, Bard College Symphonic Chorus, & the Georgian Vocal Ensemble. As well as the A Cappella ensemble The Orcapelicans. Here’s the info on Bard’s Vocal Music program (in the college, not the grad program through the conservatory) https://music.bard.edu/classical-vocal-performance/<br>As for the vibe - not everyone is a hipster at Bard. Really. But he’s absolutely correct about the level of teaching and the engagement of the student body.<br><br>", "<b>Username: HCatmom</b><br><br>Definitely not a hard science guy! But thanks.<br><br>", "<b>Username: HCatmom</b><br><br>Lol. At this point i am like “oh Vassar would have been perfect!”<br><br>", "<b>Username: HCatmom</b><br><br>Thanks all. All these schools are stellar! He is very fortunate. Hopefully, he can come to a conclusion that fits. Each school has plusses and minus for him.<br><br>", "<b>Username: merc81</b><br><br>I agree with the early comments that Bard and Oberlin should probably be paired. And, based on subsequent comments, these colleges would seem to be his best fits. However, I suspect the decision will not be as simple as that . . .<br>Regarding, reply #8, there are several statistical factors that support the validity of the figures in #7. For one, standardized scoring across all schools comports to a strong degree with class rank. In the case of this group, it shouldn’t be surprising then that the CDS profiles for Bates and Oberlin, for example, register nearly identical figures for both class rank and standardized scoring. (Therefore, even though the class rank data itself is based on slim reporting, its validity appears supported by substantiating standardized scoring data across these and other schools.)<br><br>", "<b>Username: gardenstategal</b><br><br>For his interests,  I would pick Bard.  He’ll get the richest experience in theater and choral music, and the academics are truly engaging.<br>There are a lot of kids there who are “mainstream” although I agree that the overall vibe of the school is less so.<br><br>", "<b>Username: BookLvr</b><br><br>My daughter has visited three of your son’s four top picks. (The one she has not is Bates.) For her, OBERLIN would be the clear choice.<br>Oberlin is a very vibrant community with clear strengths across the field academically and in the performing arts. There’s also that cool $5 art rental program…wow! Interesting living choices, food coops, ex-co classes some of them taught by students, the winter term program…my daughter considers all these things pluses.<br>Hamilton is a great school, the arts center is amazing, and it is considered a writer’s college. I also love that it is open curriculum. I found the dorms a little underwhelming, but overall a great choice.<br>Bard was one that looked great on paper for my daughter, but she found it uninspiring on the tour. Now, that could have just been a sign that we had a more laid-back tour guide…but other tours were far more effusive in articulating what is super cool about the school. We saw a couple classrooms and they were also not in great shape…though that could have been luck of the draw, and maybe there are nicer classrooms elsewhere.<br><br>", "<b>Username: apple23</b><br><br><br>\"\"<br>I found [Hamilton’s] dorms a little underwhelming<br>\"\"<br><br>Which ones? Hamilton offers 28 residence halls in a variety that may have no direct comparison at other colleges.<br>https://www.hamilton.edu/campuslife/where-to-live/residence-halls<br><br>", "<b>Username: HCatmom</b><br><br>Thanks all. Are there students from Bates or Hamilton on this forum? At this point for whatever reason he has ruled out Oberlin. Rather surprising as it was his top pick a few days ago. He is concerned about choir and theatre programs at Bates maybe not being as strong as he would like, though generally feels the school a good match.<br><br>", "<b>Username: gardenstategal</b><br><br>@HCatmom, you might be best served by going to those schools’ forums and asking specifically about their theater and choral programs.<br>As you have probably noticed,  folks have their favorites.  And often,  when people have experience with a school,  it’s not with the programs that interest you.<br>While I thought Bard would be best for your kid, of these, my kid - no theater or choral music interest - looked at all of them and liked Bates best and Hamilton least.  But that’s one kid with different tastes.<br><br>", "<b>Username: merc81</b><br><br>You might want to check IPEDS. For example, Bates indicates 5 theatre “first majors,” and 24 across visual and performing arts in general:<br>https://nces.ed.gov/collegenavigator/?q=Bates&s=all&id=160977#programs<br>Regarding his final few choices, if the stated draw for Hamilton relates primarily to proximity, why not choose from between Bard and Bates?<br>Btw, I agree that Hamilton offers an amazing variety of housing choices. For example, Wally J is available to first-years and houses 20 students:<br>https://www.hamilton.edu/campuslife/where-to-live/residence-halls/wally-j<br><br>", "<b>Username: mamaedefamilia</b><br><br>@HCatmom   As you say he is interested in “community-oriented living,” before crossing Oberlin off his list, has he looked seriously at the student co-ops?  That with environmental and theater interests seem to tick a lot of boxes at Oberlin.<br>That said, if he isn’t feeling the student vibe, he shouldn’t dismiss that inner voice.  Obies have a distinct flavor that isn’t for everybody.  That said, the in-your-face SJW stereotypes are exaggerated, IMO.<br>We also know somebody at Bard who reports a somewhat similar vibe to Oberlin.  If your son is looking for a more heterogeneous yet artsy student body, Bates may be the happy compromise.<br>I have a kid at Oberlin so if you have further questions, feel free to message me.<br><br>", "<b>Username: MinnesotaDadof3</b><br><br>I can’t add to any commentary concerning the quality of the theater programs at any of the five colleges in your query. But I do have a continuing concern about one aspect of Bard – namely its bond rating/financial strength.<br>I’ve been criticized before, here on CC, for mentioning this concern of mine. Consequently, I held off until now from writing about it whenever this thread showed up on “Latest Posts.”<br>Bard’s bond rating by Moody’s sits at “B1,” which is the fourth rung down into “junk-bond” status, or on the 14th quality rung of  21-rung rating scale. This is an measure of the college’s financial health, or lack of it. Personally, I would not want a child of mine attending a college rated so poorly. The poor financials are bound to pose some risk to a student’s undergraduate experience, and the risk could increase if interest rates rise significantly and thus make it difficult for Bard to survive a cash-flow crisis.<br>I’m prepared to be bludgeoned again by some fellow CCers for writing the above. But I am more at peace now, after sharing it. Maybe Bard’s theater program is the best choice for your son.<br><br>", "<b>Username: HCatmom</b><br><br>Thanks. Looking at between Hamilton and Bates, instagram stories are so different. Bates posts sports every other time. Hamilton, mostly classes and performances etc.<br><br>", "<b>Username: HCatmom</b><br><br>Where are the forums?<br><br>", "<b>Username: Trixy34</b><br><br>Have you tried the pull a name out of a hat trick?  Put all 4 schools in a hat and tell him you’re going to pull the winner, then assess how he feels about it.  My sister-in-law tried this with my son, and he just shrugged each time (LOL!), but it might work for yours.  My sense is he’s down to Bard or Bates.  He wasn’t feeling Hamilton.  My son didn’t either, even though he’s a double legacy.  It’s nice to have a fairly short trip home, but it’s not everything.<br>But I will take issue with the characterization of housing at Hamilton.  I lived there for 4 years and thought it was pretty fantastic.  And that was before they renovated all the fraternities.<br><br>", "<b>Username: HCatmom</b><br><br>He loves Hamilton. Not just proximity, open curriculum, fantastic facilities. Etc.<br><br>", "<b>Username: Trixy34</b><br><br>@HCatmom - that’s tough. I’m sorry he had disappointing classes.  I can’t say I ever had a bad professor at Hamilton  Some were more engaging than others, of course, but I felt the faculty was pretty top-notch. But, of course, that was 25 years ago, and most of my favorites have either retired, passed away or moved on to Tufts, Cornell, Northwestern, etc.  If it’s near to you, maybe he could go meet some more professors in his intended major and get a better sense of the department?  As far as choral groups go, he would certainly not be at a loss for opportunities.<br><br>", "<b>Username: BookLvr</b><br><br>@apple123 and @merc81 I will revise my previous statement! I found the dorm that our tour guide showed us on the tour to be underwhelming compared to the dorms which we got to tour at other colleges. I fully recognize that other colleges may have been showing us particularly nice examples of dorm rooms or Hamilton might have chosen a particularly tight space.<br>I also want to make it clear the dorm was not bad. It just wasn’t a highlight, particularly compared to some of the other facilities we saw on the tour. I will add that we saw Hamilton on the same tour we saw Smith and Vassar. I think a lot of the women’s colleges (and colleges that started as women’s colleges like Vassar) have particularly nice dorms. So it could be that if I had seen Hamilton’s dorms after having seen more run-of-the-mill dorms, I would have had a different reaction. I certainly wouldn’t rule Hamilton out based on dorms! And Hamilton’s marketing materials were among my favorite, with tabs like like “Study What You Love.” That’s a great approach for an open curriculum school!<br><br>", "<b>Username: Trixy34</b><br><br>@BookLvr - did you tour Hamilton in the summer?  We were shown a quad in South.  Some of the other parents said, “FOUR people live in here?”  I kind of chuckled to myself - it did seem small, but back when I went to Hamilton, a quad in South your first year was highly desirable.  Of course, that was also back when any student could have a beer ball on campus and open containers were allowed, so the older students in South would throw great parties open to everyone.  Ahh, memories.  By my second year, the alcohol policy changed and dorm parties became smaller and more private.<br>Anyway, my sense is that, aside from the South dorm, which seems to be the one they highlight, housing is much less crowded for first years than it used to be.  After first year, the housing options are pretty great.  And it’s hard to beat Hamilton when it comes to facilities management.  They really keep the campus in tip top shape.<br><br>", "<b>Username: BookLvr</b><br><br>@Trixy34 --Yes, we did! (We prefer to tour during the school year, but we wanted to make sure we got to Hamilton and it is a little off the beaten path.) It was definitely a quad room. It could well have been South.<br><br>", "<b>Username: mom2jgd</b><br><br>I love the idea @Trixy34 mentions above about pulling a name out of a hat and now that you’re down to two, it might be  revealing to hear how he defends the “losing” choice.<br><br>", "<b>Username: HCatmom</b><br><br>My son loved everything about Hamilton. Only complaint really is it offered the least FA.<br><br>", "<b>Username: merc81</b><br><br>For those who’d like to self-tour a sampling of Hamilton’s residence halls, these might be among those to include:<br>Traditional: North (open to first-years), South (included on the official tour, open to first-years in the REAL program), Carnegie<br>Modern: Major (open to first-years), Milbank<br>House Style Cluster: Wally J and Wertimer (open to first-years), Skenandoa<br>House Style Row: Morris, Eells, Ferguson<br>Co-op Living: Wollcott<br>Apartments: Griffin Rd.<br>A Separate Peace: Rogers Estate<br>Regarding South dormitory, which was discussed up-thread, note that the quads (four students) consist of two full rooms plus a bathroom. Interior views of this hall can be seen in The Sterile Cuckoo, a film I’d recommend to prospective students for its visual aspects.<br>@HCatmom: If your son chooses Hamilton, he should familiarize himself with residence hall options, then express any preferences on the housing questionnaire.<br><br>", "<b>Username: Puzzeled101</b><br><br>I would, personally, chose b/w Hamilton and Oberlin- whichever the student is more comfortable w/<br><br>", "<b>Username: merc81</b><br><br>Sp (#32): Woollcott.<br><br>", "<b>Username: MomInSB</b><br><br>Here’s a video of last winter concert at Hamilton - https://livestream.com/HamiltonStream/events/8478947  very cool song starts at 43:34.<br><br>", "<b>Username: Trixy34</b><br><br>@HCatmom - I hear you on the financial aid.  I had a small merit scholarship when I attended ages ago.  Nothing for our kiddo since they don’t do merit aid, so we haven’t tried to sell him on Hamilton.<br>Whatever your son decides, please update us.  I’m dying to know where he chooses!<br><br>", "<b>Username: Trixy34</b><br><br>The a cappella groups at Hamilton are phenomenal too.  And very well-loved and appreciated I might add.  Check out the Buffers, Hamiltones and Special K.  I’m sure there are videos of their performances out and about.<br><br>", "<b>Username: Sue22</b><br><br>It sounds like he may already have taken Oberlin off the list, but if it’s possible he’ll want to teach I would have advised eliminating Oberlin anyway. Oberlin doesn’t have an Education major or minor. Bard also does not have an undergraduate teaching program (although it probably has the strongest theater program), while the other 2 have programs that would lead directly to teaching credentials. Another consideration if teaching is a possibility-he’ll want to keep his debt down. Education’s a great field but it doesn’t pay a lot.<br>Just my personal opinion, but with close relatives at both Bates and Oberlin I’d say that Oberlin is great for the kids it’s great for but it can be a little ideologically extreme. I wouldn’t worry about Bates being an “all work, no play” kind of place. IME it’s pretty balanced.<br><br>", "<b>Username: HCatmom</b><br><br>I think he is mostly down to Bates and Hamilton at this stage. Both great choices. Bates more aid but further away? but we love Maine. Great folks and vibe for him. Hamilton sounds maybe a bit better for choir options and possibly theatre but teachers look great at Bates too!<br><br>", "<b>Username: HCatmom</b><br><br>@mom2gjd ha! This trick never worked for me but maybe it will for him.<br><br>", "<b>Username: privatebanker</b><br><br>@Trixy34   Are you referring to the    “Matt’s Beer Ball”?<br>Brought back a lot memories.  Lol.<br>@HCatmom   Hamilton seems to be the best blend of all you are seeking.<br>If I had a vote, it would be a big yes!<br><br>", "<b>Username: cptofthehouse</b><br><br>My reaction is that Bates is best choice. A little extra money, closer to a city, top LAC rep.<br>However , I don’t think he can lose.  The drawbacks at any  one school outweighed by the pluses.    I look at Bard as the most quirky of the bunch and FM, the preppiest. Oberlin, I’d place next to Bard with Bates and Hamilton in the middle.<br><br>", "<b>Username: Trixy34</b><br><br>@privatebanker  - well, I went to college in the early 90s.  I think lots of companies made party balls by then Bud and Coors comes to mind), but I’m sure we went through some Matts.  But by the time I was of purchasing age, we were limited to cases. (lol)  We drank a lot of Old Milwaukee at Hamilton.  (Why not Utica Club or Matts?  i have no idea).  If you had a few empty cases, you could get another one with the returnable bottle deposits.   And we had the convenience of a drive-through beverage place in Clinton that we fondly dubbed “The Brew-thru.”<br><br>", "<b>Username: SpiritManager</b><br><br>It sounds like Bard is out of the running now but just wanted to let @Sue22 know that Bard has a 4/1 MAT program for a teaching credential. https://www.bard.edu/mat/ny/programs/ba-mat/<br><br>", "<b>Username: Sue22</b><br><br>@SpiritManager, I know Bard has an excellent graduate teaching program. Still a disadvantage to have to spend an extra year in school when he could come out of a 4 year program with teaching credentials. This may all be moot, as the OP mentioned education among a group of other interests.<br>I feel the same way about 3/2 or 4-1 engineering programs. If engineering is a real contender as a major it’s better to go somewhere where a student can earn the degree within 4 years.<br><br>", "<b>Username: merc81</b><br><br>If your son has expressed that a flexible curriculum would be preferred, I wouldn’t count that as an important aspect against Bates. Bates does require general education courses across a variety of disciplines. However, partly as a result of this requirement, your son will have a variety of courses from which to choose that will be oriented toward students whose primary interests reside in other academic areas.<br><br>", "<b>Username: HCatmom</b><br><br>Oh lordy. I have decided that the perfect college for him was the one he didn’t apply to for no good reason. VASSER! Closer to home. Big performing arts. Oh well. Lol. What u dont know when you start this process.<br><br>", "<b>Username: Trixy34</b><br><br>Oh man, HCatmom.  Does he have any idea what he wants to study besides theater?<br><br>", "<b>Username: HCatmom</b><br><br>Sue22. I went to oberlin and loved it. But that was a LONG time ago. Of all the colleges it grabbes him the most intellectually.<br><br>", "<b>Username: Trixy34</b><br><br>Remind me why F&M is out of the picture - most expensive?<br>I would think the Fulton Theatre being right there in Lancaster would be a big draw.<br><br>", "<b>Username: merc81</b><br><br>Of his current choices, I’d say that Vassar most resembles Bard and Oberlin by program emphasis and Hamilton by overall academics.<br><br>", "<b>Username: Sue22</b><br><br>Not the OP here, but given their description of their son the first school I’d knock off the list would be F&M. It’s a school I like but it’s 30% Greek.<br><br>", "<b>Username: HCatmom</b><br><br>Education, environmental studies, humanities.<br><br>", "<b>Username: merc81</b><br><br>For environmental studies your son might appreciate Hamilton’s Adirondack term. If he attends elsewhere the program may still be open to him as a visiting student.<br>https://www.hamilton.edu/academics/offcampusstudy/adk<br><br>", "<b>Username: Trixy34</b><br><br>Any progress @HCatmom ?<br><br>", "<b>Username: HCatmom</b><br><br>He is asking me to talk him into Bates. He is stressed. He likes Bates vibe. Still worried about choir and theatre.<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>He is asking me to talk him Bates.<br>\"\"<br><br>This statement would seem to contain his decision.<br><br>", "<b>Username: gardenstategal</b><br><br>If he loves Bates (easy, btw!), maybe you can talk to him about the big fish in a little pond opportunities.  He may not be in a choir that everyone watches on TV on Christmas Eve, but he’s likely to get more solos, ensemble parts, etc.  And he’s unlikely to be the only true talent there!<br>At some level,  there’s a lot to be said for that.<br><br>", "<b>Username: Trixy34</b><br><br>Tell him Trixy34 says he should go to Bates.  That should do it.  <br><br>", "<b>Username: CardinalBobcat</b><br><br>And CardinalBobcat agrees <br><br>", "<b>Username: merc81</b><br><br>Based on indications throughout the thread, I think your son should attend Bates as well.<br><br>", "<b>Username: Turquoise52</b><br><br>@Lindagaf, a student just asked to be convinced to pick Bates … out of Bates, Hamilton, Oberline, Bard<br><br>", "<b>Username: Lindagaf</b><br><br>@HCatmom , your son seems to like Bates and Hamilton the best. I would agree that based on vibe, those two are more similar and Oberlin and Bard should be taken out of the mix at this point.<br>On the most simple level, it seems sensible to choose Bates. It gave the best aid, and really, your talking about paying less for an equal school. It’s a top LAC, the location is excellent, it has everything a student could want in terms of academics, activities, sports, and, let’s not forget, food. The dorms are excellent. As far as I’m aware, the dorms have all recently been redone. Except for singles, (even those are roomy) I’ve never seen a bad dorm room, and some are beautiful. The campus is compact and lovely. The dining hall is outstanding, and the Den and the Ronj offer alternatives for when students want something different. The art museum is lovely, and the arts are well supported in general. Is everything at Bates glistening and modern? No. It is not a school of performing arts, but I can honestly tell you that I am always blown away by the level of talent I see when I am at Back to Bates weekends. I don’t know how these kids do all that they do, and do it well.<br>The courses are great. My daughter has never felt that she has been forced to take a class she isn’t interested in, and the requirements are very flexible. Short term in May is fun, and no one has better study abroad options than Bates. If study abroad is not possible, as it sometimes isn’t due to major or double majoring, short term offers study abroad too.<br>The thing I like best about Bates is the students. I like how relaxed they are with each other. I like the guy in the flannel shirt hanging out with the hippie girl. Or the urbanite hanging with the science nerd. That’s a little idealized, but my point is I never feel that there is one type of Bates student. My daughter is only a sample of one, but did not apply to Hamilton because she felt it was a little uptight and a little too preppy for her. Just her impression, because I liked Hamilton. I think many people agree though that Bates is known for being friendly and relaxed.<br>Your son shouldn’t be concerned about choir and theater. There will be plenty of opportunities for him to be involved in performing arts. If he wants to sing something different, I’m sure he will be able to do so.<br>As far as Maine, well, my daughter’s best friends are from Hawaii, Florida and Tunisia. Is he going to college to be close to home? Does another hour in the car outweigh everything else, including the money? That’s a family decision. Yep, it’s cold. But they go to the beach anyway, or they go snowboarding, or they go out in Portland, or they go running in the adjacent bird sanctuary, or hiking right off campus, or with the Bates Outing Club. If he’s asking to be convinced to choose Bates, have him read this post, and that might help him decide.<br><br>", "<b>Username: HCatmom</b><br><br>@Lindagaf Ha! Thanks so much. will do! I think today he is trying on Hamilton as someone here suggested. He said he feels anxious after making the decision about Bates and does that mean it is the wrong decision. I said, there are no wrong decisions here. I feel anxious everytime I go on a trip, but I always end up having a great time! Someone just re introduced Bard as an option based on it actually being more academically challenging than Bates or Hamilton. I think my son noticed this when he attended the classes tho he like the things he attended at Bates.<br><br>", "<b>Username: Trixy34</b><br><br>@Lindagaf - after that, I want to go to Bates!  (And I’m a Hamilton alum - lol!)<br><br>", "<b>Username: HCatmom</b><br><br>@gardenstategal  Yes, we have been over that. He has been singing with the best choir I have ever heard for the last 4 years. Hopefully the smallness doesn’t also mean too many competeing for good parts, I guess it can go both ways. He is not the top talent anywhere, except maybe for his comedic roles.<br><br>", "<b>Username: HCatmom</b><br><br>I, personally love that program and would be in it in a minute if I were 18. I keep mentioning it to him!<br><br>", "<b>Username: Trixy34</b><br><br>Hm - Bard is more academically challenging?  Like, in a creativity sort of way? Heavier work load?  Students seemed more engaged?<br><br>", "<b>Username: Lindagaf</b><br><br>I believe Bates has about six a capella groups. Is he interested in that?<br>Each of those schools is going to be academically challenging. Kids don’t get in if the colleges don’t think they can handle the academics. Not one of them will be a good school for slackers. Not implying that your son is a slacker, of course.<br><br>", "<b>Username: merc81</b><br><br>Regarding Hamilton, it potentially offers your son the most varied social options because of its spatial aspects. With three residential neighborhoods and five places to eat lunch, he could choose an essentially fluid experience based on where he lives and dines. In terms of academics, Hamilton’s intellectualism probably runs a bit “cooler” than at a school such as Bard, so course selection would be key for the type of active engagement that he experienced there. In terms of intellectual capability as might be indicated by class standing and standardized scores, however, Hamilton falls at the top of his group. If Hamilton was located in Maine, for that matter, it would be the top school in the state by these measures.<br><br>", "<b>Username: chemusic</b><br><br>I agree with merc81.   The overall music program is stronger at Hamilton than at Bates if that is an important consideration.<br><br>", "<b>Username: apple23</b><br><br>I’m not sure at all about the claim that Bates offers the best study abroad programs around. Bates approves programs such as Hamilton in France, Hamilton in Spain and Associated Colleges in China, which are all administered by Hamilton College. Bates’ own abroad programs seem much less developed by comparison.<br><br>", "<b>Username: Trixy34</b><br><br>All that said, he’s just “feeling” Bates.  I think he should go to Bates.<br>Also, with so much choral talent at Hamilton, do we know he would make the choir if he’s not a top talent?  @HCatmom - did you get a sense of that while on campus?  Meet with the choral director at all?<br><br>", "<b>Username: HCatmom</b><br><br>I am completely stunned that he is not choosing Hamilton or Oberlin for that matter. Bates was the last place he visited. So maybe thats it. Anyhow, he has, for better or worse, seemed to have chosen the one school that is the farthest away and the farthest North. EEEEEEWK! Thanks all.<br><br>", "<b>Username: HCatmom</b><br><br>Also, the one school his dad went to for the admitted student day instead of me.<br><br>", "<b>Username: merc81</b><br><br>Best of luck to your son at Bates, @HCatmom!<br><br>", "<b>Username: Lindagaf</b><br><br>Congratulations to your son! He’s made a choice he’ll be happy with.<br><br>", "<b>Username: Sue22</b><br><br>Congratulations on your son for having made his decision. Time to buy the sweatshirt and never look back!<br><br>", "<b>Username: gardenstategal</b><br><br>^ @HCatmom , you should have devised your own microbrewery tour…?<br><br>", "<b>Username: HCatmom</b><br><br>This was tough. I personally think i had to adjust letting go of Hamilton. It had always been his choice and we had been there 3 times. Starting to feel like home! Bates was the one college i didn’t get to visit a 2nd time. So there will be alot of getting to know<br><br>", "<b>Username: Sue22</b><br><br>@HCatmom, feel free to head over to the Bates forum to ask any questions you may have about the college!<br><br>", "<b>Username: HCatmom</b><br><br>Where is the Bates forum?<br><br>", "<b>Username: merc81</b><br><br>You properly placed your other thread in the Bates forum, @HCatmom. You can create further threads there for additional topics of interest to you.<br><br>", "<b>Username: Lindagaf</b><br><br>@HCatmom https://talk.collegeconfidential.com/bates-college/<br><br>", "<b>Username: HCatmom</b><br><br>Hey. How do I message you. Trying to figure out freshman housing options<br><br>", "<b>Username: HCatmom</b><br><br>Anybody have ideas about best freshman housing options?<br><br>", "<b>Username: happymomof1</b><br><br>@HCatmom - to send a message, click on the username.  In my screen, they appear in blue.  That will get you to a page where you should see a place to click to send the message.<br><br>"]}