{"title": "engineering georgia tech vs duke vs cornell", "comments": ["<b>Username: petedawg</b><br><br>Hey guys I'm a high school senior who is trying to decide between these 3 schools. I am a Georgia Resident so I have a full tuition scholarship to GT along with some merit aid. I have also been accepted by the college of engineering at Cornell and am waiting on a decision from Duke. The cost of attendance are all comparable due to financial aid.<br><br>", "<b>Username: ucbalumnus</b><br><br>Questions you need to ask yourself before deciding:<br><br>1. What kind of engineering? Georgia Tech has the largest selection of engineering majors, followed by Cornell, followed by Duke.<br><br>2. Do you want to work as an engineer (versus investment banker or consultant)? In what region would you prefer to work?<br><br>3. By \"comparable\" costs, you mean net cost after non-loan financial aid, and debt, if any, would be similar?<br><br>4. How likely is it that you will change your major outside of engineering, or want to take extensive non-engineering course work? Georgia Tech is relatively limited outside of engineering.<br><br>", "<b>Username: JamieBrown</b><br><br>Cornell<br><br>Duke<br>GT<br><br>", "<b>Username: petedawg</b><br><br>@ucbalumnus great questions. I am currently undecided on which engineering major I would like to pursue but I definitely plan to study and finish a degree in engineering. The net cost of Cornell and GT are very similar and I would not have to take out much loans at all for either. Since cost is not an issue, I am trying to determine which school is \"better\" for engineering and the overall college experience<br><br>", "<b>Username: petedawg</b><br><br>@JamieBrown is there any reasoning behind that order?<br><br>", "<b>Username: Alexandre</b><br><br>For engineering, Cornell and GT are peers while Duke is not quite as good. However, Cornell is a stronger overall university than GT. I agree, if cost is not an issue, Cornell is the way to go.<br><br>How do you you got accepted into Cornell? their decisions do not come out under March 29.<br><br>", "<b>Username: petedawg</b><br><br>i got accepted via likely letter. For some reason though, the Georgia Tech engineering rankings are all higher than cornell's and its rated as a top 5 college for Engineering. Would I be taking a loss by going to cornell?<br><br>", "<b>Username: ucbalumnus</b><br><br>If you are undecided which kind of engineering, ask two questions:<br><br>1. Does each school have the kinds of engineering that you may decide on?<br><br>2. How difficult is it to change to a different engineering major at each school?<br><br>", "<b>Username: Alexandre</b><br><br>petedawg, you should know by now that rankings are not absolute. It is not logical to assume that rankings are the be-all, end-all. #5 is not better than #10. GT's engineering programs are significantly larger than Cornell and engage in more research. That explains the difference in ranking. In terms of engineering academic quality, reputation in industry and engineering professional placement, the two schools are equal. However, outside of the engineering domain, Cornell is a stronger university than GT.<br><br>", "<b>Username: Georgiatwins</b><br><br>Since you live in Georgia, you are more than likely familiar with the mid-town experience around the GT campus. We have 2 dear friends' children who are in different engineering major at Tech, who are completing 2 extra semesters to have a minor in management I would humbly disagree with the prior poster about GT being primarily engineering. The heart of GT is engineering, but the Ivan Allen College of Liberal arts, the Nunn school for international relations have excellent reputations and graduates do very well in the job market. Cornell clearly has the elite stature of the Ivies-but it is also more remote ( which matters when you want to travel home, etc) and is COLD a good part of the year. GT on the other hand, is in the middle of a huge metro. area with plenty to do ( when you have time). To me, they are very different schools in terms of overall college experience. I can tell you that GT students in all areas and colleges land incredible summer internships, many with job offers after the second year. DS's best friend is spending second summer with Caterpillar with pending offer and other student just completing sophomore year with double major in German and International Business will spend entire summer with BMW in Germany.<br><br>", "<b>Username: Waverly</b><br><br>Cornell....<br><br>", "<b>Username: Alexandre</b><br><br>Georgiatwins, I agree that GT is an excellent university. I never said otherwise. But I do believe that it is pretty heavy on Engineering and Science. Two thirds of GT students major in Engineering/Computer Science. For this reason, outside of the tech industry, GT doe not have as strong a presence or reputation as Cornell.<br><br>I also agree that setting is important. Cornell is located in a smallish college town in the snowbelt while GT is located in a large, southern city. Something else to consider is the male to female ratio. Cornell is 50/50 in this regard, while GT is 70/30. Just like location and climate, that may not be a big deal for some but it is for others.<br><br>", "<b>Username: westsidewolf1989</b><br><br>Depends a lot on what type of college atmosphere you want. Georgia Tech and Duke are schools in the ACC, with Georgia Tech probably having more of a big time sports culture due to their greater athletic success across the board. Cornell plays in the Ivy League and is obviously not as big time on the athletics scene.<br><br>Size is also another deal, with Duke being half the size of Georgia Tech and Cornell. While Georgia Tech is your typical state school, I'm not so sure that there's a bigger party culture there, it didn't seem like an incredibly fun school when I visited.<br><br>Personally, I would go with Duke. Weather is decent, smaller undergrad population, good girl/guy ratio. I actually think Durham is the worst of the three cities/towns, but Ithaca has horrible (albeit great scenery) and Atlanta is an actual city with a ton to do and solid weather.<br><br>If you don't get into Duke, I think it's a tossup.<br><br>Also, in the small chance you change majors, Duke is a lot easier school to do that at. While Georgia Tech is a very good school, its programs outside engineering are lacking in comparison to Cornell and Duke.<br><br>", "<b>Username: bluedog</b><br><br>\"\"Also, in the small chance you change majors\"\"<br><br>I wouldn't say it's that small of a chance really and definitely agree with you that it's something to consider. Nationwide, 1/3 of people going into engineering transfer out. And of the approximately 2/3 that stay in, a large percentage end up not going into the engineering workforce (consulting and banking are popular). Hence, why there's a shortage of engineers in this country. Every high schooler that goes into engineering thinks they're completely committed to it, but things change. Thus, I would encourage you to attend a university where you'd also be happy studying something else if your interests change or engineering proves not to be your cup of tea.<br><br>All three are great schools, so you really can't go wrong in my mind. Cornell and GT are more known for the engineering overall, while Duke is more a small niche engineering school with 1/2 of its undergrads studying BME. Since you're undecided, I'd also inquire as to how easy it is to change within the engineering school. When I applied to Illinois, I had to apply to a specific engineering major. I don't know if that's the case at GT or how difficult it is to transfer to a different major, but it's a reasonable question. I'd imagine Cornell is more flexible in that regard. At Duke, you don't have to declare until the end of your sophomore year and even transferring to the arts &amp; sciences school is as easy as checking a box.<br><br>ucbalumnus' questions above are great - I'd also encourage you to visit the schools to get a better sense of the feel and what would be a better fit. Good luck.<br><br>", "<b>Username: ucbalumnus</b><br><br>\"\"bluedog wrote: I wouldn't say it's that small of a chance really and definitely agree with you that it's something to consider. Nationwide, 1/3 of people going into engineering transfer out. And of the approximately 2/3 that stay in, a large percentage end up not going into the engineering workforce (consulting and banking are popular).\"\"<br><br>However, the stats may differ at highly selective schools. For example, 80% of freshmen in engineering at Berkeley graduate with bachelor's degrees in engineering. I would not be surprised if the three schools described here also had much higher rates of staying in engineering than the national average (which is actually worse than 2/3, since only 60% of freshmen in engineering are still in engineering after one year).<br><br>The investment banking and consulting thing is mostly at a small number of high prestige schools (presumably including Cornell). Other schools do not have a very large percentage of engineering graduates going into investment banking and consulting.<br><br>", "<b>Username: Sam Lee</b><br><br>^I second that the national average is not a good benchmark for top students. The GT data are much more applicable:<br><url>http://www.irp.gatech.edu/sites/www.irp.gatech.edu/files/GeorgiaTech_First-TimeFreshmanRetention%20Study_Fall2011%2001-18-12.pdf</url><br><br>", "<b>Username: Sam Lee</b><br><br>Here are the pros and cons:<br><br>Duke<br>Pros<br>General prestige<br>Targe schools for elite ibanking and consulting firms (note that you should at least be a semi-extrovert, if not an extrovert, to have the personality type most of them look for; for ibanking, probably the thick-skin to handle jack*ss and to be in a culture of questionable ethics)<br>Cons<br>Limited offering in engineering<br>Limited recruiting from engineering firms<br><br>Georgia Tech<br>Pros<br>Very strong engineering recruiting and industry connections<br>Great engineering co-op program<br>Cons<br>Lack of top-quality programs outside of engineering<br><br>Cornell<br>Pros<br>Kinda the best of both worlds. But co-op program doesn't match Georgia Tech<br>Cons<br>Weather and location<br><br>So there's really no right or wrong answer here because none of them cover all the basis.<br><br>", "<b>Username: petedawg</b><br><br>Thanks so much for the advice guys. It helped me see things more clearly. I've never visited cornell so I will definitely visit soon and see if I like it there.<br><br>", "<b>Username: jym626</b><br><br>Do you have FA packages from all three yet? Do you know the cost will be equivalent?<br><br>", "<b>Username: petedawg</b><br><br>I have recieved the FA package for Georgia Tech and I am basing the estimates for Duke and Cornell off their financial aid calculators and EFC<br><br>", "<b>Username: UCBChemEGrad</b><br><br>If costs are similar and you're definitely set on engineering, I'd choose between Georgia Tech or Cornell based on the environment you prefer. If it were my decision, I'd lean toward Cornell for reasons Alexandre and others have stated.<br><br>", "<b>Username: bluedog</b><br><br>\"\"^I second that the national average is not a good benchmark for top students. The GT data are much more applicable:<br><url>http://www.irp.gatech.edu/sites/www....2001-18-12.pdf</url>\"\"<br><br>Yes, that's definitely true. That report doesn't refer to <i>internal </i>transfer rates though...It simply looks to see if a student that originally enrolled in the engineering school was retained by GT as a whole, not the specific school. \"This report tracks retention through year seven and graduation through year six for each cohort in total, by gender, by ethnicity, and by college of <b>entry</b>.\" This sentence makes it clear: \"Students entering the Ivan Allen College most frequently graduated at higher rates, while entrants to the College of Engineering most frequently graduated at lower rates\"<br><br>Looks like about 84% of GT students who <i>enter </i>as engineers stay at GT through the end and graduate, but that doesn't mean they <i>stay in engineering</i>. Also, the report tracks retention out to the 7th year! haha, what?<br><br>Actually, looking at Table 4, only 31% (!) of GT students that entered in 2005 graduated in four years. That's shockingly low to me. I bet Cornell is significantly higher. 72% graduate in 5 years and 79% graduate after 6. Looks like GT is likely at least a 5-year program to get a bachelors and that includes all the schools, not just engineering.<br><br>Duke's engineering to arts &amp; sciences transfer rate appears to be 21% for the class of 2009. A decade ago, it was 39% percent. Duke arts &amp; sciences students transfer into engineering at a 10% rate so the net attrition rate for engineering at Duke appears to be 10-15%. Nationwide, the national average attrition rate is ~50%. Can't find these numbers for GT anywhere...I'm sure Cornell has them somewhere too. <url>http://www.dukechronicle.com/article/truth-and-fiction-about-intercollege-transfer-rate</url><br><br>Getting back to GT, Table 10 has the graduation rates by college and only 27% of students that <i>begin in an engineering program</i> graduate in 4 years. 79% graduate within 6 years. Sorry for getting off track....GT is a great engineering school, but I had no idea how few people actually get a degree within four years there. So, if you're comparing costs, I would take into account the extra year of tuition and lost income in your calculations.<br><br>Edit: Just to verify this, U.S. News lists the four-year graduation rate as 33%, so that closely matches the above.<br><url>http://colleges.usnews.rankingsandreviews.com/best-colleges/georgia-tech-1569/academics</url><br><br>Sam Lee's list above looks pretty good to me....I would just add the likely extra year or two in school as a con for GT.<br><br>", "<b>Username: Sam Lee</b><br><br>One reason for the \"low\" 4-year grad rate is due to the co-op program. At Northwestern, the participation rate is 30% or so; I think the participation rate is higher at GT. Like the one at NU, the co-op at GT alternates semesters between on-campus study and full-time employment. This is unlike other so-called co-op that's more like a summer internship.<br><br>At Northwestern, the retention rate for female students was 95% (2001) and the rate for URM was 79% (2000).<br><br><url>http://coeweb.fiu.edu/sites/athltrn/ArticlestoShare/No.%201%20in%20retention%20of%20minority%20engineering%20students.pdf</url><br><br>", "<b>Username: Sam Lee</b><br><br>Much of the attrition is due to engineering being too hard. The national SAT average for prospective engineering students is proably in the low 600s. There's only so much you can make Calculus or differential equations simple, assuming a professor even tries to make it easier; when one has a score lower than that average, the only option may be to quit.<br><br>", "<b>Username: happy1</b><br><br>If cost is not a factor and you are willing to venture up north (it gets cold in Ithaca), I think Cornell presents the best combination of being an overall strong university with a great engineering program.<br><br>", "<b>Username: petedawg</b><br><br>I think I am definitely set on engineering since I have taken Calc III, Differential Equations and Linear Algebra already in high school and found that I could handle them well. Yes the Co-op program is one of the main reasons why GT seems so attractive to me. I have known many Tech grads who were able to take full advantage of that program and therefore earn a very high paying job after graduation. Does Cornell have anything similar?<br><br>", "<b>Username: bluedog</b><br><br>\"\"Does Cornell have anything similar?\"\"<br>Looks like it...<br><br><a href=\"http://www.engineering.cornell.edu/academics/undergraduate/special_programs/coop/index.cfm\" rel=\"nofollow\">Cornell Engineering: Co-op Program</a><br><br>", "<b>Username: goldenboy8784</b><br><br>\"\"Sam Lee wrote: Limited recruiting from engineering firms\"\"<br>It's important to keep in mind that Duke has a much smaller engineering population than Cornell and definitely GT. Furthermore, the fact that most Duke engineers major in BME compounds the size difference and you're left with very few Civil or Electrical Engineers at Duke looking for jobs in the industry (if you remove those aiming for a PhD, going to law/med school, becoming bankers/consultants, etc.).<br><br>Cisco, Google and Microsoft all recruit heavily at Duke on the ECE end while Skanska and Clark Construction hire multiple Duke civil engineers annually for their Project Manager role. Duke is located in the Research Triangle so it's location is actually better suited for engineering jobs than Ithaca or Atlanta.<br><br>I think the supply/demand equation for engineering jobs would work out in Duke's favor. If you throw in consulting, Duke is by far the better option. There's simply no way you will graduate out of Duke Engineering unemployed, whether you end up an engineer in industry or not.<br><br>I would go...<br>1.) Cornell/Duke<br>2. GT (much less prestigious)<br><br>", "<b>Username: jym626</b><br><br>\"\"Duke is located in the Research Triangle so it's location is actually better suited for engineering jobs than Ithaca or Atlanta.\"\"<br>Ummm... seriously? Metropolitan Atlanta and surrounding environs have plenty of engineering opportunities. If you want to remain in the research triangle in rural NC, fine. If you prefer to be in a metropolitan city, lots of great opportunities exist in and around Atlanta.<br><br>", "<b>Username: Sam Lee</b><br><br>\"\"Skanska and Clark Construction hire multiple Duke civil engineers annually for their Project Manager role\"\"<br>I doubt it. Project managers are those with at least few years of experience and preferrably PE license. No reputatable construction firms will hire fresh grads, who don't even have the EIT certificate, for that role. I don't know where you pulled that from.<br><br>", "<b>Username: jym626</b><br><br>OP-<br>College website FA prediction calculators are not too terribly reliable. Best is to wait and see what you actually get. Are all schools going to meet 100% of need or will you be gapped?<br><br>", "<b>Username: petedawg</b><br><br>@jym626 Well for Georgia Tech I have the hope scholarship since I am instate which covers the full cost of tuition plus a couple thousand dollars in merit scholarships. And Cornell and Duke both meet 100% of need according to their website so I figure the cost will be roughly the same between Duke and Cornell<br><br>", "<b>Username: jym626</b><br><br>pete-<br>I assume you'll qualify for the full 100% tuition (Zell Miller) Scholarship rather than the now slightly lower 90% tuition HOPE, yes?<br><br>", "<b>Username: bluedog</b><br><br>\"\"I doubt it. Project managers are those with at least few years of experience and preferrably PE license. No reputatable construction firms will hire fresh grads, who don't even have the EIT certificate, for that role. I don't know where you pulled that from.\"\"<br><br>I would guess goldenboy accidentally mixed up the project manager and project engineer roles...the project engineer certainly assists the project manager, though. It does seem like civil engineers at Duke have really good placement for whatever reason. There aren't very many of them, so perhaps the less competition yields a favorable result for them. This is probably not applicable to the OP since he doesn't know if he wants to go into civil.<br><br><url>http://www.pratt.duke.edu/node/2171</url><br><a href=\"http://www.cee.duke.edu/undergrad/where-students-go\" rel=\"nofollow\">Where Students Go | Duke Civil and Environmental Engineering</a><br><a href=\"http://www.pratt.duke.edu/where-our-students-go\" rel=\"nofollow\">Where do Pratt undergraduates go after graduation? | Engineering at Duke University, Pratt School</a><br><br>I would definitely wait for financial aid offers (and acceptance offer too) and then compare costs. Hard to make a fully informed decision with a key component missing from the equation. But no matter what, can't go wrong as you have great choices.<br><br>", "<b>Username: petedawg</b><br><br>Yes that is what I mean't, sorry! Yea I think I will wait 2 weeks to see all the financial statements before I make any decisions.<br><br>On another note, Cornell seems incredibly isolated? Is that bad from a recruiting or internship standpoint???<br><br>", "<b>Username: petedawg</b><br><br>Thanks for the links and info Bluedog, It definitely gave me a better sense of the Duke and Cornell from an engineering standpoint<br><br>", "<b>Username: jym626</b><br><br>No worries- Cornell has job/career fair and start-up career fairs on campus <url>http://www.career.cornell.edu/careerFairs/SummOpp.html</url><br><br>", "<b>Username: ucbalumnus</b><br><br>\"\"bluedog wrote: Getting back to GT, Table 10 has the graduation rates by college and only 27% of students that begin in an engineering program graduate in 4 years. 79% graduate within 6 years. Sorry for getting off track....GT is a great engineering school, but I had no idea how few people actually get a degree within four years there. So, if you're comparing costs, I would take into account the extra year of tuition and lost income in your calculations.\"\"<br><br>It would be really more useful if they quoted these numbers in number of semesters or quarters of school. Schools with a lot of engineering majors tend to have a lot of students doing co-ops which involve taking a semester off of school; this makes graduation rate measured in calendar years worse, but is not really worse as it would be for students taking extra school semesters due to repeating failed courses, needing to take lighter course loads, etc..<br><br>", "<b>Username: ucbalumnus</b><br><br>\"\"Sam Lee wrote: Much of the attrition is due to engineering being too hard. The national SAT average for prospective engineering students is proably in the low 600s.\"\"<br><br>If that is the case, then high attrition is not surprising. A study at the University of Oregon found that students with SAT-R Math scores under 600 had very little chance of success majoring in math or physics; although engineering was not included (due to University of Oregon not having engineering majors), the authors hypothesized that engineering would be similar in this respect.<br><br>", "<b>Username: jym626</b><br><br>ucbalum is correct. Taking a semester off to do a co-op or paid internship will throw off the graduation rates<br><br>", "<b>Username: Sam Lee</b><br><br>bluedog,<br><br>The girl in the article met the company through job fair. While what you said about less competition yielding a favorable result may be true, the downside - that not many engineering/tech companies come to campus (I already verified that) - is still there.<br><br>"]}