{"title": "vanderbilt full pay vs ucsb in state", "comments": ["<b>Username: LMK5</b><br><br>Honestly, what would you do? If your kid was accepted to Vanderbilt but they were asking for a king’s ransom in tuition, whether or not you could afford it, would you pay sticker price for Vanderbilt or would you take honors college at UCSB for an in-state price?<br><br>", "<b>Username: OhiBro</b><br><br>Even ignoring UCSB, under no circumstance would I ever pay sticker price at Vanderbilt or any similarly-priced college. Debt-free bachelor’s, no matter the institution, has always been my advice.<br><br>", "<b>Username: Gumbymom</b><br><br>Honors college at UCSB absolutely.  Affordable price as a CA resident, beautiful location and great academics.<br><br>", "<b>Username: Twoin18</b><br><br>If you have the money, I’d offer my kid the difference for grad school or to buy their first house. That $150K to $200K goes a long way in real life.<br>To me it made more sense and was fairer to give my kids a fixed amount of money rather than the promise of a free college education (in our case the difference in cost between the two schools they chose is about $25K per year because one decided to take a great scholarship at a lower ranked school). They always knew what was in their 529s and what we would give them, so $300K colleges were off the table.<br><br>", "<b>Username: ProfessorPlum168</b><br><br>It might depend on what the major is, but for a 50% discount, USCB all the way.<br><br>", "<b>Username: Publisher</b><br><br>Honors College at UCSB.<br><br>", "<b>Username: ucbalumnus</b><br><br>“Whether or not you can afford it” is a key factor in how willing many people are to pay for a college.<br>A plutocrat may find any US university’s cost to be pocket change, so price does not matter to him/her.  But the typical forum demographic who gets no financial aid on a high income, but would have household budget trouble paying Vanderbilt cost of attendance and may need parent loans (generally a bad idea, especially if there are younger kids) for that, is a different story.<br><br>", "<b>Username: LMK5</b><br><br>@ProfessorPlum168 , Her major is likely history or economics. And yes, the discount would be at least 50% if full pay.<br><br>", "<b>Username: bopper</b><br><br>I would take UCSB unless the tuition at Vandy was pocket change for me.<br><br>", "<b>Username: Hamurtle</b><br><br>Also depends on the major.  If OPs kid is considering BME/premed, then Vandy would be extremely attractive.  Otherwise UCSB with in state costs would be a third of Vandy’s cost.<br><br>", "<b>Username: happymomof1</b><br><br>Unless the parents are made of money, I expect they’d encourage that BME/premed to re-think the specific engineering major, attend UCSB, and save money for med school.<br><br>", "<b>Username: BayAreaRecruiter</b><br><br>Aside from the money, I’d imagine that “college fit” would be something to consider. Two VERY different environments (preppy/large Greek system) vs (California casual/smaller Greek system). I started at a “higher ranked” private undergrad and transferred to UCSB because it was a much better social fit for me. I completely underestimated the importance of “school fit”. Was super happy I made the change, and I didn’t feel like the classes were any less challenging at UCSB compared to the higher ranked private. Two very different environments we’re comparing here— hopefully there’s one that speaks to your daughter more and can be weighted when evaluating the financial aspects.<br><br>", "<b>Username: LMK5</b><br><br>@BayAreaRecruiter, She received a very surprising waiting list decision from UCLA last week, which really threw a wrench in things. Still waiting on Berkeley decision this week, but she didn’t like the vibe at Berkeley when we visited. We visited Vanderbilt earlier this month and she seemed to like it. It has that combination of academics, nice campus, plus school spirit. She is not a partyer and has really worked hard throughout her school years. I want her to go to the strongest academic school possible. She has been offered Honors college at UCSB but I’m not sure that the party culture will agree with her. But my gut tells me that the sticker price of the privates makes no sense at all. She has also gotten into UCSD but the campus really turned her off.<br><br>", "<b>Username: BayAreaRecruiter</b><br><br>@LMK5 Sorry to hear about the UCLA waitlist. Hoping that comes through and makes this an easier decision. It’s great to learn she liked Vanderbilt. I’ve heard it’s one of those places that you tend to know right away if it’s a fit or not. UCSB is definitely a social campus (think ASB President!  ), however there are many non-partiers and I suspect she’d find her people. Best of luck to your daughter, and to you as you navigate this decision.<br><br>", "<b>Username: socaldad2002</b><br><br>The important question for me is: would you have to borrow 300k for the Vanderbilt education or did you already save most (or all of the costs)?  IMO, no way I would borrow that kind of money for undergrad but if already ear-marked for college and was the “best fit” I might.<br><br>", "<b>Username: LMK5</b><br><br>@socaldad2002, I could scrounge up the dollars but it would mean no help for grad school; no help with first house down payment, etc. I just haven’t found the data that suggests that the full price private tuition differential vs. in-state is worth it, even throwing in the intangibles. I just feel the money could be put to better use after undergrad. Just my gut feel.<br><br>", "<b>Username: ProfessorPlum168</b><br><br>Assuming money isn’t an issue, there might be a few reasons why Vandy might make some sense, most of them reaches:  1) if she’s planning on going into the country music business lol 2) if she aspires to be in high political office 3) if she wants to do a career where the place/reputation of the undergrad degree matters in the long term (I can’t think of any off the top of my head - can think of some in the short term but not in the long term) or 4) if she wants to work in the South.<br>Vandy is a top notched school, my kid really liked the place, the city brought back good memories for him as he won a major national championship there, so happiness is worth some money that’s for sure.  (He didn’t get in though, so it’s a moot point).<br><br>", "<b>Username: BayAreaRecruiter</b><br><br>@LMK5 If your daughter does end up at UCSB, have her consider one of the designated Scholar’s Floors in student housing (usually saved for the Honors students). This might provide an nice community of like-minded students for her. Best wishes!<br><br>", "<b>Username: socaldad2002</b><br><br>@LMK5 I respect that and it’s not like the choice is say Harvard or  UPenn Warton and wanting to get a Finance job on Wall Street.<br>Btw- my doctor BIL also did UCSB premed, MD/PhD at New York Medical School, residency at Columbia University children’s hospital so it can be done. He is now a pediatric anesthesiologist and will pay off his 200k+ medical school loans in 4 or 5 years.<br>My only concern is that many times college students change their career aspirations and undergrad may be the maximum education they obtain before entering the workforce.<br>I know I’m in the minority here at CC but I think 4 years of undergrad is very important in the development of each student (“best fit”) and I don’t take that undergrad college experience lightly.<br><br>", "<b>Username: EV2017</b><br><br>This is a tough one.  If history, especially Civil War history, probably Vandy, since it is the South.  Economics Vandy ranks higher also, but UCSB is pretty strong too.<br><br>", "<b>Username: cptofthehouse</b><br><br>How hard would you have to scrounge, is my question?  We paid full freight for a private college for our youngest, and I often wonder if it was the right choice.  In our case, we made the commitment long before the acceptances came rolling in because, we permitted him to apply ED to a school that gives very little merit money and was a long shot for admissions.  That’s a problem with ED–things happen before the acceptances and choices are on the table, and my son was poised to be perfectly happy with second choice EA school at half the price.  But we had already all made the commitment and kept it.<br>You have the choices right down to the costs in front of you, and it comes down to how important going to Vandy is to you and your DD.  Perhaps offering her the differential in costs as a grad present if she takes the lower cost option can show her what the true difference is in terms of money.  Kids don’t always get that until it’s right in their faces.<br><br>", "<b>Username: anon145</b><br><br>I suspect unless you are a trust fund family, most would suggest for history or economics major save the money and go UCSB.  If gets into Cal that would be worth considering too for those majors, very strong. If honors at UCSB allows early class registration that is great. not sure what honors means at UCSB.<br><br>", "<b>Username: LMK5</b><br><br>@cptofthehouse, Thanks for the honest reply concerning your experience with full pay for private school. For me, my hesitation is based on that large differential better used someplace else, like graduate school, help with a house down payment, etc. I’m concerned about the value proposition. I also have 2 other daughters who will be in college in the fall, so equity/fairness becomes an issue. Of course Vandy could come back with a great package later this week and things may require a closer look.<br><br>", "<b>Username: LMK5</b><br><br>@anon145, UCSB honors does offer priority registration, a “scholars floor” in the dorms, special advising and peer services, etc. It certainly sweetens the pot.<br><br>", "<b>Username: ucbalumnus</b><br><br>From your reply #16, it looks like Vanderbilt is at the very edge of affordability, so that an unexpected extra semester or financial setback (or even higher than typical college cost increases in later years) could push it into the unaffordable range.  That seems risky for both you and the student.<br><br>", "<b>Username: scubadive</b><br><br>UCSB.  The reality is liberal arts majors do not graduate having big incomes.  Employers pay grad A from school c the same as grad B from school d.  In the long run it would be smarter to have that grad school paid or a downpayment on a house.<br><br>", "<b>Username: karlee2510</b><br><br>Honors college at UCSB. The money at Vandy isn’t worth it.<br><br>", "<b>Username: anon145</b><br><br>@LMK5   the key with honors is the priority registration. At state schools that is IMHO the best thing for an honors program.  Some offer it some don’t, some used to offer it but got rid of that part e.g. UNC chapel hill.  The ‘worst’ part of state schools is not getting classes or teachers you want. priority registration gets rid of that.<br><br>", "<b>Username: GoldPenn</b><br><br>Vanderbilt, hands down!<br><br>", "<b>Username: LMK5</b><br><br>Thanks for all the great responses. Seems most here are like-minded.<br><br>", "<b>Username: mamaedefamilia</b><br><br>@LMK5. Another vote for UCSB with honors.  I faced a similar choice back in the day and chose an in-state public honors program for reasons of cost.  It was a great choice. She will encounter similarly smart peers, will have priority registration, and UCSB has a great history department (as does Vanderbilt, but if she sticks with history, she can consider it again for grad school).  And then there’s the beach…<br><br>", "<b>Username: latinart</b><br><br>wow same thing happened to my son accepted Vandy and now ucsb. I have no idea which is better choice for him<br>I am  worried he will have too many distractions at UCSB.On the other hand I will be able to pay his med school bills.<br>Any issues with pre med at UCSB?<br><br>", "<b>Username: hackeysack</b><br><br>I think the whole UCSB as party school / distraction is a bit over rated as a concern.  Its quite competitive to gain admission, the kids who attend there certainly acheived a lot in HS, and most are going to keep it up.<br><br>", "<b>Username: LMK5</b><br><br>I think the decision is dependent on how much aid Vanderbilt gives you. If they give you no aid, then the decision becomes rather easy, no?<br><br>", "<b>Username: CardinalBobcat</b><br><br>Does your child understand that the price of attendance at Vanderbilt (if no substantial financial aid is offered) would be zero money for graduate school or toward a down payment of a first home? If so, leave the decision to your child, and let the chips fall where they may. I strongly suggest not making the choice yourself under these circumstances.<br><br>", "<b>Username: InfoQuestMom</b><br><br>Regarding the distraction factor at UCSB, I’d say it’s very much an individual thing. For one of mine, the concern was merited, very bright student, but time management not a strong suit. I could see, and so could she, how she could easily get carried away. For my other one, not so much, very strong time management skills and she performs better when she is busy.<br><br>", "<b>Username: bluebayou</b><br><br><br>\"\"<br>Regarding the distraction factor at UCSB, I’d say it’s very much an individual thing. For one of mine, the concern was merited, very bright student, but time management not a strong suit. I could see, and so could she, how she could easily get carried away. For my other one, not so much, very strong time management skills and she performs better when she is busy.<br>\"\"<br><br>Exactly.  For those with excellent time management skills, a school with a party rep is win-win:  while many are out at the beach, you are in the library studying, raising that curve.  <br><br>", "<b>Username: cykel24</b><br><br>@LMK5 Vandy’s has been known for generous finaid. In general, your estimated COA should not be that much different from UCs unless you have very high income bracket (&gt; $300k/yr with equity of $500k+). I will be surprised that your earned income is &lt; $200k/yr and COA difference between UCs and Vandy is over $10k/yr.<br>In some cases I’ve seen personally (a family making about $110k/yr), attending Vandy was cheaper than attending UCs.<br><br>", "<b>Username: hackeysack</b><br><br>@InfoQuestMom   I think kids who are prone to dawdling and squandering time will  find a way to do so on any campus.  I went to school in a cold, boring midwestern campus.  I’d sometime spend time I shoud have been studying just randomly picking books up off the stacks in the library and reading a bit of them.  Or I’d watch Jeopardy and Wheel of Fortune on TV.  My son, who also has time managment issues, will read a cereal box or more commonly watch insipid You Tube videos.<br><br>", "<b>Username: hackeysack</b><br><br>@InfoQuestMom<br>If your point is that kids might get involved in too many extra-cirriculars I dont see how UCSB is any worse than other top schools with a huge suite of activities on campus.<br>If its about too much “partying”, I knew lots of kids at my top 25, boring Midwestern campus who drank to excess every day from Thurs to Sat.  Its really the student, not the location that drives a lot of this behavior.<br><br>", "<b>Username: privatebanker</b><br><br>If they cost the same after financial aid, choose what makes the most sense for your student.<br>If the cost is substantially different then you can make an economic judgement.<br>No degree in the same major from schools of this level of excellence will overcome bad math, economically.<br>If you are cost agnostic. Let it fly.<br>If you have to sacrifice a large part of your non college fund savings or incur large student debt co-signed by you, or much larger med school debt than otherwise.  That’s not always the best decision either.<br>Case by case.  Kid by kid.<br><br>", "<b>Username: bloomfield88</b><br><br>@LMK5   Congratulations to your family!  Great school choices.<br>Sounds like you are leaning towards Vanderbilt, but questioning the net cost.<br>Curious to hear how the comparison post-financial aid package works out.<br>Vanderbilt is #1 Great Financial Aid according to the 2019 Princeton Review.<br>So, if you qualify for need-based grants at any college, Vandy may be one of your better bets.<br><br>", "<b>Username: LMK5</b><br><br>@bloomfield88 Thanks for the congrats. As it turned out, both daughters were admitted to Berkeley and one of those had been admitted to Vanderbilt. Unfortunately Vanderbilt offered no aid so Berkeley it had to be, although she was a little disappointed. Then UCLA accepted her off the waitlist so she accepted there and rescinded Berkeley. So it’s one future Bruin and one future Golden Bear. It will wind up costing me less than it would have to send one to Vanderbilt.<br><br>", "<b>Username: Erin_s_Dad</b><br><br>Good result. Congratulations.<br><br>", "<b>Username: bloomfield88</b><br><br>@LMK5  Congratulations!  Sounds like a good, friendly sibling rivalry brewing in the family.  Enjoy!<br><br>"]}