{"title": "help princeton vs usna", "comments": ["<b>Username: C1nj</b><br><br>My son was accepted during SCEA. He also received a 4 year Army ROTC scholarship. He plans to study chemistry, physics, or perhaps chemical engineering.<br>He just learned he also received an appointment to USNA. I realize hard work pays off but we never thought he would have two incredible choices.<br>Princeton will cost more but their will be less of a military commitment. Any thoughts?<br><br>", "<b>Username: carinaec</b><br><br>It depends on what your son prioritizes and will do later in life. I would personally go with Pton, where having that option of doing service and still attending a very prestigious university, would be the ideal scenario. Hope this helps! Regards<br><br>", "<b>Username: Publisher</b><br><br>If you have to ask, then the answer should be clear.<br><br>", "<b>Username: ucbalumnus</b><br><br>How committed is he to being a military officer?<br>If his goal is to be a military officer, Army or Navy/Marines?<br><br>", "<b>Username: moooop</b><br><br>Military service goes a LOT better if you really want to be doing it. There are some amazing rewards, but also some brutal sacrifices.  If you aren’t convinced it’s the place you should be, it will become a burden very quickly.  The most successful military people are those who can’t really imagine themselves in a different lifestyle. It sounds like your son will be going into the military one way or another, so the question is whether he wants to start now or start in 4 years.<br><br>", "<b>Username: happymomof1</b><br><br>Attending the USNA might not necessarily restrict him  to Navy/Marines.  Every year a small number of each academy’s graduates choose to be commissioned in one of the other service branches.<br><br>", "<b>Username: C1nj</b><br><br>Thanks for the advice. He will be attending two admissions events at Princeton in the coming months. Hopefully, he will be able decide what’s best for him. Both options involve a military commitment. One is full immersion. It’s just an odd situation. He had his heart set on attending a service academy until this equally impressive option presented itself.<br><br>", "<b>Username: aquapt</b><br><br>One relevant question is, would your family be able to afford Princeton (after any need-based aid that you’d qualify for) without the ROTC scholarship?<br>Apart from the obviously-very-different experiences at the two schools, a major difference is that if he should have a change of heart about the military within the first two years, he could change his mind about that without having to transfer, at Princeton (if your family could afford your EFC), whereas USNA is all-or-nothing.<br>Both are terrific opportunities - congrats to him on having this tough decision to make!<br><br>", "<b>Username: privatebanker</b><br><br>OP and @aquapt it doesnt quite work like that.  If you have received the 4 year national scholarship you sign a contract. It’s binding.<br>If so, unless you withdraw from the program after freshman year and (not one day into sophomore year) you are obligated to pay back all funds in full or accept an enlistment.<br>Also these scholarships do not cover room and board.  Which is about 16k per year at Princeton. You will also receive 300 per month spending money. Full tuition is paid.  It’s an incredible offer. So cost of Princeton is 64k over 4 years.  Certainly worth it for Princeton but not free like usna.<br>However, if you are really interested in the military, it makes more sense to go to Navy.  You will receive a regular commmision versus reserve.  It doesn’t mean that much, but does carry some weight the higher you climb in your career. Also the Navy has great programs for officers to attend prestigious grad schools including hpys on the government. It’s very common for elite officers.  Anapolis  itself is a special environment and everyone on campus is rowing in the same direction.  Not sure how well the cadets at Princeton feel like the greater whole. Certainly not like an academy.<br>And it’s not like the Navy grad has to look at their shoes when asked about their college. It’s elite in many areas.<br>Hard choice.  Princeton is Princeton. But in this case I would suggest being a midshipman. In the Navy or any branch of service is one of the few places in life that going ug to Princeton isn’t an advantage. Even right out of school.<br>Also didn’t he attend the summer program already at anapolis to be considered.  If he wasn’t sold on that I am not sure what else would.<br>Best of luck.  Sounds like a wonderful kid.<br><br>", "<b>Username: C1nj</b><br><br>He attended the summer program at West Point and attended a Candidate Visit Weekend at USNA. He loved West Point but was medically disqualified.  That’s another thing to consider. If your seriously injured at a service academy you may be discharged and have to transfer to a new college. I appreciate everyone’s input. Hopefully, the best choice for him will become apparent after his Princeton visit.<br><br>", "<b>Username: aquapt</b><br><br>Sorry, I didn’t realize the proverbial “point of no return” was after one year. I seem to remember my ROTC friends saying it was two years back in the day, but then again I am… not young. Thanks for the correction @privatebanker<br><br>", "<b>Username: C1nj</b><br><br>As far as finances are concerned, if he chose to drop out of ROTC we could afford Princeton.<br><br>", "<b>Username: privatebanker</b><br><br>@aquapt its probably different for regular rotc versus the national 4 year scholarship.  We probably are both correct.  It’s all good.<br>Op. Not saying you couldn’t afford it. It’s a value proposition. That’s all.<br>If it’s just one college versus another with the normal aspirations.  Sure Princeton is top of the charts.  I personally think Navy is pretty darn close.  And in the business world just as impressive. Maybe moreso.  It’s says a lot about character and grit on top of the smarts required.<br><br>", "<b>Username: cupugu</b><br><br>I had to make a similar choice  30+ years ago… I chose Princeton Army ROTC scholarship over USMA.   Unless your son is sure he wants to go active duty and is interested in making the the military a career then I would go with ROTC.  My fellow Tiger Battalion cadets all went on to wonderful careers in law, medicine, business, and a few are still on active duty as Colonels and Generals.<br><br>", "<b>Username: ChoatieMom</b><br><br><br>\"\"<br>If your seriously injured at a service academy you may be discharged and have to transfer to a new college.<br>\"\"<br><br>Depends on when the injury or illness occurs and of what type/severity it is.  Each year, the academies allow a few DQ’d cadets or mids to complete their education without commissioning.  Those who are medically separated who are in good academic standing usually have pretty good transfer options.<br>We felt our son had better college options than USM/NA (he was appointed to both), but he never wavered.  It takes a certain kind of kid to make that commitment, we just didn’t think ours was one of them.  I felt better when I learned that he could walk away from either academy with no financial or service obligation right up to the minute he took that final oath the day before classes started junior year.  At that point, we felt he would be making an adult decision informed by two years of experience, but I must admit, I was still kinda hoping…  But, he’s where he belongs and he’s still happy with his decision.  He commissions this May.<br>In his gut, your son probably knows which option is for him.  No one else can make this decision for him.  It’s his and his alone to make.<br><br>", "<b>Username: Hamurtle</b><br><br>The current Chief of Staff of the Army is a Princeton grad and got his commission via ROTC.  And has been nominated as Chairman of the Joint Chiefs of Staff.<br>https://en.wikipedia.org/wiki/Mark_A._Milley<br><br>", "<b>Username: C1nj</b><br><br>I am perfectly fine with whatever decision he chooses. I understand service academy students can leave after their sophomore year but is he going to be accepted to Princeton again?<br><br>", "<b>Username: donnaleighg</b><br><br>This is an anecdote of one but I knew a young man who left the USNA after the two year mark and finished at U of Pennsylvania. I believe he was a regular transfer rather than someone who had been accepted as a freshman. He realized that his love of sailing did not translate into a love of military life.<br><br>", "<b>Username: ChoatieMom</b><br><br><br>\"\"<br>…but is he going to be accepted to Princeton again?<br>\"\"<br><br>Maybe not.  He might have to settle for Harvard or Yale.  <br><br>", "<b>Username: privatebanker</b><br><br>Thank you to the young men and women with the commitment to help keep us free.  Whether that is coming from at Navy Princeton or State U.<br>We need talented young leaders to support the wonderful group of enlisted men and women and Coasties.<br>We hear about all the problems of the current generation.  I don’t buy it.<br>The freedom and luxury that allows us all to debate the merits of school rankings versus other harsh realities in different parts of the world.<br><br>", "<b>Username: Momtogirls</b><br><br>My daughter was in a similar postion last year.  She was accepted to MIT ea, received her nomination to the usna and then her nrotc scholarship.  It was an agonizing 3 months.  Her first choice was always usna, until the pie in the sky MIT acceptance came it.  (Honestly, we assumed she was going to Villanova with a nrotc scholarship.)  When going through the process, she just was curious if she could get in to MIT. She knew both schools were long shots.  After visiting MIT for their big weekend and usna for cvw, it was still tough but, for her the choice became clear.<br>She choose MIT.  The biggest reason was probably the breadth of academic majors.  She is also interested in chemical engineering…the academy does not have that option.  She is loving MIT and her nrotc experience.  She has so many options she is like a kid in a candy store.  (She is also able to do varsity swim there as well as a business club.)<br>It needs to be his decision.  My husband jokes that he may have been the only parent a bit sad about his child choosing MIT.  It’s the right place for her.<br>Note…there are 3 students last spring who had her decision, all three choose MIT.  Also two other students in her high school received nominations to the academy, accepted them and are very happy.<br>Good luck. Have your son contact usna admissions, there are overnights in March and April.  He should be prioritized for one of those.<br><br>", "<b>Username: C1nj</b><br><br>How ironic that you bring up MIT. My son’s classmate was in almost the exact position. He received an appointment to to USNA and was accepted to MIT with a AFROTC scholarship. He chose USNA but still questions rather he made the right choice.<br><br>", "<b>Username: privatebanker</b><br><br>@C1nj    That’s very common. Heck the Governor of Massachusetts ,Charlie Baker just had an article wittten in the Globe about a physiological and sociological exam he recently completed .<br>His biggest regret came up in the answers —- choosing to go to Harvard over Wesleyan.<br>Everyone can second guess.<br><br>", "<b>Username: ChoatieMom</b><br><br>Cadets and midshipmen have very good options for graduate programs while serving.  Our son was sponsored for a Draper fellowship to MIT Lincoln Labs upon graduation, but he was selected to serve in the Cyber Corp at Branch Night in November, and Cyber changed the rules just weeks prior.  It now requires an additional service year (six instead of five), and all Cyber officers must attend graduate school sometime during their service stint but, for our son, not right out of the academy. As of now, it looks like the degree he will complete is at Carnegie Mellon, but that could change.  In any case, our son did not regret passing up his other (better academic) undergraduate options as he would have the opportunity for grad school later on.  His goal was always, first and foremost, to be an Army or Navy officer, and he wanted the 24x7 military immersion and leadership training at an academy.  Different strokes.<br>I will say, though, and I’ve posted elsewhere that, until he was fully into his major, our son found the academics at West Point underwhelming.  The brain trust is there, but cadets (and mids at Navy) sometimes have to seek it out.  The academies’ goal is to get everyone to graduation which is sometimes at odds with the academic experience–and, only about 1/3 of any incoming class is chosen for academic chops as the military values brains and brawn somewhat equally.  However, you can’t beat the academies for small class sizes (sometimes fewer than ten, no more than twenty), direct access to that brain trust, incredible facilities, and hands-on leadership and strategy experience.  From the vantage point of senior year, our son has been challenged immensely both academically and physically and does not feel he passed anything up.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> ChoatieMom:<br>\"\"<br>I will say, though, and I’ve posted elsewhere that, until he was fully into his major, our son found the academics at West Point underwhelming.<br>\"\"<br><br>As an incoming first year cadet, was his high school academic preparation on the high end of academic strength compared to that of other incoming first year cadets?<br><br>", "<b>Username: oldchief78</b><br><br><br>\"\"<br>@C1nj That’s very common. Heck the Governor of Massachusetts ,Charlie Baker just had an article wittten in the Globe about a physiological and sociological exam he recently completed .<br>His biggest regret came up in the answers —- choosing to go to Harvard over Wesleyan.<br>\"\"<br><br>I think that was Hamilton, not Wesleyan.<br>*Gov. Charlie Baker addressed graduating college students at a commencement Sunday, but not in the actual state he governs.<br>Rather, Baker gave the commencement speech for Hamilton College.<br>“I’m sure you’re wondering why the governor of Massachusetts was selected to be your commencement speaker,” he told the students of the small liberal arts school in upstate New York.<br>In 2014, then-candidate Baker was asked by The Boston Globe what was his greatest regret. His response: “Not going to Hamilton College.”*<br>https://www.boston.com/news/education/2017/05/23/charlie-baker-still-regrets-going-to-harvard<br><br>", "<b>Username: C1nj</b><br><br>To be honest with you. My son’s friend at USNA said he was disappointed in the caliber of students at USNA as well.<br>Remember though, they admit students according to the WCS which is 60/30/10 in addition to a nomination and a clear medical history.<br><br>", "<b>Username: bjkmom</b><br><br>My only issue is the nomination part. By pursuing that nomination, some other hopeful was denied the chance to attend the USNA. They’re not unlimited; there are only so many to go around.<br>So it seems to me that no one should apply unless he or she is firm in their desire to attend.<br><br>", "<b>Username: gardenstategal</b><br><br>A friend who is my age, so not a recent grad, found the USNA education to be \"not intellectual \".  That doesn’t mean bad, but that intellectual curiosity was not really encouraged nor valued.  This might matter less in certain fields, but when we were talking about it, his description of the academic experience sounded consistent with an institution that requires conformity and obedience to command to function.   He also noted that a high percentage of classmates dropped out, which suggests that they didn’t fully appreciate what they were getting into or their ability to function in that setting.  He graduated,  did his service,  and left the military.<br>It sounds like you have a great kid and he is committed to the military.   He should definitely think about the kind of academic experience he wants.  Based on the kids I have seen who have gotten into those 2 schools (not enough to know the whole class),  the Princeton admits were much much stronger students.  Those getting into service academies were good students but not at the same level.<br><br>", "<b>Username: C1nj</b><br><br>I was concerned about “stealing” a nomination as well. According to his West Point liaison if my son declines his appointment another student on the slate will receive the appointment. Each congressional slate has 10 nominees for one appointment. My son never waivered on his commitment to attend a service academy until he was accepted to Princeton.  The reality is he never thought he had a chance to be accepted to Princeton.<br><br>", "<b>Username: C1nj</b><br><br>Also, every year competitive candidates receive multiple appointments to different service academies and can choose only one.<br><br>", "<b>Username: crankyoldman</b><br><br>Has your son explored the very, very different experiences of serving as an Army officer v. serving as a Navy officer?  The services have very different missions, and offer very different opportunities/responsibilities.<br><br>", "<b>Username: C1nj</b><br><br>He attended admissions events at USNA, USCGA, and West Point. He spoke at length with his uncle who is a deployed Navy Officer, my best friend who attended USNA and just retired from the Navy, and a family member who went to West Point and also served in the Air National Guard. He also spoke to a Navy Chaplain, an Army General and three midshipmen from our area attending USNA.<br><br>", "<b>Username: ChoatieMom</b><br><br><br>\"\"<br>To be honest with you. My son’s friend at USNA said he was disappointed in the caliber of students at USNA as well.<br>\"\"<br><br><br>\"\"<br>A friend who is my age, so not a recent grad, found the USNA education to be \"not intellectual \".<br>\"\"<br><br>I have posted previously that the rubric used to determine academy appointments, by design, does not value academics the same way civilian colleges weight them.  Evaluating the academies against civilian universities is an apples to oranges comparison. The SAs value a combination of brains, brawn, and leadership–as they must. When our son discussed the general academic rigor at West Point with his department head, the LTC explained to him that only about one third of the incoming class is selected for academics; the other 2/3rds are chosen for other equally shiny traits. All are academically capable, all pass the academic bar, but only that third is what you might label “scholarly.” Our son has learned to value those other critical equally shiny traits in his band of brothers very highly. The corps needs a balance of all of them in a way civilian colleges do not as their missions differ vastly.  The Army puts it this way (as inscribed in stone at West Point):<br>The society that separates its scholars from its warriors will have its thinking done by cowards and its fighting done by fools. -Thucydides-<br>The service academies are looking to produce capable officers for each branch of our armed services. It takes a certain kind of kid to go this route, and those kids don’t always look like the applicants to the usual civilian suspects.  If academics rather than service is the main concern of any applicant’s college evaluation, then the SAs probably aren’t for them, not because that applicant can’t be academically satisfied (s/he can) but because getting through a SA and the years of service that follow takes a gut commitment to something else.<br>(And, yes, @ucbalumnus, our son’s high school academic preparation was “on the high end of academic strength compared to that of other incoming first year cadets,” so he is one of those students considered scholarly and is one of a pool of cadets who can assure others like the OP’s son that they will find their intellectual peers at an academy.)<br><br>\"\"<br>By pursuing that nomination, some other hopeful was denied the chance to attend the USNA.<br>\"\"<br><br>As with any college, each accepted/nominated student has earned the right to determine whether to accept or reject that admission/nomination but, as pointed out upthread, no congressional nominations go unused, they continue to fall down each congressional slate until all slots are filled.  Appointments work in a similar way.<br><br>", "<b>Username: C1nj</b><br><br>One thing I failed to mention is that he required a medical waiver. USMA, USAFA, and AFROTC declined to issue him a medical waiver. USCGA is still pending and AROTC and USNA issued him a waiver. I don’t think he will have a problem at the academy but if his issue ever resurfaces he could be discharged. When we started this process the normal military recruiters at the high school said he didn’t have much of a chance receiving a waiver.<br>I guess this boils down to a bird-in-hand situation vs a leap of faith.<br>His appointment showed up in his portal today. I promise it’s his decision but it’s hard not living vicariously through him. I wanted to serve at his age. I tried joining the Coast Guard Reserve but they wouldn’t accept me!<br><br>", "<b>Username: ucbalumnus</b><br><br>QUOTE=ChoatieMom<br>[/QUOTE]<br>Since the first and part of the second year at the USMA is core curriculum, could his less satisfying academic experience then (before getting into his major) have been due to the core curriculum having to be suitable for incoming cadets with a wide range of high school academic preparation?  I.e. if he was an outlier at the top end of high school academic preparation, he may have found the core curriculum aimed at the average (for the USMA) incoming cadets to be too low level.  Of course, that could also mean that outliers at the bottom end of high school academic preparation would find the core curriculum too difficult.<br>At other colleges, being an outlier in high school academic preparation may be less of an issue, due to a wider range of first year options in terms of academic rigor.<br><br>", "<b>Username: bopper</b><br><br><br>\"\"<br>Apart from the obviously-very-different experiences at the two schools, a major difference is that if he should have a change of heart about the military within the first two years, he could change his mind about that without having to transfer, at Princeton (if your family could afford your EFC), whereas USNA is all-or-nothing.<br>\"\"<br><br>Not sure what you mean by all or nothing…after two years at USNA you have the decision to commit or leave. You are allowed to leave with no further monetary obligations at that point. If you commit you have to serve for 5 years.   If you commit, and don’t graduate, you are responsible for service or paying back the tuition/room/board.<br>For NROTC you have a 5 year commitment as well if you take the scholarship.<br>https://www.nrotc.navy.mil/military_requirements.html<br>Understand in both cases what the obligations are if you don’t finish school. Understand what the obligations are if you do finish school.<br><br>", "<b>Username: crankyoldman</b><br><br>It’s a good thing he has attended those events/spoken with those individuals, but it’s also a personal thing.  There’s a big difference between being stationed at Ft Huachuca or serving in a destroyer in the North Atlantic in January.<br>And I’d suggest reviewing the provisions of the service academy waiver carefully.  I know a person who enlisted in the military with a waiver, was sent to language school in CA, then after 8 months medically discharged.  The person didn’t want to leave, told me the medical condition hadn’t changed, but that a decision had been made that his type of language specialist was no longer needed so was discharged; claimed it was all budgetary.  And I attended a medical school student welcoming ceremony where several applicants who applied for and very much wanted the military medical scholarships were initially granted waivers and then those waivers were pulled at the last minute(thereby cancelling those scholarships).  One parent told me that the waiver was for well-controlled seasonal allergies(hay fever) and the student was floored(and left scrambling for private loans) a short time school began.  Admittedly, this is all anecdotal information.  The concern is arbitrary application of standards after the fact.<br>But it’s my understanding that if a person is granted a medical waiver for ROTC and then is discharged for medical reasons, there is no service obligation and no obligation to pay the scholarship back.  Is that correct?  If so, perhaps Princeton is the better bet.<br><br>", "<b>Username: bopper</b><br><br>Also get input from the serviceacademyforums dot com.  It will probably be more pro-USNA, but you can get input there.<br><br>", "<b>Username: bopper</b><br><br>Would be prefer: \"mainly college with a little military thrown in” vs. “mainly military with a little college thrown in”<br><br>", "<b>Username: C1nj</b><br><br>I have posted this on Service Academy Forums as well. You assumption is correct regarding USNA. The majority of the posters can’t believe you would even consider going anywhere but USNA.<br>This is exactly what I hoped for when I posted this on College Confidential. Everyone is much more objective. I really appreciate your help.<br><br>", "<b>Username: ChoatieMom</b><br><br><br>\"\"<br>Since the first and part of the second year at the USMA is core curriculum, could his less satisfying academic experience then (before getting into his major) have been due to the core curriculum having to be suitable for incoming cadets with a wide range of high school academic preparation?<br>\"\"<br><br>No, he validated every Plebe course possible.  The academies administer assessment tests prior to the start of the academic year and do not waste anyone’s time repeating material or forcing them to suffer below ability level.  That serves no one. At West Point, cadets must declare their majors at the end of Plebe year and start their major curriculum sophomore year.<br><br>", "<b>Username: C1nj</b><br><br>If I show him “Top Gun” on April 30th this may be easy.<br><br>", "<b>Username: moooop</b><br><br>“His biggest regret…choosing Harvard over Wesleyan.”<br>Some Harvard grads are amazingly resourceful when it comes to bringing up the fact that they went to Harvard.<br><br>", "<b>Username: privatebanker</b><br><br>“You can always tell a Harvard grad<br>You just can’t tell them much. “<br>Old joke around Boston…<br><br>", "<b>Username: circuitrider</b><br><br>“If graduating from Wesleyan is your biggest achievement in life, then we’ve failed you.”<br>Often heard around Middletown…<br><br>", "<b>Username: onthewestfence</b><br><br>USNA if he wants to be career military. Otherwise, Princeton/ROTC gives the best of both worlds and allows an out if he doesn’t particularly care to pursue becoming a commissioned officer and not have to transfer. Leaning more towards Tigers.<br><br>", "<b>Username: C1nj</b><br><br>He went to Tiger Tuesday this week.<br>He really was impressed by Princeton. He found the students kind and down to earth. He went to a class and didn’t feel intimidated and liked how the professor knew everyone’s name.<br>He ate lunch and became friendly with a group of other future students. One kid was in the same situation he was in. USNA or Princeton ROTC. He told my son that Princeton became his first choice after Tiger Tuesday.<br><br>", "<b>Username: C1nj</b><br><br>So I know it’s been nearly two months since my last post. Unfortunately, we are still in the same situation.<br>My son just returned from Princeton Preview and had a great time. I thought he was going to come home and press the accept button but he said he still isn’t sure.<br>I must be doing something wrong. The more I expose him to Princeton the more he likes it but the same is true for USNA. The scholar in him is attracted to Princeton while the future officer in him is attracted to USNA.<br>One thing I have found interesting is that most military officers (current and retired) and most service academy graduates (including USNA grads) tell him to pursue Princeton.<br>Meanwhile, most non-military people are partial to the Naval Academy. Especially conservative ones.<br>While he was at Princeton he asked the current ROTC students whether they also had to decide between Princeton ROTC and a service academy appointment. Nearly all of them said yes. I guess we know what they chose!<br>Anyway, I know this thread is old and I might be talking to myself but that’s where we stand.<br><br>", "<b>Username: bamamom2021</b><br><br>Thanks for the update. I am following your son’s journey and wish you the best.  Please update us once his final decision is made.<br><br>", "<b>Username: STF4717</b><br><br>Admittedly I didn’t read through all 4 pages - but wanted to offer my two cents.  The “boat school” is an uncollege.  First year is going to be rough.  It won’t be a typical college experience.  Is that what he wants?  If he isn’t sure, he needs to choose Princeton.<br>If he doesn’t mind sacrificing the typical college experience, what he will gain at USNA is beyond compare.  Suggest you hope on over to www.serviceacademyforums.com and read up over there.<br>Best of luck!<br><br>", "<b>Username: aquapt</b><br><br>Tough decision. I agree that uncertainly should default to Princeton… but it sounds as if he just needs to think it through. I hope it doesn’t come down to the wire on May 1st, for your sake!<br><br>", "<b>Username: C1nj</b><br><br>Service Academy Forums has been a great help.<br>However, CC users are much more impartial with ROTC/SA issues.<br><br>", "<b>Username: privatebanker</b><br><br>You probably should tell him you prefer usna and he will switch to Princeton. The old double reverse. Lol.<br>But you do have to remember that it’s his life and we can’t live our lives vicariously through them.  Make sure it’s not you who prefers Princeton. I had that problem myself and had to stop coaching my child to the decision.  Info and love.<br><br>", "<b>Username: BronxBaby</b><br><br>There is a service academy forum website if you google. Lots of info there and maybe some new perspective.<br><br>", "<b>Username: BronxBaby</b><br><br>https://www.serviceacademyforums.com/index.php<br>Didn’t realize I could link!<br><br>", "<b>Username: ChoatieMom</b><br><br>The OP is already a consumer of the SA forum, but she is correct that the herd over there is less impartial than the crowd here.<br>Lots of good thoughts have been posted so far, but I do scratch my head a bit over this indecision lasting months when the two choices could not be more different.  Both lead to a commission if that’s the main goal, but the college experiences are worlds apart, and I can’t imagine anyone drawn to one being equally drawn to the other.    @STF4717’s comment about USNA (any academy) being “uncollege” is an apt description.  Navy even sells tee-shirts that say “NOT College.”<br>Personally, other than cost, I don’t see the attraction to the academies.  If officership is the goal, the ROTC programs get the same job done with much less pain and a better college experience. And even the current and former officers who moderate over on the SA forums admit and have posted links to data showing that academy grads in this century no longer have any military career advantage over ROTC officers.  And, of course, former USNA professor Bruce Fleming has been vocal in his opinion of the academies for years:<br>https://www.nytimes.com/2010/05/21/opinion/21fleming.html?emc=eta1<br>@C1nj:  The “future officer” in your son will end up with a commission from either source, but he needs to decide if he wants 24x7 military immersion while earning it or a normal college experience.  Both can provide him the academic and intellectual challenge he seeks though he may need to find his peers initially and advocate for himself among the faculty brain trust at USNA.  But don’t be misled — USNA absolutely can deliver on the intellectual front.<br>As others, including me, have said upthread, if your son truly is still conflicted, he can try USNA commitment-free for two years and still have Ivy transfer prospects, assuming he retains top academic status amid the relentless physical and military requirements at the academy.  If he stays and graduates in the top half of his class, he will also have fine prospects for a top-notch grad program also at government expense.<br>TLDR:  Your son really can’t go wrong either way.  He will be intellectually satisfied and a Naval officer regardless of his choice.  He just needs to decide which college experience he prefers.<br><br>", "<b>Username: C1nj</b><br><br>I believe a portion of his indecision stems from the amount of work it took to receive his USNA appointment.<br>So many interviews, medical tests, medical waivers, physical fitness exams, essays, recommendations etc.<br>Applying to an Ivy was relatively easy in comparison. With that being said, I do realize the acceptance rate is even lower at many Ivies including Princeton.<br>In addition, his older classmates at his high school were in a similar situation. One had to choose between Princeton, MIT and USNA and another between MIT and USNA. They both chose USNA. This may be muddying the waters as well.<br>@ChoatieMom You are correct. He should of come to some conclusion by now. I believe the underlying issue is he really isn’t sure where he wants to be in 10 years. He wants to do something exciting but he really isn’t interested in a career in the military.<br>Once again, thank you everyone for your input. It is very helpful.<br><br>", "<b>Username: SailingMomof2</b><br><br>“He wants to do something exciting but he really isn’t interested in a career in the military.” I think here is your answer right off the bat.<br><br>", "<b>Username: C1nj</b><br><br>@SailingMomof2 You may be correct.<br>I think he sees himself serving 4-5 years active duty or long term in the National Guard or Reserves. He feels he has an obligation to serve his country. He doesn’t want to do a 20-30 year active duty career.<br>The choice actually is between Army ROTC and USNA. Army ROTC does have some great advantages. You can choose any major and you have the option between active duty, reserves, or National Guard.<br>USNA is a 5 year active duty commitment but the Navy has fighter jets and romantic travel. Remember, we are still dealing with an 18 year old.<br>He lost his Air Force ROTC scholarship due to a medical disqualification. I think that would of sealed the deal for Princeton. He can probably try for a Navy ROTC scholarship next year if he attends Princeton. He ran out of time this cycle applying to all the academies.<br>It is alot of moving parts.<br>Like @ChoatieMom said, none of this really matters he has the opportunity to be successful with either option.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> C1nj:<br>\"\"<br>He lost his Air Force ROTC scholarship due to a medical disqualification. I think that would of sealed the deal for Princeton. He can probably try for a Navy ROTC scholarship next year if he attends Princeton. He ran out of time this cycle applying to all the academies.<br>\"\"<br><br>Would the medical issue be a problem in the USNA, Navy ROTC, or service in the Navy?<br><br>", "<b>Username: ChoatieMom</b><br><br><br>\"\"<br>He wants to do something exciting but he really isn’t interested in a career in the military.<br>\"\"<br><br>@SailingMomof2 is correct:  There’s his answer.  If this is truly the case, he should opt for Princeton without ROTC and consider OCS if he still wants to serve post grad.  If his heart isn’t pining for a commission then, he’s gotten a fine undergraduate education with no military commitment, and he can get on with his life.<br>I will also add that if he isn’t interested in a military career, one thing the academy route WILL do is prove that rather quickly — and painfully.  He should not underestimate the scathing difficulty of Plebe year from the military perspective.  He will be stretched to his physical and emotional limits only to be built back up very slowly (and, again, painfully) over the remaining three years; that’s the program at all of the academies as these new officers are being trained to lead and make decisions under extreme pressure.  He will need a strong commitment to the end goal to sustain him through the brutality.  Plebe year is a weed-out exercise, and attrition is high at all of the academies as each mid’s/cadet’s motives and internal strength are put to the test.  That’s why I emphasized choosing the college experience over any other factors first.<br>I also think that no discussion of choosing to attend a service academy can skirt the fundamental fact that the purpose of these schools is to prepare officers for war.  They are not just “different” college choices.  They are schools of warfare and their main mission is not academics.  Our world is not getting any safer.  More and more officers are going to be needed to carry out our country’s decisions.  To this end, USMA branched 81% of the class of 2019 into combat arms.  You can be certain that 81% of the class did not select a combat arms branch as a first choice.  Though mids and cadets may be able to select their majors, they serve at the needs of the military, and the military ultimately controls in which area they will serve. It was enlightening to our son to find out that undergraduate major is only a consideration for a handful of branches.  It was also enlightening to find that the various branches (Army has 17) have various service commitments; five is the minimum.  In our son’s case, he went into USMA thinking he’d five-and-dive, but the branch he was selected for had a longer service commitment, and he was also selected for grad school, so the Army will own him for the next nine years.  He’s fine with that because his goals align with the Army’s choices for him, but this lack of autonomy cannot be overlooked.  (FWIW, he’s also at the top of his class.  Class rank, of which academics is only one factor, does not equal autonomy.)<br>I wish your son well, @C1nj.  I’m sure he is a fine young man who would make a fine officer, but he needs to decide where his heart lies.<br><br>", "<b>Username: ChoatieMom</b><br><br><br><br><br> @ucbalumnus:<br>\"\"<br>Would the medical issue be a problem in the USNA, Navy ROTC, or service in the Navy?<br>\"\"<br><br>@C1nj posted upthread that USNA issued a waiver for his condition, so the Navy has determined it is not an issue for Navy service.<br><br>", "<b>Username: C1nj</b><br><br>He received a medical waiver.<br>However, if his condition resurfaced he could be forced out. I don’t think this is likely but you never know.<br>If it resurfaced at Princeton, he could be separated from Army ROTC, but at least he still would be at Princeton and we could afford the tuition.<br><br>", "<b>Username: C1nj</b><br><br>“opt for Princeton without ROTC and consider OCS if he still wants to serve post grad”<br>It’s ironic that you said that @ChoatieMom. Three students on SAF are in the same situation as my son.<br>They have decided to forgo the ROTC scholarship, partly due to Princeton’s generous financial aid, and pursue OCS after graduation.<br>It’s a great idea but I doubt my son would go along. Plus he still can try ROTC for one year without any obligation.<br><br>", "<b>Username: PtonAlumnus</b><br><br>It sounds as if your son would like to be a pilot.  If he becomes a pilot then realistically he will stay in for 20 years.  The AF and Navy require about a 12 year commitment for pilots.  The retirement pay at 20 years is too good to pass up.  If he is a pilot for 20 years then becoming a commercial air line pilot becomes very attractive.<br>If he want a military career there are significant advantages to the service academy.  You may need medical counsel to make an informed decision on the probability that his medical condition will resurface and disqualify him for military service.  If he wants a career as an engineer then Princeton will be better preparation.  As @Hamurtle posted earlier General Mark A. Milley has been nominated  to serve as the chairman of the Joint Chiefs of Staff.  Princeton does not preclude a long and successful military career.<br>Applying for OCS is not a sure thing.  If your son wants multiple options AROTC at Princeton will provide that opportunity.  At the end of his freshman year he can be dedicated to a short military career or find out that the military is not for him.  At the end of his commitment he can stay in the military.  We have multiple members of our family that have served in the military; they all complain bitterly but are proud of their service.  Some like the military; some do not.<br><br>", "<b>Username: bopper</b><br><br>@C1nj  And the final answer is??<br><br>", "<b>Username: OneMoreKid</b><br><br>Without reading through everything - we had a Princeton grad superstar in my Marine Corps OCS platoon as well as several Navy Academy grads in the next 6 months of training.  All were about as good as it gets.  Either answer would work remarkably well.  There was mention about flight and that’s never a guarantee.  Some of my friends that went that route got out after their initial commitment and don’t fly anymore.  Some that were offered flight training ended up being dropped for one reason or another.  One can accomplish the same goals regardless of where they went for undergrad.  It’s probably more about the desired undergrad experience than what would come after.<br>That would be a heck of a choice if you have it.<br><br>", "<b>Username: C1nj</b><br><br>My son ended up choosing Princeton AROTC.  He started by accepting Princeton on the night of April 29th but he actually took till May 1st to decline his USNA appointment.<br>It was the hardest decision he ever had to make. He stared at his USNA portal for hours.<br>Since then he hasn’t looked back. I haven’t heard him say he regretted his decision and he seems really excited about Princeton. In fact, he is applying to Bridge Year.<br>A letter was also sent to the Senator who appointed him to USNA. My son thanked him for the appointment and explained why he declined it.<br>Unless you go through the process, most people have no idea how much work is involved in securing an appointment to a service academy. There are physical fitness tests, medical tests, countless essays, congressional interviews, strict timelines and summer camps.  It takes an incredible amount of perseverance.<br>It may not be easier getting into an Ivy but it’s definitely a lot less work.<br>I want to thank everyone for offering their advice.<br><br>", "<b>Username: privatebanker</b><br><br>Good luck. Hope it all works out great for him !<br>I wonder if the senator was left scratching his head though. Does the appointment for your state go to waste?<br>I’m sure there talented kids right behind him who would have given their right arm for the opportunity.<br>Do they have a waitlist by state ?<br>That would be such a shame if they don’t,  too bad he couldn’t have known a bit earlier.  Of course it was his choice to use he wished obviously.<br>When I went though OCS.at quantico.   We had one student from Harvard who had to NPQ. He wasn’t impressive at all.  But half the class npq’d for one reason or another. We were a pretty smallish group by the end of summer.<br>Flagships and others of the type were the most common. If you had a flight contract then they were actually trying to get people to switch to a ground contract.  My rack mate was from Durango co. And a Native American. I had never personally  met with anyone from co until then. My other friend was from St. Cloud state in minn.  I had never been on a plane before then.  Lol. Find memories. I loved all of it.   Except air conditioned lecture halls, I couldn’t stay awake.<br><br>", "<b>Username: aquapt</b><br><br>@privatebanker , it isn’t that much of a zero sum game https://www.usna.edu/Admissions/Apply/US-Senators-Representatives-and-Delegates.php  There are indeed alternates to fill his spot.<br>@C1nj , glad to hear that your son seems to have peace of mind about a very tough decision. He made the choice I was rooting for, but of course there were good arguments for both. It definitely had to be hard to let the USNA appointment go after all that work. Good luck to him with the Bridge Year application, and congrats on a job well done!<br><br>", "<b>Username: C1nj</b><br><br>@privatebanker I understand what you are saying.<br>However, Princeton Preview with ROTC as the host, wasn’t until April 15th.<br>He also toured a naval ship, flew in a helicopter, spoke to an active duty submarine officer and pilot, watched 10 hours of “Carrier” and met with an Army NG officer during Easter break.<br>Ironically, I found 3 other appointees in the same situation and they all chose Princeton.<br>What is morally wrong are the candidates who accept their appointments and never report to Induction Day.<br>The candidates on the waiting list never get a chance.<br><br>", "<b>Username: privatebanker</b><br><br>That’s awesome. If there is a waitlist is all I was asking.  It’s such a hard process I had no idea how this was handled.  I was. PLC program and non academy guy myself.<br>It’s think it’s a great option your son has and Princeton is special. And my wife 100 percent agrees with you. Go into military after and try different things in college and academies are really tough.<br>Perhaps I’ve always had a special kind of respect and awe if the academies.  Especially Annapolis. It’s just a different deal to me.and  as a son if ww Ii naval officer the stories get embedded.  He always felt the the ring knockers not only had a lifetime connection but were slotted for success in the service and industry equally.<br><br>", "<b>Username: ChoatieMom</b><br><br><br>\"\"<br>What is morally wrong are the candidates who accept their appointments and never report to Induction Day. The candidates on the waiting list never get a chance.<br>\"\"<br><br>The academies account for no-shows in their yield formulas.  Just like other colleges, one candidate who does not report does not translate to someone in the National Wait List (NWL) pool who doesn’t get a call.  Let’s say USNA needs an incoming class of 1,300 to eventually commission 1,000 officers four years later (both USNA and USMA expect to lose about 300 mids/cadets between I/R-Day and graduation) and sends out 1,500 offers of appointment to yield that 1,300.  The academy is not underenrolled until the 201st candidate declines or fails to show, and they’ve padded enough to never be in that position prior to the start of the Plebe academic year.  In addition to no-shows, the padding accounts for fall-outs during Plebe summer, academic, honor, and medical separations over the four years, and attrition due to those who decide not to take the oath and commit prior to the start of junior year.  So, there’s no need to be concerned that anyone in the NWL pool was cheated by a handful of appointees who don’t show up for I-Day; the candidates in that pool didn’t even make the initial padded list.  No one is just one turn-down or no-show away.<br>That said, a handful of candidates do get pulled from the NWL each year, but not due to no-shows.<br>Congrats to your son, @c1nj.  That decision  seemed like a no-brainer to me.<br><br>"]}