{"title": "grinnell vs bates", "comments": ["<b>Username: wyorafter</b><br><br>My daughter just got off the wait list at Bates after sending her deposit to Grinnell. Bates has given her a couple of days to commit/decide. Grinnell’s admission includes about a 50% off tuition scholarship. I doubt Bates will offer anything, because, well, NESCAC. That aside, anybody want to weigh in on this choice? We’re prepared to pay if it’s really her choice. She won’t thrive in an ultra-competitive environment. Wants to major in psychology. Runs XC though not a rock star. Loves outdoors, skiing,etc (I know Bates wins that one…) From Rocky Mountain West.<br><br>", "<b>Username: Aspiringacademic</b><br><br>I personally think Grinnell is a better school. It’s not uber-competitive, but it’s known for its academic rigor, research opportunities afforded to undergraduates, and fantastic science programs. It also has a massive endowment which provides lots of opportunities for students; bates has, comparatively, always had a problem with raising a sufficient endowment. Given that Grinnell is offering her money, I think it’s a no brainer. If she wants to do outdoorsy and skiing stuff, she can always take a year abroad in Switzerland! I think Grinnell is fairly good with study abroad stuff.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Agreed, Grinnell with money would be a “no brainer” in our house. Fantastic research resources, collaborative student body, lots of different types of kids, not homogenous.<br><br>", "<b>Username: privatebanker</b><br><br>I could see choosing Bates under many circumstances.<br>However your description of your daughter’s preferences seems to point to Grinnell. Skiing wouldn’t be a day trip like Maine but Grinnell  isn’t going to be confused with an urban environment anytime soon. Lol.<br>It’s a great school and seems to produce a lot of successful and varied graduates.<br><br>", "<b>Username: Aug2019</b><br><br>If your D had gotten into both schools initially - did she have a clear favorite then? Just curious if her feelings have changed because if the circumstances of her acceptances to both.<br><br>", "<b>Username: Lindagaf</b><br><br>I love Bates and my daughter attends, but I would have sent her to Grinnell in a heartbeat for 50% off tuition. Grinnell is a great school.<br>OTOH, if you really don’t mind paying the extra money, she won’t regret choosing Bates. IMO, Bates is very hot right now (acceptance rate this year was just below 12%) and it’s East Coast location makes it easy for students to find internships, research positions, and jobs. Your D has great choices, best of luck.<br>ETA: Bates is not competitive. Psych is excellent.<br><br>", "<b>Username: EganAg</b><br><br>Per student, Grinnell has more resources and expenditure than Bates. Faculty is extremely committed. Very well respected in the Midwest and a lot of kids end up with great internships and<br>jobs in the Chicago area.<br><br>", "<b>Username: doschicos</b><br><br>Bates wins on location but I’d choose Grinnell given your family’s circumstances. Bates doesn’t give merit aid so unless you qualify for FA, you’re not going to get a tuition break.<br>1/2 price Grinnell over Bates would be my choice. That tuition savings would buy a lot of ski trips. <br><br>", "<b>Username: Mom24boys</b><br><br>Another vote for Grinnell.  My son will be graduating this month from Grinnell with a double major in psychology and economics.  He was able to study abroad and do psych research.  He has been amditted to a fully funded PhD with a stipend.<br><br>", "<b>Username: Aug2019</b><br><br>Congratulations on that @mom24boys!<br><br>", "<b>Username: gardenstategal</b><br><br>I love all the Maine schools but here’s another vote for Grinnell with your circumstances.   They are on a par with each other in pretty much every aspect  but one costs half as much?  No-brainer.<br><br>", "<b>Username: Sue22</b><br><br>I love Bates but I agree with the others. Unless there’s a very compelling reason to choose Bates the $100,000 she’d save by going to Grinnell would make the decision in my book.<br><br>", "<b>Username: mamom</b><br><br>As @doschicos mentioned the money you save going to Grinnell can buy some very nice ski trips.  Both great choices but I would stick with Grinnell.<br><br>", "<b>Username: prodesse</b><br><br>Next year Grinnell will have an added bonus - being in Iowa, where all the major presidential candidates will be coming through!<br><br>", "<b>Username: Publisher</b><br><br>This is an easy, clear-cut decision based on OP’s original post in this thread. There is nothing to indicate that Bates should be chosen. Grinnell College is the better choice. Why pay more for less ? (For example, Grinnell College is higher ranked than Bates & Grinnell College has a much larger endowment than Bates.)<br><br>", "<b>Username: homerdog</b><br><br>I love Grinnell and our son also received the 1/2 off tuition scholarship but has chosen to go to Bowdoin full-price. Has your D visited both schools? Grinnell is warm and inviting but S felt the kids leaned a little more nerdy (in a good way though!) than some of his other choices. I guess it depends on your financial situation and if your D really felt a connection when visiting each school. Grinnell seemed like it should have been the clear winner for us, $100k less over four years, the only school on his list within a 4 hour drive, and a really incredible school in so many ways. He just wasn’t feeling it and, after  visiting Bowdoin, felt very strongly that he found his college home. He even arranged to stay an extra night on campus because he wanted to stay longer. If your D did not have a very strong preference for Bates, I would definitely stick with Grinnell.<br><br>", "<b>Username: Publisher</b><br><br>@homerdog: I think that there are some notable differences between Bates College & Bowdoin College. This seems to be reflected by the number of applications each of these schools receive even though both schools have about 1800 students.<br>Apps received for the same year: Bates College received 5,316 while Bowdoin College received 7,251 during the same application cycle–over 36% more applications.<br>Bowdoin College has a superior location.<br>@homerdog: If the decision was between Bates College full pay & Grinnell College with a 50% scholarship, what would be your family’s choice ?<br><br>", "<b>Username: homerdog</b><br><br>@Publisher We never visited Bates so I can’t say for sure but my gut says Grinnell. He could have found his people for sure. If S19’s revisit to Bowdoin didn’t make it crystal clear that it was the place for him, Grinnell would have stayed in the running…but my husband went on that trip with him and saw first hand how Bowdoin was a really great fit for S19. He accompanied him to both Grinnell and Bowdoin and so was able to compare. That’s why I was asking the OP if his D has visited both schools.<br><br>", "<b>Username: privatebanker</b><br><br>Grinell. However the candidates coming through Iowa wouldn’t be on my list for reasons to attend. lol.<br><br>", "<b>Username: homerdog</b><br><br>I know but my point was that visiting is what can make the call on whether to choose one school or another. And one of our schools in contention at the end was Grinnell. Bates and Grinnell are comparable academically so really the only way to make a decision is to be on campus and access the fit. I used our experience as an example.<br><br>", "<b>Username: EganAg</b><br><br>I think rankings, resources, endowment wise, Grinnell is better than Bates; just sheer numbers.  And then for half the price?<br>One other difference that we remember from our visit to Bates is that they work on a 4-4-1 schedule.  Does that matter to OP’s D?  Unless there is something unique like that that is attractive, I think Grinnell wins here.<br><br>", "<b>Username: Publisher</b><br><br>I find the 4-4-1 schedule confusing.<br>Many colleges located in rural or semi-rural cold weather locations used to have a 4-1-4 academic schedule in which the month of January was a separate term during which students took just one course that met 5 days a week or was used for study abroad.<br>In the context of this thread, I view the 4-4-1 schedule as a negative for Bates College as May should be quite pleasant in Lewiston, Maine while January calls for some marine science study in the Florida Keys or a month in Colorado studying the physics involved in downhill skiing or learning to speak French to French girls in France or Montreal.<br>However, if the month of May was used to get a head start at an internship, working for course credit rather than for money, then that makes the 4-4-1 schedule look attractive.<br><br>", "<b>Username: doschicos</b><br><br>Many stay on campus for the 1/May and take interesting, fun classes. I think most Bates students would tell you they love the 4-4-1 schedule and definitely don’t see it as a negative.<br><br>", "<b>Username: gardenstategal</b><br><br>@homerdog , Bates and Grinnell are much closer culturally than Grinnell and Bowdoin.<br><br>", "<b>Username: crankyoldman</b><br><br>That’s a lot of money to walk away from-but let me ask-does your daughter want to run XC in college? Is that a factor in her decision-making? Don’t know about Grinnell, but Bates has an established womens XC team, D3, in a competitive league.<br><br>", "<b>Username: Trixy34</b><br><br>I’m kind of wishing Grinnell were on our list right about now.  But my mother keeps saying, “he wouldn’t have been happy all the way out in Iowa”  (She actually went to college near there and taught school for a year not too far from Grinnell, so it’s not a dig at Iowa, just her opinion that my kid would not be happy in a rural location so far from home and family )<br>So, @wyorafter, if your daughter has no problem spending 4 years in the middle of Iowa, then go Grinnell.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Bates is a lovely school, but Grinnell has dramatically superior resources which contribute to all kinds of positives for student life, from the facilities, to funded internship programs, to guest speakers, performers etc. I haven’t checked in the last year or so, but Grinnell’s endowment is over $1.5  billion and Bates was around $300 million. Plus, Grinnell has a diverse student body and fantastic academics. In my house, I could not imagine paying more for Bates. Grinnell, Iowa is, to my mind at least (your mileage may vary) a charming midwest town 2-3 blocks from campus with all the necessaries for college life – pizza, bike shop, doughnut shop, great grocery store with extensive organic offerings. Both my kids loved Grinnell, we must have visited 6+ times between the two of them, and my LAC kid did visit Bates twice so we have some basis for comparison.<br><br>", "<b>Username: Publisher</b><br><br>You had me at \" pizza & doughnut shop\".<br><br>", "<b>Username: wyorafter</b><br><br>Funny, Bowdoin was her first choice. After being deferred in ED, she was rejected. She’s also wait-listed at Carleton, Colby, Middlebury and Dartmouth, which, I cannot lie, is fogging up this decision. I would say of her five wait-lists, Bates was probably her fifth choice (among five very strong choices…) But as of now, only Bates has come calling. She has visited all the campuses.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>@publisher, apologies for my imprecise phrasing. Pizza shop, doughnut shop etc. . . . though a combination sounds too perfect.<br>Maybe I’ve been living in the midwest too long, but Grinnell, the town, has charm  – 2 story brick buildings, retail on the ground floor, often apartments on the second floor. There is an actual movie theater which plays new releases. There is a community band shell in the park where there are summer concerts (our first visit was in the summer). The grocery store – 3 blocks from campus – is fabulous, lots of organic, all natural, and imported products (not that the students are picking up European treats). The few mile stretch from the interstate into town itself is disheartening – a large John Deere distributorship, a mid-range hotel, and a Walmart and not much else. But once you swing onto the actual town streets, it is quite lovely.<br><br>", "<b>Username: homerdog</b><br><br>@wyorafter wow. That’s a lot of waitlists. Did she take spots at all of those? I think it’s really hard to deal with a multiple waitlist situation. What if you accept Bates and then a school she likes even better gives her an offer? I would say, if Bates was near the bottom of her pecking order of waitlists, she should decline.<br><br>", "<b>Username: gardenstategal</b><br><br>@homerdog, the answer to the above is she’ll forfeit another deposit.  It would be foolhardy to pass up one WL acceptance because another might come through.  Because it may not.<br>So right now, only Bates and Grinnell are on the table.<br><br>", "<b>Username: Lindagaf</b><br><br>I agree, forget the other waitlists. Right now, they are not options, and are not likely to be options. She should proceed as though they won’t happen<br><br>", "<b>Username: Andrew2199</b><br><br>@wyorafter I have a son at Grinnell.  We also visited Bates.  Setting aside cost, I’d pick Grinnell.  It’s a great school.  Given the huge price difference, the choice seems especially clear.<br>The XC team at Grinnell (men’s and women’s) is very close, has a lot of fun and would provide an instant friend group. And a student doesn’t need to be top flight to be on the team.<br><br>", "<b>Username: Sue22</b><br><br>@wyorafter,<br>What does your daughter say?<br><br>", "<b>Username: wyorafter</b><br><br>So, GSGal, is your advice to take the Bates offer, pay the deposit, and wait until a later date to see if she comes off another waitlist, then forfeit whatever deposit(s) you need to when making a final decision?<br><br>", "<b>Username: menloparkmom</b><br><br>@wyorafter<br>^^ your DD  CAN’T have deposits at 2 colleges at the same time.<br>It s the same as saying “yes” to 2 colleges, which is forbidden.<br>Your DD needs to EITHER accept the Bates offer now, which also means letting Grinnell she won’t be coming, OR declining the Bates offer.<br>With college acceptances, you can’t “have your cake and eat it too”.<br><br>", "<b>Username: Lindagaf</b><br><br>Does she prefer Bates to Grinnell? Is the money not an issue? If so, she should deposit at Bates and immediately notify Grinnell that she is not enrolling.<br>FWIW, my D was in a similar position almost three years ago. She deposited at Bates, and immediately notified the other school that she wouldn’t be attending. I then made her take the other college’s bumper sticker off the car to seal the deal.<br><br>", "<b>Username: menloparkmom</b><br><br>^^ yes, but if $$ IS an issue, she should stick with Grinnell until she does hear from any other WL schools. She can always back out from Grinnell before the first semester tuition $$ is due.<br>She should also check the recent history of WL #'s at the other WL colleges from their Common Data Sets- see if they have a history of offering  thousands of students places on their WL, but end up accepting only a few. If that is the case, then the chances of her clearing the WL should be viewed as being very low.<br>One never knows how much “summer melt” will end up actually happening.<br><br>", "<b>Username: Lindagaf</b><br><br>@menloparkmom , I think the OP said her D is on the WL for a bunch of LACs and Dartmouth.<br>Historically, if those schools take kids from WL, it might be in the single digits. In some years, several of those colleges take 0, in others, maybe in the teens. It is impossible to look at previous years’ data and try to determine if there is a chance of getting off WL. The overwhelming majority of students will not get off WL. Bates admitted 0 from the waitlist last year, but three years ago, they offered over 40. Carleton offered over 30 students a spot off WL last year, but three years ago, they offered 2.<br>If OP’s daughter is hedging her bets on WL, she might be in for a long and anxious wait. Students who are pining for WL spots aren’t as able to get excited about the college they plan to attend. I get the impression that Grinnell isn’t the OP’s top choice and she’s hoping for something “better”, but I hope I’m wrong.<br>ETA: @publisher, I literally do not know of a single person who views Bates short term as a negative. Not one, and I think by now I know a lot about Bates and I know a lot of Bates people. It is universally loved by everyone who is involved with Bates. It is a big selling point for Bates, as far as I am aware.<br><br>", "<b>Username: gardenstategal</b><br><br>@wyorafter , if Bates is the preferred option (over Grinnell), she should accept the place, pay the deposit,  then inform Grinnell that she will not attend.  She’ll lose the Grinnell deposit (and that 50% discount on a great education. )<br>THEN she should evaluate whether she wants to stay on those other WL.  If so, do nothing.  If Bates seems like a better option than any of those, give up the WL spot.<br>Should she be offered a spot from any other WL that she prefers to Bates, she’ll repeat the process,  this time rejecting Bates and forfeiting that deposit.  I would guess, but of course don’t know, that none of those will come with $.<br>Realistically,  unless she doesn’t really like Bates or has her heart set on one of those WL schools,  it gets harder to walk away from the school where you’ve committed as time goes on.  Housing assignments,  \"meeting \" your advisor and starting to work through courses, meeting classmates at local events…  all of this can make it feel more real and harder to leave.  Not that it doesn’t happen but it’s why WL schools tend to check in on continued interest periodically.<br><br>", "<b>Username: Lindagaf</b><br><br>OP, is there a decision yet?<br>Thought it might be useful for other readers to share this story about why it’s a bad idea to double deposit. When my D was offered admission to Bates, it was from an AO who had JUST come from the college she had originally planned to attend. This AO was now working at her new college (we discovered this after the fact), and I have no idea if it was checked or not, but it would have taken just a phone call to determine if she had indeed withdrawn acceptance from the other school. (It seems pretty likely that the AO at Bates knew her name from the other college she originally planned to attend.) If she had double deposited at both schools, she would have had both offers rescinded. Scary thought!<br><br>", "<b>Username: Publisher</b><br><br>@Lindagaf : Re: your post #39 above: I only view the timing of short term as a potential negative as it could bring more joy if scheduled during January rather than in May. Due to poor weather in January & the chance to escape for a month to the Bahamas or elsewhere, short term could be a strong positive for attracting students, in my opinion & in my experience.<br>P.S. It might be interesting to take a poll of current Bates’ students asking whether they would prefer the separate one month, one course term to occur in January or May.<br><br>", "<b>Username: Lindagaf</b><br><br>Getting off track now, but…<br>@Publisher , stated by my daughter most emphatically, just now: “the fun of short term is enjoying the outdoors. If it was in January, I wouldn’t do it the third time. If I’m going to be stuck on campus in January, I might as well be doing proper classes. Plus the weather in May is better for short term study abroad options.” (Bates allows students to do short term three times if they like. Most seniors do it.)<br>That’s straight from one current horse’s mouth, anyway. ?<br><br>", "<b>Username: Publisher</b><br><br>That was my point = to enjoy the outdoors in a different location such as Colorado, Florida, The Bahamas, etc. I went to an LAC that had a J-Term similar to short term & to what Colby College had or has. The options were incredible both on &, especially, off campus.<br>P.S. One such offering was “People Watching in Montreal” offered as a psychology course.<br><br>", "<b>Username: Lindagaf</b><br><br>Pros and cons to both. I don’t know about Jan terms anywhere, I just know that Bates’ short term is very popular. Regardless, I like the idea of either a Jan or May short term. Grinnell doesn’t appear to offer a short term option.<br>Just saw that Dartmouth admitted zero from WL last year.<br><br>", "<b>Username: gardenstategal</b><br><br>Spring athletes love the May short term as it really allows them to focus on championships.  Skiers (including recreational) love the Jan short term in NE.  Travel study is popular for all of them.  Personally,  I would pick Jan over May.  But never having gone to a school with a short term, I would pick any short term over no short term!  It really lends itself to a different kind of study, even if it doesn’t involve travel.<br><br>", "<b>Username: wyorafter</b><br><br>@Lindagaf , I never even suggested that she double-deposit. I merely thought that another poster had and wanted clarification. My daughter has not yet decided, and we have a call scheduled today with them.<br><br>", "<b>Username: Lindagaf</b><br><br>No worries, @wyorafter . It’s information that benefits other readers. There are lots of people reading this thread who aren’t commenting (over 1.4k, it would appear.) You’d be surprised at how many people don’t realize you aren’t allowed to double deposit.<br><br>", "<b>Username: Aug2019</b><br><br>Smith College in Northampton, MA has a 3-wk January Interterm. Campus is open and students can use the time to investigate a special area of interest; to participate in courses, activities and conferences at Smith and other area colleges; to do work in libraries, museums, laboratories, etc.; to participate in internships; to work on research projects; or to enjoy the facilities of the campus at a more leisurely pace. You could also use the time to extend your winter break for travel, etc. As an alum, I can say I really liked this calendar a lot. Interterm sessions were great and with classes wrapping up in mid-May, I wouldn’t have valued the 3 wks in the summer the same way I enjoyed them in the winter.<br><br>", "<b>Username: privatebanker</b><br><br>I recall at Massachusetts we had a “W-inter’session”.  It was great.  Knock off a few credits or take a focused tougher class.<br><br>", "<b>Username: wyorafter</b><br><br>“OP” here again to say that she’s been given until mid-week to decide. Meanwhile, now has a voicemail from Wesleyan, which I neglected to list earlier as a waitlist for her. AARRRGH. You know, out here in the rural Rocky Mountain West, this stuff all seems somehow theoretical… but to those of you active on this board and living on the east coast, it kinda seems like a sport… I mean, it’s not like we’re not taking this seriously, for Chrissakes. We spent two nights in F-ing Ottawa plus one in Canton New York on Easter weekend just in order to rule out St. Lawrence after riding on six airplanes. I could write a book about trying to make up for geographical disadvantages in the college search process. (I’ve been drinking…)<br><br>", "<b>Username: dadof4kids</b><br><br>I’m in a similar geographically challenged location. We took a trip to the east coast and had time to visit 4 schools. Costly and a major logistical undertaking. And of course he is headed to a different East Coast school this fall. Although it was still a worthwhile trip, he learned a couple places he didn’t want to go and I found a couple targets for D21.<br><br>", "<b>Username: LoveTheBard</b><br><br>If, as you indicated in post #28 Bates was 5th on a list of 5 waitlists (or 6th on a list of 6 waitlists, now that Wesleyan has surfaced as a possibility?) I’m not sure why it’s even an issue.<br>To my mind, Grinnell is a better school than Bates. It is highly respected among academics, has some very unique programs supporting research and mentorship, and has one of the largest endowments found among LACs.<br>Were both schools to be full pay, Grinnell would be my choice; the scholarship makes Grinnell a no-brainer over Bates.<br>That brings us now to Wesleyan, which I would I would say lies somewhere between Bates and Grinnell, depending on the area of interest. If your D is interested in the arts (film, theatre), Wesleyan might get a slight nod over Grinnell. If your D is interested in the social sciences, Grinnell would get the nod. Again, the scholarship would make me more inclined to pick Grinnell over Wes, but your D can’t go wrong with either.<br><br>", "<b>Username: intparent</b><br><br>Hmm, I’d put Wes above both of them, if the finances work.<br><br>", "<b>Username: menloparkmom</b><br><br>@wyorafter<br>I for one would love to read your book!<br>your sense of humor reminds me of an old time CC poster from 2006- crumudgeon, whose tales of what he and his DD went through during the whole college application process- had all of us old timers in stitches in !!<br>BTW- his DD, as well as my DS, went for the $$, and both have never regretted it.<br>It is the reality that WL offers are very short lived. If a student does not REALLY want to go to a WL college then he/ she needs to decide quickly so that others can have a chance.<br>My advise, and those of others who know of Grinnel’s multiple strengths- continues to be- pick Grinnell.<br>But I want to read your book!<br><br>", "<b>Username: EganAg</b><br><br>Totally agree with @LoveTheBard. If your D is interested in the sciences, Grinnell gets the nod as well.<br><br>", "<b>Username: Leigh22</b><br><br>@Lindagaf I will raise my hand as someone who only found out very recently that you can’t deposit at two schools. I just never thought about it until I read it in the letter my S received after he made his deposit. Obviously it makes sense.<br><br>", "<b>Username: Lindagaf</b><br><br>Wow, Wesleyan too! She has great choices. OP, how does she feel about Grinnell though? Is she hoping for something “better” than Wes, Bates, and Grinnell? I’d still choose Grinnell, due to the money.<br>I have to offer a defense of Bates, because I feel that it’s being bashed somewhat. Bates and Grinnell have similar outcomes post grad. Both see 5% of grads go on to fellowships (scholarships), Grinnell has higher rates of students going to grad school, Bates has higher percentages going into work. 91% of Bates students who applied were accepted to med school, whereas it looks like 80% of Grinnell grads were, (though maybe I read that wrong?) Bates comes in #4 in Fulbright scholarships, and Grinnell is #26. It depends on the list you look at, but Bates is ranked more highly in several (showing that rankings are not very meaningful, haha.)<br>Bates can never come close to Grinnell’s endowment, or that of many other colleges. Historically, Bates graduated working class men, women, and African Americans, all people who were never (back in the day) going to earn a lot of money to donate to the school. So no, it doesn’t have some of the top-notch facilities that other colleges of its ilk have. But it’s not a second rate school by any means.<br>Anyway, it doesn’t seem that OP’s daughter is inclined towards Bates, which is fair enough. With the wonderful scholarship she’s been offered, there is still nothing that would steer my child away from Grinnell.<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>“OP” here again to say that she’s been given until mid-week to decide. Meanwhile, now has a voicemail from Wesleyan, which I neglected to list earlier as a waitlist for her. AARRRGH.<br>\"\"<br><br>@LoveTheBard wrote:<br><br>\"\"<br>That brings us now to Wesleyan, which I would I would say lies somewhere between Bates and Grinnell, depending on the area of interest.  If your D is interested in the arts (film, theatre), Wesleyan might get a slight nod over Grinnell. If your D is interested in the social sciences, Grinnell would get the nod. Again, the scholarship would make me more inclined to pick Grinnell over Wes, but your D can’t go wrong with either.<br>\"\"<br><br>Wesleyan is most emphatically not somewhere between Bates and Grinnell. Wesleyan is almost in a category by itself. It is nearly twice as large as either Bates or Grinnell and is the only one of the three that isn’t located in a remote part of the country. Middletown is not New York City nor is it Philadelphia or Washington, DC, but, Connecticut as a whole is one of the most densely populated states in the nation and Middletown is one of its traditional county seats. That translates into dozens of restaurants, a waterfront, and all sorts of civic activities - including a hospital - all within walking distance of campus.<br>A slight nod for arts? Okay, now we know we’re dealing with a Grinnnell booster. But, let’s move on.<br>Social Sciences? As of last count, Wesleyan has two alumni running for President, John Hickenlooper (read his autobiography, “The Opposite of Woe”, where he devotes two chapters to Wesleyan and Middletown), and Michael Bennet, the senior Senator from Colorado.<br><br>\"\"<br>Totally agree with @LoveTheBard. If your D is interested in the sciences, Grinnell gets the nod as well.<br>\"\"<br><br>Not sure where this is coming from. Wesleyan is one of perhaps two traditional LACs that awards STEM degrees all the way to the doctoral level (the other is Bryn Mawr) This translates into millions of dollars in tax-supported research, the highest both nominally and per capita of any LAC in the country (okay, maybe that title toggles between Wesleyan and Wellesley from one year to the next). And, because all Wesleyan professors teach undergraduates, the demand for interns is constant and ongoing (i.e., not just during the summer.)<br>I would definitely add the Wesleyan W/L to the mix.<br><br>", "<b>Username: EganAg</b><br><br>@circuitrider my nod to Grinnell for Science is BECAUSE Weslyan has PhD programs.  I’m a scientist and this is based on my look at the Physics, Chemistry, Biology depts where I have expertise and my D19 was very interested in at Weslyan.  We eliminated it after our investigation and a quick visit.  Yes, they have million dollars of grant funding, but, I got the feeling that the professors focus there is distracted with research and PhD students and not teaching undergrads.  Whereas places like Grinnell (full disclosure, a good friend of mine is a STEM professor there), Profs do research, but, it is more undergrad oriented as opposed to Weslyan or a research university like say, Chicago.  Whenever you have grad students around, we felt that the benefit of a LAC science environment is lost.  I don’t have hard data, but, my experience being in academic science research and industry research and being educated in a LAC myself.<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>Whereas places like Grinnell (full disclosure, a good friend of mine is a STEM professor there), Profs do research, but, it is more undergrad oriented as opposed to Weslyan or a research university like say, Chicago<br>\"\"<br><br>You’re right, @EganAg, it is a different kind of research. It is more advanced. That’s the whole idea. Where I disagree with you is your assertion that somehow, because it is more advanced, that it is per se against the interests of undergrads. Just logically, it would seem advantageous to be taught by someone, under pretty much the same classroom dynamics as the best LACs in the country (i.e., Amherst, Grinnell, Bates, et al), but with a richer, more advanced resume.<br>Also, as a professional in the field, you must know the advantages for undergraduates of being able to intern in a laboratory all year round with the help of either grad students or a post-doc as opposed to only being able apply for summer research when their professors are no longer busy teaching.<br><br>", "<b>Username: EganAg</b><br><br>@circuitrider It is the feeling that we got when we visited and chatted with science professors at Weslyan, Amherst, Midd, Bowdoin, Bates, Mac on our visits.  You are correct.  Weslyan prof emphasized working year around with a grad student.  Whereas other places, the undergrad worked directly with the Prof.  We felt that if I wanted my D19 or S19 to work with a grad student, they should chose a research university, not a LAC.<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>@circuitrider It is the feeling that we got when we visited and chatted with science professors at Weslyan, Amherst, Midd, Bowdoin, Bates, Mac on our visits. You are correct. Weslyan prof emphasized working year around with a grad student. Whereas other places, the undergrad worked directly with the Prof. We felt that if I wanted my D19 or S19 to work with a grad student, they should chose a research university, not a LAC.<br>\"\"<br><br>Well, @EganAg, all I can say, is that it’s quite possible that the OP is operating under a completely different set of biases and that maybe the opportunity to work year-round in an NSF funded laboratory - even, if only with doctoral students - might constitute an acceptable trade-off. Either way, it might behoove them to consider taking a spot on the Wesleyan W/L.<br><br>", "<b>Username: EganAg</b><br><br>At the risk of angering Bates supporters on the thread- We felt that the Middletown and nearby Hartford are much nicer cities and thriving cities than Lewiston, ME.  We loved walking around Middletown outside the Weslyan campus.  Our walk from Bates to the center felt a bit depressing.  But, had dinner at a wonderful vegan place called Guthries.<br><br>", "<b>Username: Lindagaf</b><br><br>@EganAg , not angry. Lewiston has a lot of nice places now, and there are a lot of good restaurants. There is a lovely, long river walk that crosses the river to an outdoor theater venue and has nice views. There’s a bird sanctuary adjacent to campus where people run and walk. But I don’t think Bates people care that Lewiston isn’t beautiful. There is no question that it’s improved in the nearly four years since I started visiting there, and many will agree with me.<br><br>", "<b>Username: Trixy34</b><br><br>I love Wesleyan.  I wanted to apply there back when I was in school, but my parents were not impressed with the upkeep of the place.  I mean, they had leaves still on the ground in the Spring for crying out loud!  Two of my ex’s family members went to Wesleyan undergrad and have achieved great success in their respective fields.  My brother-in-law ended up at MIT for his PhD, and both the people of which I speak ended up, at one point or another, teaching grad school at Princeton.  So I hold a Wesleyan education in high regard.  I think it can take you wherever you want to go.<br>@wyorafter - your daughter can’t go wrong.  And boy, she has a lot of great opportunities to choose from.  But what a stressful process, huh?  I was at St. Lawrence Easter weekend too!  There’s really no place in the US from which that is a convenient trip!<br><br>", "<b>Username: merc81</b><br><br><br><br><br> wyorafter:<br>\"\"<br>Meanwhile, [she] now has a voicemail from Wesleyan, which I neglected to list earlier as a waitlist for her.<br>\"\"<br><br>Did Wesleyan offer admission to your daughter?<br><br>", "<b>Username: PrufrockJA</b><br><br>As Fulbright grants were previously mentioned, it may interest readers to have statistics for the three LACs (Bates, Grinnell, Wesleyan) that have been the foci of this thread.  The Fulbright student awards for the five most recent years are shown below (and baccalaureate institutions are the reference class for rank).<br>Format:  ordinal rank / institution / number of Fulbright grants / (number of Fulbright applications).<br>2018-19:<br>4 Bates 13 (60)<br>26 Grinnell  6 (22)<br>70 Wesleyan 2 (17)<br>2017-18:<br>1 Bates 23 (63)<br>15 Grinnell 8 (20)<br>24 Wesleyan 6 (38)<br>2016-17:<br>5 Bates 13 (54)<br>15 Grinnell 7 (28)<br>18 Wesleyan 7 (23)<br>2015-16:<br>3 Bates 18 (50)<br>30 Grinnell 5 (21)<br>33 Wesleyan 5 (22)<br>2014-15:<br>9 Bates 10 (34)<br>12 Grinnell 9 (35)<br>18 Wesleyan 7 (42)<br><br>", "<b>Username: wyorafter</b><br><br>She was offered admission to Wesleyan as well.  They have given her a week.<br><br>", "<b>Username: Trixy34</b><br><br>A week is nice.  Tough decisions to make, though.  Is she leaning one way or another?<br><br>", "<b>Username: LoveTheBard</b><br><br>@circuitrider, I can assure you that I don’t have a horse in this race. You, on the other hand, seem to have dozens upon dozens of threads on Wesleyan forums, so I’ll take your enthusiasm for Wesleyan with a grain of salt.<br>OP can’t go wrong with any of the schools. My point was that since Bates was #5 of OP’s waitlist ranking (which, at the time, did not even include Wesleyan), I thought it should be taken out of the equation.<br>Whether in OPs shoes I’d choose Grinnell over Wesleyan or vice versa would depend on a variety of factors: financial, academic, geographical, and social. My D turned down a full tuition scholarship to Grinnell –– having just lost two faculty members that worked in D’s area of interest ––  it happened, at the moment, to not be particularly strong in that subject. That said, they were planning to replace the faculty that had left, but not soon enough for D’s liking, who had other options that she preferred (she had also decided at that point that she was more interested in a research uni than an LAC, but OP’s MMV.)<br>As I said before, depending on other factors (in my post I mostly focused on academic area of interest, but there are others that I just mentioned in the last paragraph), the scholarship might make me more inclined to pick Grinnell over Wesleyan. At the end of the day, however, OP’s D can’t go wrong with either school.<br><br>", "<b>Username: Sue22</b><br><br>Full disclosure, my husband chose Bates over Grinnell. My niece just chose Grinnell over a school (where she was a legacy) ranked higher than Wesleyan, Bates, or Grinnell.<br>In my mind the rankings are a wash. Grinnell has the highest stats. Wesleyan has, historically, the most lofty reputation. Bates has, as of this year, the lowest acceptance rate. USN? Grinnell. Forbes? Bates. WSJ? Wesleyan. All three are great schools, and all excel in different ways.<br>If finances aren’t an issue, as seems to be the case with the OP, the first tiebreaker for me would be the student’s desires. Where does she see herself? Which school tugs at her heart? The second tiebreaker would be the merit award from Grinnell. It would be tough to turn own that kind of money, all things being equal. Of course, it’s rare that all things are equal.<br>If finances are an issue the choice would be easy. Grinnell. If there are other factors (location, specific major, EC’s etc.) things become more complicated.<br>In any case the OP’s child really can’t make a bad decision.<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>Bates has, as of this year, the lowest acceptance rate.<br>\"\"<br><br>In that Bates and, at least, Wesleyan, clearly have been making offers to their wait list applicants, these schools cannot be said to have firm acceptance rates for this year.<br><br>", "<b>Username: Sue22</b><br><br><br>\"\"<br>In that Bates and, at least, Wesleyan, clearly have been making offers to their wait list applicants, these schools cannot be said to have firm acceptance rates for this year.<br>\"\"<br><br>Even going to the waiting list Bates will have the lowest acceptance rate this year, but that wasn’t really my point. You can cherry pick statistics to support a decision to attend any of these schools. Endowment? Grinnell wins. Fulbrights? Bates wins. NSF funding? Wes wins. And so on…<br>Theses schools are close enough that who has a 30 point higher average SAT or a 5% higher yield wouldn’t be the deciding factor in my book. All three have nice campus cultures but they’re different, and there are curricular differences between the three schools. That’s what I’d be concentrating on.<br><br>", "<b>Username: Lindagaf</b><br><br>I don’t see last year’s data for Grinnell (strangely, there is no data for '17-'18 or '18-'19,) but it admitted 97 from the WL three years ago. This year, the list here on CC apparently indicates that Grinnell is closed “for internationals\" (is it open for citizens?) Last year, in addition to Bates, Wes also admitted zero from waitlist. https://talk.collegeconfidential.com/college-admissions/2141097-what-waitlists-are-active-who-has-closed-their-waitlists-p12.html Post #74 has the latest info.<br>It doesn’t mean much though. They are all very selective and we’re splitting hairs. All are great schools.<br>OP, we’d love to hear how your daughter is leaning.<br><br>", "<b>Username: EganAg</b><br><br>I agree with @Sue22 post #74.  OP’s D will be fine at any one of the places.  It is where she is excited about going and the willingness to pay the associated cost.  Another difference between the three that we remember from our visits (and we looked at Grinnell carefully even though we didn’t visit) is I think Wes has a Greek life and the other two don’t.<br><br>", "<b>Username: circuitrider</b><br><br>^Wesleyan’s Greek life is like a dog whose bark is bigger than its bite. The two remaining single-sex houses (out of a possible four or five that function as theme houses) occupy an outsized presence on the campus imagination mainly because of their central locations and, frankly, because they are the last vestige of all-male exclusivity in a sea of feminism. If more than 5% of the campus was Greek-affiliated, I’d be very surprised. Unlike many of its peer LACs, social life at Wesleyan is firmly in the hands of its music and arts community.<br><br>", "<b>Username: homerdog</b><br><br>Right. I agree with the posters above.Where does your D want to go to school? If you’re saying you are ok with paying full price, what does she say? I don’t even think a debate about the merits of the schools makes much sense. She can’t go wrong. What is her gut telling her? She’s got the luxury of choosing with fit in mind.<br><br>", "<b>Username: Trixy34</b><br><br>Yeah, I wouldn’t put any weight on the fact that there is “Greek Life” at Wesleyan.<br><br>", "<b>Username: PrufrockJA</b><br><br>@Lindagaf, for 2018-19, 196 applicants accepted a place on Grinnell’s waitlist, and 14 were admitted; for 2017-18, 534 were on the waitlist, and 12 were admitted.<br><br>", "<b>Username: PrufrockJA</b><br><br>@Lindagaf, a correction needs to be made:  for 2018-19, 724 applicants accepted a place on the waitlist at Grinnell, and 33 were admitted.  (I glanced at the wrong CDS.)<br><br>", "<b>Username: wyorafter</b><br><br>“OP” here… The decision is in: Grinnell by a hair. The reason this was such a tough decision for my daughter is that her 1st choice was Bowdoin, because of it’s blend of strong academics, outdoor culture and inclusive (somewhat?) less competitive culture. After applying there ED and being deferred, she set her sights on schools she thought to be similar (Colby, Middlebury and Bates) as reaches, along with Dartmouth, Carleton, Connecticut College, Wesleyan and Brown. More “reachable” (match?) applications were placed at Oberlin (her sister is there), St. Olaf, Macalaster, St. Lawrence, and Whitman. All along she continued to pine for Bowdoin.When regular decisions came in, it was:  Accepted at Oberlin, St. Olaf, Macalaster, St. Lawrence, Whitman and Grinnell. SEVEN waitlists: Dartmouth, Colby, Middlebury, Bates, Wesleyan, Carleton and Connecticut College. Denied admission by Bowdoin and Brown. She stayed on all the waitlists, paid her deposit and chose Grinnell, and figured the waitlists would fade away. You know the rest (so far). In the end, she decided that she was reflecting her love of Bowdoin onto Bates (a very fine school) but that there wasn’t any of the passion for it that she had for Bowdoin. Her visit to Grinnell was a good one. Wesleyan awaits her decision.<br>I made a round of calls today to the admissions offices at Dartmouth, Middlebury, Carleton and Colby. Middlebury is in the middle of working through their waitlist (evidence of that exists elsewhere on this forum) Dartmouth, Middlebury and Colby sound doubtful. We are aware of the gift that is these waitlist acceptances to Bates and Colby. For my daughter, maybe it’s something like being offered free tickets to see Def Leppard, but she’s really a Boston fan… I dunno. I hope I have met my obligations as “OP.” As for my daughter, it’s her life, not mine.<br><br>", "<b>Username: circuitrider</b><br><br>^You’ll be back. <br><br>", "<b>Username: Saisei1</b><br><br>^^<br>Very prescient.  New thread.<br>https://talk.collegeconfidential.com/college-search-selection/2143300-competitive-culture-at-grinnell-vs-others.html<br><br>"]}