{"title": "state flagship vs cornell", "comments": ["<b>Username: hstarschools</b><br><br>Hi CC,<br>I reached out to the admissions people from Berkeley and Cornell and managed to delay my college decision response by a week and a half; I am deciding between offers from the two schools. I do not qualify for any financial aid and am from a middle to upper-middle income family. Berkeley in-state tuition will be about $14k per year and Cornell tuition will be $55k per year. Finances are not a big concern for my family but I want to make the best value-based decision between the two schools since the tuition difference between the schools is non-trivial.<br>I am interested in a career in finance, for which Cornell has an upper-hand over Berkeley, but I also have an interest in computer science and technology, for which it can be argued that Berkeley has an edge based on its location. I was initially drawn to Cornell for its strong presence in the financial services sector, but I am not yet entirely sure that I want to pursue a career in that industry so that is not a deciding factor for me. Location-wise I prefer Berkeley but that is also not an important consideration for me. The most important consideration is whether Cornell’s marginally stronger undergraduate experience is worth the premium tuition over Berkeley in-state tuition.<br>When I did some research on Cornell I noticed that it has 15,000 undergraduates, about 8 to 10 thousand more undergraduates enrolled than at any other “top” private school, which is about the same number of undergraduates as the undergrad population of the University of Virginia. I also learned that Cornell is not fully a private school; it is half a statutory or public school affiliated with the State University of New York. Based on this fact, and the fact that Cornell offers tuition remissions to New York State Residents at its contract colleges, I am wondering if members of CC would recommend that I as a California in-stater pick Cornell over Berkeley since Cornell looks to be a state flagship of sorts for the state of New York and is the federal land-grant institution of New York the same way that UC is of California. This question is about value return of the premium tuition; I met a Wisconsin resident who paid out-of-state tuition for UC–Berkeley for a year and returned to Wisconsin to attend the University of Wisconsin–Madison since she did not believe that the out-of-state premium of UC–Berkeley was worth it given the resources that she was offered. This question is specifically for me and other students of families in the middle to upper-middle income bracket who are full-pay; financial aid packages are likely much better at Cornell than at Berkeley. I would like to know the opinions of Cornellians and CC-ers in general if the extra ~$40k of tuition per year at Cornell undergrad vs. in-state tuition at Berkeley will offer significantly better private school instruction, alumni networking opportunities (during both the College years and down-the-line in one’s career) and selectivity and rigor of the student body than what is offered at Berkeley. Thank you.<br><br>", "<b>Username: mom2twogirls</b><br><br>Cornell is not a public school, is not a public flagship and none of the colleges within it are run by the state at all. You must not have fully researched it to have come to a different conclusion.<br>If you are full pay, you are also not middle class.<br>All that aside, it seems silly to consider choosing to pay what, $200k more for 4 years? For what may or may not be slightly more prestigious in one major over your much cheaper, more prestigious in other areas, choice? And you seem to prefer Berkeley anyway? I don’t see why it’s that difficult a choice to make.<br><br>", "<b>Username: albertsax</b><br><br>@mom2twogirls “If you are full pay, you are also not middle class.”<br>This is 100% not true and representative of one of the main problems with the current financial aid system. The upper class can easily afford college, the lower class is given grants to easily afford college, but the middle and upper-middle classes are often determined to pay full price, which for many families is impossible depending on family circumstances.<br>I am middle class and my brother was full-pay. So there’s one data point that proves you wrong.<br><br>", "<b>Username: whidbeyite2002</b><br><br>@hstarschools, I am a former Cornellian whose academic program involved many biology and chemistry courses, so my experience (and my age) is likely to provide a very different experience from what yours would be.<br>Cornell provided me with a stellar education and a fun, well-rounded undergraduate experience. That said, I would recommend UCB by cost alone. However, like some other state schools, I hear it is difficult to enroll in certain popular programs and required courses.<br>Wishing you the best with your decision!<br><br>", "<b>Username: austinmshauri</b><br><br><br>\"\"<br>@albertsax: The upper class can easily afford college, the lower class is given grants to easily afford college, but the middle and upper-middle classes are often determined to pay full price, which for many families is impossible depending on family circumstances.<br>\"\"<br><br>Most low income students aren’t handed $55k/year (or anything remotely close to that) for college. If your family was full pay to the tune of ~$60k/year, you’re not a middle income family and declaring yourself one doesn’t make it so.<br>OP, Berkeley is an excellent school. There’s no reason to pay more just to get an OOS undergraduate experience. NYS doesn’t have a flagship. We have 4 university centers, but Cornell isn’t one of them.<br><br>", "<b>Username: mom2twogirls</b><br><br>Ok @albertsax . I get it. People have this need to call themselves middle class, whether they are or not. There isn’t really a set, agreed upon number defining it, so I suppose it’s all opinion. Not “100% not true”.<br>I stand by my assertion that a family that can pay full pay, without loans, and contemplate spending an extra $200k for 4 years of college is not middle class. And not “representative of one of the main problems with the current financial aid system”<br>But YMMV.<br>Back to the main point of this thread though, why would Cornell be worth that extra money over Berkeley for someone who isn’t wealthy?<br><br>", "<b>Username: TheBigChef</b><br><br>The correct answer to OP’s question is Berkeley - by a country mile.<br><br>", "<b>Username: bopper</b><br><br>@mom2twogirls   You are incorrect…Cornell U is half publicish, half private.<br>Cornell is unique: Although it’s an Ivy League university, chartered as a private institution, it includes undergraduate colleges and schools that receive some funding from New York State. They are sometimes called state contract colleges. The state subsidy results in lower tuition for students who have New York State residency and are enrolled in these colleges or schools. The state-assisted colleges are:<br>College of Agriculture and Life Sciences<br>College of Human Ecology<br>School of Industrial and Labor Relations<br>SC Johnson College of Business: Charles H. Dyson School of Applied Economics and Management (Dyson)<br>The other Cornell undergraduate colleges and schools, sometimes called the endowed colleges, rely on private support. They are:<br>College of Architecture, Art, and Planning<br>College of Arts and Sciences<br>College of Engineering<br>SC Johnson College of Business: School of Hotel Administration<br>Cornell is known as the easiest Ivy to get into, but the hardest to stay in.<br>I would go with Berkeley as it is also a great school but is much much less expensive.<br><br>", "<b>Username: cptofthehouse</b><br><br>Unless the money is truly not an issue, I’d stick with Berkeley.  The only other compelling reason to go to Cornell is for you to get the opportunity to leave CA and get an east coast experience.  Bear in mind, however, that Ithaca is not NYC or Boston or SanFranciscoor even Oakland and nowhere close to major cities.  You are truly going small town there.<br>Yes, there is question as to whether Cornell is even “better” than Berkeley.  I know kids who have gotten into Berkeley OOS from here go there over Cornell.  It’s an excellent school, has ivy luster.  It also has a rep of being edgy and competitive in academics  Often called the easiest ivy to get in, hardest to get out.<br><br>", "<b>Username: mom2twogirls</b><br><br>@bopper please reread what the OP wrote and what I wrote before calling me incorrect.<br>No part of Cornell is a public flagship. No part is run by the state of NY. The state helping with tuition and those particular colleges within Cornell (none of which the OP has even indicated they are contemplating for their own admission anyway) having a mandate to accept more NY residents does not equate them to being public colleges. I can’t say whether it qualifies them as publicish since I’m not sure how that is being defined. I’m not sure which part of what I wrote originally you thought was incorrect. If you have evidence that the state of NY hires and fires professors, pays professors, sets curriculum, or even has a hand beyond a minimum requirement of students needing to be from NY, please show me. Aside from subsidizing tuition for NY residents, does the state even have a hand in the budget process for these colleges in Cornell? All of those things would perhaps lead me to believe they are “publicish”. Otherwise, all I see is that some of the colleges receive some extra financial support for tuition in comparison to other private colleges in NY. Other private NY colleges also get money from the state for student tuition (TAP, STEM scholarships), so are they also publicish? Or is it just that the state requires a certain number of students in those colleges to be from within NY that it makes them publics?<br>Anyway, none of the makes sense as a reason to decide for or against Cornell for this student. The reality of the cost difference for what is an subjectively equivalent education, in addition to the student prefering Berkeley, means choosing Berkeley is the best choice.<br><br>", "<b>Username: momofsenior1</b><br><br>Cornell is a private institution and is no way a NY flagship.<br>That said, there is no way I’d pay that much more for Cornell over Berkeley.      (And I’m a Cornell grad who loved her experience).<br><br>", "<b>Username: whidbeyite2002</b><br><br>Same, @momofsenior1.<br><br>", "<b>Username: whidbeyite2002</b><br><br>We had the opposite situation in that our state flagship was going to cost more (at least this year) than almost all the private schools to which our daughter was accepted.<br><br>", "<b>Username: PurpleTitan</b><br><br>From a purely ROI perspective, it’s really hard to justify full price for Cornell when you get a discount to Cal just by being a CA resident when you consider that money not spent, if invested, can be reasonably expected to be 7-15 times as much in 40 years (about when you will retire) in real terms assuming that you can get the classes that you want.<br><br>", "<b>Username: albertsax</b><br><br>@austinmshauri By any of the basic measurements (Pew Research has a good calculator that takes into account location and family size), my family is indeed middle class and indeed was determined to be full pay with one child in college.<br>I was referring to institutions that meet full need. A regional public will likely not provide any aid for anyone and so it’s not really relevant.<br>Why do you believe colleges are the ones to determine one’s social class?<br><br>", "<b>Username: yikesyikesyikes</b><br><br>@mom2twogirls<br>Haha yeah, I totally agree.  You have households with 2-3 kids with 200k annual income with analogically similar assets claiming to be “middle class”.  It is getting kind of ridiculous.<br><br>", "<b>Username: AlmostThere2018</b><br><br>We went through this equation last year.  Once my D was accepted to Honors UNC early action we took Cornell off the table. There was no way were going to pay $200k more for a college roughly the same size.  They told us on Cornell tour that some intro classes are very large and it felt large walking around.  Cornell is great, but we just couldn’t articulate the value proposition over UNC.<br>(Full disclosure, D ended up being WL at Cornell – maybe they had spidey sense she had taken it off her list, lol?  Also, she end going to a highly selective LAC so we are paying more than for UNC; however, we feel like we can actually see where the money is going – small classes, full professors teaching all the classes, lots of $ avail to fund research and travel – and she realized smaller was better fit for her. And they offered us some aid. Realize not everyone would make same choice. )<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> albertsax:<br>\"\"<br>@mom2twogirls “If you are full pay, you are also not middle class.”<br>This is 100% not true and representative of one of the main problems with the current financial aid system.<br>\"\"<br><br>Net price calculators at good financial aid private colleges suggest that one needs to have very high income (e.g. $200,000+) or large assets to be full pay.  Of course, if the private college has bad financial aid (but then we would be referring to NYU, BU, etc. rather than Cornell or other Ivy League schools), full pay would be at a lower threshold.  But the level of income and wealth to be full pay at good financial aid private colleges is multiples higher than the median in the US.<br><br><br><br> albertsax:<br>\"\"<br>The upper class can easily afford college,<br>\"\"<br><br>Yes, at least in theory.<br><br><br><br> albertsax:<br>\"\"<br>the lower class is given grants to easily afford college,<br>\"\"<br><br>Only at a small number of highly selective colleges that admit few students from lower class families (due to various K-12 disadvantages that prevent most of them from being admissions-competitive), or in a small number of states with good in-state financial aid.  Students from lower class families in some states, like Pennsylvania and Illinois, may find their in-state public schools to be unaffordable.<br><br><br><br> albertsax:<br>\"\"<br>but the middle and upper-middle classes are often determined to pay full price, which for many families is impossible depending on family circumstances.<br>\"\"<br><br>If a family with $200,000 income lived and spent money like a family with $60,000-100,000 income (the upper middle range in the US), then it would be saving plenty of money for kids’ college and parents’ retirement.<br><br>", "<b>Username: ucbalumnus</b><br><br>Which division/major did you get admitted to at each school?<br>Note that UCB L&S CS does require a 3.3 GPA in the first three CS courses to declare the major, and the UCB business major is competitive admission after two years.  Cornell requires a 2.5 GPA in CS courses and a 2.5 GPA in math courses to declare the CS major, and changing to the business (AEM) major if not already in it is a competitive process.<br>However, Cornell has a huge price difference against it.<br>Regarding finance, here is an old post describing the investment banking recruiting scene at UCB:<br>https://talk.collegeconfidential.com/discussion/comment/14204944/#Comment_14204944<br><br>", "<b>Username: sgopal2</b><br><br>Cornell does have better recruiting on Wall Street, but just marginally. You’ll still have plenty of opportunities in finance coming from Berkeley. Its really up to you on whether the extra money is worth it.<br><br>", "<b>Username: yikesyikesyikes</b><br><br>Mean *analogous, not analogical - long day.<br><br>", "<b>Username: Aspiringacademic</b><br><br>Berkeley isn’t just any state flagship, too. It’s one of the strongest and most prestigious universities in the world. I’ve been admitted to Cornell and am partial to it, but I’d say go with Berkeley at this price point. You won’t be missing out.<br><br>", "<b>Username: hopewhite25</b><br><br>For what it is worth, this is what  Pew has to say about what constitutes middle class: “Pew defines the middle class as those earning between two-thirds and double the median household income.This means that the category of middle-income is made up of people making somewhere between $40,500 and $122,000. Those making less than $39,500 make up the lower-income bracket”.  In my state of NC the median income is around $52,000, so middle class would be between $35,000 - $104,000.  For the OP state of California it is around $72,000, making the middle class $48,000 - $144,000.   Even in California a middle class family would be hard pressed to be full pay at a university costing $70,000+ a year.  With that said, UC Berkeley is an outstanding school in their own right and if you were my child that would be the direction I would be headed towards.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> hopewhite25:<br>\"\"<br>For the OP state of California it is around $72,000, making the middle class $48,000 - $144,000.  Even in California a middle class family would be hard pressed to be full pay at a university costing $70,000+ a year.<br>\"\"<br><br>Yes, but would a family with $144,000 or lower income get no financial aid from Cornell or similar good-financial-aid private school?<br><br>", "<b>Username: ProudLoomisDad</b><br><br>I’m getting disappointed that every other thread at CC devolves into nitpicking issues not related to finding a solution.  Yikes, people. Find a hobby.<br>That’s said, OP, I think the choice is obvious.  Enjoy Berkeley.  You’re very fortunate. ?<br><br>", "<b>Username: kalons</b><br><br>you’re not middle class. i’m middle class, and i receive extensive financial aid from the college i attend. thank you, next.<br>go to berkeley. simple decision, honestly.<br><br>", "<b>Username: socaldad2002</b><br><br>@ProudLoomisDad “Find a hobby.”<br>This IS their hobby : )<br><br>", "<b>Username: MWolf</b><br><br>While Cornell is mostly private, it is similar to flagships, and to other large public schools, in that it is a land grant school, one of the few private ones in the USA. That means that it was required to have a focus on things like Ag and engineering from the beginning, and was established to provide education to the public,  rather than have a mostly Liberal Arts focus, and have a mission of mostly educating the kids of the upper classes, as was the case for the rest of the Ivies. The differences between Cornell and the other Ivies were reduced as the other Ivies started allowing academically accomplished kids from poor families to attend, early in the 20th century, and, after the 1950s, when the tech race with the USSR and the importance of high tech in the military raised the profile and prestige of engineering and of engineers.<br>So Cornell does have a vibe that is more similar to state flagships. However, NY’s flagship is SUNY Buffalo.<br>Even if your parents can afford it, unless your family is rich enough that $160,000 is chump change, it’s money that could be put to better use for other things…<br>Personally, I would go with UCB because of weather, but I’m partial to warm weather places.<br><br>", "<b>Username: coolguy40</b><br><br>There’s no bachelors degree I’m aware of that’s worth $300k. That’s more than most medical schools. Save your money. There’s nothing that Cornell offers that Berkeley doesn’t already have.<br><br>", "<b>Username: Coloradomama</b><br><br>MIT is also a land grant private college.   Cornell was modeled after U of Michigan, a public flagship, of<br>the same age. Cornell and U of Michigan are very similar, but the New York State Flagships are SUNY schools,<br>not Cornell.  SUNY is State University of NY.  Buffalo, Binghamton, in upstate, and Stoneybrook  on Long Island.<br>For finance, Cornell is tightly connected to New York City and Wall Street.<br>Does OP want an MBA, then undergrad school  matters less.   Do you need an away experience, and<br>can you really afford Cornell? Do you want the rural, wet cold weather, that Ithaca dishes out and<br>the natural beauty of the Finger Lakes over easy access to San Francisco?<br>Do you want to eventually go back to California, for a job? Berkeley would be best.<br>Do you think you might want to move to New York City, then Cornell would be a little better, just<br>to get the feel of the east.  Cornell Tech is in New York City ,  as is Cornell’s fine medical school,<br>so there is a daily bus between NYC and Ithaca NY.   Very tightly connected, I would say for jobs.<br><br>", "<b>Username: PurpleTitan</b><br><br>^ Huh, yes, there is a Cornell/NYC bus. 4.5 hours each way.<br>For an away experience, you could also study abroad.<br><br>", "<b>Username: Coloradomama</b><br><br>Here is the Cornell /NYC bus to the medical school area of Manhattan, and the Cornell Club in Manhattan.<br>https://fcs.cornell.edu/content/c2c-nyc-departures<br>Also note that Cornell Tech, a two year old city campus,  has taken over an island in the East River, its a graduate school in Manhattan for CS, and other subjects.<br>https://tech.cornell.edu<br>So Cornell’s ties to NYC are better and better now.<br><br>", "<b>Username: Coloradomama</b><br><br>Cornell Tech offers an MBA right in Manhattan too–<br>https://tech.cornell.edu/programs/masters-programs/johnson-cornell-tech-mba/<br>Its good to be aware of all the business related programs Cornell offers and why their grads have an edge in NYC.<br><br>", "<b>Username: hstarschools</b><br><br>Hi all,<br>Thank you for your responses on this matter. I just have a few more things to add:<br>The upper-middle class versus middle-class argument is difficult. If one is making over $200k in a year, it cannot be assumed that the person has been making that sort of money their entire life. One of my parents got a new job paying that figure relatively recently. Additionally, when you look at that income, about 35% is taken away from it by taxes, leaving one with $130,000, then with $70,000 taken away by college one is left with $60,000 which is not a large amount of money to use to pay housing bills, lifestyle expenses in the Bay Area and contribute to retirement accounts. It is not like my family doesn’t have any savings though so I am fortunate to be in a situation where my parents are willing to let me consider full-pay Cornell vs. in-state Berkeley, especially since they know that I would like to attend a private University on the east coast, and Cornell just so happens to have the Ivy League luster.<br>At the same time, I am not sure what the exact financial situation of my parents is, as I am their kid and they are not completely transparent about the situation with me. I am not sure if $160,000 is “chump change” to them so maybe it is best if I exit this relatively privileged conversation on CC and have an honest conversation with my parents so that we can come to a family decision on the matter.<br><br>", "<b>Username: hstarschools</b><br><br>(continued) To address the conversation of Cornell’s contract colleges being private and/or public, I did a lot of research on Cornell since I am really interested in the school and I found more information indicating that it was originally intended to be a public school. From what I read, Ezra Cornell and AD White arguably swindled the State of New York of its Morrill Act land-grant funds signed into law by Lincoln and created a smashed-together private/public school that is simultaneously privately endowed and receiving a non-trivial amount of funding from the State of New York. Unlike its Ivy League peers, Cornell was not founded in the pre-Revolution timeframe between the 1600s and late 1700s - it was founded in 1865, just 3 years before U.C. Berkeley, which is also a land-grant school. Someone pointed out that M.I.T. is a land-grant; that is interesting, I will have to look into that. So its membership in the Ivy League/“Ancient Eight” is dubious. But although Cornell has over double the number undergrads of most of the Ivies and almost double the student-faculty ratio, it still has half the number of students and half the student-faculty ratio of Berkeley, resulting in smaller class sizes, so it can’t be equated to Berkeley. Ultimately this decision is difficult because we live in a society that is striving to give a student, no matter what their financial background, an opportunity to excel at the highest level of merit without regard to finances. But that is a utopian view. As can be seen in this thread, financial considerations are important for those debating between schools of similar stature but with a high difference in cost. In a utopian world, I would be able to simply pick Cornell since, according to my preferences in going to a better funded and endowed school, it is the clear pick over Berkeley for me. But due to real financial considerations and the fact that Cornell and Berkeley are “close enough,” I have to pick a worse (in my opinion) University, Berkeley, and go to school with double the number of undergrads and student/faculty ratio for four years - potentially putting a dent in my future vs. what I would have access to at Cornell.<br>For me, if the choice was Harvard, Yale, Princeton or Penn-Wharton, the answer would be clear as day. Pour the money into the more prestigious program, taking out loans if you have to, and let life and the networking take you from there. But those are not the schools that I am able to pick from. And because of that, there is a really high chance that I will wind up at a state flagship school instead of a private school that I marginally prefer.<br><br>", "<b>Username: cptofthehouse</b><br><br>Cornell holds an unusual place in our household. Two of my kids turned it down despite it being an ivy and “higher” rated on the prestige scales. One refused to even apply though he would have been a strong candidate. His best friend also put his nose up to it despite a hook there.<br>I don’t know whether Id pick Cornell over Berkeley because I’m not knowledgeable enough about B, but Id pick Michigan over it as my one son preferred. And several others here in NY chose. Also UVA, Hopkins, Emory.  On several occasions.  This is all without cost taken into account.<br>I think there is an intensity about Cornell that takes some of us aback. I, for one, felt that UMichigan had a more relaxed atmosphere and I preferred Ann Arbor to Ithaca. Just the slightest of nuances that made the difference.<br>Throw in a cost differential and even most avid Cornell fans will vote for Berkeley.  A business degree from Haas is certainly not going to hold you back on Wall Street.<br><br>", "<b>Username: PurpleTitan</b><br><br>Note that when it comes to student-faculty ratio, they may not be apples to apples as not all schools use the same denominator.<br>When it comes to classes of under 20 and classes over 50, there is little difference:<br>Under 20: Cornell 57.3%; Cal 53.5%<br>50 and over: Cornell 17.8%; Cal 18.6%<br>In a popular major like CS, you will be going to huge classes at both schools.<br>What schools have you been admitted to at each?<br>Both Cornell and Cal would be intense.<br>Also, even if your parents have budgeted $300K for your education, if you go to Cornell, you’d blow through all those funds. If you go to Cal, you’d still have enough left over for a 2 year master’s (or 2 1 year master’s; or most of the costs of an M7 MBA). Basically, in exchange for what you consider a worse undergrad experience, you’d have bullets left in case you want to change careers or get an Ivy master’s or invest or travel the world or whatever.<br>And Cal isn’t exactly chopped liver. It’s merely one of the most respected research universities in the world (reputation on par with Cornell outside the US, if not better).<br><br>", "<b>Username: hstarschools</b><br><br>@PurpleTitan I have a few friends who went to Berkeley and they tell me the “Under 20” and “50 and over” statistics are misleading because many courses and discussion sections are taught by TAs and GSIs instead of faculty. They said that the lack of faculty interaction is a big problem at Berkeley, and Cornell’s having half the number of students as Berkeley is a definite plus for Cornell. However Cornell is no star itself, having almost double the student-faculty ratio of schools such as Stanford and Harvard.<br><br>", "<b>Username: PurpleTitan</b><br><br>@hstarschools, why do they find the lack of  faculty interaction to be a problem? Are they looking for faculty recommendations?<br>Would you?<br>One of the best classes I took as an undergrad was a seminar taught by a grad student (at an Ivy-equivalent). He’s now a prof at SOAS in London.<br><br>", "<b>Username: whidbeyite2002</b><br><br>At Cornell there were about 450 students in my first-year Biology lectures, 900 in the Intro Computer Science course (dropped it for the “smaller” Calculus  class), and 1700 in the Intro Psychology class. Thank goodness for my French and Comparative Lit classes. <br><br>", "<b>Username: ucbalumnus</b><br><br>Cornell CS courses are not small.  There are about 400 CS graduates per year these days.<br>https://classes.cornell.edu/browse/roster/SP19/subject/CS shows many CS courses with large numbers of discussions attached to each lecture.  However, it does not disclose size of lecture and discussions.<br>Some upper level courses have only lecture with no discussions.  But the classrooms can give an idea of the size.  For example, CS 4410 (operating systems) is in Klarman Hall KG70, shown at https://registrar.cornell.edu/spaces/klarman-hall-kg70 .  CS 4700 (artificial intelligence) is in Olin Hall 155, shown at https://registrar.cornell.edu/sites/registrar/files/space_images/OLH155.jpg .<br>UCB class sizes in CS are large as well, since there are about 900 L&S CS + EECS graduates per year these days.<br>As a practical matter, the difference between “very large” and “huge” class sizes is not significant.  If you wanted small class sizes, you would have chosen a much smaller school (perhaps a LAC) where CS is not so popular that the department has to choose between making the class sizes large and keeping interested students out of them.<br><br>", "<b>Username: ucbalumnus</b><br><br>Business majors are large at both schools.  About 350 per year at UCB, and about 200 per year (in AEM) at Cornell.  Expect large class sizes at both schools.<br><br>", "<b>Username: hstarschools</b><br><br>I do not appreciate how earlier commenters assumed that I prefer Berkeley over Cornell. I do not prefer Berkeley, as can be evidenced by many of my previous comments. I was simply presenting some of my initial findings about Cornell in the first post.<br><br>", "<b>Username: privatebanker</b><br><br>Then I would suggest you attend Cornell, obviously.<br><br>", "<b>Username: Riversider</b><br><br>If you were looking for a small private undergrad school environment, neither Cornell nor Berkeley can offer that so forget it.<br>For academics and prestige, both are equally good, Berkeley May have more high achievers with high stats. It’s not some random state school.<br>Berkeley is cheaper, has better weather, diverse and politically active environment. It is situated in bigger town near a major airport. You are more likely to find internships and research opportunities there. You can use public transport for going home and save money.<br>Unless there is a strong personal preference, logical choice is Berkeley. This isn’t even a tough choice.<br><br>", "<b>Username: twogirls</b><br><br>Congratulations on two wonderful offers.<br>As a NYS resident whose HS sends several students each year to Cornell, whose local CC has an articulation agreement with Cornell, and who personally knows two kids who transferred there from four year SUNY schools, I feel like I know at least a little bit about Cornell. It is a wonderful school…don’t kid yourself…but you are not comparing it to some unknown state school. And…going to Cornell will not guarantee suceess. That is up to you. I ran into an acquaintance two summers ago whose son is now graduating from Cornell…he could not get an internship. Again…success is up to you.<br>Berkeley is no shrinking violet and it is not your typical state school. Where I live it is much harder to gain acceptance to Berkeley than it is to Cornell. You will have large classes at both schools. As noted above, you will not receive that small, private school experience at either.<br>My daughter loved Cornell but chose a different school. After speaking to her friend who was there she got scared of the intensity ( whether it’s real or perceived). She needed a different type of environment.<br>I would sit down with your parents and decide if the cost of Cornell would be difficult to sustain for 4 years. If the answer is yes, I would choose Berkeley.<br>Once again congratulations on two wonderful acceptances. And for the record…Cornell is not the flagship school for NYS. We don’t have one, but we do have a group of 4 larger SUNY universities. Cornell is not part of that group.<br><br>", "<b>Username: PurpleTitan</b><br><br>You would have a good number of large classes at Harvard and Stanford too, BTW, especially if you chose a popular major.<br>As @ucbalumnus said, if you really cared about that stuff, you should have applied to small and tiny LACs or at least much smaller universities.<br>BTW, you never answered my question about faculty interaction.<br><br>", "<b>Username: cptofthehouse</b><br><br>I had no doubts that you, OP, preferred Cornel to Berkeley, and that the issue was dollar value of the cost differential.<br>I think the answer to which school to pick, with that financial consideration in the picture is clear.  Even die hard Cornell people here have agreed.<br>I’m also telling you that even without that differential in place, there are those who have carefully looked at both choices that would prefer Berkeley or other state schools to Cornell.  There is an intensity, an edge, something about the atmosphere at Cornell that does not appeal to a number of people who have the direct choice of going there or to another school without the ivy luster, the NYC connections and higher rankings on standard lists.  I see it all of the time because Cornell is s staple on college lists here in my area. No question at all, that it’s a great school and that those who complete there get a fine education and a boost in terms of finding sought after jobs.  I wish some of mine had given Cornell the thumbs up (as well my alma mater, but there are those preferences)<br>You have two excellent choices. You are sitting pretty in that either choice is wonderful and you will be the envy of many regardless which one you choose.<br><br>", "<b>Username: PurpleTitan</b><br><br>Yep.  People tend not to be grateful for what they have and yearn for what they don’t have, but look at it this way:<br>Through no achievement of your own, you live in CA instead of NV, and because of that, you get a discount to Cal.  If you lived in NV, both Cornell and Cal would cost a huge amount for you.  Granted, UNR and UNLV would probably be free or close to it, but then again, they would be to you as a CA resident as well if you had applied there.<br><br>", "<b>Username: badgolfer</b><br><br><br>\"\"<br>@hstarschools : maybe it is best if I exit this relatively privileged conversation on CC and have an honest conversation with my parents<br>\"\"<br><br>Cal is to the left politically of Cornell. You’ll find more people who share your angst about “privilege” there, so perhaps it is a better fit<br><br>", "<b>Username: Alexandre</b><br><br>No university is $160k better than Cal…not Stanford, not Harvard, not MIT, and not Cornell. Flawed rankings try to push the notion onto the public that Cal is a marginal top 20 university. It is not. It is an unanimous top 10 university, on par with the likes of Columbia, Cornell and Penn. Cornell will be more heavily recruited by Wall Street IBanks, just as Cal will be more heavily recruited by Silicon Valley tech companies. But that does not justify the $160k delta.<br>Of course, if money is not a concern whatsoever, then going for fit may make Cornell the better option. But otherwise, Cal is the way to go here.<br><br>", "<b>Username: hstarschools</b><br><br>@Alexandre I disagree because a family that does not qualify for need-based financial aid should, in my opinion, invest the extra money for their kid to go to a school like Harvard or Stanford; the kid deserves to have their spot at one of those types of schools. My original question is about CC’s general opinion on whether a family should spend the money to send their kid to a top but lower ranked private school vs. a somewhat similarly ranked state flagship (if they reside in a state such as California, Michigan or Virginia). Of course, this question is irrelevant to a family who considers the ~$160k difference to be “chump change.”<br>Another data point that I wanted to include is that tuition at Cornell’s contract colleges is $20k less than full sticker price for New York State residents. That is a net savings of $80k, a pretty penny, over four years that a student gets simply for having family residing in the state of New York. This data point is important for my concern about value; why should I as a California resident, who benefits from large tuition remissions at my local UCs and CSUs, pay a premium to attend a school that gives tuition remissions to its local state students that I am unable to benefit from? To me this is a conversation similar to: why pay out-of-state tuition? Although I understand that Cornell is a private school, not a state school. If the debate was between a lower ranked UC and Cornell the choice would be Cornell, but a debate between Berkeley or UCLA and Cornell has a little more meat to it (for a CA state resident). My overall question is: should I not be thinking about this scenario this way? Is Cornell’s NY State Resident tuition, cheaper than sticker price but still quite expensive compared to the in-state rates of state schools, significant in the discussion of the school’s value? Thank you.<br><br>", "<b>Username: hstarschools</b><br><br>@mom2twogirls You mentioned a couple of times that I seem to “prefer Berkeley” and I want to make the correction that I do not, I prefer Cornell. This post is about a financial decision that my family is going to make.<br><br>", "<b>Username: Greymeer</b><br><br>^ “This post is about a financial decision that my family is going to make.”<br>The ROI favors Berkeley. The weather favors Berkeley.<br><br>", "<b>Username: tk21769</b><br><br>I don’t see how the state resident discount is relevant at all. Virtually all colleges charge various net prices for various reasons. Carnegie Mellon has a bagpipe scholarship.  One of the Loyolas has a scholarship for Catholic students named “Zolp” (https://www.thebestcolleges.org/weird-scholarships/).<br>Are we trying to come up with reasons to feel better for choosing Berkeley by devaluing Cornell?<br>No need. They are peer schools regardless. Certainly close enough that a $160K price advantage is sufficient reason to choose one over the other.<br><br>", "<b>Username: oldfort</b><br><br>I have 2 girls who went to Cornell (most long time CC’ers would know that) and I also have 2 nephews from CA who also went to Cornell, so I have long history with Cornell.<br>The reason my kids chose Cornell over other schools was for its size.  They did not want small LACs.  They wanted the feel of “large public school,” but with funding/resource/flexibility of a private school.  Cornell and NU fit the bill, but they didn’t want to go to a school in the midwest.<br>Cornell gets some funding from NY state, at the same time they are not beholden to NY government on how to run the school.  I think until you have worked in a government agency you really do not have any idea how much you have to adhere to government’s policies and “perceptions” to general public.  As an example, most companies encourage their employees to work from home, but most of NY government employees (SUNY included) do not due to perceptions.  If there are critical conferences at vacation resorts (Vegas, Miami, Scottsdale, et) you are most likely not able to go because of perception.  How much one could get paid (not matter how specialized your skills are) is also capped.  Their procurement process (buying new technology/equipment) is long and tedious.  Cornell does not need to follow those rules because it is a private institution.  They have large endowment through private donations that they could provide great resource to their students.  They do not need to go through 20 layers of approval every time they want to try something new (very important for advanced technology).<br>Berkeley is a great school with very good reputation.  If I lived in CA I would have a difficult time in sending my kids to other peer private schools.  At the same time, I would consider its ongoing budget issues, diversity of its students (large percentage of Asians), resources available to its students, red tape at the school because it is public.<br>Even though Cornell is a large research uni, both of kids’ majors (Math, Philosophy) were so small that each student was able to give a speech at their departmental graduation.  To be expected, majors like Economics had much larger number of students.  Few times when my kids had issues, from dorm room, grading, to study abroad, were quickly resolved.  My emails to the school were always answered promptly.  Now they are few years out of Cornell, they are still very connected to the school because many Cornellians have common experiences (slope day, Halloween parties, even prelims).  Cornellians are roommates after graduation, they look out for each other at work, and refer jobs to their friends (D2 has landed 2 jobs through her friends at Cornell).  Both of my nephews were able to get summer internships by contacting some alumini.  My kids were in large introductory courses first year, but most of their advance classes in their majors were small.  They knew their professors well.  D2’s professors wrote very personal recommendations for her law school applications.  One of them still get together with D2 whenever he is in town.<br>I do not know Berkeley’s alumini network.  I can only offer what I know of Cornell based on my kids and nephews’ experiences.<br><br>", "<b>Username: monydad</b><br><br>re #51: “…why should I as a California resident, who benefits from large tuition remissions at my local UCs and CSUs, pay a premium to attend a school that gives tuition remissions to its local state students that I am unable to benefit from?”<br>If the situation was actually true, reasonable answers would include: if the subject programs at the school were that good; the school environment and programs seemed to fit  the OP so much better; OP wanted to experience life in a different part of the country, (others)<br>However the stated situation is only true if the OP is admitted to one of the contract colleges at Cornell. The endowed colleges: arts & sciences, engineering, architecture, hotel-  do not offer discounted tuition for New York residents.<br>Someplace on this thread the OP mentioned Dyson. I don’t know if OP is admitted to Dyson, but if so it might be worth it, based on what I’ve read.<br>Depending of course on how much the money “matters”. If the money matters above all, then there is really nothing further to discuss.<br>There are tons of past  Berkeley vs Cornell threads OP can check, But of them all I can refer to # 20 of this one<br>https://talk.collegeconfidential.com/discussion/comment/9995497#Comment_9995497<br>written by a poster who did BS Cornell grad school Berkeley.<br>Still looking for the relevant old threads but IIRC California students who attended Cornell cited that it had a more diverse student body, interesting to know “east coast” people who are different  (somehow), they liked the exposure to a different part of the country. Among other things.<br><br>", "<b>Username: PurpleTitan</b><br><br>^ Cornell is a bit more diverse.<br>Roughly half the student body is from the Northeast.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> moneydad:<br>\"\"<br>IIRC California students who attended Cornell cited that it had a more diverse student body<br>\"\"<br><br>Depends on what kind of diversity.<br><br>State of origin:  yes.<br>SES: no (Cornell is much more skewed toward students from high SES backgrounds).<br>Race/ethnicity:  depends on what you are looking for.<br><br><br>", "<b>Username: DadTwoGirls</b><br><br>“I also have an interest in computer science and technology,”<br>Cornell is strong for these, but Berkeley is stronger.<br>I don’t see any reason to spend the extra $200,000 to go to Cornell. These are two great schools. If the price was the same I would see this as a hard decision but would probably go to Cornell. On the other hand I love real winters which may skew my preferences. Given how close the decision is I would be inclined to save the $200,000 for some other purpose.<br><br>"]}