{"title": "umich vs ut austin premed", "comments": ["<b>Username: UniK</b><br><br>I know that I don’t have any time left but I really need to know where to go for the next four years of my life. I got accepted into Michigan LSA and UT and I’m looking to go into premed. I originally applied for UT’s neuroscience but instead got my second choice major, psychology. I’m a Texas resident, so I got instate for UT and the freaking expensive OOS tuition for Michigan. Although going to Texas may be comfortable (as I’d be close to my family and have cheaper tuition), I want to have a more global college experience (even though I know UT is #3 in study abroad programs, but I want more than just studying abroad).<br>I visisted both campuses and I really liked basically everything about Michigan except for, again, its freaking high tuition (which for me comes around $60,000 a year compared to UT’s $25,000 annual tuition). My parents said that they’re willing to pay for either one.<br>I tried applying for Michigan’s honors program and four-year scholarship but missed both deadlines. I heard that Michigan’s premed programs are #1 and that Michigan is a top tier level 1 school (nationally ranked #27) compared to UT (#49) not to mention that it does have a powerful network as well as prestige (not saying that UT isn’t well known but that Michigan is pretty famous). Also Michigan has its own hospital so I’m guessing it can be really convenient for hospital volunteering, research, internships, etc. At the same time, I got into UT’s Jefferson Scholars Program, but I don’t know how that’ll help me really. If I go to UT, though, I’m considering transferring to the College of Natural Sciences (and maybe into its honors program) because that’s where I originally wanted to be, but I don’t know if it will be difficult or not.<br>What I’m really worried about is that if I go to UT, although I’d be closer to my family and be more comfortable by paying less tuition, I’d miss a lot of opportunities at Michigan (and maybe some of its prestige) but also be bombarded with higher competition than at UT. However, if Michigan is similar to UT but I go to Michigan anyway, I’d be carrying a $160,000 price tag along with Med School tuition. Basically, is the price tag worth the education and premed preparations I’ll be getting at Michigan?<br>edit: I posted this discussion on the wrong thread but everyone said that UT is better because it’s cheaper. Aside from money, is Michigan really worth it, even if I didn’t get into any honors/special programs?<br><br>", "<b>Username: CU123</b><br><br>Wrong place for thread, but most posters are going to say save your money and go to UT.  These are two very large public universities and will give you virtually the same experience.  You will miss no opportunities.  You will be one of thousands except at UT you will be special in the sense of being a Jefferson Scholar, the more I type the more its obviously UT.<br><br>", "<b>Username: Publisher</b><br><br>Based on the financial consideration, this is an easy choice = UT-Austin.<br><br>", "<b>Username: thumper1</b><br><br>What opportunities do you think you would be missing by attending UT?<br>Save your money because if you DO get accepted to medical school, you will need the money for that.<br><br>", "<b>Username: thumper1</b><br><br><br>\"\"<br>if Michigan is similar to UT but I go to Michigan anyway, I’d be carrying a $160,000 price tag along with Med School tuition<br>\"\"<br><br>Didn’t you say your cost per year at Michigan is $60,000? If so…that’s $240,000 for four years and that doesn’t account for any increases in costs for the four years of undergrad.<br><br>", "<b>Username: ucbalumnus</b><br><br>As a Texas resident, wouldn’t attending UT Austin for undergraduate allow you to save money for medical school and be more convenient to travel to interviews at (lower cost) Texas public medical schools if/when you apply?<br><br>", "<b>Username: OhiBro</b><br><br>There is no way I would spend 4 years of my life in Ann Arbor, especially if Austin is the alternative. And I advised my child as such.<br><br>", "<b>Username: cptofthehouse</b><br><br>Michigan not worth it with Austin as the alternative. I think it’s insane to enrich another state school that is equal or close to quality and name recognition without getting a comparable price.<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>There is no way I would spend 4 years of my life in Ann Arbor, especially if Austin is the alternative. And I advised my child as such.<br>\"\"<br><br>That’s exactly how I feel, and my Class of 2022 kid felt, except the other way around.  My DC18 picked AA and loves it!<br>If money were no object, then I’d pick UMich. If money matters, then UT is the obvious choice.<br><br>", "<b>Username: privatebanker</b><br><br>Same prestige. Don’t worry about that. It’s very common for the proximity and familiarity to lessen the attractiveness of a state flagship.  UT is an academic peer of UMich.  If you are going to med school you’ll need another 300k perhaps. And Texas has great med school options.<br>However if the money issue is irrelevant in the end, no one would ever second guess you choosing UM either.<br><br>", "<b>Username: happy1</b><br><br>UT and UM are both among the top public universities in the country.  You would be wise to save the money and go to UT, especially if med school is a consideration in your future.<br><br>", "<b>Username: UniK</b><br><br>I know that I don’t have any time left but I really need to know where to go for the next four years of my life. I got accepted into Michigan LSA and UT and I’m looking to go into premed. I originally applied for UT’s neuroscience but instead got my second choice major, psychology. I’m a Texas resident, so I got instate for UT and the freaking expensive OOS tuition for Michigan. Although going to Texas may be comfortable (as I’d be close to my family and have cheaper tuition), I want to have a more global college experience (even though I know UT is #3 in study abroad programs, but I want more than just studying abroad).<br>I visisted both campuses and I really liked basically everything about Michigan except for, again, its freaking high tuition (which for me comes around $60,000 a year compared to UT’s $25,000 annual tuition). I tried applying for Michigan’s honors program and four-year scholarship but missed both deadlines.  I heard that Michigan’s premed programs are basically #1 and that Michigan is a top tier level 1 school compared to UT (Also Michigan has its own hospital so I’m guessing it can be really convenient for hospital volunteering, research, internships, etc.). At the same time, I got into UT’s Jefferson Scholars Program, but I don’t know how that’ll help me really. Also, if I go to UT, I’m considering to transfer to the College of Natural Sciences because that’s where I originally wanted to be.<br>What I’m really worried about is that if I go to UT, although I’d be closer to my family and be more comfortable by paying less tuition, I’d miss a lot of opportunities at Michigan but also be bombarded with higher competition than at UT. However, if Michigan is similar to UT but I go to Michigan anyway, I’d be carrying a $160,000 price tag along with Med School tuition.<br>I really don’t know what to do and what would be the best not only for my college experience but for pre med and my future preparations for medical school<br><br>", "<b>Username: yikesyikesyikes</b><br><br>If fit is a really major concern (and it is 100% okay if it is) and you can afford it --&gt; Michigan.  Otherwise, I would definitely go the UT route.  Both schools will serve a premed well.<br><br>", "<b>Username: CU123</b><br><br>If you love it you return, here are the top retention rates.  Both UM and UT have impressive retentions rates for public universities.<br>Columbia University<br>New York, NY<br>99%<br>Massachusetts Institute of Technology<br>Cambridge, MA<br>99%<br>University of Chicago<br>Chicago, IL<br>99%<br>Yale University<br>New Haven, CT<br>99%<br>Brown University<br>Providence, RI<br>98%<br>California Institute of Technology<br>Pasadena, CA<br>98%<br>Dartmouth College<br>Hanover, NH<br>98%<br>Northwestern University<br>Evanston, IL<br>98%<br>Princeton University<br>Princeton, NJ<br>98%<br>Stanford University<br>Stanford, CA<br>98%<br>University of Notre Dame<br>Notre Dame, IN<br>98%<br>University of Pennsylvania<br>Philadelphia, PA<br>98%<br>Carnegie Mellon University<br>Pittsburgh, PA<br>97%<br>Cornell University<br>Ithaca, NY<br>97%<br>Duke University<br>Durham, NC<br>97%<br>Georgia Institute of Technology<br>Atlanta, GA<br>97%<br>Harvard University<br>Cambridge, MA<br>97%<br>Johns Hopkins University<br>Baltimore, MD<br>97%<br>Northeastern University<br>Boston, MA<br>97%<br>Rice University<br>Houston, TX<br>97%<br>Tufts University<br>Medford, MA<br>97%<br>University of California–Berkeley<br>Berkeley, CA<br>97%<br>University of California–Los Angeles<br>Los Angeles, CA<br>97%<br>University of Michigan–Ann Arbor<br>Ann Arbor, MI<br>97%<br>University of North Carolina–Chapel Hill<br>Chapel Hill, NC<br>97%<br>University of Rochester<br>Rochester, NY<br>97%<br>University of Virginia<br>Charlottesville, VA<br>97%<br>Vanderbilt University<br>Nashville, TN<br>97%<br>Washington University in St. Louis<br>St. Louis, MO<br>97%<br>Georgetown University<br>Washington, DC<br>96%<br>Lehigh University<br>Bethlehem, PA<br>96%<br>University of Florida<br>Gainesville, FL<br>96%<br>University of Maryland–College Park<br>College Park, MD<br>96%<br>University of Southern California<br>Los Angeles, CA<br>96%<br>Worcester Polytechnic Institute<br>Worcester, MA<br>96%<br>Boston College<br>Chestnut Hill, MA<br>95%<br>College of William and Mary<br>Williamsburg, VA<br>95%<br>University of California–San Diego<br>La Jolla, CA<br>95%<br>University of Georgia<br>Athens, GA<br>95%<br>University of Texas–Austin<br>Austin, TX<br>95%<br>University of Wisconsin–Madison<br>Madison, WI<br>95%<br>Villanova University<br>Villanova, PA<br>95%<br>Emory University<br>Atlanta, GA<br>94%<br>North Carolina State University–Raleigh<br>Raleigh, NC<br>94%<br>Ohio State University–Columbus<br>Columbus, OH<br>94%<br>Stevens Institute of Technology<br>Hoboken, NJ<br>94%<br>University of Washington<br>Seattle, WA<br>94<br><br>", "<b>Username: bethany23</b><br><br>i’ve visited both and they’re both very nice and have good stats, personally i think UT is the better option since it’s more affordable and i don’t think you’ll be missing anything there. you can also always transfer later if you don’t like it<br><br>", "<b>Username: rjkofnovi</b><br><br>“There is no way I would spend 4 years of my life in Ann Arbor, especially if Austin is the alternative. And I advised my child as such.”<br>That’s your misfortune.<br><br>", "<b>Username: warblersrule</b><br><br><br><br><br> UniK:<br>\"\"<br>I heard that Michigan’s premed programs are basically #1 and that Michigan is a top tier level 1 school compared to UT<br>\"\"<br><br>You are worrying far too much about prestige. Like Michigan, UT Austin is one of the best universities in the world, and it’s the only public university in the US with an endowment as large as Michigan’s. Additionally, Austin is a great town, the weather is nice, there’s tons of school spirit and great athletic teams, and you’re saving a massive amount of money. What’s not to like?<br>You’re hardly missing out by going with such an excellent in-state option.<br><br>", "<b>Username: rjkofnovi</b><br><br>“Like Michigan, UT Austin is one of the best universities in the world, and it’s the only public university in the US with an endowment as large as Michigan’s.“<br>The University of Texas has a total endowment of over 24 billion, but that amount is for all its campuses (8) comprising over 214,000 students.  Michigan’s endowment is over 12 billion, but that amount is for a total of 62,000 students (3 campuses).<br><br>", "<b>Username: UniK</b><br><br>@privatebanker My parents did say that they’d support my decision to go anywhere and are willing to pay for my finances.<br>If money wasn’t relevant, then why should I choose Michigan? What advantages over UT would I get going to Michigan?<br><br>", "<b>Username: warblersrule</b><br><br><br><br><br> rjkofnovi:<br>\"\"<br>The University of Texas has a total endowment of over 24 billion, but that amount is for all its campuses (8) comprising over 214,000 students. Michigan’s endowment is over 12 billion, but that amount is for a total of 62,000 students (3 campuses).<br>\"\"<br><br>Such a comparison isn’t very useful, though, because university systems don’t split the income from their endowments equally, nor does state funding go to all schools equally. In Michigan, for example, the Ann Arbor campus receives roughly 87% of state funding, whereas Dearborn and  Flint receive only 6.5-7% each. UT Austin doesn’t dominate the other UT schools to the same extent, but more money is earmarked for UT Austin than for any other UT school.<br>The 2018 NACUBO endowment figures:<br>$30,886,018 - UT system<br>$11,901,760 - Michigan<br>The precise breakdown of funds from the UT endowment varies from year to year, but UT Austin receives a minimum of 45% of the UT profits from the Permanent University Fund (a hefty chunk of the UT endowment), and the actual percentage is usually higher. Even if UT Austin lays claim to a slightly smaller percentage of the overall UT endowment - say, 40% - it still has a very respectable $12.3 billion.<br>Michigan and UT Austin are pretty comparable in size, enrolling 46,700 and 51,800 students, respectively.<br><br>", "<b>Username: privatebanker</b><br><br>Oh please let’s not go down the endowment dollars per student path.<br>And many endowment dollars are restricted and separate pools for different outcomes. They are both well funded.<br>These pissing contests are just a waste of time.<br><br>", "<b>Username: privatebanker</b><br><br>Op. I think you will have no measurable difference in potential outcomes at either school.<br>However, there are individual preferences that can have an impact. Where are you going to work the hardest and have the motivation you’ll need to make it to med school?<br>Simple things like weather and atmosphere. Social life.<br>But each school is known for excellent opportunities in all areas.<br>But some people like red wine. Some prefer white. What can I say?<br>However. I think if you are honest with yourself you need to ask a few questions.<br>-Am I interested in Michigan simply because it’s not UT?<br>-Do I think I have earned something more exotic than UT and you don’t respect all the others form your school who are going. You’re smarter and have just worked harder.<br>-if I knew I was just going to UT I wouldn’t have done all the things I did<br>-Am i jealous of people leaving Texas on some exciting and exotic journey.<br>-Rich kids in my school can do whatever they want and I want to show them I’m just as good.<br>-Michigan makes everyone know I’m smart. UT doesn’t say the same thing.<br>-I would like to go somewhere where no one knows me so I can create a whole new person. Kind of way to start over.<br>-am I trying to find every piece of info I can find to support a decision I know in my heart is a bit foolish?<br>-am I being honest with others about my motives?  Am I hiding my feelings to get them to see my way ?<br>-Is there something. About yourself that you can’t be genuine about in Texas and need some distance ?<br>-do I really want to be a doctor or is it another thing I’m doing to make people see me as a smart person.<br>-is being seen as smart or smarter than others part of my identity and I am afraid of losing that s little with my decision ?<br>-I don’t know how I’m going to pay for med school and I’m just not sure it matters more than the value I receive from how others perceive me ?<br>You don’t need to answer these for me or anyone else. Just yourself. Make sure your motivations are known to you. Be honest.<br>Because UT and Mich are the same  level of excellence. They both have huge school spirit and fun. Great college town and city. Big time sports. Huge resources. Smart students and world class professors. Research leaders and access to a vast medical ecosystem.<br>One is really inexpensive. One is expensive. You will need money in a big way in four short years. That’s why people like me are making sure you making a wise and mature decision. The decision could be either but it should be viewed coolly and not emotionally. It’s an investment.<br><br>", "<b>Username: rjkofnovi</b><br><br>“Because UT and Mich are the same level of excellence.“<br>But are they actually?  Doesn’t Texas still have the top 10% (6%?) rule regarding instate admissions?  Isn’t UTA overwhelmingly made up of instate students?  I would imagine the students who attend from the best high schools in the state of Texas would really feel that in their interactions with others who are coming from lesser grade  schools.<br><br>", "<b>Username: thumper1</b><br><br>@UniK<br>Will your parents also fully fund medical school costs…including cost of living? If not…maybe save that undergrad money towards medical school…if you get that far.<br><br>", "<b>Username: OhiBro</b><br><br><br>\"\"<br>@privatebanker said:<br>Oh please let’s not go down the endowment dollars per student path.<br>…<br>-Michigan makes everyone know I’m smart. UT doesn’t say the same thing.<br>\"\"<br><br>???<br>I wonder if people would avoid a doctor that went to undergrad at UT?<br><br>", "<b>Username: privatebanker</b><br><br>@rjkofnovi   I’ll go down this path one more time. I know you love your school.  And you should.<br>However. To your point. Roughly 17000 out of the 29000 um undergrads are from Michigan.  You can do the math but it is a clear majority.<br>So not sure how the mostly Texans thing is any different from a mostly Michigander thing.<br>From UT website “For Fall 2017, only one in every eight non-automatically admitted Texans, however, gain admission.<br>The admitted student profile for OOS students looks similar to admitted Texas students who rank outside of the top 7% of their high school.Dec 1, 2018”<br>The Texas auto admits are even stronger than the out of state admits.<br>They are academic peers. In some majors UT is better and in some the opposite is true.<br><br>", "<b>Username: rjkofnovi</b><br><br>Texas is approximately 80% instate. Michigan entering classes hover just above 50% instate.  That’s a big difference. There are also no restrictions of who automatically gets in at Michigan. Facts<br><br>", "<b>Username: rjkofnovi</b><br><br>“The Texas auto admits are even stronger than the out of state admits.”<br>That’s surprising. I can’t imagine that auto admits from over 1000 Texas high schools are all equal in terms of stats. I’m also surprised that OOS admits are weaker than instate.  That certainly is not the case at U-M.<br><br>", "<b>Username: mom2collegekids</b><br><br><br>\"\"<br>Basically, is the price tag worth the education and premed preparations I’ll be getting at Michigan?<br>\"\"<br><br>The beauty of going to UT as a premed is that their advising, etc, is VERY much geared to the TMDSAS application.  Plus, you’ll be in Texas for the convenience of med school interviews.<br>Now, you may be thinking…but I will want to apply to non-Texas meds, and you sure can try that.  UT advising also supports the AMCAS app.<br>BUT…here’s the deal.  As a Texas resident, other med schools know that if push comes to shove, a Tx resident will more likely end up choosing a super-low-cost Texas med (even private Baylor Med is cheaper for instate) over an OOS much more costly med.  we’ve seen many Tx residents get plenty of love from Texas meds and the cold shoulder from OOS…even with very high stats.  Sure, there are exceptions.  And, if you’re lucky to get into an Ivy med, then they often provide grants to help make their costs more affordable.<br><br>", "<b>Username: badgolfer</b><br><br><br>\"\"<br>@UniK writes: I tried applying for Michigan’s honors program and four-year scholarship but missed both deadlines.<br>\"\"<br><br>IMHO this is the most important sentence you posted.<br>Success in premed is built on daily study averaging 3-4 or more hours, day after day, week after week.  It’s a self-imposed goal and there is no obvious sign if you skip it.  But each time you fall a bit behind the kids that continue to put in the work. Come test time it shows up.  In college there are lots of distractions, friends to hang out with, stuff on campus, and sometimes you just don’t feel like locking yourself away with the books. It’s easy to say “I’ll make it up later” but somehow that never happens.<br>You blew thru deadlines for the program you wanted and for a big pot of money that could have helped you.   When you get to college, whichever you choose, you might want to pay special effort to ensure that you hit your daily and weekly goals so you don’t look up at the end of the semester and find out once again you’ve missed a target gpa-wise.<br><br>", "<b>Username: mom2collegekids</b><br><br>Save money for med school!!!  Ask parents about that<br><br>", "<b>Username: CU123</b><br><br>UT is pulling from a MUCH larger population then UM, in state, so the quality of the in state UT student will be higher.<br><br>", "<b>Username: rjkofnovi</b><br><br>^^^^Thats nonsense.  No way to prove it. Furthermore, Michigan is not obligated to take any percentage of instate students. I would argue the exact opposite of what you said.<br><br>", "<b>Username: crankyoldman</b><br><br>OP, something to consider-it’s really, really tough to do study abroad as a pre-med.<br>And both are superb schools, so I’ll join the “save the money” chorus.  But it seems you’ve answered your own question-you clearly want to go to Michigan.  So if the folks are willing to pay, and if potential huge costs for medical school are not an issue, then it’s clear you prefer Michigan over Texas.<br><br>", "<b>Username: mikemac</b><br><br><br>\"\"<br>OP, something to consider-it’s really, really tough to do study abroad as a pre-med.<br>\"\"<br><br>There are a dozen or so courses required to apply to med school.  See for example https://cns.utexas.edu/health-professions/current-students/health-profession-pathways/pre-medical#pre-med-course-requirements  (1 class is 3 hours)  By planning carefully it should be possible to fulfull all the requirements and study abroad.<br>Many students who study abroad report it is one of the best experiences of their time in college.   You’ll learn (because you have to) skills to function in the presence of considerable uncertainty as you navigate in a world where you are not fluent and that runs under different expectations.  You’ll gain a new perspective on life back home.<br><br>", "<b>Username: crankyoldman</b><br><br>Sorry Mike but have to disagree; it’s very very hard to study abroad if you’re planning on applying to medical school during your senior year of college.  It’s not just the required courses, it’s the MCAT prep, it’s the ECs, it’s the physician shadowing, it’s (for some) the research.<br>If OP was referring to summer only programs, that’s more easy to do.  But medical school only starts with completing course requirements.  So is it possible?  Sure, but doing so will add a level of stress to an already stressful process.<br>So it can be done(see Princeton advice, below) but will clearly be adding a level of stress to the process:<br>https://hpa.princeton.edu/faqs/academics-faq/study-abroad<br>Now if OP is considering medical school after obtaining his/her bachelor’s with a gap year, that’s a separate consideration.<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>If money wasn’t relevant, then why should I choose Michigan? What advantages over UT would I get going to Michigan?<br>\"\"<br><br>A few minor points, but UT is an outstanding school and much cheaper!<br>For the Class of 2022, in-state/OOS ratio:<br>UMich was 52% in-state and 48% OOS<br>UT is 91% in-state and 9% OOS.<br>So, if you want to meet many more students from other areas of the country, UMich would be the choice.<br>Student-Faculty Ratio:<br>UMich 15:1 (2018-2019 CDS)<br>UT 18:1 (2017-2018 CDS)<br>Freshman Class Size:<br>UMich 6,680 (23% acceptance rate)<br>UT 8,238 (36% acceptance rate)<br>UMich has a D1 Hockey team and D1 hockey is exciting to watch!<br><br>", "<b>Username: coolguy40</b><br><br>If there’s one preference medical schools give to applicants, it’s being a Texas resident. Going in-state is your best shot at getting into medical school.<br><br>", "<b>Username: UniK</b><br><br>Thank you, everyone, for the wonderful advice! Although I really did want to go to Michigan for its diverse community and probably its prestige, I feel that UT Austin is also a great institution that can also provide me quality experiences at a fraction of Michigan’s cost. Also, if I really want to go to Michigan, I work hard at UT to attend Michigan’s medical school. Again, thank you for everyone’s advice, and I’ll make sure to keep in mind these helpful tips for the future!<br><br>", "<b>Username: rjkofnovi</b><br><br>That is the intelligent choice.  Best of luck!<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> UniK:<br>\"\"<br>Although I really did want to go to Michigan for its diverse community<br>\"\"<br><br>Texas is more diverse in SES (24% Pell versus 15% at Michigan) and race/ethnicity (largest race/ethnicity is 42%, versus 60% at Michigan).<br><br>"]}