{"title": "knox college vs allegheny college", "comments": ["<b>Username: Theoden</b><br><br>Hi!<br>My son was accepted to Knox College and Allegheny College.  We live in NYC.<br>We are going to visit both this month and attend accepted student events.<br>What are your thoughts if you either compared the two, visited both, or attended/have a child there?<br>Academics, Social Life (Greek vs. non-Green, friendliness), Diversity, Marketable Degree?<br>They both seem to be real treks to get to from NYC for breaks, etc.<br>Thanks,<br>Theoden<br><br>", "<b>Username: Midwestmomofboys</b><br><br>I don’t know Alleghany, but my kid – and I – were very impressed with Knox. After some lean years, Knox is raising money from alums, and has renovated several facilities, including Athletics and academic buildings, including one which was the site of a Lincoln/Douglas debate. New fine arts buidling was built after my kid visited, and we understand renovation of performing arts building was the next step after new fine arts building was completed. I happened to sit next to the President at an athletic event and had a wonderful conversation with her. My kid’s all-time, number 1 favorite class he sat in on during college visits, from Bates to Dickinson to Knox and Grinnell – was a Poli Sci class at Knox – he said the prof was riveting and the discussion great. Faculty were generally very responsive, Jazz Professor spent an hour with my kid, discussing performance options. We know a few grads who had taken advantage of all opportunities and really flourished in their post-grad life, including top 5 law school. Lovely library, renovated science facilities, non-traditional greek life. I was impressed that, when my kid was visiting for a weekend and I was meeting him at a central location on Sat night around 10-11pm – there were no drunk kids wandering around being stupid. Galesburg is not a metropolis but it has its charms, there are several blocks with student-related shopping, including pizza, coffee, pub etc.<br><br>", "<b>Username: cptofthehouse</b><br><br>THey are treks from NY.  Both schools have gotten great feedback from parent whose kids have gone.  My closest friend and her husband went to Allegheny.  It was favorite school for those living in western PA and is well regarded there.  Knox College comes up often as a very nice LAC where the kids get a lot of attention.  A number of such schools out there, and they each have their special flavor. A matter of personal preference as to what is the best fit.<br><br>", "<b>Username: blue1516</b><br><br>A major difference is that Knox runs on trimesters and Allegheny has semesters. Knox school year ends about 3 weeks later than Allegheny which may effect summer opportunities.<br><br>", "<b>Username: Empireapple</b><br><br>Allegheny is very, very nice.   IMHO, they attract smart kids and have solid academics with a rich collegiate history.   My son was given a wonderful scholarship to Allegheny but that year we had so much snow and bad weather we were unable to get to all the colleges we wanted to visit.<br><br>", "<b>Username: taverngirl</b><br><br>Haven’t been to Knox, but we toured a ton of LACs and loved Allegheny. It was on my dd’s list until the end. We visited three times and every interaction was great. Loved the students, faculty and administration. Academics were solid. Nice campus. Great merit! What major is your son considering? Drawback for us was the 8 hour trek (min) from CT. And dd ultimately decided she wanted a bigger school.<br><br>", "<b>Username: Theoden</b><br><br>@Midwestmomofboys Thanks for the helpful insights.  It seems like the school is amazing and pays attention to the students.  I am a Bates grad and my son wasn’t accepted there.  He also got into Bard and Muhlenberg, but the merit scholarships and Allegheny were quite generous.  Is your son a Junior, Senior?  Did he pick a school yet?  Thanks for the insights.<br><br>", "<b>Username: Theoden</b><br><br>@blue1516 Thanks…yup, I noticed the trimester calendar.<br><br>", "<b>Username: Theoden</b><br><br>@Empireapple Yes, my son was also given a nice scholarship at Allegheny and Knox.  We’re excited to see both schools.<br><br>", "<b>Username: Theoden</b><br><br>@taverngirl He’s considering Biology, Environmental Science and History.<br><br>", "<b>Username: Empireapple</b><br><br>When we were exploring Allegheny I remember learning that their Environmental Science program was top notch!  I have always regretted not getting there for a visit.   Enjoy!<br><br>", "<b>Username: Acadia2023</b><br><br>My S will also be visiting Allegheny in the next week or so too. Had a quick visit in the past and liked what he saw. Nice campus, nice people, great academics. He’s looking forward to the overnight to help him make a final decision. Also interested in history…<br><br>", "<b>Username: abbeany</b><br><br>My D is a jr. at Allegheny and my H graduated in '89  It is the true liberal arts education—requiring students to write a senior comp (thesis) and also requiring cross disciplinary majors and minors.  You have to major and minor in subjects that are in different schools.  So and Enviro student couldn’t really minor in a science.  I like this format b/c it really creates a broad minded student and gives kids a chance to meet students from other disciplines.  Meadville is a really, REALLY tiny town but safe and close to P’burgh and Erie.  Greek life is very prevalent but the fraternities and sororities are very involved in their service missions and hosting fun social events.  The Greeks are friendly with each other, for example, my D is living with girls from her and another sorority senior year.  There is a LOT of opportunity to get involved in all aspects of campus life.  Allegheny has made a noticeable push to appeal to a diverse population by approaching HS’s as far away as FL, looking to engage students of multiple races and cultures who may not have thought about a small LAC in PA.  The varsity sports teams are not fantastic, but students attend the games and the facilities are nice.  My D has gotten close with her professors and was asked to be a TA in the film lab (for $) even though she doesn’t have an official work study grant, so that was nice!  The new Wise center is a nice workout facility available for all students.  Good luck w/your decision!<br><br>", "<b>Username: Zephyr19</b><br><br>abbeany- thanks for your comment. If a student wasn’t into joining a frat/sorority…would that be a big disadvantage socially?<br><br>", "<b>Username: abbeany</b><br><br>No. I don’t think so at all.  Although it feels like a lot participate, I think the overall rate is less than 50%.  I will tell you that my D went into college ADAMANT that she would NEVER join a sorority in 100,000,000 years.  They were dumb.  She hated them.  Blah Blah Blah.  She’s now a exec board member of her sorority and actively involved in recruiting new members and very involved in their cause of educating people on safe, healthy relationships and assisting in the local domestic violence shelter.  So never say never!<br><br>", "<b>Username: Zephyr19</b><br><br>Very funny! Thanks for sharing. My S isn’t much of a wild partier and I think he’s in your daughter’s previous camp right now…Greek life’s dumb, blah blah blah. Time will tell.<br><br>", "<b>Username: blue1516</b><br><br>Maybe not an issue for most but health insurance for a student not covered by a family plan that has adequate coverage in the area.<br>Allegheny offers a plan to purchase. Knox does not and a family would have to figure out a plan by themselves.<br><br>", "<b>Username: Theoden</b><br><br>@Acadia2023 I’m taking him for accepted student overnight and checking out the school myself.<br><br>", "<b>Username: Theoden</b><br><br>@abbeany So you won’t be totally bored if you’re not in Greek life, is that true?<br><br>", "<b>Username: Zephyr19</b><br><br>@Theoden We’ll be there in ~10 days too. S signed up for some classes to sit in on. I haven’t seen the campus yet, looking forward to it.<br><br>", "<b>Username: Leigh22</b><br><br>We are going next week - looking forward to it. Will make sure to share son’s experience (and of course my take!)<br><br>", "<b>Username: Theoden</b><br><br>@Leigh22 @Zephyr19  Are you both going to the accepted student overnight with your kids?  If so, we’ll get a chance to meet.<br><br>", "<b>Username: Hapworth</b><br><br>I am a Knox grad, so I say Knox, of course.  <br><br>", "<b>Username: Theoden</b><br><br>@Hapworth We’re visiting Knox for the accepted student day, too. They seem to have a lot in common.  I’d say from, what I’ve read Allegheny is a bit more traditional, but both seem to have small student bodies, low student-to-faculty ratio and excellent experiences for their students.  Both are on the Colleges that Change Lives list.  Can you share your experience at Knox?  The reason I put it on my son’s list for his search is that back when I was looking at Colleges (in the Stone age) the Insider’s Guide to Colleges said that Bates (where I applied and went) was essentially like  the “elite cadre” of liberal arts colleges in the midwest like Knox, Kenyon or Antioch, except that it was in Maine.<br><br>", "<b>Username: Hapworth</b><br><br>@Theoden I attended Knox in the mid-90s, but I still have close ties and pay attention to campus happenings (a play canceled last year because students felt it was insensitive toward Asians–stuff like that).<br>Knox is down-to-earth midwestern, but its student body is quirky-progressive for the most part.  Knox tends to attract the sorts of students who might not have fit in in high school.  Not antisocial, mind you.  Just bright, quirky, and usually creative.  When I attended, there was a bit more balance.  The college was progressive, and so was a good chunk of the student body, but there were more conservative students too.  Nowadays, the school is much more homogeneously liberal, which may not be a problem for your son.  I am liberal, but I made friends with everyone back in the day.<br>Knox’s current president, Teresa Amott deserves a lot of credit for turning things around.  She has been terrific.  The president who was in charge when I was a student launched a 100 million dollar fundraising initiative and then claimed victory five years later.  The problem?  Too much of it was deferred money, money promised down the road but not actual.  25-30% of such funds is fine, but 70% of the 100 million was of this down-the-road sort.  Knox was never in any real trouble (like close-the-door trouble), but it took some time to get things turned around.<br>Now, under Amott’s leadership, things are sort of soaring.  Fundraising is up.  Alumni Hall, a building that stood condemned for decades, was renovated and now houses Admissions, Financial Aid, and a sort of Alumni History Hall.  A terrific new art building opened a few years ago, very modern but also beautiful.  In the past, one single-level building housed admissions, FA, art, music, theater, etc.  Right now, as we speak, the eyesore that was the math and science building is finally being redone so that Knox can boast the sort of STEM (well, STEM minus the “E”) facilities that Grinnell, Beloit, and even Cornell sport (these two last schools recently christened new math/science buildings).<br>The renovated math/science building should be done in 6-12 months, I think? Things are looking up.  That’s my point.<br>Most of the students at Knox come from the midwest, of course.  Around half come from IL.  The next most-represented states are IA, WI, and MN (in that order).  But after that?  The west coast!  CA, OR, and WA are decently represented.  One nice thing is that if your son chooses Knox, he’ll be from the northeast.  48 out of 50 states are represented at Knox, so your son won’t be alone from the east coast, but he will be a rarer gem.  Oh, and Knox boasts a huge international student population, usually between 15% and 20% of the student body.  I had friends from Japan, Spain, Turkey, the Netherlands, etc.<br>Academics are terrific, and your son will get to know his professors by first name.  This would happen at Allegheny too.  Lots of Knox students complain about Galesburg, a once-proud railroad town gone bust, but this is simply the reactions of sheltered students who come from the suburbs of Chicago or the suburbs of some other metropolis.  I liked Galesburg–though, yes, it is pretty red politically.  Think working-class rural town.  Meadville wouldn’t be that much different, I’d imagine.  Your son could find value in Galesburg, especially if he doesn’t have much experience outside NYC or with rural America.  Truth is, I spent nearly all my time on campus.  I had a car and went an entire month without using it.<br>I’ve always admired Allegheny and Juniata from afar, though I haven’t been to either.  They remind me of Knox: top-notch schools that get overlooked because they’re in “flyover country.”<br>If I’ve missed anything, ask away!<br><br>", "<b>Username: Theoden</b><br><br>@Hapworth thanks for the excellent summary. I went to Bates in the mid 80’s and though it was mostly Democrat, conservatives had a place there too. It used to be rather down to earth. Now Bates is heavily in the progressive camp, with a wealthier student body. In fact, I couldn’t get into Bates now with my HS grades and SAT scores.  My sson is solidly a city kid, but so was I when I ended up in a working class Franco-American mill town in Maine for college. My son, however, likes NYC more than I did in the 1980’s. I wanted a taste of Americana. He’s not sheltered and had grown up in culturally diverse neighborhoods with a mix of middle class, well to do and low income working class people. He’s interested in Biology, Environmental Sciences and History. He’s also looking at several SUNY colleges which are in small, rural or rust belt towns in upstate NY.<br>Knox seems a lot like Allegheny, except I’d say Allegheny seems a bit more traditional it’s also a bit bigger with more than twice the endowment. Both punch well above their weight class, have great academics and very dedicated faculty.  It seems with the new President, Knox is definitely on the upswing. Both colleges are on the Colleges that Change Lives list.<br>On another note, they gave him a pretty generous financial package. Do the costs tend to creep up and while the aid remains the same, or do they try to keep the aid in line with the tuition/room and board increases?<br>Thanks,<br>Theoden<br><br>", "<b>Username: blue1516</b><br><br>Merit aid given in original financial package does not increase. Need based aid can increase. Costs do increase. I calculated tuition/room/board total for one school for 2019-20 and it had increased about 4% a year over the last several years.<br><br>", "<b>Username: blue1516</b><br><br>@hapworth That is an interesting point about international students at Knox. Allegheny only has about 4% international students while Knox has about 14%. Based on the reported numbers in the common data set for each school.<br><br>", "<b>Username: Theoden</b><br><br>@blue1516   Thanks.  So costs go up, but the need might go up with it.<br><br>", "<b>Username: Leigh22</b><br><br>I’ll add that Allegheny just got a new president - Hilary L Link. She is coming from an appointment as dean of Temple University Rome.<br><br>", "<b>Username: Hapworth</b><br><br>Hey all,<br>Sorry that I missed some posts.  I was away for a bit.  I think that @blue1516 is right.  Usually, an award says something like, “The Jane Doe Award, $18,000 per year, renewable over four years.”  At the same time, one fills out the FAFSA every year, so the school should try to meet need.  Schools like Allegheny and Knox should be open to working with families, as no school wants to lose a student to dropping out or transferring.  I’d also recommend that the OP ask the schools directly either over the phone, in an email, or in person when the son visits.  Financial Aid employees get these sorts of questions all the time, so don’t be embarrassed.<br>The visits will probably make things clearer, as the OP’s son should have a definite feel for which school is the right fit.  Oh, about the Greek thing raised earlier, and I’m sure this is true at Allegheny as well, but Knox’s Greek options are very mild.  Three fraternities have houses, but the other two or three fraternities do not, and none of the sororities do.  There is no Greek/non-Greek divide.  Parties were open to all, and people who go Greek eat in the cafeteria every day with everyone else.  Really, it’s a non-issue.  This is true at most LACs, though there are exceptions like DePauw (which is something like 70-80% Greek).<br><br>", "<b>Username: Theoden</b><br><br>@Hapworth Thanks. This is helpful. The more I read about both schools, the more I’m impressed. Ultimately it’s my son’s decision.<br><br>", "<b>Username: Theoden</b><br><br>OK - we went to both accepted student overnights.  My son’s got a tough choice in front of him.   Both schools shine brightly.  My son has an interest in Environmental Science and History.<br>Allegheny - incredibly strong Environmental Sciences dept (rated #4 in the country), with Environmental Geology major, too.  Solid History dept.  Beautiful campus.  6-7 hour drive from NYC.  Great student/faculty ratio.  Excellent Gateway program (internships, research, study abroad, peer tutoring, career counseling).  He sat in on two classes (Env Science and History), which were OK, spoke with the professors afterwards (he made appointments) who were nice and answered his questions. It seemed like lots of classes were booked, so these were the ones available.  I sat in on a “master class” for parents, which was amazing.  He did an overnight with a guy who was in a fraternity and enjoyed his time. even made him consider Greek life.   Student body not too diverse, but seemed to have a variety of types and is accepting.  Greeks there, but not a super heavy influence.  He said the food was standard.  Didn’t really visit Meadville, but it seemed a world apart from the campus, though the school really tries to engage with the community.  It rained, then we had a tornado watch, then it snowed.  <br>Knox - solid Environmental Sciences dept, exceptional History dept.  Very nice campus, gorgeous library.  A flight from NYC to Chicago and then a train to Galesburgh, or a flight to Peoria or Quad Cities Airport or a 12-13 hour drive from NYC.  Great student/faculty ratio  Really interesting Trimester program, with solid emphasis on research and internship. peer tutoring and study abroad.  He eavesdropped on some classes and had appointments with two professors who seemed to super-engaging and passionate. Knox is flat in corn-field country.  He stayed in a living-learning suite with a host and everyone seemed friendly.  Student body was pretty diverse and eclectic, almost quirky.  Greek life was there, but not heavy influence.   He liked the food at Knox.  Took a quick bus tour of Galesburgh, which seemed nice.    Very friendly campus and it seemed to have a distinct sense of community and close-knit friendships.  Very bright, sunny, but windy day.  <br>Very similar in many ways.  I mention the weather, because I imagine the season/weather colors your visit.<br>Allegheny is a stronger match for his main academic interest, and still has other options should he change his mind.<br>Knox isn’t as strong in Env Science, but shines in History.  Also it has a certain je ne sais quoi.<br>I think he would be happy in either place.  At the end of the Knox events even he asked me what I thought, and I said, “You have two excellent choices in front of you”.<br>It’s his decision.  And I could see excellent reasons for either school.<br><br>", "<b>Username: Theoden</b><br><br>Ok…so it looks my son is choosing Knox.  <br><br>", "<b>Username: Knowsstuff</b><br><br>FYI. With Knox you can stack scholarships. Talk to them about it. There are like 4 main ones that I remember when my daughter was looking.<br>For others reading for env science. Beloit tends to be strong in that area.<br><br>", "<b>Username: taverngirl</b><br><br>Allegheny also allows stacking of scholarships and FA.<br><br>", "<b>Username: Theoden</b><br><br>Does stacking a scholarship mean you can have more than one?<br><br>", "<b>Username: taverngirl</b><br><br>Yes, and outside scholarships won’t lower your FA award.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Congrats to your son on making his decision – no “wrong” choice there!  We were very impressed by Knox on multiple visits, strong leadership in the administration, tremendous mentoring and support for students, interesting, engaged students. And after 15+ class visits, my LAC kid’s standout visit was the Poli Sci class at Knox where the prof led a riveting seminar.<br><br>", "<b>Username: mamaedefamilia</b><br><br>@theoden.  Although the decision has been made (congrats!) I wanted to add that at a regional college advising event at my child’s school a few years ago, there were a number of admissions representatives in attendance and several spoke in a large general assembly before opening the college fair.  The admissions officer from Knox was by far the most impressive and I have attended many such events and have gone on many campus tours.  He did a great job of selling the school as a place for inquisitive learners and he is one of the few college speakers I remember clearly.  My child took a serious look at Knox because of his presentation, but alas, she was interested in a particular field of study that was not strongly supported there.  In any event, I think your son will be in excellent hands, although Allegheny sounds like it would have been a great choice as well.  Having to soul search over two great options is actually a good problem to have, rather than settling unenthusiastically for a safety.  Best of luck to your family in this next adventure.<br><br>", "<b>Username: Theoden</b><br><br>@mamaedefamilia Thanks for the good words.  He is quite fortunate to have had several good choices. And having to agonize makes is all the more clear how blessed we are.<br><br>", "<b>Username: Hapworth</b><br><br>Booyah!  Another addition to the Knox family!<br><br>", "<b>Username: Theoden</b><br><br>I’d like to express my thanks to all of you who have provided input and helpful advice on this.  It’s been a joyful journey to have you along side me.  Also I’m feeling particularly grateful to two of the Colleges that Change Lives, Knox and Allegheny, for seeing something that’s worth investing in my son and being very generous with aid, making his transition to college possible.  The real hard part was having two excellent choices to wrestle over.<br><br>"]}