{"title": "university of michigan vs northwestern", "comments": ["<b>Username: slb176</b><br><br>My DS was all set on going to the University of Michigan…until he found out yesterday that he was accepted to Medill School of Journalism at Northwestern.  Now, he is so torn and I am wondering how he will decide. Clearly, Medill is one of the best journalism schools in the country and Northwestern is a highly ranked school.    He is very interested in a career in sports — at first, his focus was narrow -  sports journalism/broadcasting.  He is a talented writer and is sports editor of hs paper, enjoys it, etc.  However, as he has gone thru this college process, he has expanded his view of careers in sports and may be interested in sports analytics, sports management, etc…he wants to take classes in communications but also statistics, management, even Spanish – he has though about minoring in Spanish.    I am not sure how flexible his curriculum can be if he is in Medill - I guess he will need to explore.   He has loved University of Michigan since he was young and we have a lot of family who has gone there and he has grown up on Michigan sports.  He is a huge college football/basketball enthusiast and definitely wants a school that has huge school spirit and focus on sports.  I am not sure if one can turn down an acceptance to Medill though.<br>Does anyone have any perspective/insights into either of these schools?<br><br>", "<b>Username: Publisher</b><br><br>As an accepted student at Medill, he can take courses in Weinberg. Your son can double or triple major at Northwestern or take a minor or two in Weinberg.<br>Your son has two outstanding choices so it is easy to understand why the choice is difficult.<br><br>", "<b>Username: moooop</b><br><br>The whole school spirit thing at NU is pretty underwhelming. The students get to go to all home games for free, & still the turnout is small & some leave at halftime. Some of the students simply dont’t care about sports, & others take their academics so seriously that they won’t spare a couple hours for a game.<br>NU students tend to take 4 classes per quarter, so that results in 12 classes per academic year…as opposed to (I’m guessing) typically 10 classes per academic yr at Michigan. That would tend to make dabbling in classes outside one’s major a bit easier at NU (depending on # of required classes).<br>Some students might pick NU over UM due to the proximity of Chicago, but in reality a lot of NU students are so busy they barely get to know the city during their time there.<br><br>", "<b>Username: PurpleTitan</b><br><br>I think you have to take a lot of classes outside Medill as a Medill major.<br><br>", "<b>Username: Alexandre</b><br><br>The Michigan vs Northwestern decision is always tough. I always recommend going with fit if financial concerns are addressed.<br><br>", "<b>Username: yikesyikesyikes</b><br><br>Current Michigan student here.  If he is set on Journalism, definitely NU.  If he is set on sports-related careers, definitely U-M.  This is all not considering major fit issues.<br>In any other case, either school is a pretty rational choice - congratulations to you and your son!<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>The students get to go to all home games for free, & still the turnout is small & some leave at halftime.<br>\"\"<br><br>Home football games are free at Northwestern? Are basketball games free? If so, wow.<br><br>", "<b>Username: moooop</b><br><br>https://nusports.com/sports/2015/3/18/GEN_201401014.aspx<br>Fulltime undergrads get in all home sporting events free. Just show ID. Sometimes they are so eager to get students to attend they even give them a free tshirt<br><br>", "<b>Username: rjkofnovi</b><br><br>I would encourage Michigan.  If he loves sports that much, NU will not satisfy him.<br><br>", "<b>Username: moooop</b><br><br>Some people are going to assume NU is more elite because of its higher ranking in some lists, & its lower acceptance rate. But some international rankings have UM ranked higher, & my kid who graduated from NU recently said it was not unusual to meet students there who had been rejected by Michigan as out-of-state applicants.<br><br>", "<b>Username: Publisher</b><br><br>@moooop : International rankings are usually based on graduate research. Michigan has the second highest research budget–behind JHU–among US national universities. Therefore, for undergraduate study, the international rankings are<br>largely irrelevant.<br><br>", "<b>Username: Publisher</b><br><br>If still undecided, then buy sweatshirts from both schools, try them on & go with the better fit.<br><br>", "<b>Username: moooop</b><br><br>I’m aware of that. Also aware that the difference in ranking in undergrad -focused rankings like USNews is usually small enough to be not very significant either. It’s just that some impressionable people here are easily swayed by rankings, & I was making sure they knew that even with rankings there isn’t a clear-cut favorite between these two.<br><br>", "<b>Username: slb176</b><br><br>Thank you all for your input.  We are going to Admitted Students Day at Northwestern in 2 weeks and have already visited Michigan.  I think he will make decision based on fit and feel after that.<br><br>", "<b>Username: StanfordGSB00</b><br><br>@slb176 - Both are great schools. I would recommend Northwestern because it is more exclusive / elite at the undergraduate level. Most students at Michigan cannot get into Northwestern, except maybe the top 10-20%. Top 10 in USNews vs. Top 30. And now to SAT / ACT scores, Northwestern has had significantly higher scores for many many years compared to Michigan. About a 100 point difference in SAT average until the last year, when scores have been re-centered (causing the scores to converge towards the top). And it is not just about test scores when it comes to exclusive, elite admissions - Harvard could enroll a class with a 1600 perfect SAT average. They are looking for very talented, unique individuals. Northwestern / Duke / Dartmouth, Stanford, etc. could similarly enroll a class with a 1550 SAT average if they wanted to but UMichigan could not. Go look at the RD decisions threads for these schools and you’ll see a ton of students with 1500+ SAT scores / 34+ ACT scores (with perfect grades) rejected on the regular.<br>Northwestern is significantly more impressive on the pedigree level / resume. Why would you pay the same amount of $$$$ to go to a large public school (which is still awesome but not quite the same level as NW) when you can go an elite private school with more resources, a higher caliber student body, smaller classes, etc. It is extremely easy to switch out of Medill and go into WCAS. I think this is a no brainer to go Northwestern if money is no issue. If Michigan was giving a large scholarship, then I would say Michigan could be a great option. But, in this instance, I would go to Northwestern and switch to WCAS after a quarter. Or double major, etc. UMichigan alums will disagree here but if money is not a factor, 90% of students are choosing NW over UMichigan. Good luck and congrats on the acceptances.<br><br>", "<b>Username: rjkofnovi</b><br><br>“Northwestern is significantly more impressive on the pedigree level / resume.”<br>NU is not Stanford.<br><br>", "<b>Username: rjkofnovi</b><br><br>“UMichigan alums will disagree here but if money is not a factor, 90% of students are choosing NW over UMichigan.“<br>I also disagree with this statement.  Michigan offers enough things that NU cannot match.  You make it sound as if these schools are not comparable in any way.  I’m not saying that perhaps the majority of students accepted at both places might choose NU, but you make it sound like it’s not even close.  Furthermore, the nonsense about Michigan being a public school so therefore it cannot compete with a private school is ridiculous.<br><br>", "<b>Username: momofsenior1</b><br><br>I’m also in the go by fit camp.    Academics will be solid at both but there is a big difference in feel of the school and location.<br><br>", "<b>Username: moooop</b><br><br>The ol’ “state schools can’t compete with private schools” thing is a Northeast cliche that people there grow up believing because their state schools are all outclassed by a few local privates.<br>My kid loved Northwestern, & as a parent I have nothing but great things to say about it. The administration is courteous & efficient; the president is visionary and inspiring. But several of kiddo’s friends spent weekends in Ann Arbor visiting high school chums who were attending UM…they all came back raving about how great the town & people were. Evanston is beautiful, & Chicago is spectacular. But neither has a college town atmosphere like Ann Arbor has, so in many ways NU & UM are apples & oranges. But, they are in the same league, literally & figuratively.<br><br>", "<b>Username: HPTD12</b><br><br>I went to NU and as a non-journalism major, I was still active at WNUR Sports.  One of my fraternity brothers is a major personality on ESPN.   Another guy down the hall from me sophomore year is now a major anchor on the Big Ten Network.  Point being that if you work hard (and those guys really did), you can be a very successful sports journalist coming out of Northwestern,<br><br>", "<b>Username: slb176</b><br><br>After a long time of thinking, debating, making pros/cons lists, my son has decided to go to Michigan over NU&gt;  He said it came down to his gut and that he felt he fit better at Michigan than NU&gt;  Hard to turn down Medill but he really is not even sure that he wants to go into journalism as career.   Loves the student life/vibe/sports/spirit at Michigan and the students we spoke to at Northwestern all talked about the stress culture/quarter system which probably weighted on his mind as well.   It was a very very hard decision for him but know that he will be successful wherever he goes!<br><br>", "<b>Username: rjkofnovi</b><br><br>““UMichigan alums will disagree here but if money is not a factor, 90% of students are choosing NW over UMichigan.”<br>Another 10 percenter chooses Michigan.  Hmmm<br><br>", "<b>Username: momofsenior1</b><br><br>Congrats to your son OP!<br><br>", "<b>Username: sushiritto</b><br><br>Go BLUE!<br><br>", "<b>Username: Alexandre</b><br><br>“Northwestern is significantly more impressive on the pedigree level / resume.”<br>StanfordGSB00, I am not sure who told you that, but by and large, most employers, from Fortune 500 companies to Investment Banks, and from Silicon Valley techs to Management Consulting firms do not differentiate between Michigan and Northwestern. As far as academe is concerned, Michigan and Northwestern are considered equally prestigious. Outside of the crowd that worships the US News (aka, impressionable high school children and parents), there are not many highly educated adults who would agree with your statement.<br>“Why would you pay the same amount of $$$$ to go to a large public school (which is still awesome but not quite the same level as NW) when you can go an elite private school with more resources, a higher caliber student body, smaller classes, etc.”<br>So let me get this straight, Michigan is merely a “large public school”, but Northwestern is elite? Are you for real? First of all, Northwestern does not have more resources than Michigan. You clearly need to study Michigan more before laying such claims. Students, on average, are indeed of a slightly higher caliber at Northwestern, but the students at Michigan are not far behind. Classes at Northwestern will be smaller than at Michigan, but that is mainly thanks to the thousands of freshman seminars offered at Northwestern. Remove seminars from the equation, and Michigan and Northwestern will have a similar ratio of large:mid-sized:small classes. Intro level classes at Northwestern will be smaller, but still large. Intermediate and advanced classes at both universities will be roughly the same size.<br>“UMichigan alums will disagree here but if money is not a factor, 90% of students are choosing NW over UMichigan.”<br>That is a grossly exaggerated figure. While there are many students who choose Michigan over Northwestern because of cost, there are probably just as many who choose Northwestern over Michigan for the same reason. I would say that when you cross out financial decisions, cross admits choose Northwestern over Michigan on a two third to one third basis. But it should be noted that the disparity is due to ignorance, not objective analysis of the pros and cons. High school students are impressionable and easily swayed by criteria that are, quite frankly, immaterial. Impartial students who choose to look at those two objectively will be equally split between Michigan and Northwestern. I certainly was, and in the end, like slb176’s son, I was one of that “10%” who chose Michigan over Northwestern!<br><br>", "<b>Username: Alexandre</b><br><br>slb176, I am glad to hear that your son weighed the pros and cons and chose the university that suited him best. I am sure he will have an excellent experience at Michigan.<br><br>", "<b>Username: firmament2x</b><br><br>StanfordGSB00, by whom I wasn’t remotely bothered, was also a participant in [this thread](https://talk.collegeconfidential.com/college-search-selection/2138131-help-me-decide-between-ucla-cal-berkeley-duke-and-northwestern-for-economics-math-p4.html) and  submitted post #52, in a very similar spiel-like manner.  In the other thread it was Northwestern v. Duke v. UCLA v. Cal.  I answered him/her later in reference to the alleged &gt; 100 SAT points difference between Duke/Northwestern and UCLA, by stating that public universities like UCLA don’t superscore, in addition to the University having a reportage of 132% of both SAT and ACT, whereas Duke reported 101% (terribly low) and Northwestern 110% (standard for a private U), if I recall correctly.  The commonality between his participation in this and the other thread, of course, is Northwestern.<br>Sorry for the interruption. And congrats to the OP and his choice.<br><br>", "<b>Username: firmament2x</b><br><br>@Alexandre . . . if you wouldn’t mind seeing my post above, re, superscoring and redundant reporting of SAT/ACT? Michigan seems to have a 1400+ Median SAT and reports 117% of both board tests.  So there isn’t a 100 point diff, especially if Mich doesn’t superscore.<br><br>", "<b>Username: rjkofnovi</b><br><br>Michigan does not superscore.<br><br>", "<b>Username: Alexandre</b><br><br>firmament2x, I am not sure about the exact difference in the SAT/ACT ranges and averages between Michigan and Northwestern. Northwestern obviously has the ability to secure a higher percentage of high test scorers than Michigan thanks to its smaller size, use of ED and lofty US New ranking.<br>But it should also be noted that Michigan does not place as much emphasis on test scores as most other top universities. Michigan has always maintained that GPA and course rigor are a better projection of potential than test scores. Even when Michigan used a formula 15 years ago, it assigned the same weight to SAT scores between 1300 and 1600 and ACT scores between 31 and 36.<br>There is not going to be a shortage of brilliant minds at Michigan. The classroom environment will be supercharged and challenging, and indistinguishable from that at Northwestern.<br><br>", "<b>Username: firmament2x</b><br><br>I won’t tag your presence, but thanks Alexandre for your response.  Superscoring adds a good 40 points, so the difference is maybe ~ 40 points or so, not 100.  Thanks.<br><br>", "<b>Username: MWolf</b><br><br>If people REALLY assign high importance to ranking, they should look at other ones. There are two well known rankings systems for universities worldwide, the Times Higher Education World University Rankings, and the QS World University Rankings. Times Higher Education World University Rankings has Michigan ranked as #20, among world universities, and Northwestern as #25. QS World University Rankings also has Michigan in place #20, while Northwestern comes in at #34. They also are too caught up in things like reputation, with Q2 being ridiculously so, however, they include in teaching things like reputation among employers, which tell you how well the graduated are prepared for the work force. They also include research, which is important for the quality of a research university. An additional factor they add is number of international students and faculty, which is related to the international reputation of a college, though it fails when dealing with public universities that have strong preference for in-state students.<br>So what these rankings are really saying is that, among most other universities, employers, and internationally, Michigan has a better reputation than Northwestern. While I assign no more value to these rankings than I do to those of USANews, I am presenting them so that people can see that Northwestern is not universally held as a superior university to Michigan. It all depends on what metrics a system uses, and how the metrics are weighted.<br>Lest people think that a ranking system that includes research should not be used to compare undergraduate colleges, one of the major metrics used by all systems is reputation. Discoveries and interesting results coming from a university definitely enhance its reputation in the public. In fact, I would say that the majority of MIT’s reputation came initially from its research, and this is true of Johns Hopkins as well.<br><br>", "<b>Username: StanfordGSB00</b><br><br>@MWolf - you are perpetuating misleading data. Those international rankings you are citing also put University of Washington ahead of Brown and Dartmouth. Do you really believe that any reputable employer (with the exception of a Washington-based one) would think more highly of a UWashington grad than the other schools? Michigan at the undergrad level is NOT a peer of Northwestern, Duke, Dartmouth or Brown. Many of these rankings also put UCLA in the top 10-15 ahead of Duke, Northwestern, etc. Do you honestly believe that UCLA is a more prestigious school than Duke or Northwestern? Umichigan is an excellent university but it is a “back-up” option for the very top students in the college admissions sweepstakes. To say that Michigan (or UCLA) is a peer of these far more selective privates is literally ludicrous.<br>And just because a few people like Alexandre and others picked UMichigan over Northwestern, Duke, etc. does NOT mean Michigan is superior by any means. If someone picks a Honda over a BMW, are we saying that Honda is a peer of BMW? If you go to Wall Street or any of the prestige-obsessed elite $40,000+ / year private high schools and boarding schools on the East Coast (Andover, Phillips Academy, etc.) and in NYC (Horace Mann, Dalton, etc.), you will easily see that Michigan is at the bottom of the “elite” pecking order. Even at top public high schools (where you have to test to get admitted) like Hunter High School, you will see the same pecking order. Just look at this - http://docplayer.net/40861352-Hchs-college-admissions-may-2016.html. And this is just simple supply and demand dynamics. When you have a school that is accepting 50%+ of the students applying and then has an enrolled student body with average scores that are more than 100 points lower, than the “peers”, how can the perception be that it can compete with the other schools?<br>In cases where $ is not a consideration, top students are easily picking Duke, Northwestern, Dartmouth, etc. over Michigan at the rate of 90+ / 100 out of times. This is not even debatable.<br><br>", "<b>Username: Alexandre</b><br><br>“Michigan at the undergrad level is NOT a peer of Northwestern, Duke, Dartmouth or Brown. It is a very fine “back-up” option but to say that Michigan is a peer of these far more selective privates is literally ludicrous.”<br>Do you have evidence that academe or industry support your claims? I would like to see peer assessment ratings (from academe) or corporate ratings that suggest that Northwestern is, as you seem to claim, far superior to Michigan.<br><br>", "<b>Username: rjkofnovi</b><br><br>““When you have a school that is accepting 50%+ of the students applying and then has an enrolled student body with average scores that are more than 100 points lower, than the “peers”, how can the perception be that it can compete with the other schools?”<br>A comment like this simply means that you have no idea what you’re talking about.<br>“The facts don’t support the assertions that Michigan is a peer.”<br>What facts?  All I see is hyperbole.<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>When you have a school that is accepting 50%+ of the students applying and then has an enrolled student body with average scores that are more than 100 points lower, than the “peers”, how can the perception be that it can compete with the other schools?<br>\"\"<br><br>For the Class of 2022, since Class of 2023 stats aren’t available yet, the in-state acceptance rate was 41% and the OOS acceptance rate is 19%. The overall acceptance rate is 23%. <br><br>", "<b>Username: StanfordGSB00</b><br><br>I did not say Northwestern was “far” superior. However, Northwestern is “superior” to Michigan where it matters. Smaller classes, higher quality peers in terms of test scores and accomplishments, more exclusive (in terms of acceptance rate), more undergrad research opportunities per capita, and higher endowment per student. You seem to underestimate the impact of the student body differences between the schools. Let’s look at the most recent common data sets (2018 - 2019). Northwestern’s ACT range (25-75th) for “enrolled” students is 33-35 and Michigan’s is 30-34.  Safe to say that Northwestern’s ACT average is a 33, whereas Michigan is a 31 or 32. For the sake of simplicity, Michigan’s 32 ACT average converts to 1420 - 1440 SAT and Northwestern’s 34 ACT converts to 1490 - 1520. This is a significant difference when we are talking about thousands of students. Your average peer at Northwestern will be more accomplished. You are a product of your surroundings and the average Northwestern student is more accomplished than that at Michigan. These are the facts. And regarding recruitment for top jobs, Ross is a fine program but let’s compare the undecided liberal arts major (English, History) at Michigan and Northwestern. The English major at Northwestern could end up at McKinsey or Oliver Wyman or JPMorgan investment banking and the same will be A LOT harder for the Michigan grad who is not in Ross.<br><br>", "<b>Username: slb176</b><br><br>I think there are quality of life factors that go into a college decision too as well as financial. From that perspective, Michigan wins over NU in our house<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>The English major at Northwestern could end up at McKinsey or Oliver Wyman or JPMorgan investment banking and the same will be A LOT harder for the Michigan grad who is not in Ross.<br>\"\"<br><br>My kid is a STEM major, so I’m not too edge-a-ma-kated on English majors, but I googled “English undergraduate”, but USNWR gave me “English graduate”, but I assume that’s important too.<br>UMich is #8<br>NU is #18<br>https://www.usnews.com/best-graduate-schools/top-humanities-schools/english-rankings<br><br>", "<b>Username: Alexandre</b><br><br>“And just because a few people like Alexandre and others picked UMichigan over Northwestern, Duke, etc. does NOT mean Michigan is superior by any means.”<br>I never claimed that Michigan is superior to Northwestern. I chose Michigan because I felt it was a better fit for me personally.<br>“If you go to Wall Street or any of the prestige-obsessed elite $40,000+ / year private high schools and boarding schools on the East Coast (Andover, Phillips Academy, etc.) and in NYC (Horace Mann, Dalton, etc.), you will easily see that Michigan is at the bottom of the “elite” pecking order.”<br>Goldman Sachs, Morgan Stanley and JP Morgan hire over 50 Michigan undergraduates annually. Michigan is consistently listed as a major target by the majority of Wall Street firms. But I don’t see the relevance of how well Michigan fares with boarding schools. Nobody will deny that high school children are impressionable and Michigan admittedly does not hold the appeal that smaller private universities do. That does not make Michigan any less appealing in the eyes of academe and industry. But you are incorrect in your claims that Michigan is at the bottom of the “elite” pecking order. Several private high schools have extremely strong connections to Michigan, including Phillips Academy (Michigan is generally the fourth or fifth most popular destination among its graduates) and Harvard Westlake (also among the top 3 or 4 popular destination among its graduates). Most East Coast boarding schools place as many graduates at Michigan as they do at other elites such as Duke and Northwestern.<br>https://www.exeter.edu/sites/default/files/documents/2016-2018%20Matrculation.pdf<br>https://students.hw.com/Portals/44/HWProfile2018-19.pdf<br>https://sps.myschoolapp.com/ftpimages/36/download/download_2527075.pdf<br>https://www.dalton.org/programs/high-school/college-counseling<br>“When you have a school that is accepting 50%+ of the students applying and then has an enrolled student body with average scores that are more than 100 points lower, than the “peers”, how can the perception be that it can compete with the other schools?”<br>To petty, image-conscious high school kids, acceptance rates matter. And while students at Hunter High School may have a 50% success rate when applying to Michigan, its acceptance rate is currently 23% and dropping. But not many universities have SAT averages that are “more than 100 points higher” than Michigan’s. Most private elites have SAT averages that hover between 40 and 70 points higher than Michigan’s, but that does not factor in super scoring and the benefits of ED admissions. ACT scores are also not significantly higher (mostly 1-1.5 points higher).<br>Northwestern University 1490, 34<br>University of Pennsylvania 1490, 33.5<br>Dartmouth College 1490, 33<br>Brown University 1485, 33.5<br>Duke University 1485, 33<br>Cornell 1465, 33<br>Michigan 1420, 32<br>That being said, admissions data, while certainly interesting, and important to some kids, does not determine a university’s quality or reputation in academic or corporate circles. Overall academic excellence and rigor across all disciplines, availability of individualized and specialized programs, access to world-class facilities and labs, participation in ground-breaking research, reputation within academe, corporate placement, alumni affluence and influence etc…are all more telling attributes of institutional excellence than admissions.<br><br>", "<b>Username: yikesyikesyikes</b><br><br>@StanfordGSB00<br>A lot to unpack here.  Let’s start with how you imply the matriculation choices of some of the most privileged kids in the world is the gold standard for the quality of a university.  Also, don’t kid yourself.  The average English major at Northwestern is not landing IB gigs at Goldman or consulting jobs at McKinsey.  That is not even the case at Harvard.<br>Let’s also not forget that Michigan has schools that add fantastic value to our university community but do not really prioritize mainstream standardized test scores as much in admissions: Kinesiology, Nursing, Stamps, and SMTD.  These bring the Michigan average down, but do not imply a lower quality of student body.<br>If you REALLY want to play the elitist game, go to the best ranking for that.  The US News reputation ranks - which is based on how people in academia feel each school ought to be ranked:<br>Here they are:<br>https://www.usnews.com/education/blogs/college-rankings-blog/2013/02/28/which-universities-are-ranked-highest-by-college-officials<br>I’ll save you the trouble - Michigan and Northwestern are tied at 13.<br><br>", "<b>Username: sushiritto</b><br><br>This is usually the place where I play the “sports card.” ????<br><br>", "<b>Username: MWolf</b><br><br>@StanfordGSB00 “Do you really believe that any reputable employer (with the exception of a Washington-based one) would think more highly of a UWashington grad than the other schools?”  I’m sorry, but, outside of the obsessive USANews ranking addicts, any person hiring a CS graduate will much prefer a UW graduate over a Dartmouth graduate any day, any time, and for almost any position. My wife has been in CS for 20 years, and hangs out with the top people in her field (well, she is considered one of the top people in her field), and has a bit more knowledge on hiring in her field and in other engineering fields.<br>As for the 25%-75% range? Michigan’s SAT range as of 2018: 1380-1540, SAT range: 31-34. Michigan has about 29,800 undergraduates, of which about 7,450 have SATs above 1540 or ACTs above 34.  Northwestern’s entire undergraduate student population is about 8,350. of them, about 2090 have SATs above 1550 or ACTs above 35. That would mean that  3,140 or fewer have SATs above 1540 or ACTs above 34. For MOST people that would indicate that Michigan has a lot more smart people than Northwestern does.<br>Sorry, just because YOU are obsessed with prestige, especially prestige as feature in USANews rankings, does not mean that the rest of the USA shares your obsession.<br><br>", "<b>Username: Publisher</b><br><br>If I needed a lawyer to argue my case, there is one well intentioned poster whom I would not hire.<br>Both are great universities offering students a notably different undergraduate experience.<br>One is private, the other public. One’s graduate students outnumber the undergraduate students, while the other has a massive undergraduate student body.<br><br>", "<b>Username: MaineLonghorn</b><br><br>MODERATOR’S NOTE:  This thread has devolved into a debate so I am closing it.<br><br>"]}