{"title": "university of michigan vs full ride to central michigan", "comments": ["<b>Username: kumarr</b><br><br>Hi! I made a thread before asking this but didn’t know enough about my financial situation. Central Michigan University is full tuition and housing covered with a $500 stipend for books all 4 years. Umich would be around $30,000 for me. My family would cover most of it but each year i’d have to take out a $5000 loan so I’d graduate with $20,000 debt. I want to do pre-med, I’m just worried because I was looking at a 2017 profile for Central Michigan’s medical school and saw that only 7 CMU students were accepted versus 22 UofM students. Would Umich give me a better chance at medical school?<br>Merged two identical threads so responses may seem off a little on timing/date<br>ED<br><br>", "<b>Username: blossom</b><br><br>How on earth would you come up with $60K?  What could possibly be going through your head to make that remotely realistic? What’s the plan here?<br><br>", "<b>Username: kumarr</b><br><br>Honestly I’m not sure. I’d apply for scholarships and do work study as well. But you’re right, it’s not really realistic and I don’t really have a plan, I just don’t know where to start when it comes to finances.<br><br>", "<b>Username: blossom</b><br><br>Work study will provide you with spending money and maybe cover some books.  It won’t cover tuition, that’s for sure.<br><br>", "<b>Username: BuckeyeMWDSG</b><br><br>Have you actually received your FA package from Michigan yet? Or run their net price calculator to get an estimate of your net price? https://npc.collegeboard.org/app/umich<br>The college navigator site shows average net price for freshman by income bracket:<br>AVERAGE NET PRICE BY INCOME 2014-2015   2015-2016   2016-2017<br>$0 – $30,000                                  $3,414  $2,660  $3,249<br>$30,001 – $48,000                         $6,561  $5,878  $5,575<br>$48,001 – $75,000                         $9,761  $10,106 $9,895<br>$75,001 – $110,000                            $17,163 $16,677 $17,705<br>$110,001 and more                           $23,687 $24,129 $25,001<br>https://nces.ed.gov/collegenavigator/?q=michigan&s=all&pg=2&id=170976#expenses<br>“My parents are helping out with what they can” how much exactly is this?<br><br>", "<b>Username: BuckeyeMWDSG</b><br><br>U-M must receive your FAFSA records from the federal processor by March 31 to consider you for federal financial aid programs.  If you are applying for institutional grants, we must also have your CSS/Financial Aid PROFILE by this date. We recommend that you complete these applications by March 1 to ensure that we receive them by deadline.<br>If we request additional documents from you, we must receive those by March 31.<br>The U-M Office of Financial Aid begins notifying entering students by email when U-M financial aid award notices are available on Wolverine Access. You will need a U-M uniqname or Friend Account to access your award notices online.<br>https://finaid.umich.edu/financial-aid-timelines/<br><br>", "<b>Username: yourmomma</b><br><br>Go for free.  The ROI is phenomenal.  Everything will work out.<br><br>", "<b>Username: MusakParent</b><br><br>Consider your debt load the federal student loans (up to 27K over 4 years).  Full stop.  If you have to come up with 60K and your parents aren’t in the game, it’s not reasonable to consider.  Is that your final financial offer?<br>And if you’re considering medicine or law, $0 debt will be your best choice for undergrad.<br><br>", "<b>Username: BuckeyeMWDSG</b><br><br>Did you submit your your CSS/Financial Aid PROFILE to U-M? If not - Do that now. If so, did you call their FA office and confirm they have everything they need?<br>Do not confuse lack of winning merit aid from U-M with having to pay full price, especially if you are an average/median income family. Very few students win merit aid there, but their need based aid is fantastic. And don’t confuse ineligibility for federal Pell grants with being ineligible for the institutional need based grants from U-M.<br>Are you certain that a financial aid package from Michigan is not forthcoming?<br>I’m not sure you have all the information that you need to evaluate your options. What is the gpa required to maintain the scholarship from Central Michigan and what if any other conditions must be met?<br><br>", "<b>Username: raclut</b><br><br>Choose 0 debt for undergrad if thinking of med or law school where you will have to take on debt.<br><br>", "<b>Username: MYOS1634</b><br><br>UMichigan is tuition-free for Michigan families who make 65K/year and under, and tuition for families that make 65-95K is generally about 2K a year. For families that make 95k-180k there are scholarships.<br>https://goblueguarantee.umich.edu/<br>Do you know your EFC?<br>Why would your parents help you for 2 years only?<br><br>", "<b>Username: happymomof1</b><br><br>@romanigypsyeyes is one of our experts for Michigan universities.  If she doesn’t chime in soon, send her a private message and ask her advice.<br>You can major in anything and then apply to law school, so don’t worry about Central Michigan limiting you from that.<br><br>", "<b>Username: romanigypsyeyes</b><br><br>kumarr, if you’re expected to pay 60k+ for your undergrad, it’s not even an option. I mean it is literally not an option. You won’t be able to cover that and you will have to drop out.<br>Go to CMU. Take the free ride. What you want to do right now isn’t what you’ll want to do in a few years. CMU is plenty fine and allows you to explore. You can use your summers for exploratory internships/research/whatever.<br><br>", "<b>Username: MYOS1634</b><br><br>@romanigypsyeyes : But kumarr is assuming no financial aid from UMich (has not received a financial aid package yet). I wouldn’t take the free ride till I know for sure Michigan is unaffordable.<br>Also useful: if parents have said “two years only” as an arbitrary decision, their version of “skin in the game”, or if they said so because they think UMich is 30K for all people and they can “only” pay 60k, which would only last 2 years…<br><br>", "<b>Username: romanigypsyeyes</b><br><br>@MYOS1634<br><br>\"\"<br>if you’re expected to pay 60k+ for your undergrad<br>\"\"<br><br>Obviously I can only go by what the OP has said. That’s why I said “IF you’re expected.”<br><br>", "<b>Username: wis75</b><br><br>Agree with taking the free ride.  Medical school admissions are competitive so getting top grades at a state school is better than not doing so at the top school.  Either medical or law school would mean paying the costs yourself so you should be looking at waiting as long as you can to incur debt.  Nobody cares where you did your undergrad work (nor medical school) in the long run.  Physician here, btw.  Most of us went to school based are where we were from and what we could afford.  Save your money!<br><br>", "<b>Username: Jugulator20</b><br><br>Med school is 4 years, expensive and paid for by almost all med students by loans which have to be paid back). Med school WILL then be followed by residency training (at least 3-5 years).  During these 7-10 years (med school/residency), longer if you go into fellowship training, you will not earn enough money to repay med school loans in any meaningful way. Your med school debt will continue to increase. Why would you want to add years of college debt and interest to what you have to pay back.  Consider taking the full ride.<br><br>", "<b>Username: deb922</b><br><br>The very competitive nature of pre medical studies at U Michigan (bio, chemistry and other pre med majors) is tough. You get the smartest kids from Michigan and OOS.<br>Unless Michigan gives a great aid package, I would go to CMU for free and work on being the best student there in your major.<br>I personally think that being the big fish in a smaller pond is better. You could get more attention from professors and more opportunities for research.<br><br>", "<b>Username: 3js3ks</b><br><br>Did you apply to Wayne and Oakland too?  Since the two possible majors for you require so much more schooling I would go for the free ride.  I’ve never heard of anyone getting a full ride at Central, I don’t think I would look a gift horse in the mouth and not take it.  If you have the stats to get into MI you probably could have gotten a full ride at OU too.  Wayne seems kind of stingy, though.<br><br>", "<b>Username: sciencenerd</b><br><br>Know that many many people change their career choices once in college. They explore different classes and industries that they never even knew about before.<br>Also, $60K might seem like a lot, but a Michigan education can offer you a lot and has quite the brand recognition.<br>Realize that if you have to pay for it you will have to take out loans for it. These loans will accrue a lot of interest over time. You can run loan calculators yourself to see your monthly payments. A lot of people take out loans and that is how they afford college.<br>Know that if you do go to grad school zero debt will be a major blessing.<br><br>", "<b>Username: Hanna</b><br><br>“Realize that if you have to pay for it you will have to take out loans for it.”<br>But undergrad students cannot borrow this much on their own. You can’t just go to the money store and get $60,000.<br><br>", "<b>Username: citymama9</b><br><br>Have your parents said they would help you with medical or law school?<br><br>", "<b>Username: hzhao2004</b><br><br>If it were me, I’d choose U of Michigan.  $60k is worth it over Central Michigan.  If it were Michigan State, then it is a totally different story.<br><br>", "<b>Username: sciencenerd</b><br><br>“But undergrad students cannot borrow this much on their own. You can’t just go to the money store and get $60,000.”<br>@Hanna, I am not entirely aware of the OP’s finances just that he/she will have to take out loans and the associated consequences.<br>It could be that their parent’s will cosign. Also, some lending institutions may offer a loan with no co-signor, but with a higher interest rate.<br><br>", "<b>Username: blossom</b><br><br>Science, please name one lending institution which is prepared to lend an 18 year old with no collateral and no borrowing history 60K with no co-signer???<br><br>", "<b>Username: sciencenerd</b><br><br>I found a few examples here:<br>https://www.studentdebtrelief.us/student-loans/private-student-loans-without-a-cosigner/<br><br>", "<b>Username: Hanna</b><br><br>You provide no source suggesting that they will lend $60k.<br><br>", "<b>Username: blossom</b><br><br>$60K without a cosigner or a credit history. Which was my question.<br><br>", "<b>Username: CountingDown</b><br><br>It will probably more than $60k, if the OP is paying for the last two years. It’s not like COA is going to remain stable for four years.<br>OP, if you have not had an adult-to-adult conversation with your parents about college funding, the time is NOW. And get your FA info to both schools right now.<br>Does the merit award at CM cover everything? Just tuition? Do you have to keep a certain GPA to maintain it? If CM doesn’t cover R&B, are you going to have to take out Stafford loans to pay for that, will your parents cover it, or will you need FA? Also keep in mind that FA is what the SCHOOL thinks you and your parents, not what your parents feel they can pay. There is often a significant difference in those two figures!<br>This parent would not have cosigned $60k in loans for undergrad for either of my sons. The only loans they carry are Staffords.<br><br>", "<b>Username: kumarr</b><br><br>Hello!! I have a more set idea of finances now. I’d have to take $5000 every year for loan, so I’d graduate with $20,000 debt and my parents will pay the rest. I am more decided on medicine now. Do you think Michigan would give me a better chance into medical school? I was looking at Central Michigan Medical schools 2017 profile and saw that 22 kids from UofM were accepted versus 7 central michigan kids.<br><br>", "<b>Username: kumarr</b><br><br>Hello!! I have a more set idea of finances now. I’d have to take $5000 every year for loan, so I’d graduate with $20,000 debt and my parents will pay the rest. I am more decided on medicine now. Do you think Michigan would give me a better chance into medical school? I was looking at Central Michigan Medical schools 2017 profile and saw that 22 kids from UofM were accepted versus 7 central michigan students so this worries me.<br><br>", "<b>Username: kumarr</b><br><br>Hello!<br>The full ride for central covers tuition and housing, and my parents would cover the meal plan and any other costs which would be pretty minimal. My brother currently goes to Umich and I just received an estimated financial aid statement saying I would have to pay a similar amount ( just around $28,000). The only different with mine and my brothers tuition is that I received a work study ($3000). My parents said that I’d have to take out $5000 every year in loans, meaning I’d have just about $20,000 in debt. Do you think Michigan would look better to medical schools and set me up better or is Central Michigan the better option?<br><br>", "<b>Username: trackmbe3</b><br><br>@kumarr checkout this link<br>https://www.aamc.org/download/493728/data/factstablea2.pdf It shows the number of applicants for US medical schools for 2018-19 from each undergraduate university that supplied at least 50 applicants to med school.  815 Michigan students versus only 64 Central Michigan students applied to med school this year. While Michigan class size is about twice the size (7,000) as Central Michigan (3,500?) yet 8x as many Michigan students as Central Michigan students apply to med school. This shows that Michigan has many more students competing against each other for high gpa which is needed for med school. And the academic credentials (stat-wise) of the students at Michigan are much higher than Central Michigan. Michigan’s ACT 25/75 percentile range is 30-33 whereas Central Michigan is 19-25. It will be much more difficult for you to maintain a high gpa at Michigan than it will at Central Michigan. Med schools are more concerned with high gpa and MCAT scores than they are with the particular undergraduate school you go to. So go to the undergrad school where you have the best chance of being in the top of the class. And best to save your money by choosing Central Michigan. The cost differential over 4 years between these two schools is substantial.<br><br>", "<b>Username: happymomof1</b><br><br>You would be entering Central Michigan as a star student.  At U of MI, you would have to compete for the same attention that is likely to be handed you at CMU.  Yes, sometimes it can be really nice to be a big fish in a small pond.<br>Ask your family if they are willing to set aside what they’d have to pay at U MI each year so that you have a cusion in place for when you go to med school.<br><br>", "<b>Username: QuantMech</b><br><br>The quality of education will be very much higher at the University of Michigan.  I know faculty at both places.  You will have a definitely superior experience at the University of Michigan, assuming that you are willing to work hard enough to make medical school a reality at the end of the line.  You should also plan to get to know some of your faculty members well enough that they can write effective letters of recommendation on your behalf.<br>You are likely to have superior volunteer opportunities in medically related areas at Michigan.  The quality of the teaching fellows will be far superior to the quality of teaching fellows at Central Michigan.  This is not snobbery, it is just reality.  Sorry if it appears to be snobbery.  (I don’t even especially like the University of Michigan, but I have to be honest about their strength.)<br>In my view, this is not a close contest at all, even with the $20,000 in undergrad debt.<br><br>", "<b>Username: MYOS1634</b><br><br>If your loan is limited to 5K a year, yes I’d go to Michigan.<br>It’s not so much that Michigan will help you get into med school - but rather, that Michigan will help you way more if you DON’T get into med school.<br><br>", "<b>Username: kumarr</b><br><br>Thank you so much for taking your time to give such a thorough response. I am thinking more and more that I plan to go with CMU. This analysis was sooo helpful!!<br><br>", "<b>Username: Publisher</b><br><br>Assuming that your are a resident of Michigan, then UMichigan at $30,000 per year will always be there for you. Try CMU & enjoy your scholarship & elite status. If it isn’t what you want, then consider transferring after a year or two.<br><br>", "<b>Username: yikesyikesyikes</b><br><br>I disagree with people saying you should definitely go to the cheaper school so you can save for medical school.  Admission to MD programs in the United States is incredibly difficult.  At a standard school, perhaps between 20-40% of students (sometimes even more at some schools) may enter as pre-med.  The VAST majority of them will switch because they change their mind or (even more likely) they will be forced to change their mind due to the rigors of the pre-med process with its many weed-outs.  Statistically speaking, you will VERY probably not make it.  This might sound mean, but it is the truth.  You may want to consider hedging your bets.  A Central Michigan degree, in most cases, is worth a lot less than a Michigan degree when it comes to contingency jobs/grad school programs that are popular for former pre-med students or pre-med students who will be applying (or re-applying) to med school later on (medical scribe positions, lab tech positions, good MPH programs, etc.). I am not saying choose Michigan, but definitely look past just the prices.  This decision will require more nuance than that.<br><br>", "<b>Username: scubadive</b><br><br>One child went to an expensive college in the Boston area and the other the cheaper less known school.  One parent is saddled with debt the other not.  Both kids are in the same medical school. The outcome was identical.<br><br>", "<b>Username: sgopal2</b><br><br>Med school admissions is HIGHLY dependent on two factors: 1) GPA and 2) MCAT score. Science GPA matters the most. The difference in price looks negligible. $20K over the course of your entire career is a drop in the bucket. Go to where you think you can get the highest GPA.<br><br>", "<b>Username: MYOS1634</b><br><br>The issue isn’t med school but the difference in outcomes from CMU v. UMichigan for the 75% who do not make it…<br><br>", "<b>Username: itsgettingreal17</b><br><br>UMich is worth the $20k difference.<br><br>", "<b>Username: blossom</b><br><br>“Hello!! I have a more set idea of finances now. I’d have to take $5000 every year for loan, so I’d graduate with $20,000 debt and my parents will pay the rest. I am more decided on medicine now. Do you think Michigan would give me a better chance into medical school? I was looking at Central Michigan Medical schools 2017 profile and saw that 22 kids from UofM were accepted versus 7 central michigan students so this worries me.”<br>You don’t decide on medicine- medicine decides on you.  The process is not a one time “I’m going to become a doctor”.  It’s a marathon or a triathlon filled with hurdles and weed-outs.  And then MAYBE you get in, maybe not; so your plan B is more important (in my opinion) which is Plan A, to go to med school and become a doctor.<br>So why not figure out what happens with your plan B- you graduate with a degree in what from which school.  Then what?<br>There are kids who did “everything right” and still didn’t get in anywhere.  Do you try again (boy that’s a LOT of money on applications, try the MCAT again) or do you figure out another life’s plan?<br>No HS kid is in a position to know if he or she is going to be a competitive med school applicant in four years.  Or if he/she even will WANT med school after learning about biostatistics or materials science or big data/public health, or all these other cool disciplines which have important health care applications and touch points. A young woman I know who is now doing a Master’s in statistics thought she wanted to be a doctor- but now she wants a job in epidemiology. As she put it- “I can treat 15 patients a day.  Or I can prevent disease transmissions or infections in tens of  thousands of people every day using predictive analytics.  That’s more powerful to me”.<br>So OP- before you start signing up for loans- take some time to contemplate your Plan B… what happens then?<br><br>", "<b>Username: intparent</b><br><br>For just the amount of federal loans, I’d pick UM.  I agree that pre-med is fierce there (is most places), so you really, really have to be ready and stay on top of your grades.  Get tutoring if you need it at the first sign of trouble.  Try to form study groups, use office hours, and work a little ahead if you can so lectures are for review/fine points.<br><br>", "<b>Username: 3js3ks</b><br><br>I agree that the Michigan degree is more prestigious if you don’t end up in med school later.<br><br>", "<b>Username: momofthreeboys</b><br><br>If you are absolutely headed for medical school read up on paths and acceptances etc for both unis and pick the one that gives you the best chance of achieving that. A sibling’s kid chose GVSU over UofM for that reason plus the lower cost and no muss no fuss into med school. At the end of the day a doctor is a doctor.<br><br>", "<b>Username: sgopal2</b><br><br>Check out the forums on Student Doctor Network (SDN). They have many premeds who are going thru the same thing right now. You might want to consider posting there and asking.<br><br>", "<b>Username: bopper</b><br><br><br>The cheapest reasonable college so you/your parents can use the money for med school<br>The college needs to prepare you for MCATs but still allow you to get a good GPA<br>Access to volunteering opportunities (e.g., near a hospital)<br>Success in graduates getting into med school<br>Options if you don’t go to med school. Right now you think you will but probably less than 20% of freshman who think they will be premed will actually go to med school.<br><br><br>", "<b>Username: TooOld4School</b><br><br>First off, family income is just an indicator for aid at Michigan. People making under $65K do get a free ride for tuition - but only if the family has assets in an average range for families of that income level. Your parent’s (and your) retirement assets don’t count. Stocks, home equity, and other monetary assets do. Don’t assume you’ll get any FA without running the calculator even if the guidelines say you will.<br>Given that your parents will contribute $60K and the rest is up to you …<br>You can take $30K in loans (roughly)<br>and make &gt;30K over 3 summers of working and a part time student job.<br>A lot of it depends on what you are planning to study for undergrad. Is it a major that has good market value like a STEM field? If so paying back debt is easier.  Is it a major where it does not matter that much where you go to school?  There are also other options to pay for Michigan, like ROTC.<br>Then you will have to pay for med school if you get in. That’s around $300K if you don’t get a scholarship, or trade your med degree for a few years of service in the military. Law school is expensive too but with fewer finance options besides loans.<br>You will have to weigh whether Michigan is worth $120K for the slightly better med school admission chances and much better research environment.<br><br>", "<b>Username: momofthreeboys</b><br><br>I think the OP needs to do the research on the statement that UofM provides a “better chance” of med school admissions. I am not entirely convinced that is true. There are 7 medical schools in Michigan including Central and UofM plus MSU and 4 others. GPA, MCATs and interview are required by all.<br><br>", "<b>Username: CountingDown</b><br><br>I have read here on other threads that some universities will subtly decide who they will support with med school application (as in a review committee of some sort). I would endeavor to find out, formally or informally, how the school chooses to support a would-be med school candidate as one approaches application time and if that includes gatekeeping access to certain experiences, review of apps, recommendations, etc.<br>I recall former poster (sniff) curmudgeon’s D choosing to follow the scholarship $$, having an incredible experience, and getting into a top med school (at the university she had turned down for UG because of $$). Her small UG college showered her with love and opportunities and she was a superstar there.<br><br>", "<b>Username: collegemom9</b><br><br>For 20k I would absolutely choose Michigan. Hands down.<br><br>", "<b>Username: wis75</b><br><br>For a grand total of $20 K I would go to Michigan if I liked it better.  If I had known I would have money now I would not have scrimped so much for college and medical school.  You can likely pay off smaller loans but can never redo the college experience.<br>Different schools get different valuations by medical schools.  Being a superstar, or at least a top tier student, at a “lesser” school is better than being more average at the top school.  Figure out which school has the better courses in likely majors (premed is merely an intention) for you.  Go to college intending on getting a degree with a future you will like outside of being a physician.  You don’t want plan B to be compromised.<br>Ask yourself if you would get top grades at Michigan for that gpa needed.  Talk to your HS guidance counselor.  S/he will have seen so many students over the years S/he may know how students with your HS stats end up performing.<br><br>", "<b>Username: QuantMech</b><br><br>I don’t think that the experience of curmudgeon’s daughter is relevant here.  She went to an excellent undergraduate college (Rhodes), which she selected over Yale, as I recall.  The COA at Yale would likely have been about 10 times the total debt that the OP is contemplating, and that was about a decade ago!<br>Also, I don’t think the advice that a doctor is a doctor is necessarily relevant.  If the OP wants to become a general practitioner, then it is true.  If the OP is interested in a specialty like neurosurgery or (as it turns out) dermatology, then differences in the opportunities likely offered by the University of Michigan vs. Central will almost certainly matter.  Physician’s income from salaries/practices varies by roughly a factor of 20 currently.<br>The OP will have to work hard as an undergraduate, to have a GPA to get into medical school.  But I think that the courses and environment at Michigan will help a lot with the MCAT score.  I also think that the faculty at the University of Michigan are likely to be able to write the kind of recommendation that helps to get a student into a top medical school, if that is of interest to the OP.<br>So I would say that assuming that no Plan B is needed, the University of Michigan is by far the better choice.  If Plan B did turn out to be needed, the University of Michigan would be even better as a choice.<br><br>", "<b>Username: wis75</b><br><br>The undergrad school does not matter for getting into residencies, the medical school does.  Most physicians are not interested in being researchers and from what this student states I doubt that is on the radar.  btw- I do know of physicians who do the same job in the same location who went to Harvard, many different US schools and foreign. That doctor was no better or worse than the others in his specialty.   A doctor is a doctor when most of us practice medicine.<br>Those with a passion for research would choose Michigan but this student does not seem to be that person.  OP- decide your passion.  Decide your plan B.  Figure out if they can happen with Central Michigan.<br><br>", "<b>Username: romanigypsyeyes</b><br><br>For 20k, I’d probably pick Michigan.<br>Full disclosure: I picked State over Michigan 10 years ago and have no regrets. I now have multiple degrees from Michigan and still believe I absolutely made the right choice. When it came down to it, I just felt more at home on State’s campus and I’d encourage you to visit both.<br><br>", "<b>Username: sushiritto</b><br><br>Most premeds will probably get weeded out of the process. One of the other advantages to UMich is that LSA has 40 programs ranked in the Top 10, twenty-one (21) of them ranked in the Top 5, in the event the student switches majors:<br>https://lsa.umich.edu/lsa/news-events/all-news/lsa-in-the-news/forty-lsa-programs-in-the-top-ten–says-new-u-s–news-rankings.html<br>And that doesn’t include the math program, which is ranked #12. ?<br><br>", "<b>Username: QuantMech</b><br><br>wis75, I don’t doubt that it is the medical school that matters for getting into residencies (and the medical school record).  But the undergrad school and the experiences there may matter for which medical school the student gets into.  I have seen this play out to some extent with students in my classes.  There is also some carry-forward from the undergraduate degree later in life.<br>romanigypsyeyes, if the OP were asking about the University of Michigan vs. a full ride at Michigan State, I would have to think very much longer about what to advise, and the University of Michigan might not win for an undergraduate pre-med.  The University of Michigan is higher-ranked, but UM/MSU are more like each other than either is like Central.<br><br>", "<b>Username: wis75</b><br><br>Most good physicians, even those who teach, do not want the extremely elite schools.  If this student sounded like getting a PhD instead of MD was the thought at this point in their life it would be different.<br>Save your money, OP.<br><br>", "<b>Username: mackinaw</b><br><br>Based on the overall quality of the two universities, the more credible reputation of UMich, and the modest difference in cost, I’d pick UMich over CMU. There is, as well, a non-zero probability that the applicant will choose a different major or a different career after being exposed to the far-ranging curriculum opportunities in college. One of the reasons for attending college is to discover possible career interests and alternatives, as well as aptitudes that can hardly be known in high school.<br><br>", "<b>Username: romanigypsyeyes</b><br><br>@QuantMech I’m aware that MSU and CMU aren’t similarly ranked. However, I don’t put nearly as much stock in prestige as many on this forum do. I was told repeatedly when I was deciding between the two that I was an idiot for turning down U of M.<br>I think where you’re comfortable IS important to a college decision. If you feel more comfortable at CMU, you’re more likely to seek out opportunities, build networks, etc.<br>You’ll also notice that I DID recommend picking UMich.<br><br>", "<b>Username: trackmbe3</b><br><br>The OP appears to have disappeared, but taking his/her word on being premed and wanting to become a doctor, he/she should pick the school where he/she can achieve the highest gpa and save money/have no debt because med school is very expensive. He/she has the best chance of a higher gpa at Central Michigan and it is a full ride/zero cost/no debt! Central Michigan has a med school so the OP can have a chance to shadow doctors perhaps engage in research there. And he/she can stand out from his/her peers academically. In contrast, if the OP went to Michigan, I think he/she would face an uneven playing field—he/she would be competing against one of the wealthiest student bodies (the 45% out-of-state students, most of whom are in the one percentile of family wealth, and who come into Michigan with some of the highest stats of any students in the country, and thus they have the resources to pay for private tutors for difficult premed classes, have family connections for medical internships and shadowing, & can afford the best test prep course for MCAT)—-this would be the OP’s competition— plus the competition against the highest achieving students from in-state Michigan high schools. So the OP faces an uphill battle right from the start against his/her premed classmates for earning top tier gpa and overall med school credentials which are needed to gain entrance to medical schools. Because medical schools will pick the best candidates from each school. The OP has a better chance of being the best med school candidate at Central Michigan. And if he/she changes his mind after freshman or sophomore year and decided against premed/med school, then he/she can likely be able to transfer to Michigan and earn that coveted University of Michigan degree.<br><br>", "<b>Username: QuantMech</b><br><br>romanigypsyeyes, I am not making a recommendation based on the prestige of the University of Michigan vs. Central Michigan.  My recommendations are always based on the quality of the educational experience available at the two universities (well, practically always).   There is essentially zero faculty movement between the University of Michigan and Central Michigan University.  The only counter-example to this would be that perhaps sometimes the Central Michigan University faculty take a sabbatical at the University of Michigan.  The courses delivered at the University of Michigan in my field are just substantially better than the courses at Central Michigan.<br>trackmbe3’s post #58 is an example of what is wrong with the current medical school admissions process:  A student whose actual performance is at the same level is much more likely to have a high GPA at Central than at the University of Michigan (I think this is true).  That yields a higher probability of admission to medical school, presumptively.  But this is not necessarily so.  I know of one student with a 3.95 from a less competitive college who did not get into any medical school that offers an MD.<br>A student does not need to have family connections to participate in medically related research at the University of Michigan.  Family connections and wealth are being over-valued by trackmbe3.  While tutors can no doubt help, it is actually possible to do very well in classes at the University of Michigan without a tutor, by being reasonably intelligent and working hard.  A student would need to be able to purchase the course books on time, and I know that can be a challenge for some students.<br><br>", "<b>Username: QuantMech</b><br><br>If you go to<br>https://medicine.umich.edu/medschool/education/md-program/our-community/students-faculty/admitted-class-profile<br>you can see the undergraduate colleges of the medical students at the University of Michigan in each year.<br>Clicking on the earlier year’s data, you can see for example for the entering class in 2018, 47 were undergraduates at the University of Michigan, and two or fewer came from Central Michigan.<br><br>", "<b>Username: midwest_mom9</b><br><br>I am a professor and pre-med advisor at CMU. I disagree that the basic premed courses are defacto better at U-M. We teach many intro bio and chem courses in active learning classrooms with fewer than 100 students, using innovative and engaging pedagogy. When I toured Mich. with my son, the tour guide had never heard of active learning classrooms. It will really depend on the student as to which environment will work best for them to learn the material. We have many students who turn down Mich because of the full ride at CMU, and most do very well, going on to med and grad school. It is true, of course, that CMU doesn’t have the cache of Mich, and if your aspirations include very selective med schools, then Mich. May be worth the cost. If you hope for an in- state med school, other than Mich., schools like CMU will prepare you very well for the MCAT and success.<br><br>", "<b>Username: wis75</b><br><br>Nice post above.  The truth is that the vast majority of premed students do not want the top few medical schools.  Remember- even the lowest standing graduate of the last ranked medical school will have earned the MD degree and qualify for licensure after meeting a state’s requirements.  They all can be competent physicians.  This is unlike law schools and some other post grad programs.<br><br>", "<b>Username: ChoatieMom</b><br><br>Both my (retired) in-laws were faculty at CMU.  FIL chaired a department for many years.  CMU has made vast improvements in its programs in the decades since I first became related to this family and now has a very solid reputation.  My SIL pursued an MBA at Central and is now CIO for one of the largest counties in the country.  Many here post similar anecdotes from other non-U-M universities.  I believe engaged students can get where they want to go from just about any school.  CMU will do the job just fine for the OP if s/he stays on the pre-med course.  If money were no issue, I would say that U-M is the better choice for breadth of programs if the OP changes course, but money is an issue, so CMU seems a no-brainer to me.<br><br>", "<b>Username: toomanyteens</b><br><br>Full ride all the way<br><br>", "<b>Username: 3js3ks</b><br><br>I think that you have to look at the full picture of what both schools offer.  You are looking at premed, but do you have other interests that one campus can fulfill better than the other?  I imagine Michigan offers more programs overall, whether academic or extra curricular.  There is so much to do there, it really is an amazing school.  But of course that has to be worth it to you.<br><br>", "<b>Username: kumarr</b><br><br>I’m extremely fortunate to have to choose between a full ride to Central Michigan (tuition+housing+$500 for books every year) or a regular admission to University of Michigan with in state tuition (right around 30,000 with tuition and housing). I have no idea what to weigh in this situation.<br>I am not entirely clear on what career path I’d like to go on. I’m currently debating between medicine or law as my top two choices. (they’re so different so I know this doesn’t help much) My current mindset is that UofM gives me more room to explore academically and more wiggle room, but the financial burden is still a lot to consider. Central Michigan has a medical school so that would be the only path I would seriously consider at central.<br>My parents are helping out with what they can, but will most likely leave me to pay for the last two years of my undergraduate degree if I choose UofM. Chances are I will go on to either law school or (hopefully) medical school.<br>Any idea on what I should do? I would appreciate any insight!<br><br>", "<b>Username: Erin_s_Dad</b><br><br>Why do you keep asking the same question?  What feedback aren’t you getting that you need?<br><br>"]}