{"title": "penn state vs uiuc vs purdue vs virginia tech honors mechanical engineering class of 2023", "comments": ["<b>Username: skarekat</b><br><br>My son has admits from the following schools (estimated costs - tuition, fees, room and board) and is not sure which one to accept:<br><br>PennState ($36k) (In State)<br>Purdue ($48k)<br>Virginia Tech Honors ($44k)<br>UIUC ($53k)<br><br>He plans to pursue Mechanical Engineering. So far no scholarships. Can you advise which would be best?  Thanks!!<br><br>", "<b>Username: Creekland</b><br><br>If money is an issue, I’d stick with Penn St.  They are considered a very good engineering school.<br>If money is not an issue, one thing you can look at is what programs/projects each university has going on and see if undergrads are participating in any that are preferred by the student.  If so, hands on in labs can translate nicely into internships - several companies work directly with some schools.  The “best” engineering school in rankings is not always the “best” school for any particular goal.  A school that is working with that goal has an edge.<br>Note that projects can be competitive so a place having something is not a guarantee that any particular student will be able to work on it, but the odds are better there than at a school that doesn’t offer it.  Having more than one project going on that’s of interest to the student increases the odds that they could get into something they like.<br>Another way one can look at options is if they have a preferred place they think they want to work.  If so, look at who’s already working there and where they graduated from.  Give that school extra bonus points in your “pro” column.  Sometimes students also email people within companies asking them if they have a school preference or not.  Often there isn’t (among schools like you listed and with mechanical engineering), but sometimes there can be.  This can coincide with the projects mentioned above.<br>Best wishes with your decision!<br><br>", "<b>Username: skarekat</b><br><br>Thanks Creekland!  Let me put it this way, money is not a major issue, but I do not want to throw in an additional 12k every year if for example, Penn State and Purdue offer very similar level of education/training/programs/projects/internship/job opportunities/etc.  I’m willing to pay the extra $$ if those things are significantly better than Penn State.  My son seems inclined to go to UIUC (Out of State for him) but is the additional 17k per year justified for his major (Mechanical Engineering).  I know the mid-west probably has more of internship/job opportunities in Mechanical Engineering, so would that be something that should be considered or would a Penn State student have an equal shot at those internships or jobs?  Thanks!!<br><br>", "<b>Username: momofsenior1</b><br><br>Totally biased here as I have a Boiler, but she loves Purdue.   It’s been an amazing freshman year.  I also think your estimate is high. We were at $44k oos and that was with honors college fees.  Tuition is frozen again for next year.<br><br>", "<b>Username: sevmom</b><br><br>Penn State instate sounds like a good opportunity. Can’t see any reason to spend thousands extra  every year anywhere  at an OOS  engineering school for a comparable outcome (unless you are very wealthy  and willing to pay for whatever price any college choice might be),  Since you seem concerned about price, listen to your gut. Hopefully, you communicated your financial  limits to your son before the applications went out.  The only reason I might see for going OOS  would be if he did not get into PSU main campus  for engineering(doesn’t seem to be the case?) or if it seemed to be an unworkable fit.  Many kids in engineering go to their state schools or look for merit that brings the cost down. Penn State has  very good recruiting and outcomes, I believe.<br><br>", "<b>Username: skarekat</b><br><br>Thanks @momofsenior1 and @sevmom.  We liked Purdue a lot when we visited the campus last summer (July 2018).  Though my son visited Penn State I personally haven’t visited Penn State.  He seemed to like UIUC and Purdue better.  I’m planning to visit Penn State soon with him since the last time he was there they got rained out.  He has an admit to Penn State main campus and is waitlisted at Schreyer (Penn State Honors).  What are the chances of getting accepted into Schreyer from a waitlist?<br><br>", "<b>Username: sevmom</b><br><br>Not sure Schreyer  needs to be a deal breaker if PSU is otherwise a good fit. Many kids in engineering  don’t care all that much about honors as most of their classes are challenging as it is (and they are with mostly good students and hard classes already}.  Are there any living/learning communities at PSU for engineers?   I love VT and one of my kids is an engineering grad from there, but we were instate.  How much did you agree to pay for with your son before the process began?   We told our sons , for instance, that we would pay up to instate costs .<br><br>", "<b>Username: eyemgh</b><br><br>The benefit of honors is VERY school dependent. Of the schools my son applied to, there was only one where honors made an appreciable difference for engineers. The things to look for are no increase in size to the curriculum, actual honors engineering classes that are smaller and taught by the best instructors, and early registration. I agree with everyone else. These schools are all very similar. You wouldn’t be buying a better career or earnings, just a different experience, and there’s nothing wrong with that if it’s important and you can afford it. Otherwise, they’d be far better off if you just give them the money upon graduation to invest, start their own kids’ college fund, or make a down payment on a house.<br><br>", "<b>Username: VA-NC</b><br><br>You cannot go wrong with VT Honors. Total college experience. Great place. Engineering is highly regarded. Best of luck with his decision!<br><br>", "<b>Username: ucbalumnus</b><br><br>PSU does have GPA requirements to get into your major.<br>https://advising.psu.edu/entrance-major-requirements-college-engineering<br>Purdue and VT have a similar system.<br>https://engineering.purdue.edu/ENE/Academics/FirstYear/T2M<br>https://enge.vt.edu/content/dam/enge_vt_edu/undergraduate/coe_com.pdf<br><br>", "<b>Username: sevmom</b><br><br>Don’t obsess over these requirements that are mentioned.  Send your kid off knowing the GPA requirements and tell  them you expect them to do their best).  Most kids that  will finish/are motivated to finish will do okay and will seek out support if needed. None of these schools want your kid to fail.  Don’t over think this stuff.  If your son is motivated and  going to do well in engineering, he will do well regardless of school. All of these schools are great for engineering.  Finances and fit should guide you. Good luck!<br><br>", "<b>Username: RichInPitt</b><br><br>All are very good schools and generally comparable.  My daughter had to chose between Penn State, Purdue, VT, and a few others and is very happy at Purdue.  I think a student just needs to spend time on campus and feel for the best fit - it’s different for different people. She loved Purdue and VT and hated Penn State, even though many of her HS friends were going to PSU.<br>Fwiw, I think I’ve paid under $43K, all in, at Purdue the last 2 years, and they’ve frozen tuition through 2020-2021.<br><br>", "<b>Username: skarekat</b><br><br>The competition is intense these days. Even with a perfect GPA and a 1520 in SAT he couldn’t get into Georgia Tech which was his dream school. He’s still waiting on Cornell and Carnegie Mellon, but he’s not too optimistic. Hence he’s considering one of Penn State, Purdue, UIUC or Virginia Tech from which he already has admission offers.<br><br>", "<b>Username: MWolf</b><br><br>The best schools on the list are UIUC and Purdue  (they are about equivalent, so it would depend on field), then VT, and then PSU. That being said, the difference between UIUC and PSU is not really worth the extra $68,000, IMO.<br>So, if cost weren’t an issue, I would say UIUC or Purdue, unless one of the other two schools appeals to your son for some reason or another. If cost is an issue, PSU provides the best value of the lot.<br><br>", "<b>Username: sevmom</b><br><br>Well, my husband went to Carnegie Mellon decades ago in engineering and played basketball for them. He has mentioned more than once that he probably would have enjoyed Penn State more!  Please don’t let  your  son go off to any of the state schools feeling he is settling if he does not get into CMU or Cornell.   We loved UVA and VT  instate for our sons in engineering. Older kid in particular was  competitive for lots of the  usual suspect engineering schools.  It really is many times  about fit and finances at the end.  Engineering  and  computer science are much more trendy these days .   My kids come from a long line of engineers .   Not me, of course!  Good luck!<br><br>", "<b>Username: skarekat</b><br><br>For some reason, maybe based on information he gets from his friends, he doesn’t think too highly of Penn State. We haven’t visited VT yet. We did visit UIUC on 7/3/2018 when hardly anyone was on campus so we couldn’t get a good feel of the campus activity. The information session was very perfunctory so we had to pretty much walk around campus ourselves without a guide. Purdue on the other hand was bustling with activity on 7/2/2018 and the student guides were extremely friendly and took a lot of effort in showing us around. So I personally liked Purdue a lot. My son liked UIUC better.<br><br>", "<b>Username: ucbalumnus</b><br><br>UIUC normally does direct admission to major, but some admits get an alternate major or undeclared.  But changing major (or getting into the original first choice if not directly admitted) can be difficult, since many majors are full with direct admission.<br><br>", "<b>Username: sevmom</b><br><br>Since you have not visited  Virginia Tech  yet, then don’t  if you don’t want to muddy the waters more! Beautiful campus, friendly students,  great school spirit, great outcomes, state of the art engineering building.<br><br>", "<b>Username: skarekat</b><br><br>Except for Purdue, which only accepts undecided, he’s been accepted for Mechanical Engineering major everywhere else. He also has admits from UPitt and Drexel but isn’t considering those.<br><br>", "<b>Username: skarekat</b><br><br>Just registered for an admitted students visit at Virginia Tech, Penn State and UIUC. ?<br>Hoping if he gets a scholarship at VT Honors College maybe that’ll tilt the scale in their favor for him.<br><br>", "<b>Username: Gudmom</b><br><br>If the Honors offer at VT comes with a scholarship, then that would be worthwhile, but otherwise Honors at VT is not as much of a differentiator as it is at some schools. On our admitted students tour we met a student who was dropping Honors, because it didn’t seem worthwhile.<br>This is not intended to put you off of VT - DD is a freshman and loves it.<br><br>", "<b>Username: Creekland</b><br><br>@skarekat  On your visits, try to find out about various projects going on at each school that undergrads can work with. If there are some that are attractive to you, definitely consider that highly when making a final decision. All of your choices are good for the basics. It’s fit that can make a difference. Part of fit is college life, part is finances, and with mechanical engineering part can be specific lab experience on a resume, though remember there’s no guarantee any student will get on a specific project. They’re often competitive. Still, some do.<br>You will need to decide which parts of fit rate higher than others if the number one choice isn’t also the least expensive.<br><br>", "<b>Username: VA-NC</b><br><br>@skarekat I am a firm believer that when you walk on a campus you get a feeling. Good/bad/indifferent, you fit or don’t. I felt that way when I was touring (far too long ago…) and my S19 does too. For example, he loved EVERYTHING about Northwestern and we felt it would be a good fit for him. Beautiful campus, football spirit, location, etc. When he went to visit, as much as he loved everything, he said  “I don’t fit with these kids, they are all so different than I am.” My husband looked around (who also was admitted/didn’t attend NW) and totally agreed. It was a shame, because other than that, it is perfect. We lean toward a traditional college town/campus. Some people prefer cities, some people don’t mind an array of buildings and designs to them. We, prefer uniform buildings, places like VT and Notre Dame build new buildings to replicate the old ones. That is a draw for some (us) and means nothing to anyone else…if sports interest your S, some of his choices have more spirit than others. You are fortunate to have great choices and I am sure once he tours, he will get a good feeling where he belongs. It’s a tough choice! <br><br>", "<b>Username: MWolf</b><br><br>@sevmom The OP’s son got into Engineering at UIUC and at Purdue, which are as good as Engineering at  CMU and at Cornell, and are better than CMU and Cornell in Mechanical Engineering, so the OP’s son has definitely demonstrated that he’s good enough for the best.<br><br>", "<b>Username: sevmom</b><br><br>I agree he is clearly a strong student and did not imply otherwise. The OP has said he is still waiting on privates Cornell and CMU. All these schools are very strong in engineering.  No wrong choice . Good luck with the decision!<br><br>", "<b>Username: Coloradomama</b><br><br>I like Purdue better for undergrads than UIUC becausexthry offer better study support. Purdue tests every admitted freshman engineering student in math and places them in the correct math class. .  At Purdue he will need to keep his freshman GzpAhigh to get into mechanical engineering.  Its very doable as long as he has been exposed to calculus and honors physics or bettercin high school.  Purdue offers all freshman an engineering seminar designed to expose them to a variety of engineering disciplines and help students make a good choice for major.   Purdue has sons of the best co op degree plans and industry connections. Purdue has similar school spirit to the other public programs. Purdue’s campus is walkable and has attractive matching brick buildings. UIUC seems more spread out and less attractive in some ways.   UIUC seems to have Chicago high school clicks and a very large number of international students from China. Could be a positive for some students.   I like Purdue the best for undergrads.<br><br>", "<b>Username: skarekat</b><br><br>Thanks @MWolf and @sevmom for your kind words. @Coloradomama, I agree, we all liked the vibe at Purdue. The student guides were super friendly and they took a lot of effort in showing us around. The campus was walkable and pretty.<br>I’m a little biased toward Purdue because my graduate advisor at Villanova was a Purdue alumni (Bachelors, Masters and PhD all from Purdue) and he was a genuinely great person and teacher from whom I learned a lot.<br><br>", "<b>Username: theloniusmonk</b><br><br>“The OP’s son got into Engineering at UIUC and at Purdue, which are as good as Engineering at CMU and at Cornell, and are better than CMU and Cornell in Mechanical Engineering, so the OP’s son has definitely demonstrated that he’s good enough for the best.”<br>Are you saying they’re better based solely on rankings?  I’d be careful about concluding 5th is better than 6th and use that to make a decision.  CMU and Cornell are harder to get in, maybe substantially harder to get in than Purdue or UIUC, even for OOS.  The CMU stats are 1480-1560/34 for engineering while Purdue engineering is 1350-1470/32.  The programs are very close that you want to use other factors like location, class size, strength of other majors or minors, sports, greek life and of course cost.<br><br>", "<b>Username: skarekat</b><br><br>Based on the current situation Purdue and Penn State seem to the best options from a cost/benefit perspective.<br><br>", "<b>Username: lvvcsf</b><br><br>In most situations I would recommend the least expensive option. ABET accredited programs are very similar. If you consider a STEM centric atmosphere where engineering is the center of campus Purdue fits the bill. Only you can decide if that’s worth 12k dollars a year more. Purdue has held its costs the same since 2012. I don’t know how PSU plans things.<br><br>", "<b>Username: Gudmom</b><br><br>If you are doing a cost/value calculation, just scrub Cornell right now. We made that mistake last year, even went to admitted students day. I have a happy Hokie now, but last April was tough.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> lvvcsf:<br>\"\"<br>ABET accredited programs are very similar.<br>\"\"<br><br>ABET accreditation means that the program meets a (high) minimum standard for content and learning outcomes, but different schools may organize the curriculum differently, and may offer different in-major electives within the major.<br>Whether such differences matter to a given student depends on the student.<br><br>", "<b>Username: skarekat</b><br><br>My son is from a STEM high school, that’s why I feel that he might feel more at home at Purdue versus Penn State.<br>The cost difference between Purdue and Penn State is $8k ($44k - $36k) per year which might be worth it.<br>Given the stiff competition I’m not too optimistic about an admit from CMU or Cornell.<br><br>", "<b>Username: skarekat</b><br><br>No scholarships from Virginia Tech so that’s not a cost effective option anymore. That leaves UIUC ($54k), Purdue ($44k), PennState ($37k) and potentially UPitt ($32k incl $5k scholarship). UIUC seems a bit out of budget at this point. How does UPitt compare with PennState and Purdue?  To me UPitt doesn’t seem worth the cost but I’d love to hear your thoughts. If it comes down to PennState and Purdue which one would be better and why?  Thanks!!<br><br>", "<b>Username: momofsenior1</b><br><br>My dd didn’t apply to Penn State so I can’t compare but let me know if you have any specific questions about Purdue engineering,  My daughter is finishing up her first year there and is loving the experience.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> skarekat:<br>\"\"<br>No scholarships from Virginia Tech so that’s not a cost effective option anymore. That leaves UIUC ($54k), Purdue ($44k), PennState ($37k) and potentially UPitt ($32k incl $5k scholarship). UIUC seems a bit out of budget at this point. How does UPitt compare with PennState and Purdue? To me UPitt doesn’t seem worth the cost but I’d love to hear your thoughts.<br>\"\"<br><br>Hmmm…  Pitt is the cheapest and does not require a high GPA to declare a specific engineering major like at PSU and Purdue.  Seems like two points in its favor.<br>https://www.engineering.pitt.edu/First-Year/First-Year/Advising/Choosing-a-Major/<br><br>", "<b>Username: carachel2</b><br><br>I was sitting here reading this thread with interest and was totally all butthurt that he was admitted to Pitt but not interested but was very interested in attending next door at CMU.<br>The great thing about engineering at Pitt is they spend an entire year exposing the students to the different types of engineering and then your student gets to declare their major. It is a year to grow up, explore, ask questions and then decide. My daughter turned down engineering admits at Purdue (with $10K merit per year; University of Texas and Texas A&M (and a few others) in order to attend Pitt (with $17K merit/year so we pay a bit less than in-state rates) and have a bit of time to choose.<br>With an ACT of 34 she was the lowest ACT score in her suite freshman year and was surrounded by kids who had attended much more rigorous schools. The atmosphere is collaborative and the first year of engineering culminates in a First Year Engineering Conference where the students have to present a professional paper. Along the way they are guided by engineers in the community and the writing center.<br>Except for her scare of almost failing physics  :(( it has been a great experience. Kids who want to party can find a party but there are plenty of other things to do and a nice city to explore. Mine has an on campus job n the engineering department and accepted an offer for a co-op job last month. A lot of her friends have co-ops already since MechE students can start a co-op as early as sophomore second semester. You really should encourage another peek before making a decision.<br>By the way she made a dramatic switch from thinking she would do BME to realizing she really wanted to do CivilE.  The ability to choose is the reason we are fine with her attending school so far away. Good luck with all the decisions!<br><br>", "<b>Username: momofsenior1</b><br><br>Purdue does the same in terms of exposure to many different types of engineering.     Students don’t transition to major until after the end of freshman year.    I agree that it’s a positive.<br><br>", "<b>Username: MYOS1634</b><br><br>^ the difference is that it’s much more competitive at Purdue than at Pitt.<br>What kind of environment does he envision himself in? A mostly STEM school ? A university with lots of different colleges and various majors - and if so, would he prefer a college town where key places are within walkable reach or a big city with a bus pass?<br><br>", "<b>Username: skarekat</b><br><br>My son is currently in a STEM school so he would prefer a STEM like environment. He would prefer Purdue but that’s $8k/year more than Penn State. How does the PSU engineering program compare with Purdue?<br><br>", "<b>Username: skarekat</b><br><br>@momofsenior1 - what are the key things that your daughter likes about Purdue?  Are there things that she doesn’t like?<br><br>", "<b>Username: skarekat</b><br><br>Cornell and Carnegie Mellon are out of the picture now. Their acceptance rate has dropped to ~6% this year. Waitlisted at UMich but he’s no longer interested. We visited Purdue on Monday 4/1. Except for the brutal 12 hour drive each way we loved every bit of the admitted students day. Planning to visit PennState on Monday 4/8. No scholarships from Virginia Tech so that’s out since it’s working out more expensive than Purdue.<br><br>", "<b>Username: skarekat</b><br><br>Though my son was reluctant on Penn State, labeling it as a ‘no good party school’, after visiting the University Park campus on 4/8 for the Admitted Students Day he just fell in love with everything Penn State has to offer.  Now he’s heavily leaning toward Penn State instead of Purdue. A final decision is yet to be made. ?<br><br>", "<b>Username: airway1</b><br><br>@skarekat We Are?.. we are heading to Accepted students (18th) although my son accepted Penn State awhile ago<br><br>", "<b>Username: skarekat</b><br><br>@airway1 PennState ?<br>Congratulations on being accepted to and on accepting PennState!!  What major?  Are you in state?  What other schools did he get accepted to?  And what made him accept PennState?  Thanks!!  Good luck!!<br><br>", "<b>Username: airway1</b><br><br>@skarekat my son is an international student majoring in Petroleum and Natural Gas Engineering and Energy Finance… after getting accepted he pulled his ED to Boston University (legacy) and all others as it went from being his 4th choice to his first (Accepted Jan 21… being accepted was a huge relief for him especially that at his high school so many apply to engineering (all his friends are heading to engineering which is amazing)… what we both liked about the program is the ability to double major in finance.<br><br>", "<b>Username: skarekat</b><br><br>My son finally accepted the PennState offer of admission after going back and forth between Purdue and PennState, and after a lot of analysis and discussion.<br>Purdue definitely has a better academic program than PennState but PennState has many other advantages (from our perspective) over Purdue like better campus/dining halls/food/dorms, more diverse students and programs, closer to home (2.5 hours versus 12 hours to Purdue), equally good opportunities for coop, internships, campus jobs and campus placements, and last but not the least - In-State tuition that means approximately 10k lower total costs per year.<br>Thanks everyone for your wonderful support, advice and recommendations that were immensely helpful. Good luck to all your kids for much success in their lives.<br><br>", "<b>Username: momofsenior1</b><br><br>Thanks for letting us know.  Best of luck to your son!<br><br>", "<b>Username: MYOS1634</b><br><br>Congratulations! And thank you for coming back, giving the decision, and explaining its rationale - it’ll be very useful to students later on. <br><br>", "<b>Username: sevmom</b><br><br>Congratulations on Penn State instate!  Unless merit or need based aid elsewhere comes through, often the instate options are best bets.<br><br>"]}