{"title": "uchicago vs upenn cas vs brown", "comments": ["<b>Username: slashermaster1920</b><br><br>I’m an admit at all 3 – try and convince me UChicago is the right school for me.<br>I’m interested in going to either data science/machine learning or management consulting at a top firm like McKinsey. I’m also open to the idea of getting a phd in either econ/math/stats from a top program. All else equal I like being in a bigger city over a smaller city or rural area. I’ll likely major in Applied Math, Comp Sci, and (only for UChicago) Economics.<br>With that said, I’d like you all to convince me that UChicago will be better for me than the other 2 <br><br>", "<b>Username: CU123</b><br><br>Why do you need convincing, just pick the one you feel is the best fit.  You really can’t go wrong with any of them.<br><br>", "<b>Username: slashermaster1920</b><br><br>@CU123<br>I need justification in my mind somehow. Brown is sort of eliminated in my mind though since it’s not in a big city.<br><br>", "<b>Username: CU123</b><br><br>Frankly this is a bad way to choose.  Hopefully you have visited the schools.  I personally like the YouTube videos students at these schools put out, they give you a better idea of what each school is about.<br><br>", "<b>Username: JBStillFlying</b><br><br>OP, how about you visit all three and figure out which one is the best fit for you. Or flip a coin.<br><br>", "<b>Username: 85bears46</b><br><br>OP, I shall be very honest with you.  If you need strangers on Internet to convince you in a few paragraphs to come to U of Chicago, I don’t think UChicago is the right school for you. There are literally thousands of applicants who would like to take your spot because they love the school and understand why the school fits them better than any other schools.<br>That said, I second my fellow UChicago parents/alumni that you should visit all three schools and decide on which one fits you best. Good luck.<br><br>", "<b>Username: BrianBoiler</b><br><br>Here is the problem.  Most people can only give you first hand knowledge of one school from the perspective as an undergrad.  I can tell you why I like UChicago as the parent of a current first year.  I can not tell you why it is better than your other two choices obviously are great schools too.<br>Why UChicago?  All three will give you a great degree.  I think UChicago will do a better job of teaching you how to think.  I believe Brown has an open curriculum and UChicago is known for the CORE which is a very demanding 1 1/2 curriculum that exposes you to many disciplines.  At the other two I think you can avoid it if you want to.<br>My son has no regrets in picking UChicago and if asked to do it again he would have.<br>You are very fortunate to live in an age where you can do all the research you want to make a decision. But, you also live in a time where you might have too much information causing analysis paralysis.  I think your best bet is to go with your gut.<br><br>", "<b>Username: milee30</b><br><br>You can’t go wrong with any of those choices.  I’ll let the people who know more about UPenn and Brown speak about them, but as for Applied Math and Comp Sci - especially big data, UChicago is a good place to be right now.  The math department has been known for years as one of the top math departments in the US and several of my son’s fellow math majors chose UChicago over MIT specifically for the math department.  And in case you hadn’t heard, UChicago recently lured away the head of the UCal Berkeley comp sci department, built him a great new building and are ramping up the comp sci  - especially data analytics as we speak.  Oh, and Bill Gates is not only a trustee but sent his own son to UChicago.  It’s a pretty exciting time to be a math/comp sci person at UChicago and the graduates of those programs are highly sought after.<br><br>", "<b>Username: Boothy2002</b><br><br>Nice options to consider. But all very different. I’d echo others’ comments…visit all 3 and your answer should become very clear.<br>If McKinsey really is a goal of yours, note that it is the top employer of Chicago MBA’s and was founded by a U of C professor.<br><br>", "<b>Username: Publisher</b><br><br>I won’t even attempt to convince you which is the best school for you among the three as I just want to enjoy that I have discovered someone who applied to both Chicago & Brown.<br><br>", "<b>Username: marlowe1</b><br><br>Largely because of the Core - but also because of the underlying culture and UChicago type of student - you should only opt for this school if you really do want to become educated in a broad way. You made no mention of that aspiration in your original post, which leads me to think that you might not be well-served by Chicago.<br><br>", "<b>Username: CU123</b><br><br>@Publisher very astute of you to notice the irony.<br><br>", "<b>Username: lmao2018</b><br><br>You can recruit regardless (or transfer even).<br><br>", "<b>Username: uocparent</b><br><br>Congrats on your acceptances and great choices.  All three schools will serve you well, but if possible, go to all 3 schools’ admitted student days and sit in a class, talk to the students in the cafeteria, maybe the faculty, walk around campus, then think about it for a day or two, and maybe it will become apparent which school would be the one you can call home for the next 4 years.<br><br>", "<b>Username: kaukauna</b><br><br>Regarding the comment above about Bill Gates…I do believe his son is attending now but I’m pretty sure he’s not a trustee.  Satya Nadella (Current Microsoft CEO and Booth grad) is, though.<br><br>", "<b>Username: PepperJo</b><br><br>My daughter’s first choice was Brown until she visited UChicago, where she applied to and was admitted ED. She loved both even though they are very different universities. She did not care for UPenn at all though.<br><br>", "<b>Username: Much2learn</b><br><br>Q: An aside - would i be treated as a second-class citizen compared to Wharton students while recruiting for top companies?<br>A: That isn’t allowed at Penn. Students in all schools have the same interview opportunities on campus. Employers can’t only talk to Wharton students and most don’t want to anyway. Students from SEAS and SAS land consulting jobs all the time.<br>I’ll likely major in Applied Math, Comp Sci, Economics, or Statistics. You can probably take a blend of all of those, if you wish. Penn provides a lot of flexibility to do this.<br>The Penn alumni/student network is extensive and internship and job placement is excellent.<br><br>", "<b>Username: JHS</b><br><br><br> Sniggering about a student applying both to Brown and Chicago is wrongheaded and basically anti-intellectual.  It's easy for a student to like both enough to apply.  If students like the idea of the Core, they can fairly easily replicate it for themselves by judicious course selection at Brown, and many students do just that.  The only thing they can't replicate is sharing the common curriculum with everyone.  But even ardent Chicago fans have to admit there are plusses and minuses to that.  My daughter was a huge Core fan when she was applying, and she's a huge Core fan in retrospect.  But spring of her first year at Chicago, she was saying \"I wish I had given more thought to Brown.\"<br><br><br>I know several kids who applied to both Brown and Chicago.  None of them was unintelligent or unthoughtful.  Some chose one, some the other, some neither, and some had the choice made for them.<br><br> Among my kids' friends, the one who went to a brand-name consulting company whom I knew best was a kid who went to Brown and had a great experience there.  It was mostly centered on extracurriculars, though, not the classroom.  Class was just something he did to be able to keep working in his extracurricular and to qualify himself for what would come next (Bain, then Harvard Law School).  That attitude wouldn't work well at Chicago.  What people do in class is very important to them there, even the people who are really committed to other things as well.<br><br>One thing to look into – while in most of the world, Applied Math is very popular, and a mainstream thing to do, Chicago barely has an Applied Math program.  It just created that major a couple of years ago.  Of the three colleges, Chicago has by far the most pervasive math culture, and the highest percentage of people majoring in math, but hardly any of them do Applied Math.  And I think if you look at the Chicago Applied Math curriculum, it’s barely distinguishable from its straight math curriculum.  At Chicago, people are really into mainstream theoretical math.  In addition to the formal Core, there’s something of a math core as well.<br>(Also note:  If you are serious about a PhD in Economics, Chicago has a special variant of the straight Math major designed specifically for people who want to apply to Economics PhD programs.  It also has a great Statistics department as well.)<br>Another thing to look into – At Penn, the vast majority of people who want the kind of career path you are talking about (not the one involving a PhD in Economics) will be in Wharton, not CAS.  And there will be a lot of them.  People make way too much of a big deal about the difference between Wharton and CAS, but there’s no question that the Wharton students find it in their interest to cultivate the myth that CAS students are second-rate.<br><br>", "<b>Username: slashermaster1920</b><br><br>@Much2learn<br>Sure, I might technically be able to apply. But would I be given as much of a chance as Wharton students all else equal?<br><br>", "<b>Username: milee30</b><br><br><br>\"\"<br>Sniggering about a student applying both to Brown and Chicago is wrongheaded and basically anti-intellectual.<br>\"\"<br><br>@Publisher  - maybe you can clarify, but I didn’t interpret your post as sniggering, but instead just pointing out how interesting it is to have open minded people who recognized the merits of two very different yet awesome unis.  Were you sniggering?<br><br>", "<b>Username: Much2learn</b><br><br>@slashermaster1920<br>Penn engineering students have a lot of options and many accept investment or consulting jobs. Many of those positions have seen increasing value in hiring students with computer science, math and statistics skills, which combined are basically the aspects of data science.<br>Recently, an increasing number of Penn engineers are turning down finance opportunities to work in tech and they are getting those jobs too. The program is rigorous but grads have a lot of options. The average grad has over two job offers the last time I saw data. That is almost unheard of. Look at the data from Penn Career Services for engineers, they have extensive opportunities.<br><br>", "<b>Username: JBStillFlying</b><br><br>“(Also note: If you are serious about a PhD in Economics, Chicago has a special variant of the straight Math major designed specifically for people who want to apply to Economics PhD programs. It also has a great Statistics department as well.)”<br>^ Ditto. The Math w/ Specialization in Economics includes a tailored set of Math courses that will prepare someone quite well for a PhD program in Econ. If OP is truly interested in that path, he/she should also make sure to take the upper div. Econ with someone who will write a great LOR (since that is crucial to being accepted into grad Econ).<br><br>", "<b>Username: 85bears46</b><br><br>Agree with @JBStillFlying  on #17.  Just thinking about non Nobel guys at the Econ. Department off my head:  Greenstone, Levitt, List, Murphy.  Not to mention Carlton, Diamond (my bet for our next Nobel), Goolsbee, Kroszner, Topel at Booth.<br><br>", "<b>Username: Publisher</b><br><br>@milee: Brown has an open curriculum & Chicago has a hard core core curriculum. Seems as though one interested in such core requirements might apply to Chicago & to Columbia, but not to Brown.<br>So yes, while seemingly inconsistent, it also shows flexibility & open-mindedness.<br><br>", "<b>Username: marlowe1</b><br><br>I interpreted @Publisher 's remark as humorous - in light of some of the dust-ups on this board wherein Brown has assumed the role of the anti-UChicago (and vice versa).<br>OP appears to inhabit an alternative universe in which it is possible to entertain the thought that one could imagine going to either of these schools. We must be in the twilight zone! [Joke.]<br><br>", "<b>Username: BronxBorn</b><br><br>Be open minded that young people’s career views evolve once they enter college.  However, if you have a real affinity for consulting, and you like McKinsey, then be advised that James Oscar McKinsey had two degrees from University of Chicago and was a professor at University of Chicago.  To show that there is a stronger pipeline between U of C to McKinsey anywhere in the world would not be easy—there are substantial ties between this firm and university at multiple levels, and those relationships go back decades and are at the levels of many senior partners.<br><br>", "<b>Username: slashermaster1920</b><br><br>I’m an admit at all 3 – try and convince me Penn is the right school for me.<br>I’m interested in going to either data science/machine learning or management consulting at a top firm like McKinsey. I’m also open to the idea of getting a phd in either econ/math/stats from a top program. All else equal I like being in a bigger city over a smaller city or rural area. I’ll likely major in Applied Math, Comp Sci, Economics, or Statistics<br>With that said, I’d like you all to convince me that Penn will be better for me than the other 2?<br>An aside - would i be treated as a second-class citizen compared to Wharton students while recruiting for top companies?<br><br>", "<b>Username: anon145</b><br><br>@milee30 by the time top professors are recruited away from public universities to expensive privates (a common occurrence) their impact productivity has peaked and their interactions with undergrads goes to zero.  <br><br>", "<b>Username: lmao2018</b><br><br>@JHS No one in Wharton treats CAS or any other school as second-rate, and it’s not their interest to do so.<br>I don’t have statistics in front of me, but I’d also bet that Penn sends more students to MBB every year than Chicago. It also likely has more interested applicants. But the prep from classes/clubs that you can get at Penn is as good as anywhere.<br><br>", "<b>Username: Nocreativity1</b><br><br>Congratulations you have great Choices!! Didn’t I read somewhere one of these schools had hundreds of students hidden away in mental institutions? Just for old times sake:)<br><br>", "<b>Username: slashermaster1920</b><br><br>Hey All – Before going to admitted student days, I’m leaning UChicago for these reasons –<br><br>In terms of total classes taken, it looks like UChicago’s Core isn’t that restricting compared to other universities’ gen ed requirements.<br>I lean conservative politically (but not super right wing), so would I inevitably hate the majority of my classmates at Brown? I also like being in a major city like Chicago or Philly all else equal.<br>I get the vibe that Penn CAS doesn’t get as much love from recruiters as Wharton, whereas at UChicago all majors would be on the same playing field for top notch jobs. Sure all the schools can apply for the same jobs, but would recruiters view a CAS student the same as a Wharton student with similar credentials?<br>I’m open to getting a phd, and UChicago obviously is top in that area. I can also major in Econ with Spec in Data Sci and also simultaneously get a masters in stats if I’m really hard core about it.<br>UChicago seems to have made some significant improvements in their STEM majors over the last several years.<br><br>Correct me if I’m wrong or misguided in any of the above.<br><br>", "<b>Username: lmao2018</b><br><br>Interviews are performance based. They’re not going to hire someone who does worse in on the case/technicals/personality components simply because of Wharton. If anything, the Wharton students are held to a higher standard.<br><br>", "<b>Username: Penn95</b><br><br>@slashermaster1920<br><br>\"\"<br>I get the vibe that Penn CAS doesn’t get as much love from recruiters as Wharton, whereas at UChicago all majors would be on the same playing field for top notch jobs. Sure all the schools can apply for the same jobs, but would recruiters view a CAS student the same as a Wharton student with similar credentials?<br>\"\"<br><br>This is actually not true. Penn CAS kids place very well into consulting and finance jobs and do get a lot of attention from recruiters. Obviously not as many CAS kids are interested in these jobs as wharton kids so not as many go into I, but this also means there is less competition. Just look at the stats on the Penn career services website.<br>Also as Penn CAS students you can take as many Wharton classes as you want and have access to all the various undergraduate business clubs and research going on at Wharton.  You wouldn’t have this kind of exposure at UChicago or Brown.<br><br>\"\"<br>In terms of total classes taken, it looks like UChicago’s Core isn’t that restricting compared to other universities’ gen ed requirements.<br>\"\"<br><br>Yes but you would still have significantly less flexibility compared to open curriculum schools like Penn and Brown.<br><br>", "<b>Username: privatebanker</b><br><br>The CEO of Apple went to Auburn. And the prior CEO went to Reed but failed to graduate.<br>Choose the school that you like the most, intrigues you the most and gets you the most excited.<br>You. Not the difference beteeen any of these world class institutions will not be the the difference. Your own personal talent and tenacity will or will not find you  a spot at Bain and McK.<br>There are other regional consultants that are awesome too.  I met with one firm yesterday.  The lead was a Middlebury grad.  His second in the meeting went to a UC.<br><br>", "<b>Username: havenoidea</b><br><br>Look on Penn’s Website at job placements from CAS. Their outcomes data are very thorough. I am not that familiar with the finance world, and was looking specifically at IB, but it looked to me like they do place some in finance, but obviously not like Wharton. Of course, that may be self-selection, and management may be different from IB.<br><br>", "<b>Username: tk21769</b><br><br><br>\"\"<br>If students like the idea of the Core, they can fairly easily replicate it for themselves by judicious course selection at Brown, and many students do just that.<br>\"\"<br><br>Yes, you can do that up to a point, but …<br><br>\"\"<br>The only thing they can’t replicate is sharing the common curriculum with everyone.<br>\"\"<br><br>That sharing is (arguably) a rather important characteristic to miss. The “everyone” at UChicago includes not only undergraduates but also many faculty members (who, if they teach undergrads at all, are appointed to “The College”). So the whole community of The College shares in the Core.<br>As I remember things there (dunno how much it may have changed) many Core courses were team taught (or team designed). Many of the teaching materials were prepared by faculty teams and compiled by the university press. There was a relatively high degree of integration among courses and disciplines. Even the furniture came into play:  typically, students and the instructor all sat around a big table (as opposed to students in rank-and-file order facing the teacher at a lectern).<br>So …  since a couple posters above invoked Steve Jobs and Bill Gates … the difference between the UChicago Core and other undergraduate programs is a bit like the difference between the Apple “ecosystem” and the relative patchwork you get with other computing platforms. Of course, some people prefer more  freedom and flexibility, or more stove-piped focus on their main interest(s).<br><br>", "<b>Username: Penn95</b><br><br><br>\"\"<br>Of course, that may be self-selection, and management may be different from IB.<br>\"\"<br><br>There is self-selection. Not just at the point of initial entry but also later on since many people discover an interest in business and choose to transfer to Wharton after freshman or sophomore year. still there are many who are interested in business but want a liberal arts education/dont want to actually study business and they also end up doing well at business recruiting.<br><br>", "<b>Username: stevensPR</b><br><br>I don’t think you can go wrong with any of the three when it comes to getting into a top MBB firm.  Just choose base on fit.<br><br>", "<b>Username: JenniferClint</b><br><br>Personally, I would pick Penn.<br>If I was choosing between Brown and Chicago, I would pick Brown because I think I’d have a more enjoyable college experience.<br><br>", "<b>Username: slashermaster1920</b><br><br>Right now I’m leaning<br>UChicago = UPenn &gt; Brown = UMich in state<br><br>", "<b>Username: slashermaster1920</b><br><br>I’m down to UChicago and UPenn CAS. It’s so hard to decide between the 2. I’m leaning slightly toward UChicago just because I want the option of attending graduate school in math/econ/stats, and UChicago’s grad school placement is a bit better than Penn’s. UChicago is also a couple thousand dollars cheaper per year.<br><br>", "<b>Username: JenniferClint</b><br><br>Sounds like you’ve made a decision. Very different from the one I would make but you really can’t go wrong.<br><br>", "<b>Username: warblersrule</b><br><br><br><br><br> slashermaster1920:<br>\"\"<br>I want the option of attending graduate school in math/econ/stats, and UChicago’s grad school placement is a bit better than Penn’s.<br>\"\"<br><br>I doubt there is even a shred of evidence to support this claim.<br>More Chicago students may pursue PhDs, but that does not mean that it is easier to do so from Chicago than Penn.<br><br>", "<b>Username: scalable</b><br><br>Congrats, all three schools are really great! If you want to do consulting at a place like McKinsey out of school are probably best at Penn, then a tie between Brown and Chicago. You can check the numbers on LinkedIn - Penn sends kids to top consulting firms in droves. For STEM, you probably have a wash between all three with the edge going to Penn and Brown for computer science/engineering/data science and the edge going to Chicago for math/statistics. In terms of alumni network, however, I don’t think it’s close. Penn has an amazing network that crawls every corner of business and tech, similar to schools like Columbia, Dartmouth and Duke. But in terms of quality of life, your best bet is probably Brown, then Penn, and lastly UChicago, if that is something you are considering. Your ability to get into top PhDs from any of these schools will be about the same - while they are not as fine-tuned as schools like MIT and Harvard, they can all get you the right opportunities. Also, please don’t look at things like rankings to decide - most rankings actually have Penn and Brown ahead of UChicago except for US News, so it would be an invalid argument to say any of them are “more prestigious” or “higher ranked.”<br><br>"]}