{"title": "university of cambridge vs duke university", "comments": ["<b>Username: econometrician</b><br><br>Hey CC! Hoping for some advice on choosing between two great option, and would like to hear your thoughts/advice.<br>At Duke I’d double major in stat & econ, maybe with a minor in philosophy or history. At Cambridge, I’ve been accepted to read economics at Trinity College. I’m not sure if I want to go into academia or finance. Either way, I want to go to grad school (PhD or MBA) in Cambridge, MA and end up working in the USA (I’m a US citizen), but if I follow the finance route I’d consider working in London or Singapore for a few years before returning to the US for my MBA.<br>Trinity College, Cambridge:<br>Pros:<br>Time/Cost (About $100k cheaper than Cambridge, because it’s 1 year shorter + cheaper per annum)<br>Supervision system offers unparalleled intimate teaching<br>College system offers a tight social life<br>International exposure would be good for personal growth<br>Cons:<br>Potential culture shock<br>Excessively predetermined course load: I still want to learn more from other subjects<br>Short terms means less time for extracurricular activities/bonding with friends<br>Grading being based purely on final exams<br>Duke University:<br>Pros:<br>Flexible academics; meaning I can take CS/math courses (Necessary for jobs/PhD preparation) or random courses (Just for fun)<br>Probably has a better alumni network in the USA specifically<br>Similar to above point: May be better for finance recruiting into NYC offices<br>Wider array of support for programs outside of school: Study abroad, summer community service, undergrad research, etc<br>Cons:<br>Cost (See above)<br>Not a big fan of the social scene (Drinking culture/Greek life/athletics)<br>I’d be especially interested to hear from current Duke students on the social life there, and from anyone in the finance industry on how recruiting/job outcomes would compare from the two schools.<br>All advice is greatly appreciated!<br><br>", "<b>Username: Publisher</b><br><br>Two outstanding options ! Nevertheless, consider Cambridge because it saves a year of tuition & you plan on getting an MBA, and because you do not like the Duke social scene.<br>FWIW: The Times Higher Education Global Ranking for 2019:<br><br><br>Oxford<br><br><br>Cambridge<br><br><br>Stanford<br><br><br>MIT<br><br><br>Caltech<br><br><br>Harvard<br><br><br>Princeton<br><br><br>Yale<br><br><br>Imperial College of London<br><br><br>Chicago<br><br><br>Duke.<br><br><br>Since you plan to work for a few years before getting your MBA, Cambridge gives you access to both European & US employers.<br>P.S. Plus a degree from Cambridge should make you an interesting candidate for admission at the top MBA programs.<br><br>", "<b>Username: cinnamon1212</b><br><br>I went to Cambridge a very long time ago (Queens’) It’s an amazing place and nothing like a US university. I can only contribute peripheral snippets.  Trinity is a phenomenal and historic college. When I was there there was a bit of anti American feeling, don’t know if that is still the case. And there was no career help; again things might have changed.  There will be no alumni network to speak of in the US. And, unless you have work papers  (not easy to get) you will have to come back to the US to work.<br>On the other hand, it is an experience like no other, and one that few Americans get to experience.  I went there for graduate school, and like that path better than the reverse (undergrad in the UK, graduate school in the US).<br>Good luck,  both are world class choices!<br><br>", "<b>Username: Publisher</b><br><br>With a degree in finance from Cambridge, OP should be able to establish contacts with Cambridge alums at Wall Street firms.<br><br>", "<b>Username: Waiting2exhale</b><br><br>I found this a few months ago, a discussion on “Target” and “Non-Target” schools for recruiting out of the undergraduate ranks.<br>There is probably an updated list, but for some reason I cannot find it.<br>I cannot vouch for the soundness, or veracity, of this list, of course.<br>Hmm. Think it is not allowed. Will PM you.<br>I found the link at Wall Street Oasis, under Comprehensive List of Target Schools for Investment Banking.<br><br>", "<b>Username: cinnamon1212</b><br><br>@Publisher one cannot study finance at Cambridge as an undergraduate.  Here’s their listing of courses of study:<br>https://www.undergraduate.study.cam.ac.uk/courses/search<br>There just aren’t degrees in things like finance, or accounting etc. Economics is the closest thing.<br>I would imagine Cambridge alums at Wall Street firms are heavily concentrated in the UK. There wouldn’t be many in the US.<br><br>", "<b>Username: PurpleTitan</b><br><br>Duke would provide better recruiting preparation and an alumni base that would be willing to help out more. And I have a feeling that you will fall in love with Blue Devils basketball if you go there even if you don’t care at all for it now.<br>The course and major flexibility is also quite key, IMO.<br>Cambridge would provide an intensely intellectual atmosphere and better reputation outside the US (both Duke and Cambridge respected in the US, obviously).<br>And there is the money component.<br>If money was not a factor, I personally would choose Duke because I wouldn’t have been certain I wanted to solely study econ at 18. At Duke, you could go a completely different path (say, major in CS and go work in Silicon Valley). Not possible at Cambridge. IMO, that should be your biggest consideration (assuming you are certain you want your long-term career to be in the US instead of non-US) unless that extra $100K would be a major financial strain (in which case, you should be considering your full-ride/no-tuition options as well).<br>BTW, they drink a lot in the UK, even at the very intellectual places.<br>And you could study-abroad at Duke.<br><br>", "<b>Username: cinnamon1212</b><br><br>Another factor is that an elite university in the UK is just nothing like the US. There is much less interest in diversity,  whether it is racial or economic.  The UK is a much more closed and stratified society.  As an American you are outside that, which is great. On the other hand the networks the British students already have (social, public school) are closed to an American.  There is more than a whiff of Brideshead Revisited-- the colleges still have black tie May Balls each year. It is an amazing experience,  but unless the OP has ties to the UK (for example can work after graduation,  has relatives living there) I would think long and hard about it. I am a huge anglophile,  and have lived there for 4 years, well after Cambridge,  but the UK and university education is a good 20 years behind the US. (Don’t crucify me, remember I love Britain!). And I loved Cambridge.  But I wouldn’t advise my own child to go there as an undergraduate,  over an excellent US school.<br>That said, OP you have given us very few details and there may be very good reasons for you to choose Cambridge.<br><br>", "<b>Username: Publisher</b><br><br>@cinnamon1212 : Yes, I should have written “read economics” instead of “degree in finance”. Thank you for noting that.<br><br>", "<b>Username: SJ2727</b><br><br>@cinnamon1212 , I was at Cambridge much more recently than you and I think a lot of that intense class-focus has dissipated. It’s still there, as it is all over the UK, but they are making significant efforts to reduce it, including a big push for state school intake. (By the way many people now rent rather than buy May Ball outfits - you still get the looks without needing the investment, etc.)<br>There are far more Americans at graduate level than undergrad, but being a bit of a novelty is no bad thing.<br>The only downside to Cambridge for me would be the more focused undergrad, if OP wants a more diverse education. If the ultimate goal is grad school back in the US, it is a perfectly fine background.<br><br>", "<b>Username: Twoin18</b><br><br>The economics course at Cambridge is very mathematical and an excellent preparation for a PhD. I wouldn’t worry about anything being lacking there. It’s more academically intense than anything in the US, I’m not sure why anyone would consider the educational system to be behind the US (let alone 20 years behind).<br>You don’t have general ed courses which can be fun to some and a distraction to others. I don’t think there’s a lack of time for extra-curricular activities (I found time to play 5 sports amongst other things), everything is very intense, but you work hard and get through it. And the advantage of grades being based on end of year exams is that you can catch up during the Christmas and Easter breaks. Instead of having finals like in the US, the last week of term is more focused on parties and dinners (and bumps if you want to try rowing). I guess Americans might feel black tie dinners are elitist, but it’s more about formality than anything else (at least you don’t wear black tie for exams, unlike in Oxford).<br>I agree there is not much of an alumni network (more in SE Asia than the US, after all the Singaporean PM went to Trinity), but the level of credibility that a Cambridge degree brings is significant (and most people in the UK at least will be somewhat in awe of Trinity in particular). Arguably more so than Duke, especially in academic and finance circles. I find it carries plenty of weight in the US. The $100K difference will go a long way towards helping pay for an MBA.<br><br>", "<b>Username: econometrician</b><br><br>Hey all! Thanks for all the advice; it’s given me a lot of insight and I really appreciate your time. Some more details, if they might be important:<br>The $100k difference isn’t overwhelming for me (s/o to my parents). Another thing I forgot to mention: I’m Chinese-American, so I’m not sure if that would play negatively into my experience at Cambridge at all.<br>I’m absolutely certain (That might be a bit of a folly to say right now, but I’m as certain as I can be) that I want to study economics, although I’m uncertain as to what I want to do with my economics degree (academia, consulting, finance, etc).<br><br>", "<b>Username: Twoin18</b><br><br>There are noticeably more undergraduates from the Far East (SE Asia, HK, China) than from the US at Cambridge, reflecting Commonwealth links and the more similar school systems (A levels). So I don’t think it would be a negative (and could provide another social grouping for you to become involved with if desired), compared perhaps to some other ethnicities that are acknowledged to be underrepresented there. Having said that the percentages are more like Harvard levels than Berkeley levels (though race is not taken into account in admissions in any way, this simply reflects the pool of applicants and the fact that the UK is not as ethnically diverse as the US). The stats are published on the website.<br>It’s good to be certain about your subject, in fact Cambridge likely wouldn’t have admitted you if they had perceived any uncertainty on your part.<br>Don’t underestimate what else you could do with $100K. For example if you decided to do a masters or PhD in the UK then it probably wouldn’t be fully funded (one reason to do that is because it’s much quicker, only 3 years for a PhD, if you don’t want to be in academia long term, that’s partly because you aren’t doing so much TAing).<br><br>", "<b>Username: PurpleTitan</b><br><br>If you are absolutely certain about studying econ and love it, that tips the scale heavily in favor of Cambridge. You’ll go deeper into the subject than you likely would in the US. Reading econ at Cambridge would essentially be equal to a major and masters in econ from a top school in the US in terms of how deep you’ll go (and in fact, after a few years, your Cambridge BA would be upgraded to a MA).<br>Being Chinese-American would not be a negative at all.<br><br>", "<b>Username: collegemom3717</b><br><br>Adding in a practical point: if you want to taste-test finance as a path, all of the big name firms recruit heavily from Oxbridge for (paid)  internships in London. As a full time student, you are eligible for those internships with the same firms you would be looking at in NY. The experience- and the contacts!- will open all the doors you want, if you decide that is your path.<br>As others have noted, the terms are incredibly intense- you will genuinely work harder than you ever thought possible, yet amazingly enough there is plenty of socializing of every sort. Also, the breaks are long  <br>Imo, the biggest reason not to go to Cambridge  is if, looking at the course schedule, reading the module descriptions, you aren’t thinking to yourself ‘that looks interesting / cool / fun / etc/’.<br><br>", "<b>Username: cinnamon1212</b><br><br>@Twoin18 by 20 years behind,  I was not referring to the academics.  More, all the other “soft” aspects of college.  When I attended there was a complete lack of interest in diversity,  at a time when US schools were focusing on that. My college had one black person in it. (And Britain is more diverse than you give it credit for!)<br>Things like fundraising-- they didn’t even ask for money from alumni, ever, until a few years after I graduated.  Now, we can all do without that aspect of college life, but a lot can be done with alumni donations, and it’s a way for the university to stay connected with graduates.<br>My US educational institutions stay in touch with me via email, a monthly magazine and social media. Cambridge,  not so much. There is a magazine,  every quarter? And I get an email and college magazine once a year.<br>All these things aren’t important in and of themselves,  but reflect a lack of connection to alumni and to the business side of education. So, as far as I can tell there is no career help, or nothing like a US university would have. This is more true the farther away you get from graduation.<br>Finally,  again, the OP has to know they can legally work in the UK for him to take advantage of paid summer internships in London. Otherwise he will be left to network on his own in the US  to find summer jobs in America , where, yes, the Cambridge connection will be known and respected.<br>If the OP is considering a career in academia then Cambridge is an excellent choice.<br><br>", "<b>Username: Conformist1688</b><br><br>actually, a student visa will enable OP to work in the summer vacations, so that’s not a problem, but he/she would need to find their own housing for that.<br><br>", "<b>Username: Twoin18</b><br><br>And one thing to note is that from a US perspective the accommodation at Cambridge is amazingly good: you get a single room, with a bed, desk, sink, coffee table and armchairs or sofa, and in some cases a private shower (so relatively few people feel the need to work in the library except for social reasons). Most single rooms are bigger than a double or triple room at a US university (typically at least 180-250sq ft, but third and fourth years can even get “sets” with a sitting room and separate bedroom). US students will find it odd to have a “bedder” who comes in each weekday morning to make your bed, vacuum, empty the bins and change your sheets every week (though they are usually quite good about not disturbing you if you have someone else in there and you leave the bin outside the door ;)).<br>The best advice is that if you can afford it, always take the most expensive room option, the difference in price is far less than the difference in quality/size/location. They give priority in the second (and fourth) year to scholars (those who get a first, nowadays that’s nearly half of the class).<br><br>", "<b>Username: JenniferClint</b><br><br>You want to go to grad school in the US. Go to Duke and study abroad in Cambridge for a semester or two. Better still, experience Cambridge on a Churchill/Marshall scholarship if you have the ability to win one of those.<br>The UK is a whole different world and I’m very down on British schools at the moment. British universities are probably going to lose a lot of European funding post-Brexit. Political polarization in the UK is at an all time high (even more extreme than the US IMO). I just don’t see Europe as being a credible alternative to the US/Asia in the long term. There is a massive rightward lurch in policy across the entire continent and I personally could not see myself living there in the years to come. Just one person’s opinion.<br>As far as international rankings are concerned, take them with a MASSIVE pinch of salt. Most of the global rankings come out of Europe and Asia and they occasionally come up with ridiculous results (example: Dartmouth and Brown ranked hundreds of spots lower than the University of Minnesota)<br>OP, I am a recent-ish Duke graduate who wasn’t into Greek life, drinking, partying or athletics (I came to enjoy Duke basketball). It was relatively easy for me to find a niche on campus. Look at Selective Living Groups. You will find a lot of people who share your interests. Also, I am not an expert on British schools but the drinking scene in the UK is likely to be even more extreme…<br><br>", "<b>Username: cinnamon1212</b><br><br>@Conformist1688 is absolutely right, I stand corrected! The work papers issue becomes more problematic upon graduation.<br><br>", "<b>Username: Twoin18</b><br><br>@cinnamon1212 Trinity is a lot better than most other colleges about staying in touch, because they have the money for a full time alumni relations staffer. So they have a quarterly college magazine, regular emails (at least once a month) and frequent events (including in the US - if you’re in a city like NY/DC/SF/LA you’ll get invited to dinner with the master almost every year, that’s how they do their fundraising). And you can go back to college for a free dinner almost anytime. But I agree that it’s not on the same level as US colleges, and I would never really consider using the alumni network unless I wanted an academic job (the careers center is a university not a college function while in Cambridge)…<br>On the diversity front, there is lots of effort to encourage more applications from underrepresented groups (again there is a full time outreach person), but selection is strictly on academic merit, so if those groups don’t apply (for example Trinity has a relatively low population of women because fewer of them apply to do math and physics) then they will be underrepresented in the admitted class, because there are no quotas for any particular group, not even an attempt to balance by sex. And it’s not just about ethnicity, one underrepresented group is poor white boys (see https://www.google.com/amp/s/amp.theguardian.com/society/2018/jan/07/professor-green-white-working-class-boys-becoming-more-disengaged).<br>I agree it could be hard to be the one black student (though some like standing out and others hate the attention, and certainly more opportunities might be brought to your attention, just like if you’re a female mathematician), but (as I noted above) being Chinese-American would be more unusual for being American than for being of Chinese origin.<br><br>", "<b>Username: rjkofnovi</b><br><br>Cambridge over Duke.<br><br>", "<b>Username: collegemom3717</b><br><br>Full time students can legally work in the U.K. during vacations & the big MC/IB firms do not seem to mind hiring US students for summer internships<br><br>", "<b>Username: Twoin18</b><br><br>“You want to go to grad school in the US. Go to Duke and study abroad in Cambridge for a semester or two.”<br>That’s a pretty big non-sequitur. But I would absolutely advise against doing a JYA semester in Cambridge for any reason other than having a fun travel experience. It’s just a moneymaking exercise that isn’t taken seriously by undergrads who are actually attending Cambridge and pretty isolating to turn up when everyone else has bonded for 2 years already (Trinity is rich enough not to need that sort of moneymaking). There are a handful of formal academic exchange programs where you take a full year course (Trinity has one with Rice and one with UVA) but it would be pretty hard to have enough depth from two years at a US college to measure up to second or third year Cambridge undergrads who have just done one subject.<br><br>", "<b>Username: JenniferClint</b><br><br>I’m talking about studying abroad to “scratch the itch” not because I think it will make the OP more competitive for graduate school.<br><br>", "<b>Username: SJ2727</b><br><br>“after a few years, your Cambridge BA would be upgraded to a MA”<br>An Oxbridge MA is not an academic masters. OP would need to do an MPhil (or MSc if at another university) in economics between the BA and the PhD.<br><br>", "<b>Username: PurpleTitan</b><br><br>Fair point, @SJ2727, in that the Oxbridge MA only looks good on LinkedIn.<br>However, if the OP is aiming for a PhD in the US, they could just enter an American PhD program straight out of undergrad (and pick up a masters along the way).<br><br>", "<b>Username: SJ2727</b><br><br>Sure, but typically it would still be shorter to do the MPhil + PhD (usually 4 years total, PhD may overrun half a year or so) than the US. The difference as already noted is that it’s harder to get postgraduate funding in the UK. Anyway, bottom line is that all options will be open to OP.<br>On the internships - the City is great for these. I am unsure what the landscape will look like in a few years however with various Brexit-related moves out of the City. I’d still go for Cam over Duke, though.<br><br>", "<b>Username: Publisher</b><br><br>While I agree that international rankings should be viewed with a bit of caution, they do serve as a valuable guide to gauge prestige. And prestige is an important aspect highly valued in the worlds of finance & academia.<br><br>", "<b>Username: JenniferClint</b><br><br>@Publisher Prestige is definitely important. At the end of the day, OP is looking to do an MBA or PhD at a place like Harvard (specifically mentioned Cambridge, MA). Duke sends significantly more kids to Harvard Business School and I wouldn’t be surprised if it also sends more kids to Harvard’s econ PhD program.<br>Here is some data for the MBA:<br>https://poetsandquants.com/2011/08/15/top-feeder-colleges-to-harvard-business-school/2/<br>If someone can find similar data for the PhD, I’m sure the OP would appreciate it.<br>And as far as finance is concerned, I think Cambridge would be hard pressed to beat Duke when it comes to representation on Wall Street.<br>Just some examples of Duke graduates who have recently been promoted at Goldman:<br>https://www.bloomberg.com/news/articles/2018-09-19/goldman-is-said-to-pick-dees-as-new-investment-banking-co-chief<br>https://www.businessinsider.com/goldman-sachs-names-ashok-varadhan-sole-head-of-securities-2018-5<br>it’s definitely hard to compete against 800 years of history, but if you’re looking at graduate outcomes, Duke always holds its own.<br>https://www.dukechronicle.com/article/2018/09/duke-ties-with-harvard-and-yale-in-wall-street-journal-student-outcomes-ranking<br><br>", "<b>Username: PurpleTitan</b><br><br>Prestige matters for working in finance. Both Cambridge and Duke would have plenty enough for the US.<br>Preparation and potential matter more for a PhD program. Cambridge definitely would prepare you well. Duke would too if you want it.<br>Again, what matters most is how excited the OP is about the classes in the Cambridge econ curriculum.<br><br>", "<b>Username: cinnamon1212</b><br><br>OP when you have made your decision,  come back and let us know what it is!<br><br>", "<b>Username: Twoin18</b><br><br>@JenniferClint’s post highlighted that there are not insignificant differences in what prestige means at Cambridge compared to Duke (and I expect most other US universities, other than perhaps MIT or Caltech, though even there I suspect there’s more credit given for practical implementation compared to pure ideas). Prestige at Cambridge is almost entirely measured by intellectual benchmarks (Nobel Prizes and Fields Medals for example), not financial or career benchmarks (though they care slightly about how many prime ministers and kings attended). That’s the result of a purely academic merit based admission process, combined with a British reticence for talking about money. You see it in things like the competition to be Senior Wrangler in math (which Lee Hsien Loong probably regards as more of an achievement than becoming prime minister of Singapore). And the highest status as an undergraduate is usually achieved by being effortlessly brilliant, able to do all your work and get top marks without any noticeable effort.<br>So at a reunion no one in business would ever say where they worked, just “in the city”, whereas if they were a professor you’d get a complete career history (and perhaps a recounting of intellectual problems they’d worked on, I recall one dinner where I was told in detail by the retired fellow next to me how he solved the problem of how to predict where German submarines would be found in WW2 since it was a similar subject to my PhD). And the most boastful thing you’d ever hear at Trinity is “more Nobel Prizes than France” (sadly no longer true, if it ever was), which was and is often used in speeches by those very same Nobel Prize winners (albeit now with slightly more tongue in cheek). Another similar quote that I recall was attributed to Bertrand Russell, again recounted by one of those Nobel Prize winners was that “before I went up to Trinity I was told that I’d meet the most intelligent men in the world there. My friends and I spent the whole of our first year looking for them, and it was only in our second year that we realized we were them.”<br><br>", "<b>Username: observer12</b><br><br>I think this was mentioned briefly but one of the most important questions OP should answer is this:<br>Is OP absolutely positively committed to reading economics as the college experience?  Cambridge is very different than Duke or Yale or Princeton in that way.   It’s terrific for students absolutely committed to that study with no need to take classes beyond what you are studying.   But sometimes taking random classes that you think may interest you turns out to be the way that a college student finds their real love – something unexpected in a subject that they may not have even been introduced to in high school.<br><br>", "<b>Username: SJ2727</b><br><br>It doesn’t yield much useful information to just say “Duke is more represented at Harvard and Wall Street than Cambridge”. Of course it is, because both are in the same country, just like Cambridge would be more represented at… um… Cambridge or Oxford, (because those are the top UK schools), and the City of London than Duke would be. What would be useful would be the data we can’t get, that is, % of Duke vs Cambridge applicants made offers at top US schools or on Wall Street.<br>There is no way Cambridge is going to be a less advantageous name than Duke even in the US. And this is kind of exaggerating the impact anyway, because Harvard or or MIT or wall street firms don’t just look at the name of the school you graduated from, they look at how you performed there. Bottom line is that OP will be probably equally placed on name regardless of where he goes, and what will matter is how he performs there.<br>There are plenty Cambridge alumni happily working at really good jobs in the US, on Wall Street and off it.<br><br>", "<b>Username: Twoin18</b><br><br>“But sometimes taking random classes that you think may interest you turns out to be the way that a college student finds their real love”. Just to note that other than the limited amount of time you have available, there is absolutely no barrier to you going to any Cambridge lecture you want to for fun (though it would be very hard to persuade the college to offer you supervisions). Its just that you can’t easily change your course mid way through. The most brilliant person I know did a second degree in philosophy just out of interest (and the college paid for it).<br><br>", "<b>Username: JenniferClint</b><br><br>@SJ2727 “It doesn’t yield much useful information to just say…”. That is your opinion. I think it is highly informative.<br>The OP cares about working in the US and (possibly) attending HBS. I have provided information showing that Duke is likely to be the better choice considering his career plans. I did not say it was because Duke is a better school. It doesn’t matter if Duke is a better choice because it is located in the US or because it has a basketball coach named Krzyzewski. We’re talking about outcomes. Not the reasons why those outcomes are what they are.<br>I also never said or implied that OP couldn’t work on Wall Street after attending Cambridge. Just because X is better than Y doesn’t mean Y can’t perform adequately.<br><br>", "<b>Username: Publisher</b><br><br>Both great schools. Although I do not know for certain, I suspect that “reading economics” at Cambridge is probably a more intense experience than studying at an elite US university (other than those with a narrow focus such as Caltech).<br>Certainly, the Cambridge University experience will be more focused than studying at Duke. Whether that is good or bad depends upon the OP’s mindset at this time of his life.<br>Since Cambridge is a three year experience & $100,000 cheaper, an option would be to return to the US for a 10 month specialty master’s degree in data analytics, finance or foundations of business. If done in this fashion, then OP could enjoy the job placement benefits of both Cambridge University and of Duke University or another elite US university if wishing to forego a career in academia.<br><br>", "<b>Username: SJ2727</b><br><br>@JenniferClint<br>let me illustrate what i meant with a simple example, using hypothetical numbers, why simply comparing numbers doesn’t tell you anything informative. Let’s say…<br>200 Duke graduates apply to Wall Street, 100 get accepted.<br>20 Cambridge graduates apply to Wall Street, 18 get accepted. (Obviously far fewer Cambridge graduates will have work authorization in the US so far fewer will apply.)<br>To say “there are 100 Duke graduates on Wall Street and only 18 from Cambridge, therefore Duke is better to get a job on Wall Street” is clearly erroneous, when Duke grads have a 50% success rate but Cam ones a 90% success rate.  (and yes the numbers are hypothetical, but I trust you can figure out why I said that simply comparing absolute numbers is meaningless here.)<br><br>", "<b>Username: PurpleTitan</b><br><br>“I have provided information showing that Duke is likely to be the better choice considering his career plans.”<br>Not really. You just showed that more Dukies end up in HBS and the Street, which isn’t the same thing.<br><br>", "<b>Username: JenniferClint</b><br><br>@SJ2727 Great, now please locate the numbers showing how many Duke/Cambridge graduates applied to HBS/Goldman and how many were successful. Then post them here.<br>This is a public web forum. I certainly don’t have access to the type of data you’re requesting. If you aren’t comfortable relying on heuristics, you need to do your own digging.<br>@PurpleTitan At the end of the day, I’ve provided the OP with some concrete data. He can make his own conclusions. Notice that I used the word “likely”. I’m not saying that Duke is definitively the better option. I’m saying the data I have access to suggests that it is.<br><br>", "<b>Username: MaineLonghorn</b><br><br>MODERATOR’S NOTE:  Since this has devolved into a debate and CC is not a debating website, I am closing this thread.<br><br>"]}