{"title": "nyu tisch vs pace mt", "comments": ["<b>Username: JEBJEB</b><br><br>So guys I am down to my final decision (thankfully) and it has been a long road for all of us. I would really appreciate thoughts on these 2 schools. I see them both as great programs but very different. Biggest differences are that Pace BFA MT wants you to audition while you are there and NYU does not. NYU has a much stronger academic reputation. NYU is in a better area. Pace is up and coming and when I talked to their kids it is amazing how many have gotten national tours before they graduated, taken time-off, and then come back and still got back on track. I get the sense, but can't really explain why, that NYU is slipping in the minds of some and that Pace and others are passing it--but as a student listening to adults rate these schools there is so much jumbled information it's really hard to know. The training at Pace seems great. Since we don't have studios yet at NYU I really haven't dug deep on their training but I will visit soon--anyway--all thoughts appreciated.<br><br>", "<b>Username: fullhouse</b><br><br>For what it's worth: This is said time and time again....it really is about fit. You have to spend a short time in each place and decide which feels best for you. There is no right or wrong answer here. NYU is a very strong academic school with a world wide reputation. Pace is an up and comer. It does seem that they are flexible regarding students getting work and even encourage it. Is this a very important factor to you? If so, then Pace is probably a better fit. It appears you will have stronger academic rigor at NYU as it is not conservatory training. Is location important to you? I realize that I am merely posing more questions to you rather than answering yours but I believe this is a nuanced conclusion you must reach. Perhaps you ought to make a pro con list for yourself of each school. I visited Pace when my S auditioned. I also liked the vibe and the students seemed very happy. There were many discussions about \"working\" while in school. This made me feel that the general tone was that of a \"trade school\" rather than an academic university. That's just me. Go with your gut. It almost never fails.<br><br>", "<b>Username: BvilleLady</b><br><br>JEBJEB, I may be biased since my son is a sophomore in New Studio MT, but I wonder at your concern about NYU's reputation \"slipping\" and other NYC schools surpassing it. Really? There have been changes, certainly. NYU parted from CAP21 as their MT studio two years ago and have created their own in-house studio. It's a new venture and I suppose there have been some growing pains. Even so, it is staffed with amazing people and equally amazing young actors. It is helmed by a very impressive board. My son is thriving and is quite proud of his placement in NSB. If you receive NSB as your studio, I would be happy to introduce him to you. Just PM me. Good Luck and Best Wishes!<br><br>", "<b>Username: tutu17</b><br><br>My D is a freshman at NSB and has also questioned the level of students that Tisch has been accepting and that includes for the coming year. I am concerned myself and am wondering about NYU'S reputation going forward. She is happy with the level of instruction but quite honestly, was expecting a more experienced student body. She did visit PACE and liked it somewhat but decided NYU was the fit for her. I know people are saying that academically NYU is strong and I agree with that however, the courses for the TISCH kids are not as demanding as for the other schools. It does come down to fit and if auditioning during your first year is important then you should choose a school that allows for that.<br><br>", "<b>Username: BvilleLady</b><br><br>tutu17, I'm genuinely curious about your concerns as well--especially as you are a Tisch parent. What is it that your freshman is not satisfied with? Is she saying that her peers are not proficient? It would be helpful to learn more from an insider. Please share.<br><br>As to NYU and it's reputation in the industry, I'm quite confident the Tisch Brand will continue to be well respected in the industry. In fact, it already has proven to be an asset on my son's professional resume. I can assure you, no one is looking down their nose at NYU Tisch!<br><br>", "<b>Username: claydavisdbc</b><br><br>I'm a current Tisch student who has studied at two acting studios, and I have made it a point to study with teachers outside of NYU to gain varying perspectives on my training at Tisch. I have taken acting classes outside of the school, private voice training outside, and now I am doing a career-oriented program where I contact Tisch alums who are working in the industry (agents, managers, actors, casting directors) for their input. Their input is that Tisch Drama is definitely considered to be a great school, but it is considered now to be a Top 10 Acting school instead of a Top 5. I have heard directly from Casting directors that a Tisch undergrad diploma does not have the same pull as a CMU, Yale MFA, Michigan MT, CCM MT, etc but it doesn't look bad either. The way someone put it for me, a Tisch diploma won't get you in the door but if you have a good audition and they see Tisch Drama they will know you have been well trained.<br><br>Also, one of the biggest advantages is that Tisch Drama students take theater studies and academic courses, which gives them more depth and intellectual context than someone coming from Pace or any other conservatory program. And for me, I chose Tisch because I simply have to be around actors who are also CURIOUS about the world and who won't just be satisfied with shuffle, ball change. I think those kinds of actors often have very little going on behind the eyes and everything is performed at a surface/fake level. At one of my theater studies classes last week I was just amazed at how deep of a conversation we were having about theater and its relationship to race. I thought to myself, this is why I chose Tisch because I know that theater is not just some childhood fantasy but that it affects people and I am in a classroom with people who are so smart and aware of the fact that there is life/a world outside of the theater and that more often than not theater is influenced by that very world. Theater is an interpretation of life, and you can't interpret anything if you don't have a life. So I'm a bit concerned with programs where all you do is sing, dance, and act. You have the rest of your life to do that, to be honest, and no college BFA program will completely prepare you so that you never take a performing class again.<br><br>That being said, Tisch Drama has some particular weaknesses.<br>1. Because it is not a conservatory there are fewer contact hours in terms of professional training. Someone who is going to Carnegie Mellon BFA MT will simply be taking more \"studio\" classes than someone at Tisch. At the end of the day, some things just won't be covered in the Tisch curriculum that it will be in a conservatory program. Whether it is more dance classes, a TV/Film Audition class, Stage Combat, more in depth acting instruction, or whatever something has to go to fit in those academic classes. And there is a lot to learn to prepare ourselves for this industry. Not only will Tisch Drama students (whom have an average of 22 studi0 hours a week) have to face students who have graduated from conservatory programs with 30 studio hours a week (and in four years the gap in hrs between Tisch and conservatories is a lot), they will have to face more experienced actors who also look young and can play young.<br><br>As a result, I have found it necessary to supplement my Tisch training during the summers with summer intensives. As well as occasionally taking an audition workshop, or dance classes on Saturdays, or doing a TV/Film Acting class over winter break.<br><br>2. Tisch Drama classes are inarguably huge. The two studios I have been to have groups of 12-14. New Studio on Broadway classes I believe are capped at 18 (although I have heard of instances from my friends where they have had to go over that and have reached 22). This is in my opinion unacceptable. You cannot tell me that they will get the same amount of attention from schools like Michigan where they have only 8-10 people per group. Either students will be doing shorter scenes or they will work in class fewer times or something.<br><br>3. As a result of having approximately 60 students per class per studio, some studios do not have the same teachers teaching all the groups. So one group may have one teacher and another group may have another, and while this is good to get varying perspectives, it at times can be conflicting and make the curriculum seem not well planned out. This was the case at my first studio. Now in my second studio, we have the same teachers who teach all the groups. That being said, teaching 5 groups of 14-16 students is a lot and therefore teachers often aren't able to remember specifically what each student may or may not need to work on. They try their best and take notes, but come on.<br><br><br><br>I don't really know that much about Pace so I can't comment on it. But I've tried to be as honest as I can. Keep in mind I wouldn't trade my Tisch education for anything, and I personally would not have to Pace. My options would have been CMU, U Mich, or NYU. NYU has SO MANY advantages and opportunities that other schools do not have and I have taken advantage of these opportunities and have felt so lucky to be at NYU. I can talk more about those if you want. That being said, NYU's BFA program is different from most and as a result there can be perceived DISADVANTAGES, and you would be a fool I think to not recognize those. No school is perfect, and Tisch certainly is far from perfect. (But then again, how close to perfect is Pace?)<br><br>Now these are all my opinions, but I have gotten them from talking to teachers at Tisch, teachers outside of Tisch, casting directors who have graduated from Tisch (so it's not like they intentionally want to bad mouth Tisch. but they have to talk about the reality), agents/managers who have graduated from Tisch, actors who have graduated from Tisch who are NOT working, and actors who have graduated from Tisch who ARE working.<br><br>I also don't know much about the New Studio on Broadway, although to be honest I've heard criticism from some students that its contact hours are \"light\" especially compared to that of Atlantic Acting School or CAP21. Lets keep in mind that more studio hours = more money and CAP21 was cut to save Tisch money. I am however more familiar with CAP21 and I can tell you in terms of students with \"experience\", there are some stand outs and some really mediocre people. And why Tisch does not weed those people out is bothersome to me, when they list Tisch on their resume and give a horrible audition as well as being unprepared in terms of professional presentation, it makes us ALL look bad.<br><br>", "<b>Username: BvilleLady</b><br><br>claydavisdbc, Thanks for responding so candidly about your knowledge and experience at Tisch. It is always good to hear directly from an active student on matters good and perhaps not so good in the drama department.<br><br>I think it's really difficult to compare Tisch's multiple studios to most other college programs. Tisch is unique in offering so many options in both primary and advanced training. It's probably not really fair to even try to compare Tisch to Pace for the JEBJEB. If he is truly interested in MT, than he would likely want a comparison of Pace to NSB MT. Even so, your comments are invaluable. It's great to get an insider's point of view!<br><br>As to how Tisch is perceived in the industry, I still say no industry professional is going to look down their nose at a Tisch drama graduate. Certainly not Top Casting Director Bernie Telsey, for instance, who is on the advisory board of New Studio. Nor Tony Award Winning Directors Bartlett Sher or Michael Mayer, also on the board. Nor Richard Fisher (Abrams Artist Agency), Sutton Foster (Tony Award Winning Actress) and numerous other high profile industry professionals who are on the board as well. And there are a number of CMU alumni--who either taught at CMU or graduated from CMU--on the faculty of NSB.<br><br>", "<b>Username: JEBJEB</b><br><br>claydavisdbc--Thanks so much for your thoughtful response--It is great to hear the perspective of a current student. You say in your post that Tisch is no longer a top 5 program--now it is a top 10--can I ask why? What has happened over the last few years and why is Tisch dropping? As I stated in my post, I have heard the same thing from casting directors, college counselors who focus on this area and fellow students who travel the music theatre circuit and it really concerns me. I want the academics NYU offers but I don't want crowded acting classes or a program that many see as falling rather than rising.<br><br>Does the administration see these problems and agree they exist? Is there a plan for improvements?<br><br>", "<b>Username: BvilleLady</b><br><br>Back to Clay before I leave, I wanted to say thanks again for your input. Just speaking off thread, I understand your efforts to go outside of NYU to get further along. My son does One on One and has trained outside of school for VO. He has an agent but has stood firm on his commitment to college. He is signed across the board. His theatrical agent continues to submit him to projects, but on a very limited basis per his situation. He loves VO and has gone out of his way to train first and then cut a professional demo--not even needed by his agency--so that they would take him seriously about this avenue of work. It has paid off. It's all about working towards a career in the many and varied opportunities of the business.<br><br>I'm sorry if I'm a bit of a parental cheerleader. NYU Tisch is a great place to be, despite the challenges. It's darn good training for the real world. For the right person, which I suspect your are, it's a good place to be. Good luck and break many legs in the future!<br><br>", "<b>Username: claydavisdbc</b><br><br>That's great about your son doing VO. I'm also a One on One member, I haven't taken that many classes there but I am working outside of NYU right now towards commercial print and on-camera commercials. I think I've found a new passion (as well as source of income, not a bad thing).<br><br>Well the top 5 vs. top 10 thing is just what people have subjectively saying. Keep in mind top 10 is pretty awesome, and in the end it is your audition that matters. Even with academic majors any school in the top 10 or 25 for that matter will earn you serious consideration.<br>I think THE problem at Tisch is the administration. The old chair was forced to step down and we now have an interim chair. And the many problems of the department are I believe outside of his control. Keep in mind NYU is a tuition dependent university, and as they are planning on doubling the size of its NYC campus as well as expanding study abroad sites, all schools within NYU have been told to increase class sizes. Which is why acceptance rates have increased through NYU, and being a junior, I can tell you all studios now have larger class overall class sizes. I can also tell you news that I just found out, that Tisch will be re-adding the Strasberg studio, once again increasing the size of the drama department. I think teachers have made it clear that the large number of students is now making it difficult (sometimes people have trouble registering for department theater studies classes. My freshman year they ran out of available classes and hurriedly added some more). I have been told by someone very high up at Tisch that quite frankly, more studio hours means more money. And the university is on a spending spree, and that department budgets are being cut. Keep in mind this year there were 5 mainstage productions as opposed to around 9 last year. Another teacher of mine who is also a full time professor in another Tisch department (not Drama) also told me that the university is now taking more of our tuition money on building their study abroad sites and giving less to individual schools and departments.<br>For example, it used to be if you studied abroad your junior or senior year, your school (this being Tisch) would get 60 percent and the university's office of global programs which runs study broad would get 40 percent. This will now be flipped in the near future to 40 percent for the school and 60 percent for global programs.<br><br>Now all of these random facts probably seem really irrelevant to acting, but I feel that the administration is aware of these problems and simply cannot change them because they have quotas to meet from their higher ups. My classmates and I have personally had sit down meetings with the chair of the department, associate chair, as well as the dean of Tisch. My friend who just had a meeting with the chair of the department said he was very sympathetic and said that if things were only up to him, they would be changed immediately :/<br><br>", "<b>Username: tutu17</b><br><br>WOW, thanks so much Claydavisdbc for such an honest and helpful entry. When I posted that my D had some concerns about NSB I thought I was going to be bashed for submitting that opinion. She loves NYU and her program but is aware that it is a new program and with anything new, there are often problems that need to be ironed out. She was a bit disappointed in that the program was accepting kids with not really strong dance backgrounds which for MT you think would be a requirement near the top of the list. She is also aware that many of the top tier kids from theater programs are now applying to Michigan and CMU as their first choices and NYU might be on that list but not at the top.<br><br>That being said, I want to thank you again for all of the helpful info that you shared. I have taken some notes that I will give to my D on supplementing her studies. You also mentioned that there are many things at NYU that you have taken advantage of and I have an open ear if you are willing to share those things as well!!! Also, I could not agree with you more concerning the academic component and that was a big requirement we asked of our D. We wanted her to supplement her acting with academic courses and is why NYU was a fit for her. It is refreshing to read your really well written entry and it was so nice to find someone in this competitive area who was willing to share their experience and knowledge with others. Even more impressive is that you are sitting down with the faculty and taking the time to share your input which can only benefit the school in the long run-thanks for that! Bravo to you!<br><br>@BvilleLady-I am also aware of the strong board members but it is important to distinguish that just their presence on the board does not reflect what they may think about the program. My husband has sat on boards of programs that were a mess. Hopefully however, their knowledge and input will bring Tisch back up to the top 5 where it belongs. Fingers crossed!!!!<br><br>", "<b>Username: claydavisdbc</b><br><br>Your welcome Tutu! I got a lot of info about Tisch on this board when I was an accepted student and now I'm trying to give back.<br><br>Okay so I'm sure your D would know many of these but here is just a rough idea off the top of my head<br>1. Take advantage of going to these external Tisch studios and trying to take classes with them not through NYU. It will be cheaper and since they normally teach Tisch students they will understand where your process is.<br>2. Many NYU acting teachers teach private workshops to supplement their incomes, this is a very valuable opportunity. Not only for you to see if you want to transfer to that studio but because many of these teachers know the weaknesses of each studio. There is a summer workshop called Acrobat of the Heart that is taught by ETW's main acting teachers, I think this would be invaluable because at ETW Transfer Track they accept people from all studios so they definitely know if you come from X studio that you probably lack training in this area.<br><br>Circle in the Square also does outside workshops, acting technique and scene study.<br><br>CAP21 will soon be offering nightly classes like dance classes, audition technique/song performance, audition technique/cold reading, etc.<br><br>Atlantic Acting School offers nightly workshops in Vocal Production, Scene Study, Commercial Technique, Business of Acting, etc<br>3. Take advantage of work opportunities so that when you graduate you will have made connections for your survival jobs. I know that after I graduate, if I desperately need a survival job I have people to contact.<br>Go to the Wasserman Center and look for part time, small catering jobs, temp jobs, etc. A lot of rich people in NYC need people to help them file, organize, etc.<br><br>4. Try to intern at a casting agency or talent agency over the summer. OR make contacts with them and offer to be a reader in their auditions. ***I have heard that no audition class you ever take can teach you as much as being in a real professional Broadway audition and watching.<br><br>5. Visit New Dramatists, they often have new playwrights in residence and will guide you to which playwrights and plays need people of your type. Great for monologues and for connections<br><br>6. See shows at NYU Tisch Graduate Acting- it is considered to be the top acting program in the country if not the world, and they now have a Summer Program for Undergraduates taught by their prestigious faculty.<br><br>7. Last year we had a program called Tisch Drama Mentor- a faculty member from another studio can mentor you by giving you advice, coaching material, going over resumes/headshots, etc. The program was put on hiatus this year but maybe it will be back next year. I think its' always great to make contacts with faculty from other studios. My faculty mentor even coached me on my audition monologues for advanced studios.<br><br>8. Take advantage of office hours with the department chair and associate chair for career advice as well as curricular advice- what advanced studios to do etc.<br><br>9. I'm sure being in NSB you know this, but it's always good to make contacts with the Tisch Musical Theater Writing Department.<br><br>10. Audition for Tisch Student Films as well as Tisch Dramatic Writing staged readings.<br><br>", "<b>Username: tutu17</b><br><br>Again, I am so impressed and grateful! It sounds like you have a great head on your shoulders and I am sure you will be successful. Especially since you send out good Karma!! I always say, and truly believe that, if you do something good for others then something good will come back to you! I will pass these pearls of wisdom on to my D because i am sure she does not know some, if not most, of those suggestions! We truly appreciate all of your help and truly wish the best to you in your career!<br><br>", "<b>Username: classicalbk</b><br><br>Dear Claydavisdbc- I think all the CC readers here need to send you $50 at least for that very useful, last post! :) So many good ideas for summer. I appreciate it!<br><br>", "<b>Username: halflokum</b><br><br>I agree #12 was an excellent post thank you for detailing that info. I'm saving it.<br><br>I'd like to return to the Pace vs. Tisch question and specifically the concerns about administrative problems at Tisch. Tisch seems to be getting kicked around quite a bit on the threads this year which is a concern for anyone weighing program choices. But how do we know that other programs including Pace or others like U Mich, CMU etc. don't have their own back stories if you look under the hood? It is the Arts after all and these drama programs have to survive in a very tough economy with fewer sources of funding and higher expenses.<br><br>I agree that larger class sizes that are evident at Tisch now have an obvious downside. On the other hand, Ive often wondered how programs that talk about 6  8 students per class survive economically. That is not a lot of students to justify their economic existence within a larger university especially if some portion of those students are on scholarship.<br><br>", "<b>Username: MomCares</b><br><br>>>> Ive often wondered how programs that talk about 6  8 students per class survive economically. That is not a lot of students to justify their economic existence within a larger university especially if some portion of those students are on scholarship.<br><br>I know some schools enjoy VERY large endowments per capita. It's also worth looking at the role (if any) that prestigious alum play in supporting various theatre programs. I know that NU and I think UMich have had some very generous supporters (UMich maybe more parents rather than alum?).<br><br>", "<b>Username: fnpmom</b><br><br>To JEBJEB, There is a lot to be said for an up and coming program, they tend to try harder. It sounds like you like the opportunities available at Pace. I live in NYC and while Pace is not in Greenwich Village, it is definitely not in a bad area. There is a lot to do downtown, it is walking distance to Southstreet Seaport. Pace may not have the same sort of national reputation that NYU does but it is a very good school.<br><br>", "<b>Username: MOMMY5</b><br><br><url>http://talk.collegeconfidential.com/musical-theater-major/1116787-colleges-did-current-broadway-performers-attend.html</url><br><br>This was from 2 months ago. Pace is a fine school, and I would never knock it. But all this talk about NYU's fall from grace, is just plain silly.<br><br>", "<b>Username: soozievt</b><br><br>MOMMY5, soooooooo many of my D's fellow graduates from Tisch are working professionally in the field, including at the highest levels. And this is just among her own circle of friends, not the entire list of graduates.<br><br>", "<b>Username: halflokum</b><br><br>@tutu17 on your post: \"My D is a freshman at NSB and has also questioned the level of students that Tisch has been accepting and that includes for the coming year.\"<br><br>Isn't it a little early to question the level of students for the coming year. Nobody knows who they are yet.<br><br>The audition process itself doesnt lend itself particularly well to guaranteeing a class of the most capable and committed students. Its too quick and but a glimpse. Some with lesser qualifications, talent or passion get in and meanwhile so many others with fantastic qualifications, talent and desire to learn get rejected. I dont think this is a phenomenon that is unique to NYU/Tisch. But Tisch in comparison is a very big program and they process an awful lot of live auditions.<br><br>Maybe part of Tischs problem stems from being one of the defending champs. Its a lot of work to stay on top when everyone is chasing you. If you ask enough questions about anything regarded as good, sooner or later you will hit some negatives. By way of example, I live in city that is often listed as a highly desirable place to live in those annual magazine articles. In truth, it is beautiful here and there is much to love that I could highlight. But if you asked me enough times, Id eventually mention things like voters inability to move forward on anything without multiple referendums that in essence say the same darn thing, or the mayor and city council have pet projects that are great for special interests and terrible for the masses, or our police department is under scrutiny for excessive use of force and our sports teams never go all the way etc. All those things are true but it doesnt still change that fact that its a great place to live.<br><br>", "<b>Username: soozievt</b><br><br>I also think an audition is not foolproof as it is brief, even though other factors like the application and recs are weighed. At many programs, there is a range of talent. Some programs employ cuts. NYU/Tisch does not have cuts. My D, when she was in the MT program (which was CAP21 at the time) would comment that there were some phenomenally talented kids in the class and some that were not as talented as those kids. There was a range. The very talented ones seem to be doing quite well so far since graduation. There are many kids at Tisch who received acceptances to many other BFA programs, my D included, and so it is not as if Tisch is accepting applicants who were unable to get into any other BFA programs!<br><br>Is Tisch perfect or the best? No. Is it for everyone? No. Was it a great fit for my kid? Yes. Did she pick Tisch over several other really fine BFA in MT acceptances? Yes. Did she have an amazing experience with wonderful varied opportunities? Yes. Is she working in the field professionally since graduation day? Yes.<br><br>", "<b>Username: halflokum</b><br><br>^^^To that I'd offer. Who wants to be in a program where everyone is \"the best\" anyway? A range of talent also brings a range of personalities, experiences and interests. Perhaps the least talented person in the room works the hardest. Or throws the best parties. Or will end up being your best friend for life. It takes every kind of people (thank you Robert Palmer).<br><br>", "<b>Username: soozievt</b><br><br>Just wanna add one more thing. Yes, my kid did CAP21, not NSB. Actually she did both CAP21 and ETW studios. However, my D has some familiarity with NSB which began after she graduated college. Last year, when the program just had freshmen, she was hired as the accompanist in the Vocal Performance classes taught one semester by Sutton Foster and one semester by Michael McElroy. So, she had every freshman in the class (there were four sections of about 15 kids in each section). She thought it was incredible who these kids got to work with! (both teachers were Broadway veterans) She also musically directed Assassins which was directed by Kent Gash who is the director of NSB and so just saying she thought well of the program and observed many talented up and coming kids who are current students there.<br><br>", "<b>Username: tutu17</b><br><br>I would like to say that I spoke with my D and there are only 12 kids in her classes at NSB MT so that is a far cry from the number I heard of 18-22.<br><br>If other schools can hold classes with less then that school may have a large endowment and can not only offer smaller classes but also, scholarships. What they can't offer on a regular basis is access to NYC and all that comes with that.<br><br>I am sure there is no perfect program but it is interesting to hear what \"those in the business\" are saying about the programs out there.<br><br>", "<b>Username: tutu17</b><br><br>Ladies, I totally hear all of your points and do agree with them all! My D is not at the top of the talent pool either because as in all studios some kids might be stronger at dance, or vocal or acting. She loves her studio and NYU but she was just surprised that some students were accepted into NSB without much dance training. That is all I said. we do have to remember that what the auditions look for is potential-the end product -and not necessarily where the students are starting from. It is also the \"fit\" because I know some extremely talented kids that did not get into the program. As far as new students accepted, she happens to know a few as our high school often sends quite a few to the program. There are no complaints here and I am sorry if I upset either of you. I also agree that a good mix will produce a good class!<br><br>", "<b>Username: soozievt</b><br><br>I agree that the dance background varies among admitted students. When my D was in Tisch/CAP21, for every dance class for each year in the program, the entire grade/class was divided into four different level sections and so advanced experienced dancers were in class with the same and likewise with less experienced dancers.<br><br>You did not upset me, btw and I welcome all opinions.<br><br>I'm also glad you clarified the number of students in the classroom for your D in NSB. While claydavis' posts are good and certainly welcomed, let's remember that he is not in NSB himself.<br><br>", "<b>Username: MTandArt</b><br><br>With regards to the question of the level of students that Tisch is accepting: I would add that another NSB student might look around at his/her classmates and be surprised that, although so-and-so is a terrific dancer she cant quite belt out that note. Or that this other kid has an amazing voice but he wasnt believable in his dramatic monologue. But isnt that the whole point of why they are there? To learn and to improve on whatever skill that is not their strength  whether it be singing or dancing or acting?<br><br>", "<b>Username: soozievt</b><br><br>I think with dance in particular, at most programs, there is a wide range of skill and experience. When my D applied to BOCO, she and I observed a dance class. At the time, I was a bit stunned that some of the students were quite beginnerish in their skills compared to what my D was used to in her dance studio back home. So, I don't think this is unique at Tisch.<br><br>In my opinion, voice and acting are more important than dance. I am not diminishing dance and after all, my own kid grew up taking LOTS and LOTS of dance and was advanced in that area. But almost every MT job requires a great voice and acting chops and not every audition requires a dancer. Ensemble and chorus often requires strong dance skills.<br><br>My D is out of college. While she grew up dancing, she will never be a chorus girl, she says. She is 5'3\". She has worked in music and theater since graduation day but has done MUCH less with dance than singing and acting.<br><br>", "<b>Username: beenthereMTdad</b><br><br>^^^^Boca has changed tremendously when it comes to dance since 2005. Very few if any \"beginners\" have been admitted since 2007. And the beginners or intermediates now need to demonstrate natural ability. Not sure when Michelle Chasse was put in charge of MT dance (I believe 2006) but, she really impacted the place. In fact, she has a major say in who is the be admitted.<br><br>I also have to disagree with the importance you place on acting in a musical theater production. In my humble opinion, dance is more important as evidenced by the amount of casting calls of singers who can dance and dancers who can sing. Never seen a casting call for singers who can act yet. Acting in a drama absolutely. Being able to act in a serious musical agreed, but not in the vast majority of roles. Even Mary Poppins has to dance.<br><br>", "<b>Username: soozievt</b><br><br>BeenthereMTdad....<br><br>Michelle Chasse was at BOCO when my D visited and in fact, it was HER class that we observed and she chatted with us. However, as you know, now BOCO requires dance at the admissions audition. I'm just saying that at many well regarded MT programs, there is a range of dance abilities, and some are admitted who have been advanced dancers and some with minimal dance experience, even at BOCO and even since my D applied to college (I know a LOT of kids in this field.....I advise many applicants and in fact, have had students admitted to programs, including BOCO in the last couple of years, who had just a tiny bit of dance training, not much).<br><br><br>Re professional theater....<br>Yes, OPEN CALLS do require either singers who dance or dancers who sing. My kid doesn't attend open calls, not even the Equity Chorus Calls. For many EPA notices for ROLES, NOT ENSEMBLE, you have to be able to sing and act. For some shows, roles include dancing ability and for some, not. Yes, for many ensembles, you have to be able to dance. For roles, you have to be able to dance for some roles or shows and not for others. And for roles, you MUST be able to sing AND act.<br><br>", "<b>Username: halflokum</b><br><br>I for one can barely sit through a musical when the lead sings extremely well but has absolutely no ability to connect to the material because they cant act. I can go to concerts for that. On the other hand I have no problem forgiving Richard Burton, Richard Harris, Christopher Plummer and many others for their musical forays because they could make me believe the character I was watching and the story they were telling. In fact, sometimes I failed to even notice that they couldnt sing nor dance.<br><br>Thanks for the clarification on the class size at NSB tutu17. Good to know. Also, in case youre referring to me, Im not at all upset with you either and appreciate your chiming in. We are in decision mode so Im reading things pretty closely, questioning what Im unsure of and trying to understand the context of the comments. Thanks for posting!<br><br>", "<b>Username: soozievt</b><br><br>halflokum, agree with you that in musical theater, the importance for those playing roles, in particular, to be able to act. They have to be believable, not just have a great voice. That is what makes it different than merely a concert.<br><br>I think it is important to be able to sing, act, AND dance well. But I think in the general scheme of things, and for roles, more than maybe a chorus, being able to sing and act will be more important than dance skill. Some shows don't even have a lot of dance. I'm not discounting dance, and particularly if you want to be in the chorus. But being able to sing and act are most important for many roles. Being a triple threat is ideal of course. I say this even with a kid who grew up dancing.<br><br>For many EPAs, you must sing and act before dance. For ECC, you can audition as a singer who dances or a dancer who sings. But for roles, the audition tends to first focus on singing, then acting, then dance in many cases, if dance is involved at all.<br><br>", "<b>Username: halflokum</b><br><br>And now I will show my ignorance: What do EPA and ECC stand for? :)<br><br>", "<b>Username: soozievt</b><br><br>EPA stands for Equity Principal Audition and ECC stands for Equity Chorus Call. These are open calls but just for those who are Equity (my daughter is Equity). My D rarely attends as she doesn't feel they are that worthwhile and she is too busy, but will go on auditions via an agent (which is an appointment, not an open call).<br><br>Anyway, an EPA is for roles. An ECC call is for ensemble/chorus.....and it is either a dance or a singing call. An EPA usually requires one to sing and act and then maybe dance at a callback if the role requires dance (not all roles involve dance).<br><br>", "<b>Username: alwaysamom</b><br><br>halflokum,<br><br>EPA are Equity Principal Auditions and ECC are Equity Chorus Calls. :)<br>\"\"I for one can barely sit through a musical when the lead sings extremely well but has absolutely no ability to connect to the material because they cant act\"\"<br><br>Agreed. It's those kind of 'schmacty' performances that give MT a bad name, in my opinion. If one is unable to act the song, the chances of being cast are slim. I can think of lots of very successful MT stage actors who are not topnotch dancers but very few who are not good actors. Like Susan, I am not discounting the importance of dance training but there are so many musicals these days that do not call for extensive dance for the named roles, this shouldn't come as a surprise.<br><br>Edited to add: Oops, Susan beat me to the punch. :)<br><br>", "<b>Username: halflokum</b><br><br>Thank you both for clarifying. Much to learn!<br><br>", "<b>Username: beenthereMTdad</b><br><br>SoosieVT.<br><br>I know the difference between the EPA and EPC and what a role is. My daughter has representation and is an active member of SAG/AFTRA/AEA and goes to EPA's all the time. And yes she has to read for the part, sing for the part and dance for the part. She was recently called in for the lead role for Newsies and she was told by Telsey to bring 4 different types of dance shoes. As for as ROLES go, so few people actually go from UNKNOWN to ROLES. I would think the vast majority of people reading this website are not planning on going straight to stardom.<br><br>As far as boco dance admissions go, maybe Michelle was at Boco then but she probably was not in charge. Certainly not the important role she has since 2007. If you read my post carefully I said clearly that the applicant needs to DEMONSTRATE ABILITY. Something I would leave to Michelle to judge. Having minimal dance experience will definitely hinder your chances for acceptance at Boco where their focus is turning out triple threats.<br><br>", "<b>Username: MomCares</b><br><br>>> As for as ROLES go, so few people actually go from UNKNOWN to ROLES. I would think the vast majority of people reading this website are not planning on going straight to stardom.<br><br><br>There are many talented people who absolutely have the potential to get Broadway roles who will never be suited to typical dancing ensemble stints.<br><br>There is also such a thing as being too \"dancery\" to ever be cast in many roles.<br><br>It's a big world - with plenty of places for singers who move! ;-)<br><br>", "<b>Username: beenthereMTdad</b><br><br>I am not distinguishing the difference between ROLES and ensemble. I'm saying to have a successful career it is betters your chances to be a dancer rather then an actor especially in musical theater.<br><br>", "<b>Username: MomCares</b><br><br>Of course if you are AMAZING at everything that's optimal (as long as you can ditch your inner-dancer and make yourself seem as natural as Sutton Foster which is RARE!), but I find it far easier to think of strong singer/actors making solid MT careers than stronger dancers (aside from ensemble folks). Is there even a Gwen Verdon equivalent today?<br><br>I actually consider that a good thing, as there are so many talented performers who weren't born with dancer's bodies... and so many amazing characters to be played who would not be at all dancerish, either in look, age or style.<br><br>Also, there is a growing trend toward MT singer/actors finding work in film and TV.<br><br>If I were a young performer I'd shoot for singer/actor foremost unless I was a born dancer.<br><br>", "<b>Username: soozievt</b><br><br>beenthereMTDad, of course you know the difference between an EPA and an ECC! I know that. I was making a point that in many EPAs or agent submitted auditions for PARTS, NOT CHORUS, voice and acting are paramount and sometimes dance is also important. You had mentioned that acting was not a big part of auditions and my point is that is true for ECCs for singers who dance or dancers who sing but not for PARTS.<br><br>You mention going straight to \"stardom,\" and how that is unlikely. Yes, it is unlikely to become a star. For my kid, her goal is not to be a star. Further, her goal is not narrowly defined by making it to Broadway. She feels she is highly unlikely to be cast in a chorus, particularly a dancing chorus, given her height and type. She tends to audition for parts. While she grew up dancing, she considers herself a singer/actor first and foremost. And I know a bunch of her peers who have been cast in parts on tours, Broadway, off Broadway and major regional theaters and not ensemble in the early years post college graduation. Not everyone goes to ensemble first, and not everyone is suited to be a chorus girl or boy. It has nothing to do with stardom and more to do with type. Even your daughter was considered for a part on Broadway recently (in Newsies) and I don't think she has been in a Broadway chorus yet! Actually, the daughter of a CCer from this forum is currently temporarily playing the standby for that part on Broadway! Before this, she was understudy for a lead on a National Tour, and has only been out of school less than a year.<br><br>", "<b>Username: soozievt</b><br><br>\"\"I am not distinguishing the difference between ROLES and ensemble. I'm saying to have a successful career it is betters your chances to be a dancer rather then an actor especially in musical theater.\"\"<br><br>Yes, if you are a dancer there are lots of ensembles for casting!<br><br>But if you hope to ever be cast in a PART, you better be able to act!<br><br>Also, if you can act, you can be cast in plays or on screen, etc. as well as in musicals.<br><br>If you sing very well, you can be in concerts or on recordings, or go into pop/rock too.<br><br>", "<b>Username: beenthereMTdad</b><br><br>The funny part of all this is we are experiencing the total opposite. My daughter is 5'9\" and too tall for the ensemble. If not for her being so tall she would have been a Broadway veteran by now. She is too tall for the romantic lead so far as well (amazed at how many men on Broadway are vertically challenged). Yet the casting people keep calling her back over and over again. Most of her success has come in form of TV and radio.<br><br>", "<b>Username: MomCares</b><br><br>Not perfectly relevant, but Sutton Foster is over 5' 9\". ;-D<br><br>", "<b>Username: halflokum</b><br><br>Now that my rookie-parent pants have been scared off of me perhaps I've just saved tens (hundreds) of thousands of dollars in college tuition as I fold up the tent...<br><br>Im over my head to even comment and I dont know what it is I dont know about working in the theatre world. However, one cannot live backwards. My 58 acting/singing daughter who has had 'some' dance training who moves well and picks up choreography very quickly will never be able to make up the years of formal focused dance training that many have had. Up until now, it has been the area of training that was often triaged in favor of academics followed by acting and singing. But she must have faked her dancing well enough because she got into a number of fine MT programs.<br><br>How do you embed quotes in this CC program? Wish I knew.<br><br>beenthereMTdad your comment:<br>>>>I would think the vast majority of people reading this website are not planning on going straight to stardom.<br><br>Does anyone enter a college program with a strategy to focus their training in a direction that guarantees them work in the chorus? Most of the theatre/MT kids Ive seen are hoping for featured roles on major stages (or their directorial, song writing, stagecraft, script writing etc. equivalent) and trying to do what it takes to get there which includes making choices about what/where they study. So while not planning on stardom, they are certainly hoping for it. The smart ones are also mindful of the odds so that they set reasonable goals and have a broad definition of what success means to them.<br><br>", "<b>Username: alwaysamom</b><br><br>There are many 5'9 women who are working/have worked on stage on Broadway, off-Broadway, regionally, national tours. halflokum, don't worry about your 5'8 daughter. :)<br><br>", "<b>Username: halflokum</b><br><br>^^^Worrying about my kids would happen no matter how tall they are or what field they were entering but thank you so much for the encouragement :). Honestly I'm not in the mindset yet to think about too much about \"career\" but when it comes up it give me a bit of a (YIKES!!!). Then again, I didn't understand the college audition process at the beginning either and managed to sort it out. At the moment, the focus is picking the right college program which is a nice problem to have after all of the worry and work that went into chasing the options in the first place. This thread is about Pace vs. Tisch. My daughter did not apply to Pace so I don't know much about it but from everything that I've read, anyone looking at those two choices or just one of them should be doing the happy dance.<br><br>", "<b>Username: soozievt</b><br><br>Frankly, I would not want my kid to attend a program set on training them for the chorus. A program strong in acting is important to my kid and many others.<br><br>Halflokum, your D is doing the \"happy dance\" (she can dance, yeah)....for good reason.<br><br>I never knew that 5'9\" was too tall for a dancing ensemble. I think for a dancing chorus, it would be better to be tall than to be on the shorter side like my kid at 5'3\". In any case, I think many looks and shapes and sizes are needed in casting.<br><br>beenthereMTdad, if your D is having success in TV and radio, it's a great thing she can act!<br><br>", "<b>Username: soozievt</b><br><br>Some Broadway actresses who are on the tall side:<br><br>Linda Eder 5' 10.5\"<br>Katie Finneran 6' 0\"<br>Sutton Foster 5' 9.75\"<br>Heather Headley 5' 8.5\"<br>Dee Hoty 5' 9\"<br>Christine Ebersole 5' 10\"<br><br><br>Of course, a list of shorter Bdway actresses could be made easily too.<br><br>", "<b>Username: tutu17</b><br><br>Thanks soozievt for clearing up the dance issue for me. I will pass the info on to my D. All said, even being a new studio with start up problems my D loves NYU and would not be happy anywhere else. And yes, to clarify, she only has 12 students in her class at NSB and I think that is phenomenal. She just called home asking for advice with her academic classes and they sounded so interesting that I want to re enroll in college at NYU!<br><br>", "<b>Username: soozievt</b><br><br>tutu....it's great that you have shared DIRECT information from your D who is actually in the NSB studio program as to class size.<br><br>One thing on the MT Forum that I see time and time again, is a misconception that a large BFA program such as Tisch (or BOCO, etc.) will mean less individual attention, and so on. But the CLASS SIZES at Tisch in the CLASSROOM are similar to small programs. As a former teacher myself, the classroom size is what matters when it comes to being able to provide individual attention.<br><br>", "<b>Username: MomCares</b><br><br>To be fair, there is a difference if a teacher only sees ONE group of 20 students for a year, versus having 7-8 groups of 12. (note that my kid had no interest in being in a small program as she wanted more contact with a variety of students AND professors).<br><br>It's also worth mentioning that back in the day when I attended a conservatory, many teachers flew between coasts to teach, so although my program was very small, those same teachers had MANY students outside the conservatory. I assume this is true at many small MT programs, as the small number of students probably aren't funding full-time salaries for many teachers.<br><br>", "<b>Username: soozievt</b><br><br>It's true that a teacher may teach four sections of 12 students and not just one section.<br><br>College selection is about fit and my kid liked having contact with a variety of students (not the same 12 in every class for four years) and to learn from a variety of professors over four years as opposed to just a few which small departments tend to have. But this is something one should weigh when choosing amongst programs. The class size IN CLASS is not what is so different between different size programs but is this other stuff. Another difference is a wide variety of performance opportunities in a larger program rather than just a few shows per year.<br><br>", "<b>Username: beenthereMTdad</b><br><br>I think I am being misunderstood here. I try to post my opinion based on the masses and not necessarily based on my own daughter or anyones personal situation. I try to look at not the exception (which there are always many), but the rule. The reality is thousands enter MT programs every year. Out of the thousands that graduate, hundreds wind up with representation. Out of the hundreds of graduates, how many do your think land a job (yes and even an ensemble job) on either Broadway or a Broadway national tour? And to take this a step further how many do you think land A ROLE on Broadway.<br><br>Here is a challenge for everyone. Find a list of people straight out from school who land a ROLE on Broadway. My money says the over/under is 10. YES TEN.<br><br>Some of my personal experiences come from the trials and tribulations of my daughters MT career. Personally, her agents only want her trying out for ROLES or ensemble for Broadway and Broadway national tours. Only because that is where the money is besides TV, radio and film and its a business.<br><br>Regarding being tall, 59 for my daughter has been a problem for Broadway in general. No director wants anyone in the ensemble to stick out. This is not to say it is possible. Being tall (for as girl) is usually leading lady material providing the male lead is also tall.<br><br>SoosieVT<br><br>Look at the ages of the leading ladies you chose to mention by height. I think we are talking about kids right out of MT programs not established stars. These talented ladies are the exception not the rule.<br><br>Sutton Foster  37<br>Katie Finneran  42<br>Linda Eder  51<br>Heather Headley  37<br>Dee Hoty  60<br>Christine Ebersole  59<br><br>", "<b>Username: SDonCC</b><br><br>Getting back to class size: while my D is not in MT, I can attest to the fact that even though the teachers may have more than one group of students at Tisch they really get to know these students well! And care about them. It is not an impersonal, anonymous experience by any means. It is true that students form much more of a close-knit relationship with the studio than with the Tisch School as a whole, although there are plenty of opportunities to get to know students from other studios and to work with them.<br><br>The bigger size of Tisch overall, and multiple groups within a studio has its pluses and minuses. I would imagine that at the smaller conservatories, students move through with the same group. This can be a good thing and a bad thing, a bad thing if there are people that you don't like being with, and essentially living with, for four years.<br><br>At Tisch, the groups within at least some of the studios get mixed up in different semesters. I know that at both my D's studio (Playwrights) and at NSB, the groups that were together for all of freshman year were mixed up this year. As a sophomore, my D was in one group in the fall, and a different one this spring. If a group really has a great chemistry together, it can be tough to break this up, but it also forces the students to explore artistically and take risks even when not in familiar territory.<br><br>I should say that at least for my D, there were quite a few people who have remained in her group consistently since the beginning / or more than one semester, so it has been a really nice blend for her of retaining personal familiarity and building new relationships within the classroom.<br><br>I think that at NSB, there are further breakdowns and mixing up of people for particular classes (but someone else can address that more accurately than me.).<br><br>", "<b>Username: soozievt</b><br><br>SDonCC, I agree that the professors in studio get to know the students very well. My D is still in touch with some. And both during college and after graduating, she has worked in professional capacities with several of these faculty members.<br><br>beenthereMTDad, the thing is, I think it is important for students reading this forum who are entering college to understand realistic goals and also what \"success\" may mean in this field. I run into many MT hopefuls in my work as a college counselor and many say, \"I want to be on Broadway.\" I am all for dreaming big of course. But very very few will ever be on Broadway. If someone is entering a college program with that hope in the forefront of their mind, there are gonna be a lot of disappointed people. For my own kid, of course being on Broadway would be amazing (how could it not be?) but that truly is not a goal she ever talks about. What she thinks (and I concur) is that success is working in her field in a professional capacity and getting paid to do it and making her living from doing it and immersing her entire life in performing arts (every job she has is in music and theater and has been from the get go). If success is looked at in that fashion, many of her peers from her college program are doing it. And yes, quite a number have been on Broadway and on tours in roles, but obviously they are not the majority. But for me, when we talk about work after graduating, it is not nearly defined by Broadway.<br><br>I understand your point about going where the money is but for my kid, as long as she can support herself, she cares more about the artistic work than finding the best paying gigs. For example, she has the opportunity next month to perform at the Sydney Opera House in Australia, all expenses paid, plus a small salary, but besides the amazing trip and venue, gets to work with some movers and shakers in theater and music. It is not all about the pay as long as she can pay her bills.<br><br>", "<b>Username: beenthereMTdad</b><br><br>Well we both agree about one thing.....sustaining oneself in the profession by any means possible is success!<br><br>", "<b>Username: tutu17</b><br><br>Well said halflokum-I like the idea of owning what success means to them! I too am a \"newbie\" at all of this since my D is just a freshman in NSB. I have little experience compared to the other entries on here and love reading them all! Each kid has to recognize their strengths and weaknesses and those, coupled with that child's idea of \"success\" is what will guide them to certain roles, chorus, etc. In the end, It all comes down to making yourself a well rounded performer and then a bunch of luck!. Too many are seeing the instant fame of GAGA or some of the Disney type actor/singers and think that they can do that too. Just drop out and become famous! YIKES!!!!<br><br>Anyway, good luck with all of your decisions! I remember how hard that all was but your D must be a good little actor/singer to have been accepted into so many schools. My D is loving the NSB/MT track and I hope your D loves whatever or wherever she chooses to attend!<br>@momcares-<br>For the record, being too \"dancery\" would most likely mean that the dancer was probably a ballerina and not someone who was well versed in many disciplines of dance. In my experience, most ballet students don't go into MT but the ones who have studied tap, jazz, ballet etc, usually know how to adjust on stage since dancing to a song is not much different than playing a part. You have to understand the song and match the dance moves, expressions, and mood to the music-i think it is what truly makes someone a triple threat<br><br>", "<b>Username: tutu17</b><br><br>Soozievt yes, at NSB the kids are separated by level at least in dance i know this to be true....<br><br>"]}