{"title": "caltech vs jhu bme vs georgiatech", "comments": ["<b>Username: judgegregg</b><br><br>My son got admitted into CalTech, GeorgiaTech, JHU BME.<br>He is fixated with pursuing undergrad in BME.<br>Given CalTech’s reputation, unique environment and rigor it’s very hard to pass it up. However, it appears BME is not that much popular in Caltech.<br>JHU BME is the oldest and most well reputed. However, other engineering majors are not that highly ranked in the event he changes his mind and pursues a major other than BME<br>Georgia Tech is uniquely positioned where all the majors are top ranked. BME is 3rd or 4th<br>However, Georgia Tech is a public school with all its limitations<br>I am sure some of you were in the same spot as us before. Would appreciate the guidance and insights<br>Thanks<br><br>", "<b>Username: damon30</b><br><br>Those are all great schools, I don’t think you can make a wrong choice.  Caltech has a well-regarded BME program: http://www.be.caltech.edu/ugrad/index.html<br><br>", "<b>Username: judgegregg</b><br><br>We don’t have have the pulse of how well the Caltech’s BME program excels in areas like labs, research opportunities, industry collaboration, and innovation. Certainly, the other two appears to have presence in these areas<br><br>", "<b>Username: Ghostt</b><br><br>Online rankings of specific university majors/departments are far more volatile than students’ intended majors and usually change for far stupider reasons.<br>What I’m saying is, if you’re choosing between Caltech and JHU based on how their BME majors are ranked on some clickbait website, you’re looking at the wrong things.<br>Has your son visited? Has he had the chance to talk to current students and faculty? Does he like the location and campus vibe of one of these schools more like the others’? He should go where he can see himself learning and living most happily.<br><br>", "<b>Username: judgegregg</b><br><br>point well taken. Yes, he is planning to visit. looking to garner as much info as possible to make the visits more effective<br><br>", "<b>Username: Eeyore123</b><br><br>CalTech’s undergraduate population is so small that major rankings are useless.<br><br>", "<b>Username: Coloradomama</b><br><br>I don’t think there are limitations at GaTech for BME.  In fact, arguably advantages in some of the top mechanical design related BME labs and joint BME research with Emory Medical school.  Shuttle buses go between the two schools, about 4 miles apart.  GaTech offers a really nice campus, with better recreational facilities, than the other two, the full Olympic pool from the 1996 Olympics is well maintained and now a fantastic Rec Center built around it on GaTech campus.   GaTech has some of the top BME study abroad  programs in China and Ireland, taught in English in both countries-<br>https://bme.gatech.edu/bme/undergrad-study-abroad<br>Gatech Medical Robotics is very strong-<br>http://www.medicalrobotics.gatech.edu<br>I think the difficulty   intensity at Caltech is more than most students are ready for,<br>but have your son ask questions and assess his readiness.  Caltech starts way beyond the normal AP preparation and assumes the high school student has had access to higher mathematics. beyond AP Calculus BC, so Calculus 3, linear algebra, and even knowledge of differential equations will be useful to a Caltech freshman.<br>The math at Caltech starts out with Analysis, so<br>they are assuming the student finished Calculus 3, and really understands calculus.   All Caltech students must<br>take a year of physics, math, chemistry and biology required for any degree.  Physics will assume calculus and both mechanics and E&M knowledge.<br>GaTech is geared for a bright student who has one year of Calculus, and mastered it, plus an introduction to physics and chemistry in high school.   Its more or less the follow on to a regular AP or IB high school curriculum.<br>GaTech is a more fun loving college experience, lots of spirit, some Greek life , Division 1 sports,<br>and a good social life with more regular students, but still very rigorous for a BME degree with more on campus research given GaTech’s collaboration with Emory U.  JHU is similar in that respect, with the Medical school connection.<br>Caltech offers bioengineering, thats focused more on materials science (tissue engineering) bioimaging,  and systems biology<br>http://www.be.caltech.edu<br>Thats not the same focus  as GaTech’s BME degree.  So consider what focus is of interest.<br><br>", "<b>Username: RichInPitt</b><br><br>“However, Georgia Tech is a public school with all its limitations”<br>I’m curious what limitations you believe are inherent in a “public school”.<br>All of your pros/cons seem to be based on reputation and ranking.  Have you visited any of them to understand the actual quality of education and match to individual needs?  College selection should not be a paper exercise.<br><br>", "<b>Username: judgegregg</b><br><br>My comment around limitations is around demographics of student base. Caltech Preeth much have all Uber merit students of same caliber whereas gatech would have a mix of students given it needs to cater to in state students.  Honestly, I am not sure if it’s bad ar all. My son is a product of public school too!<br><br>", "<b>Username: LlamaMD</b><br><br>Interesting discussion.My son is in somewhat similar position too -choosing between JHU and Gtech and UMD ( where he has free ride).JHU and UMD are local for us.However BME I feel is a major that needs a setting where application of what is being taught in real life settings is possible.UMD is great but not so well known for its Bio engineering program compared to JHU or Gtech. JHU is very good but what I know is that around Baltimore area there aren’t that many industries.Ofcourse Hopkins has great labs and research opportunities.I myself studied and worked there.I do strongly feel that G tech gives good value for the money.We have visited it and liked it.The environment seems collaborative.My son went to an OK public school and did very well.I don’t think Gtech has limitations with the demographics.They are quite selective in their admissions and their rigor is high too.<br>Ofcourse ultimately the student needs to make the best of what is offered to him/her.<br>Good luck!<br><br>", "<b>Username: wowbears</b><br><br>When you consider Georgia Tech, please remember its a “public-private partnership between Emory University and Georgia Tech”.<br><br>", "<b>Username: emorynavy</b><br><br>@wowbears that’s only fir the graduate program, not undergrad.<br><br>", "<b>Username: wowbears</b><br><br>@emorynavy thanks<br><br>", "<b>Username: ilovebillyjoel</b><br><br>@judgegregg  “gatech would have a mix of students given it needs to cater to in state students”.<br>Really? GT is such a reach school for in-state students.<br>But then it is a public school, so not as good as CalTech and JHU…<br><br>", "<b>Username: Greymeer</b><br><br>The admit rate for GT instate was 37% this year.<br><br>", "<b>Username: blueskies2day</b><br><br>Congrats on some great choices. You are unlikely to have your questions answered until you visit and see each of the schools/programs in action. We had one accepted to Cal Tech but chose elsewhere after visiting. The environment was much too small for what he was looking for, but others may prefer that. When we took the engineering tour at different schools there was a clear winner for him. You are wise to consider that he may change his engineering focus when he gets there, so it is good to be happy with the engineering program/school overall. They are very different schools and if you are able to visit, that will make a big difference and provide ease in your decision process.<br><br>", "<b>Username: KeepItFair</b><br><br>I agree with blueskies2day - visit all of the schools before making a decision.<br>However, the harsh reality in today’s job market (ok, in any generation’s job market), prestige matters.<br>JHU and CalTech are ranked up there with the Ivies and certain corporations will only hire from what they consider “elite” universities.  In addition, let’s say your son doesn’t want to do BME after exploring that field.  Google, Goldman, Mckinsey would be happy to talk to him if he goes to JHU or CalTech.  It would be possible from G-Tech, but harder for sure.  Call these firms snobs if you want, but it’s their money.<br><br>", "<b>Username: eyemgh</b><br><br><br>\"\"<br>@KeepItFair said: However, the harsh reality in today’s job market (ok, in any generation’s job market), prestige matters.<br>\"\"<br><br>If you have a citation for this as it relates to engineering, please provide it.<br>The reality is, companies MAY have pet schools, and they frequently, for engineering at least, are not the usual suspects. Grades and internships/coops also matter. A marginal Caltech student will not have the opportunities that a student with a high GPA and good work or research experience from San Diego State will have. The name will not buy success.<br><br>", "<b>Username: retiredfarmer</b><br><br>Do not confuse Biomedical Engineering with the related, but different Caltech majors.  Dig into the majors and the career/grad school directions.<br>By reputation, JHU just about invented the BME field.  Consider asking more “what if” questions about the major content, flexibility and the range of  your own interests.<br>Stating the obvious, the academics are very solid at all institutions.  The reputations of these opportunities are not going to hold you back.  Pick the program that fits.<br><br>", "<b>Username: retiredfarmer</b><br><br>As fields mature they produce offspring, but not all siblings are the same.<br>As new fields develop, they split off from the more established departments. Physics gave birth to EE, and EE had to fight for it.  ME is responsible for a lot of the development in BM, but so are ChE, EE and the life sciences. As these field continue to develop, the interdisciplinary nature of BME becomes more complex and apparent. Sometimes the parents don’t like to see the children leave home. They don’t like the loss of control of their offspring and they don’t like the competition for resources within the institution. This result is the fruit of academic politics, but programs do differ. This is another step in the ongoing evolution of engineering/science.<br>Learn about the siblings.  I believe JHU covers the interdisciplinary range of BME.  I am not sure here, but I believe GT is more into the robotics side of BME.  Check with GT.<br><br>", "<b>Username: privatebanker</b><br><br>I would have to think this field is enhanced working in such close proximity to one of the world’s foremost medical research universities.<br>And the other types classes you could take there would be outstanding.<br>They are all sensational.  But the birthplace of BME and the access to cutting edge medicine.  Tough to beat imho.<br><br>", "<b>Username: Jleto18</b><br><br>@Greymeer I’d still say GT is a reach for even highly qualified in-state applicants (unless you’re Val or Sal). I know some extremely intelligent students in the Top 1% score ranges for testing and ranking in their classes that didn’t make it in. I thought GT was a match for me (34, Top 3% class, 3.9 UW) until I got deferred EA as well as some of my very qualified classmates. It’s brutal even in-state, and I would consider it a reach for pretty much all in-state students unless you’re a Val or Sal at one of the approved schools.<br><br>", "<b>Username: Coloradomama</b><br><br>I have a son at GaTech, junior if anyone has questions on that school.  Familiar with Baltimore and Atlanta and both<br>student bodies<br>GaTech by state law accepts over 50% Georgia students.  All valedictorians in Georgia get automatically accepted at GaTech IF their high school meets some criteria set by the Georgia Legislature.<br>GaTech is more fun loving student body, and less intense workload  than JHU.   Gatech has an excellent collaboration with Emory and a shuttle bus for BME students who want to work with medical doctors.<br>I would choose GaTech over JHU for the social aspects of undergraduate education.<br>Remember a BME undergrad  is going to either get a PhD or go to medical school, so getting plenty more education at least four more years of med school or six more years of research and classes for a PhD.<br>The rank difference is not that big between JHU and GaTech.  GaTech is arguably better for the design aspects of BME, the mechanical engineering side of BME.<br>Systems biology, maybe a bit better at JHU, if you are looking for research work.  GaTech is particularly good at imaging sciences, tissue research, see their materials science and chemical engineering department, and of course anything related to design is superb at GaTech.<br>Engineering overall is better at GaTech compared to JHU if thats your bent as well.<br>Caltech is in a class by itself, with mathematics thats way more advanced, so a student needs to have mastered Calculus 3, and even part of differential equations to be able to earn Bs at Caltech in freshman math.  It starts with Analysis.  Caltech freshman have typically passed a college level physics class and that is assumed knowledge to start beginning required physics at Caltech, required for every major there.<br>GaTech, if you score a 7/7 on IB Physics, you can place out of freshman physics, if you want to and take a more advanced physics class, or repeat as you see fit.  Physics is not the hardest class you will take at GaTech,probably, if you are taking freshman physics.<br>JHU and GaTech are not as challenging (ball busting???)  as Caltech in physics and mathematics.<br><br>", "<b>Username: UMD2021_2023</b><br><br>@judgegregg My D was in the exact same position as your son 2 years ago when she had to decide where to study BME.  She went to visit all 3 schools ( and a few others) and made a list about what she liked about them and where she could see herself over the next 4 years.  She ultimately ended up choosing University of Maryland since they had given her a full ride and she knew she wanted to continue her studies in grad school when she finished undergrad and didn’t want a huge amount of debt.  Each of the 3 programs are very strong and each campus has their strengths. Your son should try to choose where he feels will be the best fit for him not only academically but socially too.  When your son visits I suggest he also tries to sit in on a class or 2 to see what the academics are like.<br><br>", "<b>Username: Coloradomama</b><br><br>@KeepItFair Goldman Sachs comes to GaTech for the Hackathon, presents a problem to GaTech students and<br>hires students who solve it.   GaTech has a very strong business analytics program and GaTech math, CS, and engineering students are in huge demand for west coast management consulting and Goldman Sachs type jobs.<br>FINRA also comes to Hack GT and offers many jobs to GAtech grads.  I would say the students are recruited more<br>than JHU by far.<br>Caltech is Caltech. Cannot touch it. But remember its only 600 undergrads.  Those kiddos almost all get PhDs.<br>Caltech is a school of geniuses and a few drop outs and a few that commit suicide as they cannot keep up.<br>GaTech is a regular school with great social life and amazing job options in business.  Regular Division 1 football<br>games, regular fraternities and sororities.  Hard but not ball busting classes, but still a very good reputation in the northeast and west coast.<br>See HackGT.  Many west coast firms here are offering GATech and other students hard problems to solve<br>and recruiting them-<br>https://hack.gt<br>See GaTech Scheller College of Business<br>https://www.scheller.gatech.edu/index.html<br>also Tech Square in Atlanta is loaded with start ups.   Better than Baltimore for jobs by far.<br><br>", "<b>Username: eyemgh</b><br><br>“Caltech is Caltech. Cannot touch it. But remember its only 600 undergrads. Those kiddos almost all get PhDs.<br>Caltech is a school of geniuses and a few drop outs and a few that commit suicide as they cannot keep up.”<br>This does not mean they will all be good engineers. In fact, when my son was looking, one of my patients (the manager of one of NASA’s most famous programs, dual PhD in Physics and Math, and Caltech prof) told me that some of the Caltech engineers he hired for that program were pretty pedestrian and that some of his best engineers were from Podunk U. Just because they teach brutally fast does not mean they are good at teaching students the art of solving practical engineering problems. Two retired Caltech profs told him that if his goal was to be a practicing engineer, not to consider Caltech.<br>Looking at JPLs Executive Council members with tech rolls (non-HR, etc.), none were educated at Caltech. Their schools in no particular order, representing both undergrad and graduate degrees are: Texas A&M, Sam Houston State, Cal Poly, Cal Poly Pomona, UCLA, Texas, MIT, Colorado, Washington, Toronto, USC and Purdue.<br>Engineering is VERY egalitarian. There are no magic schools where everyone is guaranteed success.<br><br>", "<b>Username: Coloradomama</b><br><br>I guess I do think that some branches of engineering do require more math than others, such as fluid mechanics. So it really depends on exactly what type of engineer you want to become, as to whether Caltech is a good fit.  Caltech is more of a chemistry, math and physics focused school, but the math will prepare students for a career in fluid mechanics for instance.  Thats the science that describes how an airplane moves through the air , the air being a “fluid”.<br>For an undergrad in BME, the chemistry at Caltech, might be compelling, but I would say JHU, Caltech or GaTech are about the same for BME.   Maybe GaTech a tad better, IF the student wants to design prosthesis, the best artificial heart, etc, because GaTech has such a tight relationship with Emory U Medical and has arguably very good mechanical engineering training.<br>All BMEs are going to get more education. So its also a personal preference, does the student  want hot dry Pasadena, a small town, with great access to Los Angeles, or the big bustling city of Atlanta, with sports, hiking, rock climbing close by, or the sailing and crab cakes  that Baltimore offers, with access to Washington DC?<br><br>", "<b>Username: eyemgh</b><br><br>@Coloradomama, my son is in his final quarter of his MS in ME at Cal Poly. His thesis is in boundary layer fluid mechanics. He took more math as an undergrad at Cal Poly than is required in a the aerospace focus of ME at Caltech. Their main distinguishing factor is not level, but pace. They go at a speed higher than any other institution probably in the world. It is debatable though whether or not that produces a better undergraduate product. As I said, engineering is very egalitarian. Much like music, you have the chops or you don’t. How you get than can be extremely variable.<br><br>", "<b>Username: 1NJParent</b><br><br><br>\"\"<br>Engineering is VERY egalitarian.<br>\"\"<br><br>I’m not so sure. It helps a great deal in one’s development in any field if s/he is surrounded and challenged constantly by people who are as smart or smarter. Engineering is no exception.<br><br>", "<b>Username: eyemgh</b><br><br>@1NJParent, Dale and Kruger blew that myth up long ago.<br>All you have to do is to look at the CEOs of top engineering firms to know that your thesis is patently false. Boeing’s current CEO, Dennis Muilenberg went to undergrad at Iowa State. United Launch Alliance…Tony Bruno…Cal Poly. Tim Cook…Apple…Auburn. Larry Page…Alphabet…Michigan. Larry Ellison…Oracle…Illinois (and didn’t graduate). Satya Nadella…Microsoft…first US degree, MS from Wisconsin-Milwaukee. I could go on and on.<br>Sure, you can find some, Jeff Bezos for example, that did go to a “top” institution, Princeton. Of the top 20 Fortune 500 CEOs though, he’s the only one that hails from the Ivy League. If your story were true all the top spots would be held by grads of “top” schools. They demonstrably are not.<br>Back to my previous post about JPL’s executive board. Here’s where they were educated: Texas A&M, Sam Houston State, Cal Poly, Cal Poly Pomona, UCLA, Texas, MIT, Colorado, Washington, Toronto, USC and Purdue. Caltech manages JPL, yet there isn’t a single Caltech grad in the top echelon of the organization and only one that hails from a “top” institution.<br>So, you might not be sure, but I am. Engineering is egalitarian and there’s LOTS of evidence proving it.<br><br>", "<b>Username: warblersrule</b><br><br><br><br><br> Coloradomama:<br>\"\"<br>Caltech is a school of geniuses and a few drop outs and a few that commit suicide as they cannot keep up.<br>\"\"<br><br>The Common Data Sets do not report suicide rates, but they do report 4 and 6 year graduation rates.<br>4 years<br>87.6% JHU<br>78.3% Caltech<br>39.2% Georgia Tech<br>6 years<br>93.9% JHU<br>89.3% Caltech<br>85.3% Georgia Tech<br><br><br><br> judgegregg:<br>\"\"<br>My comment around limitations is around demographics of student base. Caltech pretty much has all Uber merit students of same caliber whereas gatech would have a mix of students given it needs to cater to in state students.<br>\"\"<br><br>On the topic of student demographics, it’s perhaps worth noting that they differ in gender ratios in addition to geographic diversity. That matters to some and doesn’t bother others in the slightest, particularly when the schools of interest vary so greatly in size. YMMV.<br>Georgia Tech: 61.2% men, 38.8% women<br>Caltech: 54.6% men, 45.4% women<br>Johns Hopkins: 49% men, 51% women<br>The schools also differ markedly in class sizes. Unsurprisingly, Georgia Tech has more than a few large classes – a whopping 26% of its classes have more than 50 students, compared to 10% at JHU and Caltech.<br>Caltech and JHU report that 67% and 74% of their classes have fewer than 20 students, respectively; at Georgia Tech, 39% of classes have fewer than 20 students.<br>Of course, it is always best to check the enrollments in the departments of interest. It does a BME student no good if all of the small classes at his/her university are in departments like German and music.<br><br>", "<b>Username: 1NJParent</b><br><br>@eyemgh I’m not sure what your list of tech CEOs prove. First of the all, these CEOs became CEOs not necessarily because of the engineering talent. Secondly, engineering talents can certainly come from any quality school. It’s just some schools have higher concentration of them. Anyway, a few anedotes aren’t proofs of anything.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> warblersrule:<br>\"\"<br>The Common Data Sets do not report suicide rates, but they do report 4 and 6 year graduation rates.<br>4 years<br>87.6% JHU<br>78.3% Caltech<br>39.2% Georgia Tech<br>\"\"<br><br>However, care should be taken when comparing, since it looks like GT has a large percentage of students doing co-ops, which extend calendar time to graduation, but do not (by themselves) result in extra tuition-paying semesters.<br><br>", "<b>Username: retiredfarmer</b><br><br>Picking up on “eyemgh’s” point as to where engineering leaders come from:  At one point back in the 1970’s,  little WPI simultaneously had alumni as CEO’s of GM, Xerox and United Technologies (Prat & Whitney et al).  The entire enrollment was only about 2,000 students. Once a University reaches the realm of “street talk” famous, exaggeration sets in and  many assumptions lead to a mythology.<br>There are many remarkable colleges and universities out there!  They did not all come from the Ivies, MIT and Cal Tech.<br>@1NJParent<br>Agree, it takes more than thermodynamics classes to develop an effective leader!  In today’s engineering environment it takes more than courses to develop an effective research and design team.<br><br>", "<b>Username: judgegregg</b><br><br>A student with low inner motivation has higher chances of pushing his/her limits when put in an environment where others are either pushing themselves too or naturally motivated. I see these types of kids excelling in the highly reputed colleges than places where more partying is of the norm.  Having said this, if a student has lot of inner motivation, school doesn’t matter much . This is they my theory!.<br><br>", "<b>Username: scubadive</b><br><br>There are countless kids with top ACT scores of 34-36 and straight A students.  Grade inflation is rampant, standardized tests such as the SAT are far easier than decades ago and there is a whole industry to package kids for college.  Lastly tthere are brilliant kids with poor grades or lesser grades because they are not challenged.  While grades are an indicator of success they are by no means necessarily correspond to brilliance.<br><br>", "<b>Username: retiredfarmer</b><br><br>Good cooks know how to put ingredients together.  Having the fancy spices on the shelf does not assure a successful meal.  It requires the right combination of genuine interest, experimentation and culinary dialogue to bring together in a great meal.<br>BUT<br>not all customers have the same taste.<br>We need to look beyond the sign over the restaurant door!<br><br>", "<b>Username: judgegregg</b><br><br>I beleive in the law of probabilities. If i have bad cooks, no matter how fancy the ingradients are, the recipe is most likely not going to taste great. <br><br>", "<b>Username: retiredfarmer</b><br><br>Exactly my point!<br>You need good cooks, i.e., a quality teaching faculty, to make it happen  In the age of modern marketing, the packaging takes over from the talented cook.  You will never replace talented teachers and they are not always defined as the faculty with the most research.<br>There was a math teacher when I was in college who was so well known that students from other universities would seek him out for his skills as a private tutor.  A family member who was a student at the state university would study calculus with him over the summer.  She graduated as Valedictorian from her University and went on to head the technical division for Region I of the EPA  while producing some fine research.  This talented “cook” came to us by way of  Hamilton College.  He did not have a string of significant publications but always had yet another way of explaining a concept,  Another math faculty educated at Bowdion gave up a few hours on a Sunday afternoon to go over questions I had collected.  Perhaps these small LA colleges have a point!<br>How do you account for these “cooks” when selecting an  undergraduate institution?  This is not reflected in the USNEWS rankings as they are based largely on graduate school research.<br><br>", "<b>Username: privatebanker</b><br><br>@scubadive  the college board posts results for 2018.  5100 or so out of 2.3mm test takers earned at 1560 or better last year.<br>That score translates to a 35 act.  The middle of your 34 to 36 example. If you add in the 34s maybe another 30k. I’ve checked before but it’s not the exact number that matters. Top ten percent of any group is good company. Top five percent even better.  Top two percent. That’s pretty close to rare.<br>That isn’t one in a million but pretty darn exceptional. There aren’t really “scores” of students in the 34 to 36 cohort as many suggest.<br>Only mentioning this as CC threads are filled with this small group of exceptional students and their parents. It can distort the reality of 2.25 million of the 2.3 million potential applicants.<br><br>", "<b>Username: thumper1</b><br><br>@judgegregg is Georgia Tech the public where your sonreceived a Stamps Scholarship? If so, think very very carefully about the added perks associated with the Stamps. It’s an amazing award…amazing.<br><br>", "<b>Username: thumper1</b><br><br>Ok…so I’ll answer the question here so folks know. GA Tech is not where your son got the Stamps. Regardless…it’s an amazing award. Highly competitive…and he will certainly meet lots of wonderfully brilliant students wherever that Stamps was received.<br><br>", "<b>Username: SincererLove</b><br><br>How sure is your S about BME? It wouldn’t make sense for you to pick school if he might change his major. What does he want to do with a BME degree? From what I know, most kids go to medical schools with BME major. But you wouldn’t want to go to any of those three schools for premed.<br>Best of luck!<br><br>", "<b>Username: CU123</b><br><br><br>\"\"<br>A marginal Caltech student<br>\"\"<br><br>There are no marginal students at Caltech.<br><br>", "<b>Username: judgegregg</b><br><br>to keep things interesting, my son got into Duke, just announced today<br><br>", "<b>Username: PeterPerr</b><br><br>The latest US NEWS Engineering Rankings<br>======================MIT, CalTech, GATech<br>Engineering Prog. Rankings: 1, 4, 4<br>Biomedical Engineering…: 2, /, 3<br>Computer Engineering…: 2, /, 5<br>Chemical Engineering…: 1, 5, 2<br>Electrical Engineering…: 1, 6, 4<br>Civil Engineering…: 7, /, 2<br>Aerospace Engineering… : 1, 2, 3<br>Industrial Engineering…: /, /, 1<br>Materials Engineering…: 1, 9, 3<br>Mechanical Engineering…: 1, 6, 2<br>Environmental Engineering… :4,19, 6<br><br>", "<b>Username: stevensPR</b><br><br>@Coloradomama<br>Do you have any statistics to say Georgia Tech students get recruited “by far” more than JHU students at the elite Investment Banks, tech companies, and management consulting companies?  I’m ex bain from JHU, and can tell you point blank all three “elite” consulting firms (McKinsey, Bain, BCG) hire more than their fair share of JHU students.  I’d also see what division of Goldman is hiring.  Hackathon usually constitutes their IT divisions - far from elite like their IB division which hires substantially from JHU (i’m happy to name JHU alumni that are in Goldman’s IB group from recent classes).<br>Lastly in tech, Google and Facebook and other elite firms also hire substantially from JHU.   I work for one of the former now.  It’s unclear proportionally that they hire more from from Georgia Tech - I certainly don’t see it at HQ.<br>I’d choose JHU, bias and all.  When I graduated, I had my pick of grad schools with a full ride for Ph.D programs and my choice of jobs at graduation as well.  Ended up getting a Master’s for free from MIT, but had McKinsey, Bain, and Google offers at graduation as well.  When I was choosing schools for undergrad, I was also offered a scholarship at Georgia Tech (Stamps) along with UMD (Banneker-Key) and UVa (Jefferson), but ended up paying a bit more at JHU and don’t regret it in the least.<br><br>", "<b>Username: Greymeer</b><br><br>^<br>https://www.scribd.com/document/346963694/Hiringsolved-Ideal-Hire-Report-in-Tech<br>JHU not even on the list.<br><br>", "<b>Username: stevensPR</b><br><br>@greymeer, I’m talking about amongst the elite tech firms (Google, Facebook, Airbnb, Netflix, etc).  i can tell you Arizona State is not actively recruited at despite being top 10 on the list.<br><br>", "<b>Username: stevensPR</b><br><br>@Greymeer and neither are Princeton or Caltech or Columbia which are powerhouses here in the valley so what does that say about your “list” exactly?<br><br>", "<b>Username: Greymeer</b><br><br>You work at 4 companies?<br>Also I wouldn’t brag about elite consulting firms recruiting heavily at JHU. Management consulting firms are scam artists. So it’s like saying there is a high incidence of fast talkers and low ethics at JHU.<br>I have nothing against JHU but your pomposity set me off.<br><br>", "<b>Username: stevensPR</b><br><br>Where did I say I work for 4 companies?  Whether you think Management Consulting firms bring value to the table is your prerogative not a fact<br><br>", "<b>Username: anon145</b><br><br>@stevensPR   the list makes sense it says “Volume” of hires so large schools will end up equaling out.  eg. NC State was like #10.   the most interesting part of that list assuming it is remotely accurate is it appears large state flagships clearly prepare people for the top jobs and they don’t need to go to HYPM to get them.<br>Also BME is notorious as a pre-med major. So it’s not surprising they aren’t really becoming software engineers.<br><br>", "<b>Username: scubadive</b><br><br>In 2018 about 39k students earned a 34-36 on the ACT.  I am<br><br>", "<b>Username: stevensPR</b><br><br>@anon145 Agreed on volume part, but there are inherent flaws with the list.  They never identify what the top 25 silicon valley companies are.  Secondly, there’s no way a Princeton or JHU grad would be less desirable than an ASU or NC State grad (vis a vis same grades - and not trying to be elitist here given quality of education).  Lastly, there is a huge difference between what they deem could be #1 (Google where SWEs are making 300k a year with stock) vs #25 (say a Cisco where they are making $120k)<br><br>", "<b>Username: scubadive</b><br><br>While the  admit rate was 37% for GT instate, I am baffled as to why anyone would think that is a problem.  GT used to have a much higher rate of acceptance than this and the school is still the same school just as many schools admit rates have decline substantially. Did these schools suddenly hire different professors and develop new curriculum?  No.  And by the way GT has always been a self selecting university as it is highly quantitative and rigorous. It was an insulting remark for the students of Georgia.<br><br>"]}