{"title": "penn state smeal vs pittsburghs school of business administration a unique situation", "comments": ["<b>Username: ivanbond</b><br><br>I have recently been accepted into The University of Pittsburgh’s School of Business Administration and reapplied for the summer start program at Penn State University Park’s Smeal Business School after being rejected from regular fall decision and offered the 2+2 program. I was wondering if any alumni or current students could provide some background and insights into the two undergrad business schools and what gravitated their decision towards one school over the other.<br>I am rather distraught that I was not accepted into the more acclaimed Smeal Business School as a regular applicant, and this is heavily influencing my decision as my current financial circumstances could not advocate for a lapse in my work during the summer to attend school early. To read more about my background please continue, otherwise, I would like to hear your opinions of where I should go. I am more interested in which school will best prepare me academically and personally with additional focus on opportunities available at both in terms of internship placement, business clubs/organizations, and research focus. I could really care less about the parties or the campus.<br>It was quite a shock for me as I considered Penn State to be my safety school. I have a 3.8 unweighted GPA (4.0 Weighted), top 15% of my class, Magna Cum Laude, 29 ACT composite, etc. I believe my electives were the determining factor in my rejection from regular fall admission.<br>Because of my family’s financial circumstances, I often had to (and still do) work until 3 am on school nights and this schedule restricted my ability to participate in extracurricular activities that made my peers stand out on their resumes. In spite of this, however, I tried to make the most of my free time starting two companies (one which had international sales), investing, being elected CEO of company A2 at the Pennsylvania Free Enterprise Week (a renowned summer business simulation competition where I led my company to be the most profitable and received top RONA award), being elected into the accounting division at my current job at Fortune 500 company, interviewing two Fortune 500 executives, completing an internship with a local real estate agency, am in the process of acquiring two mentorships with one of the largest accredited investors and commercial developers in my city, and was also offered a summer internship at a local bank.<br>As you can see, these are typically not the standard extracurriculars that most participate in, as I tried to learn as much as I could in the real world because of my inability to participate in the school clubs like DECA and what not. I do not regard myself as anything special apart from being a hard worker. And this rejection from Penn State lowered my self-esteem rather drastically as I saw many of my peers get in with much poorer academic performance.<br>So should I still consider Penn State over Pitt for business? Is the opportunity cost worth it to attend PSU in the summer? Why do they even offer the summer start program? Am I overthinking this? Should I wait until I get back more decisions before debating my only two acceptances? Thank you for coming to my Ted talk and I look forward to hearing your thoughts! Thanks!<br><br>", "<b>Username: ivanbond</b><br><br>I have also applied to Penn (Wharton), UMich (Ross), Georgetown (McDonough), NYU (Stern), Carnegie Mellon (Tepper), Fordham, Villanova, and Babson. I do not think I stand much of a chance against the average applicant. Sorry for the length, I am just rather distraught and stressed out.<br><br>", "<b>Username: itsgettingreal17</b><br><br>Pitt has an excellent business school that is well regarded. So you already have an excellent option. I wouldn’t pass up Pitt for a chance at PSU with a summer start.  Ignoring rank, PSU isn’t appreciably better than Pitt’s CBA.  Most of the schools you are waiting on are reachy. Good luck!<br><br>", "<b>Username: Mwfan1921</b><br><br>Pitt business is a great option to have, congratulations.<br>Your ECs are impressive, so I doubt that has been/will be an issue for acceptances. I don’t know the detail and rigor of your HS courses, but your ACT score is below the 25% level for several of the schools you applied to. Fordham and Babson acceptances are higher probability than the rest of the schools on your list, and most of the rest I would classify as high reaches (with Villanova a reach).<br>Don’t fret over decisions until you are faced with them…if you need summer earnings to pay for college, I would choose Pitt over Smeal summer…but only you can make these decisions. Good luck, keep us updated.<br><br>", "<b>Username: ivanbond</b><br><br>Thank you for the insights! In terms of course load, I have had all honors classes with 2 AP (English - 4, Statistics - currently taking). I am also in the gifted individuals program at my school which gives us additional goals and skills to master in core subject areas. My dream is Georgetown, and I believe my interview went very well. For now I can only hope for the best, and prepare for the worst (but by no means do I consider Pitt Business not on par with any of these schools), I will update the thread as new information is available.<br><br>", "<b>Username: MYOS1634</b><br><br>How high did you score on your three subject tests for Georgetown? This will be key.<br>Had you taken calculus before you took statistics? (Reaching the highest possible level in math is crucial for business schools).<br>Smeal is the most selective college at PSU - only about 10% students are pre-admits from high school. The regular path is DUS-&gt; qualifying classes=&gt; admission to Smeal as a junior.<br>Your ECs are impressive and will be useful for the private universities you applied to.<br>ECs matter for Schreyer but dont really matter for general university Admissions. In addition, this year was totally weird due to their adopting BOTH early action AND common app.<br>Pitt is an excellent choice. Is it affordable? If so, you’ve got a great safety.<br><br>", "<b>Username: ivanbond</b><br><br>I may just be one of the worst students in getting prepared for college. Only in October I realized that I wanted to further my education and I will be the first in my family to do so. I took my act in november and i didn’t even know about Subject tests requirements. I guess we can cross that one off the list. <br><br>", "<b>Username: ivanbond</b><br><br>In terms of math I took everything except calculus because I didn’t think I needed it and stats would be enough. Boy was i wrong.<br><br>", "<b>Username: MYOS1634</b><br><br>Wharton considers that “AP Calc AB” is the default expected class for the lower level students since their first math class is caled calc 2 elsewhere. However if your school didn’t offer calc and your GC indicated you took ‘thevmet rigorous’ curriculum at your school, you wouldn’t be penalized.<br>Look, it’s not your fault since apparently you had no guidance.<br>Have you received financial aid packages? Is Pitt affordable? Last year there was a first Gen student (first to go to college) who ended up stuck because hed been admitted to Pitt and wasn’t affordable… <br><br>", "<b>Username: momprof9904</b><br><br>I too agree that Pitt business is a great option to have. Once you’re in college, aim for good grades - will you still need to work many hours to fund college? I have many students who work far too many hours and are unable to dedicate time to their classes. 20 hours a week is usually the max suggested for work.<br>With your work experience and a decent GPA from Pitt, you can target  decent internships in the summers, I think. My DS1 did not have hot stats to get into a top CS program, but had a lot of self motivated programming experience. He is now a sophomore at a mid-level university and got a summer internship based on decent grades and experience.<br>Also, look into taking some general education credits at your local community college in the summer before starting college… Many have class schedules that work with students’ work schedules.( Make sure all credits transfer) This could ease the load in the regular semesters if you are working.<br><br>", "<b>Username: MYOS1634</b><br><br>Be careful about taking community college classes after HS graduation - some colleges consider this makes you a transfer and may rescind you. Once you’ve registered you can do that with no worry after checking what will transfer.<br>The advice above about working is spot on - in fact, research shows that working more than 15 hours a week has a severe impact on grades, often delaying graduation.<br><br>", "<b>Username: itsgettingreal17</b><br><br>@MYOS1634  I suspect that’s not true for most colleges, but the OP should check. My D took language classes the summer before starting freshman year at a 4-year and none of the schools to which she was accepted viewed that as a problem. The credits did transfer very easily.<br><br>", "<b>Username: MYOS1634</b><br><br>Yes, it isn’t true for most colleges, but enough that op should check.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> ivanbond:<br>\"\"<br>Because of my family’s financial circumstances, I often had to (and still do) work until 3 am on school nights<br>\"\"<br><br>How do the net prices of Pitt and PSU compare?<br>What do the net price calculators of the other schools you are waiting for estimate?<br>How do those numbers compare to what you and your parents can actually pay?  (Note that you can only borrow $5,500 first year without a cosigner.)<br>Based on what you wrote above, it looks like lowest cost will be the main factor in your college choice (if any are affordable at all).<br><br>", "<b>Username: ivanbond</b><br><br>In terms of affordability I ran the net price estimator for both and PSU would generally be more affordable because Pitt doesn’t offer much in terms of financial aid. I have not received my financial aid packages yet so that’s all I can rely on right now. Additionally, parents contribution is at 0. They have their own struggles and I can’t find it in me to ask for money they don’t have to give. If I want to go to college it’s going to all come out of my pocket, and I will have to continue to work throughout college. That was my main motivation for applying to the private schools because they tend to offer more financial aid.<br><br>", "<b>Username: ucbalumnus</b><br><br>Basically, you are looking for a net price no higher than what you can earn from your own part time work and summer work plus $5,500 (the amount you can borrow).<br><br>", "<b>Username: kidzncatz</b><br><br>If your parents are contributing nothing, I can’t see how either Penn State or Pitt will be affordable.  Pitt does have a new financial aid program for students who are Pell grant eligible, in that they will match the Pell grant (see link below).  What is your family’s EFC?  Did you file the FAFSA and PHEAA state grant forms?   Are your parents low income or just unwilling/unable to pay anything?  I would suggest applying to some of the PASSHE (true state) universities that have accredited business schools (West Chester, IUP, Bloomsburg, Clarion, Shippensburg), though even those schools will be a financial reach without some family support.  If your family is low income, you also might get better financial aid at a private college, of which Pennsylvania has many.<br>https://www.affordable.pitt.edu/<br><br>", "<b>Username: ivanbond</b><br><br>Additionally I am applying for many scholarships, I believe I am at 20 right now with a goal of atleast 100, plus additional ones when I am already in college. Another option was that one of the executives I interviewed offered me an internship at CBRE Pittsburgh that pays very well (heard from his son $75k for the summer) which is why I am not too worried about a large debt. Thank you all for the helpful advice, as I haven’t had much explaining from anyone really, as my guidance counselor is always too busy and my parents think college is a waste of money. I am hoping that lucrative management or finance in a large city can take care of the rest with a smart debt repayment strategy.<br><br>", "<b>Username: kidzncatz</b><br><br>Either Pitt or Penn State will cost more than $30,000 a year without financial aid, unless you can commute from home to one or the other.  I highly doubt you can earn $75,000 in the summer.  $7,500 maybe if you are very lucky.  You can only borrow $5500 your freshman year.  Your parents would have to borrow or cosign loans for the remainder.  Most outside scholarships are competitive, are for small amounts, and are not renewable.  The best aid, whether merit or need-based, comes from the colleges/universities themselves.<br><br>", "<b>Username: MYOS1634</b><br><br>Normal earnings for a summer would be 3.5-4k. So, 7.5k would be excellent. 75k is basically impossible unless you get involved in shady stuff but you might have forgotten the period between 7 and 5 ;).<br>Do follow up with that executive, send your resume, etc.<br>Check your admitted student portal at both PSU and Pitt as your financial aid may appear there.<br><br>", "<b>Username: ivanbond</b><br><br>Yeah when I first heard 75k I thought it too good to be true. I’ll reach out again and find the real amount but I don’t think 7.5k is a stretch for a Fortune 200 company. But what do I know i’m still foolish and young.<br><br>", "<b>Username: ivanbond</b><br><br>I’m still really unfamiliar with how college loans work. Where do you recommend I go to learn more? I have applied for FAFSA, CSS, IDOC, etc but a good majority will still come from student loans. In all likelihood, I will have a large debt coming out of college and I can only hope that I can have a good business career going forward.<br><br>", "<b>Username: kidzncatz</b><br><br>https://studentaid.ed.gov/sa/types<br><br>", "<b>Username: kidzncatz</b><br><br>Will your parents take out Parent Plus or cosign private loans for you to attend college?  If not, you are limited to the federal Direct student loans ($5500 freshman, $6500 sophomore, $7500 each of junior and senior years).  In other words, $27,000 total in loans.  Have you received any merit scholarships or need-based grants from any schools yet?  Some financial aid awards may not be posted until March or even April.   Are Pitt and Penn State 2+2 your only acceptances so far?<br><br>", "<b>Username: MYOS1634</b><br><br>You need to apply to PHEAA also ( a scholarship program for Pennsylvanians who attend PA colleges).<br>https://www.pheaa.org/funding-opportunities/state-grant-program/<br>You can borrow 5.5k for freshman year. That’s it. It’s usually packaged in your financial aid, under the name Stafford loans or federal loans. If you pass enough credits you will be allowed to borrow 6.5k for sophomore year, and 7.5k each for junior and senior years. Total, 27k,with interest, 31k - what a college graduate can reasonably pay back over 10 years.<br>What is your EFC according to FAFSA?<br><br>", "<b>Username: ivanbond</b><br><br>I will have to check my FAFSA and i’ll get back to you after. Yes Pitt and Penn State are my only two acceptances so far. I have applied for many scholarships but haven’t received anything back yet in terms of financial aid packages or scholarship money. What about private subsidized loans? Can I or my parents take those out as well?<br><br>", "<b>Username: MYOS1634</b><br><br>You can’t. Your parents possibly can but I’d thy dont have money now they’re unlikely to have it in four years if they don’t have it now + you said they didn’t want to contribute.<br>External scholarships tend to be small and are often just for one year.<br>The best financial aid comes from the colleges - start rooting around your college and department at Pitt looking for scholarships.<br>As a financial safety, apply to WCU and their honors college.<br>Do apply to PHEAA.<br><br>", "<b>Username: kidzncatz</b><br><br>Applying to WCU is a good idea.  However, Honors College application is by invitation only.<br>https://www.wcupa.edu/viceProvost/honorsCollege/firstYearStudents.aspx<br><br>", "<b>Username: ivanbond</b><br><br>My parents have a relatively high gross income,  but under mean household income net because of a large debt problem and my mother’s company has been operating at a net loss for the last couple of years. If that clears anything up.<br><br>", "<b>Username: MYOS1634</b><br><br>If ‘relatively high gross income’ means 75+k (125? 200?) then you’re not eligible for much.<br>What’s your FAFSA EFC?<br>If your family owns a business operation, odds are that NPC aren’t totally accurate - but how much did most NPCs indicate?<br>If your parents’ EFC is not zero and they will contribute zero, you need merit aid.<br>With zero family help, anything above 11k is likely too much, which means you’d need a quick turnaround application “just in case”. You said your parents don’t value college (although nowadays it’s a signal all employers expect for non minimum job positions) which means they may well hope that your acceptances turn out too expensive and you can’t go.<br>You should apply to Youngstown State and/or UToledo and/or WCU ASAP (like, today, because March is around the corner and honors program+scholarships will soon be gone).<br><br>", "<b>Username: ivanbond</b><br><br>checked fafsa, EFC is 00152<br><br>", "<b>Username: ucbalumnus</b><br><br>With a FAFSA EFC of $152:<br>Pitt’s NPC at https://pitt.studentaidcalculator.com/Survey.aspx?p=Registration suggests a net price of $26,527.<br>PSU’s NPC at https://cce.ais.psu.edu/netprice-calculator/ suggests a net price of $23,726.<br>It looks like neither will be anywhere close to affordable.<br><br>", "<b>Username: MYOS1634</b><br><br>If your EFC is $0152 then you’re eligible for Pell Grants ($6k) and PHEAA grants (if you attend  PSU/Pitt/WCU) in addition to the Stafford (federal) loans.<br>It’s also good news because it means there isn’t a huge gap between what your parents want to contribute and what they’re expected to contribute.<br>Do apply to WCU as a financial safety, just in case (especially if CSS profile isn’t as kind to your financial circumstances). Do this today.<br>Apply to PHEAA as soon as you’re done with the WCU app.<br><br>", "<b>Username: ivanbond</b><br><br>Thank you all for the incredible help, i will make sure to apply as soon as possible.<br><br>", "<b>Username: MYOS1634</b><br><br>Keep us updated- the CC community can help you decipher your financial aid offer, figure out best value, etc, etc.<br>Also keep us updated with your accceptances so we can all cheer <br>For now PHEAA and WCU are urgent. (I think your best odds’ deadline is March 1 ie., WCU needs to be done today.) Look at the commonapp to see is wcu’s on it, it’d speed things up (do send recs and essays even if not mandatory as there matter for honors& scholarships.)<br><br>", "<b>Username: ucbalumnus</b><br><br>West Chester’s NPC is here: http://www.passhe.edu/answers/Calculator/WE/npcalc-216764.htm<br><br>", "<b>Username: Sophley</b><br><br>I don’t believe Pitt not PSU meet full need.  You may need to put a true state school in as a safety.  I also wonder if you’d have better luck at a private school that is committed to meeting 100% of need.  Penn State is not typically generous.<br><br>", "<b>Username: scholarme</b><br><br>Pitt will match Pell Grants starring this fall.<br><br>", "<b>Username: ivanbond</b><br><br>Just visited Pitt and found out that they are only offering me $2,000 in financial aid compared to $16,000 from Penn State. I am very distraught as I really saw myself as a good fit at Pitt. Beyond the realm of reality now…<br><br>", "<b>Username: MYOS1634</b><br><br>Don’t they match Pell grants now? Check with their financial aid office. :s<br><br>", "<b>Username: carachel2</b><br><br>Pitt is matching Pell grants starting with this class entering for Fall of 2019. Have you called them?<br><br>", "<b>Username: ivanbond</b><br><br>Yes I did call them and it was a mistake on their part and I received $5k more a year than what Penn State offered me. I’m still trying to figure out where to go and if the ranking of PSU would be worth the extra cost…<br><br>", "<b>Username: mommdc</b><br><br>Are you instate for Pitt and Penn State?<br>What is your financial aid package at each of the schools? How will you afford a $30,000 a year school? And how will your family be able to make ends meet with you off at college, and not able to work much?<br>Penn State offers some students the summer start where they can get 6 credits of classes done before the fall semester starts. It is not free, there will be extra costs.<br>I agree, for your situation, it makes more sense to work as much as possible this summer.<br>Pitt is a fine school.<br>Do you have a Pitt or Penn State branch nearby, where you could commute to for the first two years?<br>That would save money.<br><br>", "<b>Username: mommdc</b><br><br>I hope you filed the FAFSA and PHEAA grant form if you are a PA student. PHEAA application has to be done before May 1 and there is a signature form to mail into Harrisburg.<br>I think Pitt starts mailing out financial aid award letters in February.<br>Make sure the school hasn’t contacted you by email about FA.<br>If you qualify for a Pell grant (what is your FAFSA EFC?), Pitt is starting a Pell grant match program.<br>https://oafa.pitt.edu/pitt-success-pell-match/<br><br>", "<b>Username: ivanbond</b><br><br>Yes I live in Erie PA and there is a Penn State branch nearby (Behrend). In terms of family finances, I work merely to support myself with any additional money I have going to help my parents out. They told me not to worry about helping them while in college and to focus on my studies to try to get a good paying job coming out. They were expecting a debt of over $100k and with Pitts award the debt wouldn’t be as big of an issue. I’m still waiting to hear back from the private schools I applied to, which usually are more generous, but I doubt I will get into any of them.<br><br>", "<b>Username: mommdc</b><br><br>With your EFC I think you can get a PHEAA grant of around $3,700 at Pitt, and around $3,500 at a PASSHE school.<br>Then a Pell grant of around $6,000 possibly, and then the Pell match at Pitt of another $6,000.<br>Was the $2,000 a merit scholarship?<br>Then you can borrow $5,500 for the year.<br>You might get federal work study, but that is earned at a work-study job as you go ($70 a week or so during the semester).<br>That’s $23,200<br>Not nearly enough.<br><br>", "<b>Username: mommdc</b><br><br>Alone you cannot even afford Pitt. Tuition for CBA is over $20,000.<br>Then fees and room and board are another $12,000.<br>You need another $8k or so.<br>Penn State is going to be $5k more, plus the extra cost for summer, plus the money you will lose by not working in the summer.<br><br>", "<b>Username: ivanbond</b><br><br>What about private loans? I am also considering taking a gap year to save up some extra money and maybe take some additional classes locally.<br><br>", "<b>Username: MYOS1634</b><br><br>Have you applied to PHEAA grants?<br>Penn State is unaffordable (you can contact them but they’re unlikely to offer anything).<br>So, can you list your exact package from Pitt, including<br>tuition, fees, room, board = $…<br><br>grants = $…<br>scholarships = $…<br><br>(etc)<br><br>", "<b>Username: mommdc</b><br><br>Behrend is an excellent PSU branch.<br>You might get a scholarship there.<br>You might be able to save up your student loans from the first two years for the last two years at PSU main.<br><br>", "<b>Username: MYOS1634</b><br><br>^ has OP even applied to Behrend? And is Behrend cheaper than Pitt?<br><br>", "<b>Username: ivanbond</b><br><br>Yes I originally got into Behrend with the 2+2 program, and I have applied for the PHEAA grants.<br>For Pitt,<br>Federal Pell Grant - 6,045.00<br>Federal Subsidized Loan 01 - 3,500.00<br>Federal UnSubsidized Loan 01 - 2,000.00<br>Est. PHEAA State Grant FT Fall Grant - 1,479.00<br>Est. PHEAA State Grant FT Sprg - 1,479.00<br>Pitt Success Pell Match Grant - 6,045.00<br>Justus H.W. Mulert Loan - 1,500.00<br>Aid Year Totals - 22,048.00<br><br>", "<b>Username: MYOS1634</b><br><br>Tuition CBA: $20,250<br>Fees: $950<br>Room&board: $11,850<br>= 33,050<br><br>Pell Grant: $6,045<br>PHEAA: $ 2,960<br>Pitt Success Match Grant: $6,045<br>= 15,050 in scholarship<br>=&gt;<br>NET COST: 18,000<br><br>Federal Loans: $5,500<br>Pitt Loan: $1,500<br>= $7,000<br>Cost: $11,000  =&gt; how are you going to find this money?<br><br>", "<b>Username: ivanbond</b><br><br>Well what about private loans? Or external scholarships? I apologize for being so unknowledgable on the matter as neither of my parents have been to college and we haven’t lived in America long enough to understand it all.<br><br>", "<b>Username: airway1</b><br><br>I would have thought it would be cheaper to go to the other campuses plus you don’t need to stay on campus… isn’t that correct?<br><br>", "<b>Username: mommdc</b><br><br>The state grant is an estimate. Last year the maximum state grant per semester for state related schools was $1,886 a semester I believe. But that doesn’t help much.<br>You will have about $23,000 of aid. But it costs at least $32,000 at Pitt.<br>Behrend tuition and fees should be closer to $15,000. If you could commute there for the first two years (possibly less with AP credits), then you might be able to save up money for transferring to he main campus for the last two years.<br>Branch campuses might have some need based scholarships available.<br>You would get a Pell Grant, a smaller state grant (maybe around $3,000), and maybe merit. You should be able to work on weekends.<br><br>", "<b>Username: mommdc</b><br><br>Business might be a 4 year degree at Behrend.<br><br>", "<b>Username: mommdc</b><br><br>You might win some local scholarships but they are often only for one year.<br><br>", "<b>Username: MYOS1634</b><br><br>Your parents can take on 10K in Parent PLUS loans for you (I hope you’d work and earn enough to cover the 1K gap + the rest of the money for books and incidentals).<br>But since you’re low income that’s really unkind of you to do that to them - if they don’t have the money now, how will they have it in 4 years?<br>Is Behrend affordable since you don’t have matching grants there?<br><br>", "<b>Username: mommdc</b><br><br>https://behrend.psu.edu/admissions-financial-aid/financial-aid/scholarships/undergraduate-scholarships<br><br>", "<b>Username: mommdc</b><br><br>Were you accepted to Shreyer at Behrend?<br><br>", "<b>Username: MYOS1634</b><br><br>^great questions<br><br>", "<b>Username: ivanbond</b><br><br>Unfortunately no I was not accepted. I am considering retaking the SAT to try to get above a 1500 to be considered for more academic scholarships.<br><br>", "<b>Username: MYOS1634</b><br><br>Do so ASAP then, I think there’s an ACT soon too but the SAT deadline for April has passed and you’d have a late fee.<br><br>", "<b>Username: mommdc</b><br><br>Contact info. Behrend has Shreyer and another honors program. See if you can be considered for this.<br>Penn State Behrend Honors and Schreyer Honors Programs Office<br>Smith Chapel<br>Stephanie Gummerson, Administrative Support Assistant, Honors Programs<br>814-898-6864<br>Dr. Michael Brown, Director, Honors Programs<br>814-898-6324<br><br>"]}