{"title": "psu vs ncsu vs virginia tech", "comments": ["<b>Username: Amateurengineer</b><br><br>Hello all!<br>I have recently been admitted to PennState and NC States main campuses for engineering, and am relatively sure I will make it into Virginia Tech (fingers crossed).<br>I have already gone to check out PennStates campus and was happy with what I saw, but haven’t had the chance to see the other schools yet. (I have plans to check them out later this month).<br>I am a PA resident but don’t know what kind of aid I will receive from any of these schools. I have a planned major in mechanical engineering.<br>I was wondering if anyone could give me some “inside knowledge” as to how these schools programs stack up against each other and if there is anything that I should know about these schools that may aggressively sway my decision.<br>Any and all responses are appreciated!<br><br>Connor<br><br><br>", "<b>Username: AlmostThere2018</b><br><br>@Amateurengineer – Congrats!<br>Is price a factor for your decision?  These are all great programs, and if the money is a factor, you should probably go with the one that is most affordable so you don’t have to take out debt.<br>Penn State is obviously a much bigger university overall.<br>You may know that NC State’s engineering school is on its own (relatively new) campus across a busy road from the rest of the campus.  There’s a frequent bus that runs between the two campuses.  This campus also has a lot of industry research sites which makes for a lot of neat cross-pollination between academic and corporate research. RTP is booming overall, and Raleigh is a great city and the campus is not far from downtown; there’s a lot fo do.<br>I’ve never been to Blacksburg, VA and only saw Penn State once a million years ago so can’t help there.  My S is interested in engineering (college class of 2025) and these colleges so I’ll be watching others’ responses too!<br>Congrats again and good luck!<br><br>", "<b>Username: moooop</b><br><br>All 3 of these universities have wonderful reputations in engineering. The thing that sticks out about NC State is it’s the only one of these 3 that is close to a significant amount of potential employers.<br>I know that it’s very possible to get intenships & jobs from a more-isolated campus…but when the employers are nearby,  it simplifies a lot of the interviewing, the traveling, the housing (especially for summer internships), etc. Also, I don’t know if internships during the school year are common for engineering students, but if they are, NC State would seem to have a clear advantage over the others.<br><br>", "<b>Username: chb088</b><br><br>My S18 is at NCSU (not engineering) and while we think it is wonderful, you should pick the most affordable option.<br><br>", "<b>Username: jllmtw</b><br><br>All three have great reputations and will offer allot of opportunities.  They are all very large as well.  One has more winter, one is in the mountains and one has more seasons.  I attended NC State and have visited the others.  VaT is the prettiest campus, with the Hokie Stone buildings and mountain back drop.  NCSU Centennial Campus is very nice too and is where most of your engineering classes will be.  Be sure to check out the Hunt Library when you visit.  PSU campus is huge and very traditional (in a good way).  I went to a white-out game!  Had a great time.<br>Raleigh/Triangle will have more opportunity and more things to do in the area.<br>Visit and see which one feels the best.<br><br>", "<b>Username: Amateurengineer</b><br><br>@AlmostThere2018<br>Thanks for the info! Price is really not a huge factor, but if any college is severely overpriced compared to the others, it will be easy to rule out.<br>I didn’t know NC State’s engineering school was a newer addition to the campus. It looks very beautiful! (from the pictures online). I assume this means I will be taking the bus to get to most of my engineering classes then? It sounds like a lot of people also agree there is a lot of opportunity in the Raleigh area, that is going to be a huge factor in my decision!<br>That’s also neat your S is interested in engineering! I will make sure to keep this thread updated on where I decide to commit and why after I do some more in-depth visits. I am also starting a YouTube channel documenting my life from now (A high school senior) to my college graduation (provided I make it that far). I will post a link in the chat after I upload the first video!<br>Much thanks!<br><br>Connor<br><br><br>", "<b>Username: Amateurengineer</b><br><br>@moooop<br>Thanks for your reply!<br>I have been hearing a lot of people agree that there is a lot of potential in the Raleigh area! I will definitely take that into account as I didn’t know that before.<br>I have not heard of many engineering students having an internship during the school year, but usually over the summer. It is still very nice to have all those business opportunities so close though!<br>Thanks again!<br><br>Connor<br><br><br>", "<b>Username: Amateurengineer</b><br><br>@chb088<br>Glad to hear your S18 is loving the school! I agree that money will play probably the biggest factor.<br>I appreciate the input!<br>-Connor<br><br>", "<b>Username: Amateurengineer</b><br><br>@jllmtw<br>Very cool to hear from a student that has visited all campuses! I really do appreciate the input about the type of environment each school is based in. I will make a special note to check out the Hunt Library when I come down to visit!<br>I also completely agree with your view on PSU being traditional, I really liked it when I went to check it out!<br>Again I really appreciate it!<br><br>Connor<br><br><br>", "<b>Username: sevmom</b><br><br>All three are excellent for engineering.   Price and fit will be important.<br>Virginia Tech has a beautiful campus .  Large but not overwhelming. The main  engineering building is state of the art and built a few years ago.  There is a corporate research center in Blacksburg with lots of potential employers. https://en.wikipedia.org/wiki/Virginia_Tech_Corporate_Research_Center<br>Many national companies come each year to recruit at the  Engineering Expo, the career fair. Many Virginia Tech engineers do summer internships in Washington, DC,  Richmond, Roanoke, Blacksburg, etc.<br>Penn State, NC State, and Virginia Tech will all have very good employment opportunities .<br><br>", "<b>Username: STEM2017</b><br><br><br>\"\"<br>Many national companies come each year to recruit at the Engineering Expo, the career fair.<br>\"\"<br><br>Here is the list from last year’s Virginia Tech Engineering Expo.<br>https://expo.sec.vt.edu/student/Companies<br><br>", "<b>Username: Amateurengineer</b><br><br>@sevmom<br>The Virginia Tech campus sounds great from how you described it. I haven’t had the chance to get out there and visit yet but am hoping to soon! Your Wiki link helped a lot too! I looked into the Engineering Expo and it seems like an amazing way to get in touch with potential employers and build relationships!<br>Really great info, thanks a bunch!<br><br>Connor<br><br><br>", "<b>Username: Amateurengineer</b><br><br>@STEM2017<br>Hey! I have seen your posts on a bunch of other threads with this same topic! Thanks for the link, that’s a TON of companies (most of which I would love to work for) that attend the Expo!<br>That’s so cool VT does that, definitely factoring that into my decision!<br>Thanks!<br><br>Connor<br><br><br>", "<b>Username: STEM2017</b><br><br>@Amateurengineer You are welcome.  All three of the schools you are interested in have career fairs.  I’m not sure if they have engineering specific career fairs like VT, but they probably do.  Keep poking around and I’ll bet you find info.<br>You have three great choices.<br>Good luck!<br><br>", "<b>Username: AlmostThere2018</b><br><br>@Amateurengineer – I know there’s a dining hall on the engineering campus and nearby housing.  Not sure if an actual dorm right there or not…<br>Appreciate your commitment to keeping us informed!  You communicate well and I think you’ll be an excellent engineer.<br><br>", "<b>Username: Amateurengineer</b><br><br>@STEM2017<br>Yup, I just did a little google searching and found that my other choices also have career fairs! (Though not engineering specifically). I never would have thought to look into something like that, really thank you so much!<br><br>Connor<br><br><br>", "<b>Username: Amateurengineer</b><br><br>@AlmostThere2018<br>Thank you for the info on the engineering side of the campus! I will make sure to pay close attention to that when I am on the tour!<br>Also, thanks for the compliment! I am happy to try and document this whole process as much as I can because I know myself and a lot of my other engineering friends are hungry to get their hands on any and all knowledge regarding college engineering and how to decide on a college.<br>Thanks!<br><br>Connor<br><br><br>", "<b>Username: Sophley</b><br><br>You may want to investigate how challenging each program is…meaning how bad are the weed out courses.  I can only speak about PSU, but supposedly only 1 in 3 who start in engineeeing actually graduate with an engineering degree. It’s pretty brutal but that’s also why a lot of recruiters hire students from there. You could also compare the entrance to major requirements between schools. At PSU no one is technically accepted into their major. Rather they have to take a handful of required courses and hit a certain GPA before officially declaring it.<br><br>", "<b>Username: Amateurengineer</b><br><br>@Sophley<br>Hello! So your comment brings up a few questions, and I’m really into PennState, so I’m hoping you can answer them for me!<br><br>When you started at PennState, how difficult were the starting engineering courses?<br>You said no one is directly accepted into their major, but on my admission decision it states, <br><br>“I am pleased to offer you admission to the College of Engineering with the intended major of Aerospace Engineering for Fall 2019 at Penn State University Park.”<br>Does this mean I will have to maintain a certain GPA and then if I maintain it, I will be guaranteed admission to my major?<br><br>Do you know what the GPA is that I would have to maintain? (Not a lot of info from searching around google)<br>If you are in engineering, what are your thoughts in general about the program at PSU?<br><br><br>", "<b>Username: Sophley</b><br><br>1 - I’m a parent of a Penn Stater and many parents of engineering students complain on the parents Facebook page about how their formerly 4.0 GPA kids are now struggling. Lots of weed out classes.  (And possibly a bit too much partying.). Google “PSU engineering entrance to major requirements” for details. Some majors require GPAs as high as 3.2.<br>2 and #3 - As your email or letter states, you were accepted into the COLLEGE but with an intended major...but not directly into the major.  You are technically in what PSU calls premajor status. To officially declare your major, you will have to successfully complete several courses with a C or better and hit a certain overall GPA, which varies depending on your major.  Civil engineering requires a 2.6 but biomedical, mechanical,  and chemical require a 3.2.  My advice is to go to office hours, sign up for Lion tutors, create peer study groups, etc.  and try to do as many math courses as possible at your community college over the summer and transfer them in. Just make sure you confirm with an adviser that they will be accepted before doing so.<br>4 - PSU engineeeing is super tough but they are in high demand.  Alumni network is the largest outside of Michigan and so the brand name goes far.<br><br>", "<b>Username: Amateurengineer</b><br><br>@Sophley<br>Thank you for the clarification as to the GPA requirements! I didn’t realize the weed out courses would be that hard so once again thank you for pointing me in the right direction in terms of getting a tutor, office hours, and getting credits done over the summer. It’s also great to hear that the brand name reaches as far as Michigan!<br>Thanks again!<br><br>Connor<br><br><br>", "<b>Username: jllmtw</b><br><br>@Amateurengineer to answer your questions concerning riding the bus at NC State.  Most of the freshmen classes will be on main campus (the weed out classes as has been mentioned).  They are building a pedestrian tunnel to connect the two campuses.  They also stagger the classes between the two, so it is not a problem if you do have classes on both, which my sons did a couple of times.  And like PSU above, NC State engineering, your are accepted into the college but not the specific major.  Once you complete your first set of math and sciences, you apply to the major of your choice and it is based on grades in these core classes. Typically aerospace and chemical will be among the harder to get into.<br>Good Luck.<br><br>", "<b>Username: Creekland</b><br><br>My vote goes to VT, but H and I being alumni might make us a wee bit biased. H actually turned down NC State for VT when he got accepted off the wait list, but that was a few moons ago.  H owns his own company now, so I think he turned out ok.<br>VT is similar that one gets into their specialty after the core courses unless they’ve changed recently.<br>The setting in Blacksburg is incredible. We loved our time there. It’s only improved since our day.<br>All that said, you could pick based upon finances or where you think you want to live once done and do just fine with degrees from any of your choices. We live in Penn State territory and know a fair number of successful grads from there too. Head down to NC where H is from and there are plenty of NC State grads doing well too.<br>Best wishes to you with your selection.<br><br>", "<b>Username: ppxyz123</b><br><br>@Amateurengineer have you made your decision yet. I am in a similar boat as well. Pls do keep us updated on your choice<br><br>", "<b>Username: ucbalumnus</b><br><br>VT also has a first year general engineering status. Students who earn a 3.0 in those first year courses can choose any engineering major. Below 3.0 is competitive by GPA, depending on remaining capacity in the department.<br><br>", "<b>Username: Amateurengineer</b><br><br>@ppxyz123<br>UPDATE:<br>I was accepted to VT on Friday 2/22/19!<br>I have not yet made a decision, and am touring these schools in the upcoming month. I will post how those tours go and what I thought of each of the schools.<br>As of right now, I am leaning more towards Penn State. This is more based off of cost rather than how much I like either of the schools. VT is far more expensive than PSU and therefore would make sense for me to go to the college that is significantly cheaper (31,000yr vs. 44,000yr).<br>NC State, on the other hand, has fallen out of favor on my list a little. It is very expensive for out of state applicants (44,850yr) and has a lesser known engineering program relative to the other schools. However, I will still be touring the campus to give an opinion!<br>I will keep the thread posted! Glad to hear you are considering all of these schools too!<br><br>Connor<br><br><br>", "<b>Username: ppxyz123</b><br><br>@Amateurengineer - waiting eagerly for your update after the tours. NC state merit aid will be a deciding factor for me and i hear it could be informed by end of March. Pls update your info after the tours. If anyone has already toured to these campuses before kindly update<br><br>", "<b>Username: AlmostThere2018</b><br><br>Congrats on the VT acceptance.  And, yes, thanks for the update and keep it coming!!<br><br>", "<b>Username: sevmom</b><br><br>Congratulations on the VT  acceptance and good luck with your decision. I love Virginia Tech but if PSU is significantly cheaper, then that may very well be the way to go. You will be fine coming out of any of these three schools.<br><br>", "<b>Username: Amateurengineer</b><br><br>@ppxyz123<br>@AlmostThere2018<br>@sevmom<br>Thank you all!<br>I too am waiting to hear about NC State’s aid and that will, of course, be a factor in my decision too. I am touring PSU March 14th, Virginia Tech soon after, and NC State at the end of March. I will post a detailed independent review of all of the tours as soon as I get back from each of them!<br>I will also say that though this thread is for VT, PSU, and NCSU, I had also applied and got accepted to the University of Maryland, College Park. I wasn’t really thinking about going there before because of the price, however, they have offered me a one time $50,000 merit-based scholarship. This significantly brought down the cost and the school is also very excellent for engineering. I know no one in this thread is probably considering them, however, I thought I should throw this information in here because I may very well end up deciding to go there. I am touring the UMD campus in March and also having a friend in their engineering program give me a more “student perspective” tour of the school.<br>I will post a review of UMD’s tour on here also, though I know it really isn’t related to the thread!<br>Again thank you all!<br><br>Connor<br><br><br>", "<b>Username: MYOS1634</b><br><br>Is it a 50k over 4 years?<br>No matter - that’s impressive!<br><br>", "<b>Username: Amateurengineer</b><br><br>@MYOS1634<br>Yep! It’s spread out over all 4 years!<br>And thank you!<br><br>", "<b>Username: sevmom</b><br><br>Does that make it your least expensive option then?<br><br>", "<b>Username: AlmostThere2018</b><br><br>UMD College Park engineering is excellent!  Congrats – you’re killin’ it!  <br><br>", "<b>Username: Amateurengineer</b><br><br>@sevmom<br>Not quite the cheapest, but close to it!<br>UMD never sent a financial aid information form yet to inform me how much tuition and room/board will be. Therefore, I have no clue what to expect for the yearly cost, so I am just going off what it says on their website and using 51,500 per year (out-of-state). With the 50,000 spread out over the 4 years, this lowers my cost to 38,900yr. Bringing it in at the second cheapest option so far. PSU still the cheapest at 31,000yr!<br><br>", "<b>Username: Amateurengineer</b><br><br>@AlmostThere2018<br>Thank you so much! I love this website, so much positivity!<br><br>", "<b>Username: Amateurengineer</b><br><br>@ppxyz123<br>Hello!<br>Just wanted to let you know,<br>along with my posts on this thread, I will also be capturing some footage and giving a video review of the campus tours on YouTube. I just made a channel for all this college stuff so I’ll link it below if you are looking to check it out!<br>I will do a tailored video for each of the colleges after their tours!<br>https://www.youtube.com/channel/UCfBstx6cZv7doKnrWg7YHmg<br><br>", "<b>Username: prezbucky</b><br><br>As an OOS student at NC State and VA Tech, total cost (not counting transportation and personal expenses) would be about:<br>NC State: ~$40k per year<br>https://studentservices.ncsu.edu/your-money/financial-aid/estimated-cost-of-attendance/undergraduate-student/<br>VA Tech: ~$43k per year<br>https://finaid.vt.edu/content/dam/finaid_vt_edu/Cost_of_Attendance/1920/COA%20OutofState%201920_UG.pdf<br>As an in-state student at PSU: ~$30k<br>That’s give or take a grand or so. So PSU would be about $10k-$13k less expensive per year, or about $40-50k less expensive over the course of four years.<br>I think PSU has a slightly stronger Engineering rep than VA Tech and NC State, though all are adequate.<br>So to me, I would choose PSU unless you fell in love with NC State or VA Tech to the point that the $40-$50k difference became a non-factor. Still, that’s a lot of money which you could use for a house down payment, grad school, traveling, investing, etc.<br><br>", "<b>Username: Amateurengineer</b><br><br>@prezbucky<br>Thank you so much! You’re absolutely right, That is a huge difference in cost over 4 years. I like the way you proposed it, is the likability of VT or NCSU a 50,000 difference vs. PSU?<br>Again I appreciate the comment, massively helpful!<br><br>", "<b>Username: prezbucky</b><br><br>No problem. Wherever you go, work your tail off and shake hands (and have some fun - avoid early Friday classes, lol), and you’ll be fine.<br><br>", "<b>Username: Amateurengineer</b><br><br>Hey all!<br>So I got back from Va Tech and PSU a couple of days ago and just got around to making a little review!<br>I’ll do one for Pennstate first…<br>If you don’t wanna read through this I made a little video here: https://www.youtube.com/watch?v=TkE0E-4hI9c<br>But here it is, I absolutely loved PSU. Just the drive through the campus to get to the hotel we were staying at was amazing. Kids were out and about, throwing footballs around, talking in large groups, basically what you can expect at a larger university. My mom and I spent the first day just milling around campus, and it has a really good feel to it. I remember having the biggest smile on my face and also, if we got lost or needed to find something, students wouldn’t hesitate to come up to us and ask if we needed directions.<br>The second day was in the college of engineering information session. The speaker did an amazing job at relaying how great of a program they offer at PSU, and had senior students from the engineering college talk about there experiences abroad or cool projects they got involved with at the university. Then we went out in tour groups to get a more in-depth tour of the campus. The tour guides were funny and shared a ton of awesome information. The kids in my tour group were really cool too, I made a few “close” friends and we are remaining in contact in case we decide to go to PSU so can get in touch again.<br>The best part of the day was when I got to tour their Formula SAE club which is where students build a race car from scratch and race it at a national tournament every year. The students in the club dropped everything to talk to us and I could tell they were just getting excited about sharing with me what they were working on. They were extremely passionate about what they were doing. That was the best part of the day.<br>I was worried about it being such a big university, but actually being there, it felt smaller than I thought. And if parties are what you’re looking for, there was no shortage of those either (or so I was told).<br>Best takeaways:<br>AMAZING engineering program<br>Plenty of opportunities to thrive and find your niche<br>great social and sports teams<br>Very happy place with a good vibe<br>Cons:<br>Reputation as a party school to some<br>Hope this helps! I will be putting out a video on Virginia Tech as well as a review on here soon!<br><br>", "<b>Username: ppxyz123</b><br><br>@Amateurengineer thanks so much. I was so waiting for the reviews. Will wait for your Vtech review. My only concern with Penn State (other than being a college town) is the party culture.<br><br>", "<b>Username: ppxyz123</b><br><br>@Amateurengineer Had a few questions.<br><br>Is your major Computer science in the College of engineering? How was that dept?<br>Is there a residence hall (new/ renovated ones) closer to CS department. Which residence hall do you recommend?<br>How is it to commute around - bus schedules?<br>Food<br>During cold weather do the kids find it difficult to walk around campus. I heard some colleges like Purdue have tunnels to walk around from residence hall to food courts - does Penn state have something similar?<br><br><br>", "<b>Username: MYOS1634</b><br><br>Pennsylvania is not Minnesota or even Indiana… it’s not so cold that you need tunnels! <br>CS can be in Engineering or IST. Degree content is different.<br>If concerned about party culture, don’t join a frat (like 70-80% students); look for a wellness/substance free dorm/ quiet floor; honors dorm (don’t remember which name) has a quiet sound proof room and is a few minutes away from Engineering.<br><br>", "<b>Username: ppxyz123</b><br><br>Thanks @MYOS1634. Good to know its not that cold. My letter says Engg.<br>Do you have any recommendations closest to CS for double room/suite?<br>. I am not admitted to honors so cannot go for the honors dorm.<br><br>", "<b>Username: 4gsmom</b><br><br>My daughter recently graduated from PSU with an engineering degree. She had incredible internships starting with the summer after her freshman year. She was offered a job before her senior year even started. If your con is that it’s a “party school”, live in the engineering dorm. It’s in a prime campus location (across from the shrine) and is a really good option for those who want a bit more of a studious environment. She is not a partier and still made a lot of friends, had a good time and ended up with a terrific job. You have a lot of great options - good luck with your decision. Exciting times!<br><br>", "<b>Username: ppxyz123</b><br><br>@4gsmom thanks for the feedback. Is the engineering house,  the E-house in SLO community options. Are they close to CS classes (engg)?<br><br>", "<b>Username: 4gsmom</b><br><br>@ppxyz123 yes. It’s McKee Hall. And it’s on the west side of campus, not on top of, but not far from the engineering buildings. My daughter was a double major (in French and Francophone Studies) and she never complained about the distance to her classes. She’s a kind of shy, studious kid and we didn’t think PSU was the right fit and it turned out she knew herself well and thrived there.<br><br>", "<b>Username: Amateurengineer</b><br><br>@ppxyz123<br>Hey friend!<br>I’ll try my best to answer your questions!<br><br>My intended major is mechanical engineering, however at PSU, you don't get to declare your major right away, you have to take the entrance to major courses and maintain a 3.0-3.2 GPA to be able to declare your major. <br>    The computer science dept is excellent, as well as all other types of engineering at PSU, they are amazing across the board!<br>If you choose to room in \"E-House\" (The engineering special living option) you will be closest to the engineering building where most of your upper-level classes will be held. I don't know exactly where E-House is placed on the campus, I just know it is super close to the engineering building. They have renovated rooms at East, West, and North Halls. However East is supposedly the \"party hall\". I would definitely recommend getting into E-House, very quiet and all the people living around you can help you and you can ask them questions!<br>The commute is quick and efficient. The buses are going 24/7, and a lot of students take pride in the bus system because it is really well put together on the campus. If you are going for CS, I can pretty much guarantee everything will be a hop skip and jump from the residence halls. Took me only 20 minutes tops to go from one end of campus to the other!<br>The food was AMAZING. I want to stress, I was expecting high school cafeteria food, I was instead eating something out of a Red Robin or Apple Beez it felt like. We went to one of the residence halls to eat, a very basic one that you get with the meal plan. I could get unlimited burgers and fries, and they have a ton of options, everything tasted great and the students I talked to love the food as well. A very strong point of the university I would say!<br>PSU gets cold I'm sure, I luckily wasn't there when it was cold. I can say however that due to the proximity of the buildings on campus, the wind is broken up really well so there was never super strong winds when we were walking around which is nice. They don't have tunnels on campus, or at least I didn't see any when I was there. I have a friend that graduated from PSU and she said that walking around was never a problem in the winter because it's usually strong wind that makes it feel really cold out, and wind generally isn't a problem. Sorry, I can't offer much personal info on the weather though!<br><br><br>", "<b>Username: Amateurengineer</b><br><br>@ppxyz123<br>Also as for party culture, that was a huge worry of mine too! In fact, back when I was a junior in hs, I never thought I would apply to PSU because of the party school stigma. However, after talking to specifically engineering students that were passionate and devoted to their studies, they told me that as an engineer, if you don’t want to go to parties and you live in a hall other than East, you will never really be too tempted to party. However, if you want to seek out parties they are not hard to find. By housing in E-House or West or North halls, the party scene is elsewhere on campus generally. As long as you don’t join a frat, you won’t be bothered by partying!<br>I will have a Virginia Tech review up soon! I’m going to post it along with my video I’m making for it. So probably tomorrow!<br><br>", "<b>Username: ppxyz123</b><br><br>@Amateurengineer great info thanks so much.<br>The question I had however is - do all freshmen take the same courses in first year<br>or for Mechanical engineering you have your own set of major courses and for CS I  have my own set - which is ok to do and we maintain the GPA for these courses. Its also  ok if there are a few general courses<br>However if both departments are taking same set of courses it means many will get weeded out from the major they want isnt it?<br>Purdue and TAMU and Vtech states clearly that first year is General engg where all freshmen take same courses right?<br>However Calpoly SLO - you are taking classes related to CS from Day 1.<br>I would like someone to confirm if at Penn State - all freshmen are taking same set of classes or the set of classes pertaining to their major with a few common ones. This is important for making my decision.<br>Can anyone please confirm?<br><br>", "<b>Username: MYOS1634</b><br><br>Look for ‘cs academic plan’ and compare to ‘electrical engineering academic plan’.<br>Email the college of engineering to ask<br>whether CS majors need to take Calculus for engineers or whether they take regular or honors Calculus (140E v. 140).<br><br>"]}