{"title": "entitled elitist students u wisconsin madison vs syracuse vs tulane vs u delaware vs usc", "comments": ["<b>Username: hardworking99</b><br><br>My daughter is applying to college this fall. We are looking for a school which has a lot of nice, friendly, inclusive (of others)  kids and which doesn’t have a lot of entitled, spoiled kids. I know you can find your niche at most any school, but certainly different schools have different vibes and attract different types of kids. Anyone know anything about any of the above schools? Thanks!!<br><br>", "<b>Username: jym626</b><br><br>With a thread title and OP like that …  the responses should be most entertaining.<br><br>", "<b>Username: momofsenior1</b><br><br>None of these schools strike me as having a reputation for elitism.<br><br>", "<b>Username: jym626</b><br><br>And which USC?<br><br>", "<b>Username: Twoin18</b><br><br>You mean the University of Spoiled Children, as UCLA students call it?  Or are you referring to South Carolina?<br><br>", "<b>Username: hardworking99</b><br><br>Southern California<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> Twoin18:<br>\"\"<br>You mean the University of Spoiled Children, as UCLA students call it?<br>\"\"<br><br>Although USC had the “University of Spoiled Children” and “University of Special Contacts” reputation decades ago, it now has the fourth or fifth highest percentage of students on Pell grants out of USNWR top 25 national universities (23%).  However, UCLA students may still see it that way in comparison to UCLA itself (37%).<br>https://www.usnews.com/best-colleges/rankings/national-universities/economic-diversity-among-top-ranked-schools<br>For comparison, the percentage of students on Pell grants is lower at the other schools in the original list:<br>21% Syracuse<br>14% Delaware<br>13% Tulane<br>13% Wisconsin<br><br>", "<b>Username: TTG</b><br><br>Google New York Times Some Colleges Have More Students from the Top 1 Percent for an article from January 18, 2017. The paper has a pay wall, but readers can look at a small number of articles online for free. That’s a good place to start, as a way of addressing your valid concerns. You are correct there are terrific kids at all schools, AND some can have very stronger cultures that might not appeal to your daughter and would compel her into finding her niche, which can certainly be fine, but perhaps is not the best way to approach finding a school . . . choosing one where one hopes to find a niche outside the mainstream.<br>We have some experience with this. I know a student very well who attended a top national university that appears in this article, did very well, made friends, but transferred to an excellent public university for reasons similar to the concerns you express. Generally speaking, expensive national private universities that do not offer significant financial aid/merit aid to a broad spectrum of students will, as a result, have very affluent student bodies and will be susceptible to the types of things you are trying to avoid. Also generally speaking, I’d say public universities, including the top-ranked ones (Michigan, UNC, Wisconsin, several UCs, William and Mary, etc.), will generally be more diverse, especially when socioeconomic diversity is considered. Also, many excellent private schools give aid to lots of students and are able to build diverse classes.<br>Good luck!<br><br>", "<b>Username: Hapworth</b><br><br>Tulane and USC have around 13% of its student body that comes from the top 1%.  That’s okay for a private school, but it’s much higher than the typical public university.<br>U of Wisconsin-Madison (1.6%), U of Delaware (4.1%).  Syracuse has 8% from the top 1%.<br>The so-called “elitist” schools (something of a pejorative since plenty of kids from wealthy families want their schools to be more diverse and enroll more low-income students) tend to be–wait for it!–the elite private schools: Washington U, Colorado C., Trinity C., Washington & Lee, Colby C., Bucknell C., and so on.<br>Most of the “elite” schools, including Ivies, have at least 15% of its students coming from the top 1%.  Delaware’s 4.1% is pretty high for a public flagship, which as @TTG notes tend to be much more diverse.  I attended a CTCL LAC that has 3.7% from the top 1%.<br>I don’t know.  There are certainly colleges where you can feel the prep school/boarding school/wealthy family vibe, but none of the colleges the OP has listed are in this category.  There will certainly be some of these types at USC, but USC also has 22% that come from the lower 60% of wage earners (families earning under 65K per year).<br><br>", "<b>Username: Twoin18</b><br><br>I’d never heard “Special Contacts” only “Second Chances” though that’s an even more outdated stereotype. However, I would tend to characterize the (handful of) kids who went to USC from our NorCal HS as more privileged than the ones who chose a UC. But it’s an obvious choice for an OOS kid who wants to go to college in SoCal and has a low EFC when there is no need based aid for them at the UCs. So I’d be interested in how the mix of rich and poor kids differs between in-state and out-of-state USC attendees. And probably there are differences between freshmen and transfer admits too.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> Hapworth:<br>\"\"<br>Tulane and USC have around 13% of its student body that comes from the top 1%. That’s okay for a private school, but it’s much higher than the typical public university.<br>U of Wisconsin-Madison (1.6%), U of Delaware (4.1%). Syracuse has 8% from the top 1%.<br>\"\"<br><br>Combining these with the Pell grant percentages, it looks like USC has the most SES diversity out of all of these schools, with the highest from the top 1% and the highest with Pell grant.  Wisconsin may be more concentrated in the upper middle class, with the lowest from the top 1% and lowest with Pell grant.  Tulane appears to have the highest upper SES skew, with highest from the top 1% and lowest with Pell grant.<br><br>", "<b>Username: happymomof1</b><br><br>Truly down-to-earth kids?  Try your own local community college and your own state’s directional public Us.<br><br>", "<b>Username: warblersrule</b><br><br>Opinion of a (former) Pell Grant recipient at a top private university – a high percentage of Pell Grant recipients doesn’t necessarily suggest there isn’t a disparity in student experience. Big cities like LA can get pretty expensive if you go off campus to have fun, as is off-campus housing. For example, UCLA students with bigger budgets can afford to live much closer to campus than students commuting from home or relegated to, say, Palms or Culver City for cost reasons.<br>If you want to study socioeconomic cohesiveness on a college campus, you should also consider things like the percentage of students living on campus, the accessibility and reliability of public transit (or campus shuttles), the cost of living in the area (how much does it cost to go out to dinner with friends or to do a weekly happy hour?), and the cost of events on campus. Elite colleges like Swarthmore often make all events on campus free to students, whereas that is not the case everywhere; $20 for a music concert here and $15 for a play there can add up.<br><br>", "<b>Username: hardworking99</b><br><br>I appreciate all of the insightful feedback. Very helpful! Anyone know anything about the general reputation of the schools’ student bodies?<br><br>", "<b>Username: jym626</b><br><br>Read “the Yale Daily News’ Insiders Guide to Colleges”. Gives perspective from the students’ viewpoint.<br><br>", "<b>Username: Riksor</b><br><br>I don’t know about the others, but I’m applying for UW-Madison and have visited the campus several times. I wouldn’t consider it elitist academic-wise. It’s a good school for academics, but the student body doesn’t really portray that, in my opinion. My friends have gotten in with ACT scores of just 25. It’s a school that’s huge on drinking and parties and athletics, and it has huge pride. It’s not very safe, 1/4 girls have reported sexual assault there. And it’s not super diverse, but the students there are fairly liberal and appreciate diversity.<br><br>", "<b>Username: jym626</b><br><br>The thread title  and OP reminded me (in reverse) of this classic thread from days gone by https://talk.collegeconfidential.com/parent-cafe/688821-should-princeton-be-dd-choice-if-i-want-her-to-hobnob-with-snob-kids-p1.html<br><br>", "<b>Username: tk21769</b><br><br>It’s not reliable to assume that poor kids aren’t materialistic or even “entitled”, or that rich kids are the opposite. I recommend that if you find a college that seems to fit your needs on paper (somewhat regardless of the demographics), then go on an overnight visit and judge the atmosphere for yourself.<br>In light of the schools listed in the thread title, and the original post, maybe the best places to start looking would be among your in-state public universities?<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Parent of recent UW alum. Wisconsin is not an especially diverse state, outside of the cities, and with about 60% of the undergrads being Wisconsin residents, that means the overall undergrad student body is not as diverse as a public flagship for instance, in parts of California. At the same time, there is a fair amount of socio-economic and cultural diversity at UW, in the sense that first gen kids who had not left their small hometown until they came to Madison, are attending UW.  Minnesota residents make up about another another 15% or so of the student body, and the remaining 25% comes from everywhere else, plenty from Chicago suburbs but also from east and west coast. Broadly, kids at UW are mostly “Midwest nice.” In our experience, one of the big “markers” of affluence on a college campus is whether, and what kind of, car a student has on campus. Having a car at UW is not a popular option because parking is pain and in bad weather, students can hop a free bus running a circuit throughout campus – so you aren’t aware of economic stratification based on what kind of car somebody has. My kid was in greek life, which is around 10% of the undergrad student population. For those 3000 or so kids in greek life, that is the core of their social experience, but they are pretty irrelevant to the rest of campus. UW is known for a “work hard play hard” mentality, and game day is something to behold, but it is not generally a place where one is acutely aware of economic differences.<br><br>", "<b>Username: momtogkc</b><br><br>@jym626  That thread was crazy! My favorite part was the boy who chose Princeton because they fed him as opposed to MIT where he was chased by the giant beaver.  =))<br><br>", "<b>Username: notigering</b><br><br>This is great. From @jym626 thread post 273 (refers to another thread):<br>Entitlement (\u0093preppy\u0094) Index for 50 \u0093Top\u0094 (according to USNWR) National Private Universities<br>First number represents percentage of enrolled students who came from private schools. Second number represents percentage of enrolled students who receive no need-based financial aid from the institution. Tie-breaker is the second number. Numbers taken from most recent edition of Princeton Review:<br><br> Georgetown 53/59 112<br> Notre Dame 50/60 110<br> Yale 47/60 107<br> Vanderbilt 40/62 102<br> Tufts 43/59 102<br> Univ. of Penn 43/58 101<br> Johns Hopkins 40/60 100<br> Brown 40/60 100<br> Princeton 45/54 99<br>Duke 34/64 98<br>Boston College 40/58    98<br>Emory 35/62 97<br>Washington U. 39/55 94<br>Dartmouth 38/53 91<br>USC 39/51 90<br>Georgia Tech 18/71  88<br>Harvard 35/52 87<br>Northwestern 27/56  83<br>Stanford 28/54 82<br>Brandeis 30/52 82<br>Lehigh 31/46 77<br>NYU 31/44 75<br>Case-Western 30/45  75<br>Univ. Chicago 30/44 74<br>CalTech 19/43 62<br>MIT 28/28 56<br>RPI 21/29 50<br><br>Modified Entitlement Index (Reflecting Pell Grant Shares) for 50 Top Private National Universities:<br><br> Notre Dame 102<br> Georgetown 101<br> Yale 97<br> Vanderbilt 92<br> Princeton 92<br> Tufts 92<br> Penn 91<br> Johns Hopkins 90<br> Brown 90<br>Duke 88<br>Boston College 87<br>Washington U. 86<br>Emory 82<br>Dartmouth 80<br>Harvard 80<br>George Tech 74<br>Northwestern 73<br>Stanford 70<br>Brandeis 68<br>USC 66<br>Lehigh 64<br>Case-Western 61<br>Univ. Chicago 61<br>NYU 57<br>CalTech 47<br>MIT 44<br>RPI 31 <br><br>Thread: https://talk.collegeconfidential.com/college-life/11033-rich-kid-schools-p4.html<br><br>", "<b>Username: notigering</b><br><br>LACs. Same thread, https://talk.collegeconfidential.com/college-life/11033-rich-kid-schools-p4.html<br>Post 56 by @mini<br>ENTITLEMENT INDEX AMONG 50 \u0093TOP\u0094 (according to USNWR) LIBERAL ARTS COLLEGES<br>The first number represents the percentage of students who were admitted from private schools. The second number represents the percentage of students who do not receive need-based financial aid from the institution. The final number is the \u0093Entitlement\u0094 (\u0093preppy\u0094) Index score. Numbers are taken from the most recent Princeton Review.<br><br> Davidson 52/67 119<br> Washington and Lee 40/73    113<br> Trinity 57/53 119<br> Bates 48/60 108<br> Middlebury 45/60 105<br> Kenyon  46/59 105<br> Williams 46/58 104<br> Univ. of the South 48/55 103<br> Connecticut 48/54 102<br>Colby 40/60 100<br>Skidmore 40/58 98<br>Bowdoin 43/55 98<br>Furman 39/57 96<br>Haverford 39/57 96<br>Amherst 44/52 96<br>Wesleyan 44/52 96<br>Barnard 47/48 95<br>Swarthmore 40/51 91<br>Pomona 40/49 89<br>Whitman 30/58 88<br>Scripps 37/51 88<br>Franklin & Marshall 34/53   87<br>Colgate 30/56 86<br>Colorado 30/55 85<br>Dickinson 38/47 85<br>Sarah Lawrence 31/51 82<br>Hamilton 40/42 82<br>Vassar 34/47 81<br>Wellesley 37/43 80<br>Denison 30/49 79<br>Lafayette 32/46 76<br>Oberlin 34/42 76<br>Bryn Mawr 38/38 76<br>Bucknell 26/49 75<br>Union 27/48 75<br>Gettysburg 30/44 74<br>Claremont-McKenna 27/44 71<br>Carleton 25/45 71<br>Smith 26/44 70<br>Occidental 30/39 69<br>Bard 30/38 68<br>Mount Holyoke 38/30 68<br>Agnes Scott 30/36 66<br>Harvey Mudd 20/45 65<br>Macalester 34/31 65<br>Depauw 17/42 59<br>Centre 21/36 57<br>Grinnell 13/40 53<br>Wabash 8/30 38<br><br>Incomplete data from Holy Cross and Rhodes. Tie-breaker is percentage of students who do not received need-based aid.<br>If you\u0092ve visited a lot of these campuses, you\u0092d likely not find many surprises in this data. The only clear generalizations to be made are that, on the whole, midwestern schools do not seem attractive to private school students (or they simply aren\u0092t accepted \u0096 which I find unlikely), and southern schools (with the exception of Agnes Scott) offer (or need to offer) significantly less than average in terms of need-based aid. One caveat that must be attached to the data is that some schools (some that I know of for sure are Bard, Mount Holyoke, Smith, and Macalester) offer merit-based aid to significant portions of their entering class (as much as 10%) \u0096 some of those students, upon receiving the merit aid award, no longer qualify for need-based aid, and hence wouldn\u0092t appear in this picture.<br>This data picture as always is incomplete. While it reflects \u0093entitlement\u0094 on the campus as above, it does not reflect the impact on campus feel of low-income students. A school could offer lots of rather small \u0093need-based\u0094 grants to attract students away from the competition, without really changing the make up or feel of the campus. (Macalester has a reputation for doing this \u0096 whether it is just or not, I have no idea.) One way to correct for that is to subtract the percentage of students on Pell Grants (with family incomes below 35% of the national average) from the total. All of a sudden, the extremes become more extreme, and the picture (I believe) more clear.<br>Numbers Represent the \u0093Entitlement\u0094 Index minus Pell Grant Shares:<br><br> Davidson 119-6 113<br> Washington and Lee 113-3 110<br> Trinity 119-13 106<br> Bates 108-9 99<br> Middlebury 105-8 97<br> Kenyon 105-8 97<br> Williams 104-9 95<br> Colby 100-7 93<br> Connecticut 102-11 91<br>Univ. of the South 103-13 90<br>Bowdoin 98-10 88<br>Furman 96-9 87<br>Skidmore 98-13 85<br>Haverford 96-13 83<br>Wesleyan 96-14 82<br>Amherst 96-16 80<br>Whitman 88-9 79<br>Swarthmore 91-13 78<br>Franklin & Marshall 87-9 78<br>Barnard 95-18 77<br>Pomona 89-12 77<br>Colgate 86-10 76<br>Scripps 88-14 74<br>Dickinson 85-12 73<br>Sarah Lawrence 82-12 70<br>Vassar 81-12 69<br>Colorado 85-17 68<br>Lafayette 76-8 68<br>Hamilton 82-15 67<br>Denison 79-12 67<br>Wellesley 80-16 64<br>Bucknell 75-12 63<br>Gettysburg  74-12 62<br>Bryn Mawr 76-15 61<br>Carleton 71-10 61<br>Union 75-15 60<br>Oberlin 76-17 59<br>Claremont-McKenna 71-15 56<br>Harvey Mudd 65-12 53<br>Macalester 65-15 50<br>Bard 68-20 48<br>Mount Holyoke 68-21 47<br>Depauw 59-13 46<br>Smith 70-24 46<br>Occidental 69-27 42<br>Agnes Scott 66-26 40<br>Grinnell 53-13 40<br>Centre 57-18 39<br>Wabash 38-19 19<br><br><br>", "<b>Username: circuitrider</b><br><br>^Not at all sure what it is about subtracting Pell grant recipients that would cause the percent of students from private secondary schools to shoot up to 119%?<br><br>", "<b>Username: otisp</b><br><br>Before anybody freaks out over these lists, remember they reflect data from 2002-2003.<br><br>", "<b>Username: jym626</b><br><br>Yes, these are old threads and old lists, but they are a hoot!!<br><br>", "<b>Username: notigering</b><br><br>Yes! And I am not doing the work but wouldn’t be surprised if things haven’t changed all that much…<br><br>", "<b>Username: twoinanddone</b><br><br>Any time someone is paying $70k per year, there are going to be ‘entitled’ students.   I don’t know where they hide them at Wisconsin, but I’m sure they are there.<br>I was very surprised to learn after graduating from college how wealthy some of my sorority sisters really were.  It was pretty easy to figure out that a few had more money than most as they had cars and didn’t work, got to travel over spring break, etc., but it turns out a few were REALLY wealthy.  Miss Porter’s School for Girls wealthy.  Coal Baron wealthy.  My-dad-owns-a-patent-on-ball-bearings-used-on-all-Fords wealthy.  It didn’t change much.<br><br>", "<b>Username: jym626</b><br><br><br><br><br> tk21769:<br>\"\"<br>'s not reliable to assume that poor kids aren’t materialistic or even “entitled”, or that rich kids are the opposite. I recommend that if you find a college that seems to fit your needs on paper (somewhat regardless of the demographics), then go on an overnight visit and judge the atmosphere for yourself.<br>\"\"<br><br>THIS. ^<br>I was thinking exactly this but this poster worded it better than I could.  OP- don’t you have one at WSUTL?  Is that school too “preppy”? Are the students “entitled” or “elitist”?  The truth is, you will find all  kinds wherever. And some of the wealthiest students can be some of the most down to earth. When  one of my S’s attended one of the schools on your list, one of his best friends, who was as low key and down to earth as you can imagine, turned out to come from a very wealthy family.  No one would have known.  She did not reflect it in the least.<br>Those schools are not dripping with hoity toity bluebloods. Your kid will be fine at any of them.  And if not,  it may require an attitude adjustment.<br><br>", "<b>Username: notigering</b><br><br>From the NY times article mentioned on page 1.<br>38 colleges had more students from the top 1 percent than the bottom 60 percent<br>STUDENTS FROM                              THE TOP 1% ($630K+)  BOTTOM 60% (&lt;$65K)<br><br>Washington University in St. Louis                   21.7   6.1<br>Colorado College    24.2    10.5<br>Washington and Lee University   19.1    8.4<br>Colby College   20.4    11.1<br>Trinity College (Conn.) 26.2    14.3<br>Bucknell University 20.4    12.2<br>Colgate University  22.6    13.6<br>Kenyon College  19.8    12.2<br>Middlebury College  22.8    14.2<br>Tufts University    18.6    11.8<br><br>These estimates are for the 1991 cohort (approximately the class of 2013). Rankings are shown for colleges with at least 200 students in this cohort, sorted here by the ratio between the two income groups.<br>https://www.nytimes.com/interactive/2017/01/18/upshot/some-colleges-have-more-students-from-the-top-1-percent-than-the-bottom-60.html<br><br>", "<b>Username: rosered55</b><br><br>I’m also sure there are entitled students at UW-Madison, but no one should be paying $70K per year.  Estimated COA for in-state students, 2018-19 academic year, is $26,000.  Estimated COA for out-of-state studnets, 2018-19 academic year, is $53,000.<br><br>", "<b>Username: NoKillli</b><br><br>My S is a freshman at one of those schools. He has a beater hand-me-down car that is almost as old as him. I warned him there will be others at school with $70K+ cars. I told him to wear it proud and if someone gives him crap, say “why would I drive anything nice in this pothole ridden city?”<br><br>", "<b>Username: newyorkmom2girl</b><br><br>Based on our experience visiting several of the schools you included in your title, we did not perceive them as being full of entitled students (did not visit USC).  You might be trying to narrow down schools so that you don’t have to visit all of them but I would suggest visiting as many as you can once you narrow down - most of the preconceived notions we had about schools were found to be untrue once we visited.  We expected Syracuse to be pretty homogenous and  were pleasantly surpised to see that it was quite diverse and didn’t live up to the stereotypes that we had heard.<br><br>", "<b>Username: moooop</b><br><br>If you are trying to find down-to-earth students, you won’t have to look real hard to find better options than USC, Syracuse, & Tulane.<br><br>", "<b>Username: emptynesteryet</b><br><br>I find it so strange this glorification of anything and everything as long as it isnt: majority, successful, and wealthy in college these days.<br>Success, hardwork, has somehow become a negative thing though we want our kids to go to college to achieve those exact things: engineers, doctors, lawyers, cs majors, etc.<br>Seems convuluted I dont get it.<br><br>", "<b>Username: twogirls</b><br><br>One can be humble, down to earth, unpretentious, etc…and still be wealthy, smart, hardworking, successful, top school, etc.<br>Success etc is not a negative… it’s the attitude portrayed by some that is a negative.<br>OP you will find all kinds of students at the schools you mentioned.<br><br>", "<b>Username: hardworking99</b><br><br>@twogirls I couldn’t agree with you more. It is absolutely not the wealth I have a problem with. It’s the entitled, stuck up, snobby attitude that unfortunately some have. If you have nice things, that’s great. Just be humble about it and not act like you’re entitled and above everyone else. That’s the attitude I am looking to avoid. If one of the schools I originally mentioned has a lot of students who have that type of entitled attitude, that’s what I’d love to know so we can try and avoid or at least know what we’re getting into.<br><br>", "<b>Username: twogirls</b><br><br>Have you visited these schools?<br><br>", "<b>Username: brantly</b><br><br>Just entering the thread … please define entitled and elitist.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> emptynesteryet:<br>\"\"<br>I find it so strange this glorification of anything and everything as long as it isnt: majority, successful, and wealthy in college these days.<br>\"\"<br><br>However, wealth of a student while in college is usually parental wealth, rather wealth earned by the student.<br><br><br><br> emptynesteryet:<br>\"\"<br>Success, hardwork, has somehow become a negative thing though we want our kids to go to college to achieve those exact things: engineers, doctors, lawyers, cs majors, etc.<br>\"\"<br><br>It is not a negative. But an oversized sense of entitlement that some (not all) successful people and their dependents or heirs have can be.<br><br>", "<b>Username: theloniusmonk</b><br><br>“One can be humble, down to earth, unpretentious, etc…and still be wealthy, smart, hardworking, successful, top school, etc.”<br>So you’re saying it’s ok to be wealthy, you just can’t show it, or you have to somehow humbly drive a Mercedes?<br><br>", "<b>Username: twogirls</b><br><br>You can be wealthy, hard working, and successful… and…<br>I am saying you can drive a Mercedes or live in an expensive home… and still teach your kids that they can’t get a new phone “just because.” These wealthy friends… highly paid professionals…teach their kids that they can’t get that new phone… unless they earn some money …somehow… to put towards it. These wealthy friends… despite their wealth… do not want to raise entitled kids. Do you want new shoes? Better use that coupon and look for a good sale. Are you bored? How about baking cookies, selling them at dad’s office, and donating the $20 to xx organization. They also don’t treat people differently depending on their wealth or “status.” The kids of these friends attend very good, and expensive schools… and continue to give back to the community on a regular basis. They also have economically diverse college friends.<br>I also have wealthy acquaintances/ex-friends …who give their kids unlimited use of their credit cards, and who allow them to buy $300 shoes and $1200 watches in HS… for no reason…just because they can. These ex-friends… when they introduce you to one of their friends… will say “this is my friend Sam…he is an esteemed lawyer (true story).” Their daughter will actually get mad if her HS or college friends don’t have $500 to blow on New Years Eve… or money to go to Europe.<br>Another group of wealthy acquaintances … not friends…will always mention to you that their tie costs $600 ( I had no idea that ties can cost $600). Or that they just shopped at ( insert expensive store name) and bought each girl a $400 pocketbook. Again… True story. Oh… and one of their kids thanked her father… on social media… for his money.<br>All three families are wealthy ( I am not, btw). I think the OP is looking for the first.<br><br>", "<b>Username: collegemom3717</b><br><br>Re: posts 20/21/28<br>There have been some changes. As examples, in 2002-2003, Vassar, Williams, Wellesley and Amherst’s ‘entitlement’ scores put them in the middle of the pack, but by 2017, the NYTimes ranked them as some of the most economically diverse colleges in the US.<br><br>", "<b>Username: Empireapple</b><br><br>The only freshman I know who just went off to Syracuse is entitled and spoiled.<br>The only freshman I know who just went off to U of Delaware is definitely elite but he is there on a lot of merit money (although he could be full pay) and he has a lot of good qualities as a person.<br><br>", "<b>Username: jym626</b><br><br>Anecdotes, N of 1 stories are interesting, but they are not data.<br><br>", "<b>Username: austinmshauri</b><br><br><br>\"\"<br>If one of the schools I originally mentioned has a lot of students who have that type of entitled attitude, that’s what I’d love to know so we can try and avoid or at least know what we’re getting into.<br>\"\"<br><br>Syracuse has 22,000 students. That enough to qualify as a large town. It’s similar to the populations of Kingston and Plattsburgh, two actual large towns also in NYS. Is Kingston more elitist than Plattsburgh or is it the other way around? Or are both elitist? Or neither? I don’t see how anyone could know. I think your best option is to visit the schools your daughter is interested in to see if they’re right for her.<br><br>", "<b>Username: 57special</b><br><br>Wisconsin is not considered elitist. Beer guzzling partiers? Maybe, though I know plenty of kids who go there that don’t fit that mold, either. It’s such a big school that you can pretty well find what you want there, whether it be elitist(defined as persons who eat imported rather than doemstic cheese), studious, jock, or what have you.<br><br>", "<b>Username: rosered55</b><br><br>I mostly agree with you, @57special, except that I’d define elitist at Wisconsin as students who eat only Wisconsin-produced cheeses that have won World Cheese awards, U.S. Championship Cheese awards, or American Cheese Society awards.  Some of us here are local-cheese snobs.<br><br>", "<b>Username: blueskies2day</b><br><br>I tend to think the view of others being elitist or entitled is often more an issue with the one viewing them that way, often fueled by insecurity, jealousy or just unfamiliarity with wealthy and/or successful individuals.<br><br>", "<b>Username: twogirls</b><br><br>I think the OP’s child should visit…if possible. Sit in the dining hall… walk the campus… talk to students, etc. This is how she will begin to determine if these particular schools are for her.<br><br>", "<b>Username: prezbucky</b><br><br>As a UW alumnus, I can speak about this directly:<br>You’d be hard-pressed to find a group of more fun-loving and friendly students, on the whole, than you’ll find at UW-Madison. With about 40,000 students you’re bound to encounter all kinds – even some jerks, snobs, hermits – but in terms of overall cooperation and felicity, UW would be hard to beat.<br><br>", "<b>Username: rosered55</b><br><br>I agree, @prezbucky.<br><br>", "<b>Username: waitingmomla</b><br><br>I’m confused about the usefulness of a list that is so outdated, given changes in FA in the past 15 years. Even if it was current, the assumption that private high school always equals privilege is troubling to me.  I know for Notre Dame, @ 2/3 of that “private school” number are Catholic schools.  The same may be true for Georgetown and BC. If you know anything about Catholic elem/high schools, there are many (possibly most) that are among the most racially and socio-economically diverse out there. I wonder if the same is true for charter schools, which also fall under the “private” umbrella? Private high school does not necessarily equate with privileged.<br>Even if you buy into the stereotype that rich person = elitism, you will find people like that at all types of schools. My daughter grew up in a town that is affluent with little diversity.  But she went to the regional Catholic high school, which is VERY diverse racially, culturally and socio-economically.  She learned very quickly that many people could not afford to do the things that the kids in our town took for granted. She was friends with a kid who lived in a hotel room with his dad.  Another friend in whose culture it was typical to keep chickens in their back yard. Other friends who taught her about their experiences with racism. Basically kids she would barely, if ever, have encountered in our public school.  If I think about who was more “elitist” going into college, my D or her friends in our public school (who spent their years with kids very like themselves, and worrying about having the latest Tory Burch bag) – I can guarantee you it wasn’t my D. And none of those other friends attended any of the colleges on the above list. Most of them went to OOS public Us.<br>There are all types of private high schools and all types of public high schools. Both produce down to earth kids, both produce snobs, etc.  Most of that stuff is primarily formed/taught in the home anyway, no matter your personal situation.<br><br>", "<b>Username: drewsmom17</b><br><br>We toured UDel this summer and did not get any kind of snobby/elitist feel from the large group of students visiting or any of the tour guides. From what I know of WI as an East Coaster living in the midwest, Midwest nice is truly a thing. WI the state is gorgeous too. S19 says both have large party reps.<br>The feel at Miami/OH and RPI were very different. I know they were not on your list but using as a comparison for schools we also visited.<br><br>", "<b>Username: sunnryz</b><br><br>I stumbled onto this thread and had to laugh.  My daughter is currently deciding between UW Madison and U Delaware.  She is from Illinois.  I think Madison is her top choice but it is just so darn expensive so we will have to wait to see what the financial package is.  That being said, I found there to be somewhat of an elitist attitude surrounding that school, but not from the students.  Their engineering program is very competitive and felt a little cutthroat to me. And the campus wasn’t even remotely diverse.  Out of 10 tour guides on the engineering tour, all 10 came from Wisconsin.  We will tour Delaware in a few weeks.  I’m curious to see what it’s like.  It’s by far the cheapest option for our family so far so we are hopeful.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> sunnryz:<br>\"\"<br>I think Madison is her top choice but it is just so darn expensive so we will have to wait to see what the financial package is. That being said, I found there to be somewhat of an elitist attitude surrounding that school, but not from the students. Their engineering program is very competitive and felt a little cutthroat to me.<br>\"\"<br><br>https://www.engr.wisc.edu/academics/student-services/academic-advising/first-year-undergraduate-students/progression-requirements/ indicates that students in some majors need to earn a GPA as high as 3.5 technical / 3.0 overall to avoid being weeded out of the major (see “GPA Benchmarks for Progression” on that page).  So perhaps it is not too surprising that some students may be more competitive or even cutthroat as a result.<br><br>"]}