{"title": "vassar vs kenyon", "comments": ["<b>Username: 2019kid</b><br><br>i’m deciding between these 2 for ED1. I’m very into Vassar’s social justice/activist culture, and I was wondering if anything like that exists at Kenyon and whether or not kenyon is too homogeneous for me, someone very interested in diversity/inclusion work and into the PC thing. i want students who are politically active but i’m ok with a school not being too overwhelmingly liberal because i think political diversity is important. Kenyon’s lack of socioeconomic/racial diversity bothers me, but I love the feel of the campus and community and i fell in love w it when i visited. I also want a school w friendly and welcoming students, and I’m wondering if the “wannabe new yorker” population at Vassar gives Kenyon an edge in this department. I would also like to hear about the social scene and student vibes of both colleges in general, and whether or not greek life actually controls the social scene at kenyon, because i’m not into that. any advice on why i should choose either one or just the differences between them would be greatly appreciated!<br><br>", "<b>Username: Dancer41</b><br><br>I’m a parent so take this for what you will. Visited both schools with my daughter and full disclosure am a Vassar grad. My daughter and I found the opposite of what you’re expecting about the students. Vassar students were more down to earth, seemed happy and I would not describe as New York wanna bes. We both found more of a pretentious vibe at Kenyon and not one person looked up or smiled. The folks in admissions, including the student interviewer my daughter met with, were down right rude with a snobby air. Also Kenyon is very isolated so that’s a consideration as well. Poughkeepsie leaves a lot to be desired but the area around campus is nice and NYC is an option although it’s not so close that you’d be heading there every weekend. We saw confederate flags all over the area near Kenyon - a huge turn off for us at least. I know others will have other opinions - maybe we just hit Kenyon on a bad day.  Best of luck.<br><br>", "<b>Username: Publisher</b><br><br>@2019kid: Wow are you mixed up ! Kenyon is the exact opposite of what you write that you are seeking.<br>As a family, we visited Kenyon about a decade ago. Had the same experience as did the above poster @Dancer41.<br><br>", "<b>Username: Publisher</b><br><br>If you like Vassar College, then you might find Wesleyan University interesting.<br>If you like Kenyon College, then consider Colorado College.<br><br>", "<b>Username: Temperantia</b><br><br>I visited Kenyon with my son this summer. I really liked the campus  but it was tough to judge vibe with few students around.  It it does have a more homogenous and moderate reputation.  As OH schools go, it sounds to me like you’d like Oberlin more. Very progressive and diverse.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Visited both with my LAC kid –  visited Kenyon 5 times between college search with my 2 kids, but Vassar only once. Never got a NY “wanna be” vibe at Vassar, felt very down to earth, not pretentious, and I appreciated the formerly-women’s college vibe of a school with no football team and no greek life. Kenyon feels – your mileage may vary – like a place where city, private school kids go. Of course, that is not the only demographic at Kenyon, but it definitely feels more wealthy, more homogenous (and is) than some peer schools. Greek life is about 25% at Kenyon, and though students don’t live in the greek life houses, the housing office designates certain blocks of dorm rooms  for members of specific chapters, so that greek life members live together.<br>So yes, I agree with other posters that I perceive the schools the flip of how you did. But I’m a middle aged mom, so take it with a grain of salt.<br><br>", "<b>Username: elena13</b><br><br>I agree with other posters although we never got to visit Kenyon. D was accepted and we liked a lot we learned about it. However, I was concerned about the lack of economic diversity. You might find this article helpful. About 20% of Kenyon students come from the top 1% of income.<br>https://www.nytimes.com/interactive/2017/01/18/upshot/some-colleges-have-more-students-from-the-top-1-percent-than-the-bottom-60.html<br><br>", "<b>Username: 2019kid</b><br><br>Wow, you read my mind! Wesleyan was my top choice for a long time but my college counselor and parents encouraged me to look at Vassar because from my high school, Vassar is much less of a reach. In visiting I found them to be very similar. I visited Colorado College and got a weird vibe from it, but I’m going to apply early action anyway, because I didn’t like it enough to apply ED. Maybe the weird CC vibe is a sign I should choose Vassar over Kenyon?<br><br>", "<b>Username: 2019kid</b><br><br>That’s a good point. The only problem is that I found Oberlin to be too much of a bubble. I’m one of the most liberal students at my high school and in charge of a lot of the student diversity work, but Oberlin almost felt homogeneous for me and felt like a white hyperliberal bubble where students only adopt liberal views because it’s the norm. I hope Vassar is different than that, but I’m assuming they have a lot of overlap.<br><br>", "<b>Username: apple23</b><br><br>As the one person here who has a child who attends Kenyon, I encourage you to carefully consider my opinion and my daughter’s experience.<br>A little background. My daughter is not a city, private school kid. She was educated in a public school system in rural New England. At Kenyon she has many friends from all sorts of places and backgrounds. While diversity might be an issue, the school has made a serious effort to attract a diverse student body. These efforts have resulted in the most diverse first-year class in the school’s history.<br>Confederate flags. I have driven to Kenyon five times. Not once have I seen a Confederate flag. Do the residents of the surrounding area lean right? Yes. Has that adversely affected my daughter? No. Area residents are friendly, down-to-earth and kind. We have had numerous interactions in local businesses and not once felt out-of-place or unwelcome. The faculty and student body lean left, and there is an active, vibrant social justice element on campus. How do I know this? Because my daughter is part of it. She has participated in numerous peaceful protests, made a trip to North Dakota during her first year to support the NoDAPL movement, and currently lives in program housing with Eco-Kenyon, which is the school’s environmental club.<br>As for a snobby, self-absorbed student body, this simply is not the case. Her experience, and mine when visiting, could not be further removed from this notion. We found happy, friendly students, a helpful, genuine admissions staff, and an overall pleasant atmosphere throughout campus when we initially visited. This first impression has continued to be her experience.<br>Greek life at Kenyon? Yes, it exists, but for those who (like my daughter) don’t choose to join, there are plenty of  alternative social options.<br>My daughter loves her school, so much in fact that after considering the prospect of junior year abroad, she chose to remain at Kenyon. She has had fantastic, inspiring, kind and supportive professors. Her classroom experience has been enhanced by engaging and intellectual peers.<br>So, OP, my advice to you would be to thoughtfully consider what you felt when visiting these schools. As it went with my daughter, Vassar and Wesleyan were both on her list. We visited each more than once, as they were of great interest to her. She also loved Hamilton, even more than these two schools. Ultimately, though, after a deferral ED1 at Hamilton, we visited Kenyon and it rose to the top as an ED2 choice. She couldn’t be happier with her decision.<br><br>", "<b>Username: Publisher</b><br><br>@apple23: I think that everyone reads & respects all of the posts in this thread. It is wonderful that your daughter found a match school. But other posters’ experiences matter as well. In short, Kenyon–a very small rural Ohio LAC with a heavy drinking culture and lack of diversity–is not for everyone.<br>It is noteworthy that, according to your prior posts, that your daughter wanted to major in English which is Kenyon’s strength.<br>If I had to sum up my impression of Kenyon College, I see it as very similar to many New England prep boarding schools. Very similar.<br>P.S. The only reason that I responded to your post is my reaction to your first paragraph which suggests that only you have a true insight with respect to Kenyon College. I have been aware of & familiar with Kenyon for over 4 decades now & two of my best friends in life are graduates of Kenyon (both teach at prep schools). Some people are more perceptive than others & some people are clear on their preferences, likes & dislikes. In sort, everyone’s opinion should be respected & valued in this thread.<br><br>", "<b>Username: homerdog</b><br><br>@Publisher I swear that almost every school has some “drinking culture”. I have yet to meet a college student who says there isn’t a lot of drinking on their campus - whether it is a big school, small school, rural, urban, etc. I have a friend whose daughter is a freshman at ND and her roommate is drinking four nights a week. The dorm is a party. My niece is a freshman at a big ten school. All kinds of drinking. I’m guessing that, at most schools, students can choose to drink or not drink and it’s their own choice. Both my friend’s daughter and our niece have chosen to find like-minded kids in their classes and in club activities and they do not drink. But, yes, Kenyon is rural. Probably about as rural as they get. Lots of kids like that about rural LACs. I’m guessing it’s figured out early on in most kids’ searches if they like that kind of campus or not.<br>We know two kids at Kenyon (both athletes). They don’t drink, have tons of friends, and think the professors are out of this world.<br><br>", "<b>Username: Publisher</b><br><br>Great point. Unfortunately Kenyon College had a few highly publicized incidents involving drinking. There were two deaths, I believe. Passed out drunk & froze to death in a nearby cornfield.<br>I think that while almost all colleges have a large segment of students who drink, some schools have a binge drinking culture often attributed to rural location, small size & isolation. I think that the Kenyon administration has addressed the issue in a forceful manner over the past few years.<br>Kenyon College is actively addressing the heavy drinking culture so things may have gotten better over the past few years. Actually some poster or posters complained a year or two ago, that the crackdown by the administration was too harsh.<br><br>", "<b>Username: Publisher</b><br><br>@homerdog: No need to remain uninformed. Just google “Report of the Alcohol Task Force Kenyon College March 2017”.<br><br>", "<b>Username: homerdog</b><br><br>@Publisher I googled Kenyon drinking and there are quite a few interesting pages including essays written by Kenyon kids who do not drink and a professor who did research on the Kenyon party culture. Again, I really don’t think this is different than any other school.<br><br>", "<b>Username: Publisher</b><br><br>@homerdog: What you choose to believe is up to you. But why not read the report published by Kenyon College by the Kenyon College Alcohol Task Force March, 2017 ?<br>The report contains shocking observations including:<br>“Alcohol is prevalent at Kenyon, with binge drinking a significant concern. The impact of excessive alcohol consumption includes sexual misconduct, vandalism, medical traumas, and long term health effects.” = these are Kenyon’s own words.<br>Also : “there is clearly pressure to drink excessively.”<br><br>", "<b>Username: Publisher</b><br><br>@homerdog: Kenyon College students have died from the results of excessive drinking as well as have suffered “medical traumas”.<br>I think that your posts do a great disservice to CC readers when such a clear authoritative source acknowledging & addressing the drinking problem at Kenyon College is available for all–including you–to read.<br>Why do you think that Kenyon College formed an Alcohol Task Force ?<br><br>", "<b>Username: homerdog</b><br><br>Well, @Publisher I will report back. S19 is going for an overnight next month and he will be on the lookout for how evenings go at Kenyon. And he can ask his host as well.<br><br>", "<b>Username: Publisher</b><br><br>Doesn’t really matter to me what your son does or does not experience while on a short visit to Kenyon College.<br>I encourage you as a parent to read:<br>“Report of the Alcohol Task Force Kenyon College March, 2017”.<br>The Alcohol Task Force members include: (10 members)<br>Two Kenyon College Trustees<br>Three then current Kenyon College students<br>Kenyon College Vice-President for Student Affairs<br>Co-Director of College Counseling<br>A Kenyon College Professor of Biology<br>A Kenyon College Professor of Anthropology<br>A Kenyon College Professor of Sociology<br>I will rely on my own visits & on the report of this committee which concludes that Kenyon College needs to continue closely monitoring binge drinking & excessive drinking on campus.<br>P.S. The Kenyon College Alcohol Task Force was founded in September, 2016. This is a bit disturbing considering the tragic occurrences over the past decade or so at Kenyon College. What took so long ?<br><br>", "<b>Username: Lindagaf</b><br><br>I’m in the Kenyon camp. My D visited both, and deposited at Kenyon. (Ultimately ended up at another school due to WL.) She did not consider applying to Vassar. Personally, while Vassar was lovely, I did think it felt extremely monied. Make no mistake, there are rich kids at both colleges.<br>My thought is that Kenyon is relaxed and creative. The professors are HIGHLY regarded and consistently hold several spots in Princeton Review’s Best Prof list. Students really enjoy classes. I felt that Vassar is a little overly-earnest and artificial. But they are both excellent colleges and it’s probably not a coincidence that many students like them both.<br><br>", "<b>Username: homerdog</b><br><br>I’ve been reading about it for the last hour. Honestly, I think it’s a good thing that the task force is taking it seriously and I hope that many of their plans to help lessen the binge drinking make a difference. I’m not putting my head in the sand. I’m just saying that, even after reading this morning about Kenyon’s drinking issues, these problems exist on many, many campuses.<br><br>", "<b>Username: Publisher</b><br><br>Not to this extent. Everything is relative. It is all a matter of degree.<br>If you were forced to bet a year’s salary, would you consider the odds before deciding where to place your bet ?<br>P.S. What I will write in favor of Kenyon College is that the campus is gorgeous.<br><br>", "<b>Username: Mwfan1921</b><br><br>There are many schools that have created Alcohol/Drug task forces besides Kenyon, such as Lehigh, Dartmouth, Amherst to name just a few. Binge drinking is a pervasive problem at many schools. Some schools have banned hard alcohol on campus as a result of these findings, i.e., Dartmouth.<br>Regarding Kenyon (or any school) the best source (but not perfect) for campus drinking, drug, and rape statistics is the Clery report. All schools have to report these numbers annually. In Kenyon’s case when you calculate average drinking and drug infraction incidence (taking into account size of student body) over last 3 years, Kenyon’s incidence is high relative to many schools of similar size like Hamilton, Bowdoin and Williams. Again, these stats are not perfect and can reflect school by school reporting differences, or even how actively campus police/RAs, etc,  are looking for drugs/alcohol, but it is decent data nonetheless.<br><br>", "<b>Username: Publisher</b><br><br>Everything helps. A main reason that Kenyon suffers so much is its small size & rural location. Several studies have identified the consistencies among colleges with severe binge drinking problems. The three that I recall are: Small enrollment, rural location & large presence of a particular race. Kenyon has all three.<br>P.S. A concern with reporting stats is that the school only needs to report on campus occurrences. The adjacent corn fields, for example, are not included.<br>P.P.S. Interesting post about Lehigh University in another thread. “Lehigh Drops Out of Top 50”.<br>Lehigh University has long had an usually high incidence of substance abuse. Unfortunately, it is–or was–located near a main stopping point for illegal drug shipments according to a federal task force about a decade ago. So the problem is not limited to small, rural, white LACs, but it is much more severe at some schools compared to others.<br><br>", "<b>Username: Mwfan1921</b><br><br>@publisher  Schools have to report off-campus infractions and arrests in the Clery report, so I was including those in my analysis<br><br>", "<b>Username: prezbucky</b><br><br>I agree regarding the similarity between Wes and Vassar.<br>In the Midwest, Oberlin, Grinnell, and Kenyon come to mind – Oberlin and Kenyon for strength in music/humanities and Grinnell for vibe: liberal but friendly, not militant. But all three are in very small towns that would feel much more rural than Poughkeepsie.<br>Macalester might be similar in some ways, and it is in a city – a big city. But it would feel more urban than Vassar.<br>Carleton maybe? But it isn’t really known for outstanding humanities, though being a top LAC kind of implies strength in them. Carleton is liberal but not militant, pretty friendly and down to earth, and 30-45 minutes from a big city. Northfield has a population of about 20000 (vs. Poughkeepsie’s ~30000).<br>St. Olaf has more of a humanities-rich feel than Carleton.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Binge drinking is a problem at many schools, large and small and there have been tragedies at many schools. I can’t recall the source, but I’ve read that greek life, high varsity athletic participation, and rural location each contribute to campus drinking culture. Many students choose not to partake at lots of schools but, like the “how to avoid lax bro culture” in another thread, for students who are looking to avoid a dominant scene, it is helpful to really talk to a lot of students and possibly spend time on campus on a Wed (usually a big party night) or weekend night and see for themselves. Even then, it is hard to put in perspective – my non-drinking high school senior was shocked by the party scene at some schools, but now partakes, usually in moderation, I think. So what a 17-18 year old thinks may change.<br>I was one of the parents who described our experience with Vassar and Kenyon. Kenyon is a wonderful school, wonderful faculty, engaged students. It was the first school each of my kids visited and their first choice early in the process. Eventually, it came off the list, with size and location being part of that decision.  But what was right for them is not a predictor for anyone else. My perception of the student body from visits plus knowing several recent grads and current students, is that there is a sophistication about many of the students that feels “urban/east coast.” I would contrast that with, say, Grinnell, which is also a wonderful school with wonderful faculty and engaged students, but feels more “midwest nice” than “east coast cool.” Of course, there are students who don’t fit that description at either school. Your mileage may vary.<br>For folks who know, I have been genuinely curious about how the Kenyon greek life housing clusters feels to non-greek life students and whether the chapter houses can be used for parties or not.<br><br>", "<b>Username: wisteria100</b><br><br>I’m going to agree with @Publisher in that while all colleges have drinking, there are some where it is much more problematic.  The same goes for drugs. You can find them anyplace, but at some schools it may be a little pot, while at others it’s the hard stuff being dealt and imbibed on a much more frequent basis. There are definite differences in drug and alcohol climates at different schools.<br>I’m going to have to disagree with the lovely @Lindagaf on Vassar. V has more economic diversity and is less monied than most of her peers. But I do think her ‘over earnest’ comment has merit.<br><br>", "<b>Username: pishicaca</b><br><br>“Alcohol is prevalent at (insert college name here), with binge drinking a significant concern. The impact of excessive alcohol consumption includes sexual misconduct, vandalism, medical traumas, and long term health effects.”<br><br>", "<b>Username: merc81</b><br><br><br><br><br> Publisher:<br>\"\"<br>I think that your posts do a great disservice to CC readers when such a clear authoritative source acknowledging & addressing the drinking problem at Kenyon College is available for all–including you–to read.<br>\"\"<br><br>You’ve called attention to internal documents, not a comparative report. Kenyon’s purpose in this case was to look directly, honestly and even harshly at their own institution for the determination of needed change. This should be regarded as a positive development. The analysis – though I haven’t read it fully – does not appear intended to compare Kenyon to other colleges by the standards of social science. For the purposes of this thread, which requires meaningful comparisons across institutions, the documents would seem to provide little insight.<br><br>", "<b>Username: Publisher</b><br><br>@merc81: If you need a comparative report, just look at the Clery report cited in post #22 above.<br>Also, it might help if you read Kenyon College’s “internal report”. I think that you might rethink your comments posted above.<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>Also, it might help if you read Kenyon College’s “internal report.”<br>\"\"<br><br>Yes, I should read it fully. Readers of the thread can consider that I haven’t as of yet when considered my comments.<br><br>", "<b>Username: collegemom3717</b><br><br>Have you visited Vassar? did you feel that it had a ‘wannabe New Yorker vibe’ that was less welcoming than Kenyon? If you haven’t visited, I would get my skates on and visit before committing to a school ED- the cost of a quick trip will only be a fraction of the cost of a getting there & finding you aren’t happy!<br>@prezbucky’s list is a good summary of ‘usual suspects’! There is a lot of applicant overlap between them.<br>IMO, the crucial thing about these schools, which appeal to so many of the same kids, and which are similar in so many fundamental ways, actually do ‘feel’ very different (as you can see from the above posts).<br>I knew- before my collegekid did- which of these schools she would end up choosing, b/c I saw how she responded to it, viscerally, at re-visit day. She hadn’t even been that keen to go that day- she had already visited the school, done an overnight, sat in on a class, etc, and figured she knew pretty much all she needed to know (plus, it was the last of the re-visits & she was burning out). Her response to the day was just different than to the other schools: it was clear that she felt at home there, in a way that she had not at any of the other, pretty similar, schools.<br>tl;dr: Go with your instincts- where did you feel most at home? Both schools are very campus-centric- that will be home for a long 4 years. Trust yourself.<br><br>", "<b>Username: 2manycollegequestions4me</b><br><br>I’d like to chime in and just share my daughter’s experience— she is currently a freshman at Kenyon. We live in Ohio and most of the students at her high school chose to attend OSU, OhioU, Miami U or Dayton. The drinking/party culture at those schools did not appeal to her and she was looking for a very different college experience. Vasser, Grinnell, Carleton were all on her list— she was looking for many of the same things the OP noted. I will tell you so far, she has nothing but excellent things to say about Kenyon— she absolutely loves it. She says there are plenty of things to do on the weekend besides go to parties… often times so many different things that she has to choose one over the other when she’d like to do both. And in addition, my introverted kid says she actually enjoys going to the parties on campus… they are fun, “people actually dance” lol her words, and sometimes she chooses to have a beer and other times not. No one cares either way. She’s an athlete and enjoys hanging out with the team, but also has other friends she goes out with as well. She is busy all the time… I wish she’d call more! We are extremely close so it’s an adjustment not hearing from her every day but I am so thankful she is loving Kenyon as much as she is and is not homesick (yet at least!) I know it’s still early, but I honestly didn’t think the adjustment to college would be so smooth. She says it is an incredibly supportive community and the people there are very down to earth, interesting and like minded when it comes to being serious about genuinely learning new things etc.<br>Interestingly enough tonight when I called she had just come from a mandatory meeting at her dorm (bi monthly I believe) called beer and sex LOL where they talk about drinking responsibly on campus etc. So it seems the administration is not blind to what from my perspective seems like “average” college drinking… but then I’m comparing it to what I know about schools like Dayton and OU… where drinking is pretty much the only weekend activity available. Just the perspective of one student… but this was a thread I would have stalked like a hawk a year ago when we were looking, and I am so glad she made the decision to attend Kenyon— So much so my middle child is considering it after seeing how happy her big sis is.<br><br>", "<b>Username: Hapworth</b><br><br>To the OP (if still in the building?),<br>Both Kenyon and Vassar are excellent schools.  You seemed to like both.  And, yes, despite its isolation, Kenyon’s campus is gorgeous (Vassar’s is no slouch either).  What do young people call it?  Hogwarts-like?<br>Unless something seriously knocks either school out of contention between now and November+, apply to both.  If you’re accepted at both, and both remain top choices, you’ll have a chance to take even closer looks, read up, make contacts even.  Ultimately, you’ll feel one more than the other.  There are no wrong choices here.<br><br>", "<b>Username: collegemom3717</b><br><br>@Hapworth, OP was talking about applying ED- hence the need to choose.<br><br>", "<b>Username: Publisher</b><br><br>Wall street Journal/ Times Higher Education College Rankings published September 6, 2018 show starting salaries after graduation at:<br>Vassar College–$49,267<br>Kenyon College–$44,233<br><br>", "<b>Username: merc81</b><br><br>Median Starting Salary of Alumni<br>Kenyon: $48,600<br>Vassar: $47,500<br>https://www.usnews.com/best-colleges/kenyon-college-3065<br>https://www.usnews.com/best-colleges/vassar-college-2895<br>(U.S. News, 2018.)<br><br>", "<b>Username: Midwestmomofboys</b><br><br>To the OP:  have you done overnights at both? Visited class, met with students or faculty in activities/departments of interest? What we are saying is: both are great schools, a lot of overlap in culture. Vassar can be accessible to NYC and the eastern seaboard, which can be a plus for some, while Kenyon is very much a self-contained residential community, which is part of its charm for others. Vassar does not have a history of football or greek life, whereas Kenyon has several teams that are ranked nationally in the top 10 and which hope to win a national championship, including swimming and diving and Men’s soccer, and it has greek life.<br>If you felt a deeper connection to one, after full visits, then go with your heart.<br><br>", "<b>Username: Publisher</b><br><br>Apparently the WSJ/THE salaries are not starting salaries: “The Salary column is earnings 10 years after entering college, reflecting multiple years of data, while the Default Rate shows the percentage of people in default on their loans after their repayment period begins. These salary and debt data are available only for people who had federal aid.”<br>The Default Rate for Kenyon College = 2.0<br>The Default Rate for Vassar College = 0.3<br><br>", "<b>Username: TheGreyKing</b><br><br>Both are great options! You can pick by personal preference, since you can’t go wrong either way.<br>I never visited Kenyon, though it sounds great. I know both older and recent Vassar alumni very well (husband and friends, plus a young relative who is a recent grad), and I have spent time on campus recently.<br>You asked about the social feel. Vassar has a really nice social environment. People are friendly and intellectually oriented, and people tend to form lasting friendships, especially with people in their dorm.<br>Its legacy as a former women’s college may contribute to the fact that not only does it not have any actual frats, but overall it has an inclusive feel to it and not much of a good-old-boy contingent. It is the polar opposite of a frat-dominated college.<br>Theatre is big and wonderful at Vassar. So is social justice. But you also can find kids who love sports and all types of other interests.<br>Vassar also is often identified as having some of the best financial aid in the nation and as making big efforts to increase socioeconomic diversity.<br><br>", "<b>Username: 2019kid</b><br><br>Thank you to everyone for the advice! I just got back from an overnight at Kenyon and had an amazing time; I felt right at home and knew I would fit in well at the school. I think a lot of the reason I love Kenyon is that I went during admissions programming: a full day spring open house for juniors and an official fall overnight program in which there were many prospective students and many events and meet and greets that helped me make friends with students right away. Kenyon admissions does an amazing job. I will still do an overnight at Vassar just to see what it’s like, because the lack of diversity at Kenyon was noticeable and Vassar seems better in this department. My experience at Vassar will be different since I have only been to a Friday morning tour & info session & during my overnight there won’t be any special programming, but I’m sure Vassar will still be great. Ultimately I will probably apply ED1 to Kenyon because of my love for the school and gut feeling, but I still want to give Vassar a try and will apply regular to the schools mentioned (Grinnell, Carleton, Colorado College, Wesleyan, Bates, Macalester, etc.) so I hope I’ll have some good options.<br><br>", "<b>Username: Publisher</b><br><br>No “axe to grind”. Kenyon College’s issues with respect to drinking have been well publicized for years after the death & near death of some students . At least one found dead in nearby corn field. Kenyon administrators also acknowledge that it is an ongoing issue of a serious nature.<br>Kenyon’s campus is beautiful, but small.<br>And, yes, heavy drinking is not uncommon at small, rural, isolated colleges.<br><br>", "<b>Username: 2manycollegequestions4me</b><br><br>Regarding the statement “heavy drinking is not uncommon at small, rural, isolated colleges.”<br>This is true, however the thing to keep in mind (and look for if you are trying to avoid a school with a party/drinking culture) is does the college provide other opportunities on the weekend AND are they well attended. Kenyon’s plays sell out on Saturday nights, and my daughter has gone to several improv shows. They are standing room only—the students attend these activities! Rocky horror picture show, Harry Potter themed fun, a game of murder mystery held in one of the commons are all activities she has mentioned just in this first semester. Of course many kids go to parties afterward (my daughter usually does one of the two weekend nights) but being an athlete she sometimes turns in early or just hangs out in a friend’s dorm after going to the campus activities.<br>I went to an unranked small catholic college myself, and there were never activities offered on campus like that… or if they were, hardly anyone went. That is the key to look for in my opinion if you have a child who wants to do more than go to parties every weekend. Look to see what the college does offer, AND do the students attend! I tend to think because Kenyon is so rural that administration makes a conscious effort to provide opportunities on the weekends. Schools that have a big city near by often times don’t bother because so many students just leave campus. Another reason that small/rural can contribute to a real sense of community. At least that has been my daughter’s experience so far.<br><br>", "<b>Username: apple23</b><br><br>The tragic Kenyon death that @Publisher continuously refers to occurred in 2005. That’s quite long ago, and much has changed at the school since then with respect to substance use awareness and education. As parents of current Kenyon students, @2manycollegequestions4me and I have seen our daughters have great social experiences while taking advantage of many extracurricular opportunities that do not involve alcohol.<br>Drinking related tragedies happen every year on college campuses. Do we paint Penn State, Clemson, Lafayette, Middlebury, Boston University, University of Chicago and UC San Diego all with the same broad stroke, and without consideration of circumstances and statistics? All of these schools have had students die in alcohol related incidents since the 2005 death at Kenyon. Note also, they are not all LACs in rural locations.<br>Again, any student death is a tragic occurrence. However, I think we need to keep the Kenyon incident in perspective.<br><br>", "<b>Username: Publisher</b><br><br>There was more than just one incident even though just one death.<br>Do not blame this on me. Just read the recent report by Kenyon College if you think–incorrectly–that this excessive drinking problem has been resolved.<br>The problem is ongoing according to Kenyon’s own report.<br>P.S. Ignoring a problem does not make it go away. Kenyon College profs & administrators are doing the right thing by seeking solutions for this issue.<br><br>", "<b>Username: merc81</b><br><br>Unless Kenyon’s problems can be shown to be worse than the problems on other campuses, then I don’t see how they would be particularly relevant to a student choosing among colleges. Unfortunately, with respect to this, you will find plenty of schools to discuss: http://compelledtoact.com/Tragic_listing/Main_listing_victims.htm.<br><br>", "<b>Username: 2manycollegequestions4me</b><br><br>@merc81 I agree. Frankly, the only reason why we are talking about it is because the administration has put it out there as they are proactively addressing the issue. So many other colleges choose to sweep it under the rug and then it fails to be a topic of conversation on these threads. @apple23 And myself both have daughters who are not partiers and who were specifically seeking something other than that when choosing a college. It was a big factor in my daughter’s decision as she wanted a place where she would fit in and find people she had things in common with. Whether or not students do choose to drink on the weekends, you will find that the typical Kenyon student did not come to Kenyon to party. She has met bright, articulate, friendly, warm, welcoming people there who are interested in thoughtful discussion rather than simply making small talk.<br><br>", "<b>Username: Publisher</b><br><br>The post above noted\" the only reason we are talking about it is because the administration has put it out there as they are proactively addressing the issue.\"<br>We are discussing this because of the publicity that arose after the death of an intoxicated Kenyon College student who passed out & froze to death in a nearby/adjacent to campus corn field that led to the revelation that this is and remained/remains a serious issue at Kenyon College.<br>Whether one wishes to label this as “proactive” or “reactive”, it is important to applaud the efforts & concern of the Kenyon College administrative staff, professors and students as reflected in the:<br>Report of the Alcohol Task Force Kenyon College March 2017.<br>The above report is available pursuant to a Google search.<br><br>", "<b>Username: merc81</b><br><br><br><br><br> Publisher:<br>\"\"<br>We are discussing this because of the publicity . . .<br>\"\"<br><br>Have you looked at the schools that appear in the link in reply #47? You could post about any of them. But note that the publicity surrounding these occurrences bears little or no relationship to their comparative frequency or deeper causes. For that, you would need the methodology of the social sciences.<br><br>", "<b>Username: privatebanker</b><br><br>Niece at Vassar. She loves it but says a lot of weed. Not her thing. But overall absolutely loves it and is also driven by social justice issues. And she is from Manhattan and they rarely go into the City. So much going on for her. But perhaps others do more regularly. I wouldn’t know.<br>I have no insight into Kenyon but it sounds fantastic too.<br>Drinking culture is pretty much everywhere. I think the school releasing a report and putting a light on it, probably has had a positive impact. It’s quite honorable they placed principals above negative reaction.<br><br>", "<b>Username: Publisher</b><br><br>@merc81: Kenyon College’s Alcohol Task Force was found in September 2016 to consider and recommend strategies for the Kenyon community to address the high-risk practices and behavior related to the presence and consumption of alcohol on campus.<br>Rather than guess, why not read the Kenyon College Alcohol Task Force Report of March 2017. It will be easy to cherry pick quotes supporting one’s position but the merit is in the totality of the effort.<br>Again, I find this to be an admirable reactive effort.<br>Of course, there is alcohol consumption on almost all college campuses, but it is a more dominant culture on some campuses than others. I believe that it was a Harvard study that defined the major risk factors/prototype schools. Kenyon fits the profile in theory & in fact. Doesn’t mean that every student drinks or drinks excessively or that anyone is forced to drink. On the other hand  ignorance is bliss.<br>P.S. I do not know why this thread was revived by a poster who opened an account to do so. In my opinion, this thread has served its purpose–and has been very informative based on the outside sources referenced.<br>And, FWIW, the culture continues as reported by the son of a frequent poster who recently visited Kenyon on an overnight visit.<br><br>", "<b>Username: emptynesteryet</b><br><br>My opinion on Kenyon drinking is it felt like a very big thing. Our tour guides talked about the parties, talked about stumbling across campus as security would call out their name, “you okay XXXX”, “I’m fine…” as they went back to their rooms.<br>All the LAC except the very Christian LAC (expelled if caught dry campus) had a big drinking or dug/drinking culture. The only other schools that did not seem to were commuter type schools like UTD.<br>They are adults and will have to make their own choices. Good luck to all.<br><br>", "<b>Username: maringuy</b><br><br>I’m happy for the OP that they chose to apply ED1 to Kenyon. It’s a wonderful school. I wanted to post something on this discussion because I feel that there’s some misinformation being put out here, or at least information that doesn’t jibe with my own experience.<br>I looked at Vassar early on in my college search. It’s a great school, but it felt too much like the private high school I attended in San Francisco. That’s a personal perspective, obviously. My high school teammate is now playing at Vassar and loves it.<br>My final college choices were Oberlin, Carleton, Macalester, Bates and Kenyon. All great schools. Of these, Kenyon felt the most comfortable for me. I’m interested in the humanities (a likely English major) and Kenyon’s offerings in this area seemed to be the strongest of those colleges. I loved the look of Kenyon’s campus, and after 4 years of high school in the middle of San Francisco, I was also attracted to the rural setting of Kenyon.<br>As to the drinking culture at Kenyon, some of what’s being presented on this thread doesn’t ring true to me. Of course, there is drinking at Kenyon. But I have never felt pressured to drink, there are many students who do not drink, and I have rarely seen anyone out of control at a party. In fact, Kenyon students seem especially attuned to the dangers of excessive drinking, and we are all educated about the known linkages between alcohol consumption and other problems like sexual assault. I think Kenyon’s administration does a great job in this regard.<br>As to Kenyon’s Greek scene, I think this may be misunderstood unless you’ve experienced it up close. Kenyon’s Greek organizations are more like community service clubs than traditional fraternities and sororities. Yes, most of the Greek organizations throw parties, but they are open to the whole Kenyon community. Fraternities and sororities at Kenyon don’t live together (generally) and I’ve always found them to be quite inclusive even if you’re not a member. I think they add a lot to the campus social scene.<br>The assertions on this thread that Kenyon has problems with alcohol consumption are untrue in my experience. I’d suggest - respectfully - that unless you go to Kenyon, or are an alum, parent, or employee, then perhaps you don’t have the highest-quality information to report.<br><br>", "<b>Username: CAtransplant</b><br><br>@2019kid I’m curious, did you ultimately apply to Kenyon ED? I never saw this thread previously but I went to Vassar a million years ago and loved it. I can’t compare it to Kenyon as I’ve never visited, but I did visit Vassar with my D20 and it still seemed like a great place to me.<br><br>", "<b>Username: 2manycollegequestions4me</b><br><br>@maringuy As a parent of a first year, I agree 100% with your assessment. When my daughter was first looking at colleges she was turned off if a campus had a heavy Greek presence. She even questioned Kenyon early on when she read that 1/3 of students participate in fraternities/sororities. She ultimately decided it was a non-issue when she heard from several students things like “The frat guys here are poets” LOL. It turned out to be an accurate description and she has gone to several “all campus” parties thrown by the fraternities. Where on earth can you find fraternities that invite the whole campus? <br><br>", "<b>Username: ichibanmama</b><br><br>As a parent of a current Kenyon student - my son doesn’t drink on campus, that’s not this thing. He enjoys the school very much. I think it is up to the person after all who makes decisions! His first roommate transferred after one semester, so obviously it’s not for everyone, but he and his circle of friends sure loves it there.<br><br>", "<b>Username: ichibanmama</b><br><br>@2019kid I don’t know if the owner of this thread is reading this any more, but my son is very heavily involved in diversity groups such as men of color etc. He has been the DA (Diversity advisor I think)  Very social justice oriented since his HS days. You can ask me questions (and I’ll ask him) if you have questions. I don’t know when you have to accept your decisions and maybe you already have chosen one, but I happened to see this just now. Sorry.<br><br>"]}