{"title": "cornell full price vs virginia tech oos", "comments": ["<b>Username: Gudmom</b><br><br>My daughter got into every engineering school that she applied to, and received merit aid from all but Cornell and Virginia Tech. The price differential is $30k even with OOS tuition at VT; she could also choose RPI, Case Western for roughly the same as VT. She had her heart set in Yale, and it was the only school she DIDN’T get into.<br>Please help me talk her Dad doennoff a ledge ((Cornell alum) he wants her to go, he doesn’t want to pay. ?? She doesn’t like Cornell all that much.<br><br>", "<b>Username: Gudmom</b><br><br>ALMOST every school<br><br>", "<b>Username: PurpleTitan</b><br><br>Why not RPI or Case?<br>I’m not sure how much outsiders can help you with hubby.<br>So what choice would he make? What does D like? Who likes what for what reasons and how much are you willing to pay?<br><br>", "<b>Username: patatty</b><br><br>What doesn’t she like about Cornell?  The weather?  RPI and Case will have similar weather. One great thing about Cornell engineering is that it is 50% female, which is unusual for an engineering school. My D is a freshman MechE major at Cornell and absolutely loves it.  Cornell has so many opportunities to get involved, especially for engineers. She is heavily involved in one of the big project teams, which had given her a great network of friends from all years, as well as real hands-on engineering training.  Cornell has a very strong alumni network as well, especially in the NY area.  I’m an alum myself, and spend a lot of time mentoring recent Cornell grads who want to go into my field. D also looked at RPI but was wary of the lopsided gender ratio, and its extreme tech focus (even the \"liberal arts’ requirements are tech classes).  I don’t know much about VaTech. $30K is a big chunk of money though - only you can decide whether it will be worth it.<br>Edit -  Is that $30K total or $30K per year?  If that is per year, then that is a much bigger consideration - not sure Cornell is worth $120K more over those other schools.<br><br>", "<b>Username: MYOS1634</b><br><br>If her father isn’t willing to pay then he gets no say.<br>If he doesn’t pay, can you afford Cornell out of income and savings?<br>(DO NOT take on parents loans for Cornell just because dad is pushing for it!)<br>If you can afford Cornell: has she visited? Or does she dislike it because it’s Dad’s alma mater?<br>If she doesn’t like Cornell, what’s your rationale as to why you’d pay for her to go there?<br>Case would be a nice compromise - nice urban area, private university, excellent for STEM, variety in class offerings, less skewed m:f ratio than at RPI.<br>Then again, RPI is a powerhouse in STEM - in case academics matter most to her their focus is clear and strong. (The city it’s in isn’t the best and the m:f ratio is really skewed but the reputation in industry is great).<br>See if she can do overnights at Vtech and Case. It’ll clear things up: does she prefer a city or a college town, etc.<br><br>", "<b>Username: Gudmom</b><br><br>We (Mom and DD) visited VT and loved it. Dad hasn’t seen it. He also ruled out Northeastern because “you don’t pass up an Ivy for $10K a year merit”.<br>He favors RPI because he went there undergrad and Cornell fo his MEE or however you engineering people say that.<br>She didn’t like Troy, especially since he has described it as “a pit”, and the lopsided ratio and the strictly STEM curriculum are concerns. She LOVES books; her Yale essay was about the library having a Gutenberg Bible. She got $25.5/yr from them tho so that is a chunk.<br>VT is $42k vs. $72 for Cornell, and yeah, that is per year. My husband is just freakingnout because we didn’t realize the EFC in the CSS was PER CHILD. Our son is at UMiami in half tuition butnits still $45+ and we have a multiply handicapped 10 yr old that we are moving to private school in the fall because her public school isn’t providing services. Long story, sorry!<br>Bottom line- husband is torn because he is proud of her for getting accepted, and because he works with a ton of two-engineer families who have their kids at MIT and Princeton…they have been congratulating him and assuming he will send her there. I don’t work, and can’t really because of my youngest. Big difference.<br>I think my daughter would be happy with VT. It’s #14 vs Cornell’s #10. So I guess I just want people to give me Support that VT is a very fine school for either EE or MechE…and that her job prospects will be much the same. And since we missed the Hokie Focus weekend (funeral) get Dad down to take a look.<br><br>", "<b>Username: MYOS1634</b><br><br>Send a letter to Cornell Financial Aid highlighting the situation with your 10-year old. You’ll have to provide pretty detailed information so it might feel intrusive. However a medical situation and having to send a disabled child to private school for accomodations as well as costs associated with disability CAN be taken into account and may result in Cornell offering a bit in financial aid.<br>Also, are you sure you input the fact you’d have TWO in college (UMiami + daughter) in the CSS Profile? Check.<br><br>", "<b>Username: Gudmom</b><br><br>Thanks<br><br>", "<b>Username: mikemac</b><br><br><br>\"\"<br>I think my daughter would be happy with VT. It’s #14 vs Cornell’s #10<br>\"\"<br><br>As an engineer your husband should understand there is no discernable difference in the engineering education she will receive as these schools<br><br>", "<b>Username: PurpleTitan</b><br><br>There will be differences in opportunities outside of engineering.<br>So what about Case?<br>Is she guaranteed her major at VTech?<br><br>", "<b>Username: Gudmom</b><br><br>None of us have seen Case. I haven’t found a reasonable flight to Cleveland and it’s an 8 hr drive. She only applied because I told her my friend had seen it and liked it. She wants to see it, and I feel like it may help her feel like she is CHOOSING VT. But really? I hate the idea of going all the way to Cleveland for her to look around and say “yeah, it’s kind of noisy here. I like VT better”<br><br>", "<b>Username: Gudmom</b><br><br>Also Case is much lower ranked and $10K more per year.<br><br>", "<b>Username: PurpleTitan</b><br><br>Honestly, USNews rankings are definitely NOT a perfect metric.<br><br>", "<b>Username: sevmom</b><br><br>Has your daughter looked into Hypatia, the living-learning community for female engineering students at Virginia Tech? I had a son at VT. He loved it there. Just anecdotal, but my son had a female Cornell engineering student on his team for an internship. They were both offered full time positions at graduation. VT has a very large Career Fair. There are  detailed post grad surveys available  online and VT engineers are very well recruited by many different companies. Of course, Cornell is an excellent choice as well. Any of these schools will provide an excellent education. She may do best at the school she feels most comfortable at, which may not end up being where others think she should go or want her to go ! Good luck with the decision!<br><br>", "<b>Username: SouthFloridaMom9</b><br><br>This is just my opinion, but I bet she’d be very happy at VT.  My niece is graduating from there in a month (tears!) - after my sister her mama (a quarter century ago LOL).<br>They both love VT with all their hearts.<br>It’s a thing, truly!<br>JMO, again.<br><br>", "<b>Username: sevmom</b><br><br>“She doesn’t like Cornell all that much.”  That is significant when there are so many other good schools out there.<br><br>", "<b>Username: N2TheFuture</b><br><br>@Gudmom   Wow.  I feel like your post is directed right for us.  Background: S’s grandfather went to Cornell for CE.  Other grandfather went to VT for ME.  Father went to VT for ME and Mom for business.  Some of his good friends are going to UMD.  He has been accepted to Cornell, RPI, VT, and UMD with merit/honors recognition at all except Cornell.  Cornell COA $72k, VT and RPI $40k, UMD $22k per year.  We have visited all schools.  Everything everyone says about the individual schools above is true.<br>Sounds like your D is not that into Cornell or RPI.  Then it should be a no brainer for her; Case or VT.  It sounds like if she went to Cornell or RPI; it would be for the benefit of her Dad and not her choice. My S is still figuring it out, but he has no issues admitting VT is the prettiest campus out of all of them…including Cornell.  Cornell has the “old feel” to it and it is definitely pretty, but for him the Hokie Stone everywhere is awesome and the dining halls are incredible.  If she is an outdoors person, VT is a wonderful place.<br>I would suggest saving your money for undergaduate (especially if that is where she is leaning) and have her apply to Yale for graduate work…all that would be less than 4-yrs at Cornell.  That is likely what my S will do.  I have this feeling he will stay IS and go to UMD and get a great degree in engineering.  He has always been a more urban/metro area type anyway.  Then if he can prove himself, he will apply for grad school at Columbia/Berkeley/etc.  Again urban type.<br>I dunno but for me 4-yr UMD/VT and 2-yr Columbia/Yale is &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; 4-yr Cornell and potentially STILL LESS $$$.<br><br>", "<b>Username: LuckyCharms913</b><br><br><br>\"\"<br>None of us have seen Case. I haven’t found a reasonable flight to Cleveland and it’s an 8 hr drive.<br>\"\"<br><br>Set up a Monday visit to Case. Visit with both parents, if you can bring or arrange coverage at home for your 10 year old; otherwise just one parent will do. Leave on Sunday morning, share the driving, have dinner in the Italian area close to Case, maybe drive around Cleveland, which is an interesting city. Stay overnight, visit Case the next morning. You can be back on the road by 12:30 and home before 10 PM. It’s a fine school and worth it to visit IF the extra $10,000/year isn’t a deal breaker. If she decides on VT, which is also a fine choice for engineering, you are right that she’s “choosing” it. Plus you get to spend a couple of days with her, which won’t happen that often once she leaves for college.<br><br>", "<b>Username: sevmom</b><br><br>Hard to go all the way to Cleveland and not see The Rock and Roll Hall of Fame!<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> Gudmom:<br>\"\"<br>he wants her to go, he doesn’t want to pay.<br>\"\"<br><br>Well, why doesn’t he put his money where his mouth is?<br><br><br><br> Gudmom:<br>\"\"<br>She doesn’t like Cornell all that much.<br>\"\"<br><br>If that is the case, and it is much more expensive, then it does not make much sense for her to go there.<br><br><br><br> PurpleTitan:<br>\"\"<br>Is she guaranteed her major at VTech?<br>\"\"<br><br>That’s the main issue with VT.  She needs to earn at least a 3.0 GPA as a first year general pre-engineering student to be assured of her choice of engineering major.  Otherwise, those engineering majors which have space available are competitive by GPA.  https://enge.vt.edu/content/dam/enge_vt_edu/undergraduate/com_requirements/COM_GE.pdf<br>For what it is worth, Cornell requires engineering students to earn a 2.5 GPA to enter their majors.<br>It does not look like RPI or CWRU have any special requirements to declare or change engineering majors based on a glance at their web sites, but you should verify with the schools by asking directly if you cannot find anything on the web sites.<br><br>", "<b>Username: sevmom</b><br><br>VT requires a 3.0 to be guaranteed first choice major after general engineering. Most get their choice of major and a kid who also got into Cornell should be able to meet that threshold.   Of course, you never know for sure on that. But there is a good support system if needed.  And plenty of companies that recruit there, both regional and national, loyal alumni , and great school spirit!<br><br>", "<b>Username: thingamajig</b><br><br>I don’t know about VT, but as an alum, i believe no one should go to Cornell that doesn’t absolutely want to be there. it’s too hard, otherwise. Good luck to your family!<br><br>", "<b>Username: STF4717</b><br><br>She will get an excellent education at VT.<br>She likes VT.<br>VT is more affordable.<br>What more does dad need to know???<br><br>", "<b>Username: Creekland</b><br><br>I’m having a tough time comprehending why a college she doesn’t particularly like is even still being considered, especially when it’s more expensive.  It’s her life and VT is an awesome option (says the gal who is a VT alum and married to a VT alum engineer).  Even if that latter part weren’t true, I can’t fathom making a youngster go somewhere they don’t like unless it absolutely had to be done because of finances (being less expensive).<br>Again, it’s her life and VT is a terrific option.  Shouldn’t she get to make the final choice?<br><br>", "<b>Username: sevmom</b><br><br>Agree. Why is Cornell even still on the table if she doesn’t even like it?  If it were a cheaper instate school (SUNY), might still be worth being in the mix to keep  costs down,  but Cornell is more expensive than her  other options for the family…I’m not getting why a school that is substantially more expensive, that a kid doesn’t even like, is still under consideration. It is usually the teenager that is pushing for the more expensive, elite school!  Not the parent.  Good luck with the final decision!<br><br>", "<b>Username: Gudmom</b><br><br>Because When she didn’t get accepted to Yale, Cornell because the “At least I got into Cornell, and it’s still an Ivy” School. That is, she resisted Dad’s initial assumption that Of COURSE she would go to Cornell, but then when he started flip-flopping on cost, she got frustrated and defensive. Cornell wasn’t her dream school, but she was warming up to the idea of going to an Ivy that wasn’t Yale. But she still wanted to see Tech.<br>Ok, so we went back to VT. Cornell is this coming weekend. And this much is now clear:<br>It isn’t really about the school for her at all. She is a little stressed about choosing because choosing means leaving home, and she is only 17 still. She is a little scared. So NO choice feels exciting right now.<br>But she really does<br>Like VT. And Dad, having seen it, sat in on the engineering sessions,  and researched the heck out of it, is more than pleased. She will LIKELY decide on her own that VT is the right place - but she wants to see Cornell first. Because she got in. And, she wants us to spend a little more time with her maybe. But she is more a cooperative person than a competitive person, and everyone at VT was just so NICE. I mean, everyone, down to the couple at the next table who were alumni and spent their whole dinner talking to us. The girl who introduced herself to us after overhearing our conversation, and offered her dorm room for a tour and a cell number in case we had any questions. And more. So thanks everyone, I think we are good here. If anyone wants to know the final-final, I can post next week.<br><br>", "<b>Username: bopper</b><br><br>Case has single door admissions…that is, once you are in the school you dont’ have to apply for engineering or anything. You can also take classes from, say, the business school without having to be a business major.<br>Case has  a strong liberal arts component as well (as it was formed from the merger of a liberal arts and techy school). The male female ratio is 50/50.<br>Case is situated in the University Circle, a square mile of culture  including the Cleveland Orchestra, the Art museum, Natural history museum, etc.<br>Case has both undergraduate research opportunities and coop…depending if you like the more theoretical or practical (or both!)<br>Case has the think[box]…a lab for inventing complete with tools (3d printers, laser cutters, etc etc) and they teach you how to use them.<br>I would characterize Case as having cooperative vs. competitive students.<br><br>", "<b>Username: Gudmom</b><br><br>She has to get a 3.0 freshman year to be guaranteed her major, but we have all agreed that if she can’t pull 3.0 in engineering then maybe she shouldn’t be an engineer. She spoke to a former classmate about workload and rigor of courses and she is pretty confident she will get her major.<br><br>", "<b>Username: Gudmom</b><br><br>She decided not to visit since she had two strong choices, and actually prefers a quieter environment. I have no idea why she liked Northeastern, because in general she doesn’t like cities. She even gets claustrophobic if the TREES are too close together. VT gets points for being the least claustrophobic campus.<br><br>", "<b>Username: sevmom</b><br><br>Agree with you @Gudmom.  A 3.0 should not be a problem and most kids do get their first choice of major . Glad you enjoyed your visit to Virginia Tech. It is a lovely campus with many friendly students and great food!    Enjoy your visit to Cornell.<br><br>", "<b>Username: VAMom23</b><br><br>VT is a great school for Engineering. Good luck to your dau.<br><br>", "<b>Username: Gudmom</b><br><br>VT it is!<br><br>", "<b>Username: privatebanker</b><br><br>Many times young adults want their own experience and following in dads footsteps isn’t super appealing. Cornell is well known to be a bit of meat grinder for kids in premed. Not sure about engineering. Rensselaer is a preeminent school. VT is also elite in the global picture.<br>Cornell is great but it doesn’t automatically lead to a life of leisure and riches or guaranteed happiness. If so your hubby would write s check for all four years and be done with it. It’s a long life and being happy is more important in the end than anything. Any of these schools offer your d a great chance at all that is good in life and a great engineering job if that what she wants.<br>Tell him to let her grow and be independent. It’s our first job as parents.<br><br>", "<b>Username: sevmom</b><br><br>Great decision! <br>Have fun in Blacksburg. Hope your daughter has a wonderful time at Virginia Tech.  Go Hokies!<br><br>", "<b>Username: socaldad2002</b><br><br>Question, if you knew you couldn’t afford Cornell and Yale, why apply?  To say that you got in to an ivy?  Maybe I’m naive, but I would think before anyone applied to a college they would have a pretty good assessment of what they can afford and not afford.<br>Congrats on VT!<br><br>", "<b>Username: privatebanker</b><br><br>@Gudmom   Congrats   So happy for you and your student. You are in fact, a good mom.<br><br>", "<b>Username: Gudmom</b><br><br>@socaldad2002 Although she is our second to apply to college, we (and at least one of our friends, apparently) did not understand how to interpret the EFC. It was slightly less than when our son applied, but not half or anything dramatic. Income was also slightly less since I stopped working mid year (disabled younger child, a different story) and 529 had been drawn down a bit. We did not understand that it was the EFC per CHILD. Because I do the laundry at my house and I haven’t noticed $140,000 falling out of anyone’s pockets, we didn’t realize what we were getting into. And Yale, in particular, INVITED people to “pick up the phone and call us” if there were circumstances…and the example she gave was almost exactly the case with our disabled child, who we Are placing in private school after fighting with the district for 4 years over services…oh, look, I did tell you the story. Anyway, that was the EXACT example she used, and the family ended up going from full paynto getting $25 K per year for four years. Which would have been EXACTLY what she got from RPI and would have made all schools about the same. So we were thinking Yale, not Cornell. We LOVED Yale. They seemed really really nice. And, Gilmore Girls. She chose Yale. But, they didn’t choose her. So then there was Cornell.<br>Cornell has a chip on their shoulder (it was made very clear) they actually said in the financial aid session “Our endowment is not as big as Harvard , Princeton and Yale, so they can give more money away” and they sounded kind of ticked off about it. Less than half of the kids at Cornell get financial aid.<br>I didn’t really intend to tell the whole story. It makes me sound naive or ignorant. I suppose I was, but I don’t think I’m the only one who can’t believe what ‘they’ actually think a family “can afford”. The very existence of parent plus loans makes it quite clear that families can’t really “afford” their EFCs.<br><br>", "<b>Username: sevmom</b><br><br>Sounds like you made a great choice and you don’t owe  anyone an explanation!<br><br>", "<b>Username: JenniferClint</b><br><br>VT is a solid choice.<br><br>", "<b>Username: WorkNProgress22</b><br><br>It’s been fun following this thread. I have an incoming Hokie engineer, wait listed at Cornell and a few others, accepted early action for UVA Engineering. Based on family income, it’s possible we could pay less at one of the wait listed schools, but it sounds like Cornell isn’t likely to offer much. And even then, we got great vibes at VT, loved the campus, and kid loves sports (both playing and spectating) and feels the extracurriculars are an especially good fit. Reading the comments from those who’ve had kids at VT, their impressions of the Cornell grind, and positive impressions of the culture compared to other campuses makes me think it’s time to fully commit and stop checking wait list status. Similar to your experience with the Cornell prestige, plenty of people both in and OOS, think we’re nuts for turning down UVA.<br><br>", "<b>Username: STEM2017</b><br><br>I’ve enjoyed reading this thread @Gudmom   Congratulations to your D on an excellent choice. My S is finishing up his freshman year of engineering at VT. He was rejected by Cornell. We were disappointed at the time, but in hindsight it was lucky. VT is the right place for him.<br>He made the 3.0 GPA cut for guaranteed choice of engineering major next year at VT, with room to spare. Your D will not have a problem.<br>If it’s not too late, she should apply for Hypatia. I was worried that Galileo might be engineering overkill for my S, but he has thoroughly enjoyed it and took advantage of all the opportunities that came with the program. They’re all in it together. Highly recommended.<br>Your whole family will love the VT experience.<br>Let’s Go Hokies!<br><br>", "<b>Username: Gudmom</b><br><br>So in case anyone is interested in an update…D is home for break. Her calf muscles are tremendous (in a good way). She put on a much needed 10 lbs, eating the top-rated VT food, including crepes for breakfast just like here at home…and the locally sourced ice cream and chocolate milk from VT Ag school cows…her wardrobe is slowly turning maroon, and she just watched an entire football game, screaming when VT dropped the ball, screaming again when they recovered a fumble, and jumping around the room when they beat UVA, making it 14 years, 11 months, and I-don’t-remember-how-many-days since UVA won a game against tech…<br>She never watches football. Her dad he’s season tickets, brother is a huge sports guy…I’ve never seen her like this. And she is looking at 4 A’s and a B going into finals…I think she made the right choice! ?<br><br>", "<b>Username: HowardGradly</b><br><br>Aww awesome news @Gudmom<br>Hope your younger kiddo is settled into her new school as well.<br><br>", "<b>Username: sevmom</b><br><br>And years from now, your daughter will probably still be happy to have been a Hokie! My VT engineering grad emailed me to ask if I was watching the game and when I said we were,  we  followed along together.  Exciting game but they’ve had a tough season.  But they DID beat his big  brother’s  school today!   Glad your daughter is doing so well. Thanks for the update!<br><br>", "<b>Username: STEM2017</b><br><br>Fantastic update @Gudmom !<br>So happy for you and your daughter.<br>Thanks for sharing!<br><br>"]}