{"title": "stanford vs usc full tuition", "comments": ["<b>Username: davev61</b><br><br>My D got into Stanford, Princeton and Columbia with no financial aid at all. She is also admitted into USC with Mork scholarship (50K/yr). She is majoring in Biology, planning for medical school later on. She really like USC but also very excited at the possibility of getting top education at either S, P or C. The question is if Stanford or top Ivy undergrad education is worth $200k more than USC? Especially since she will go, hopefully, to medical school one day which makes undergrad school become less significant in the over all picture. I will pretty much drain all of my saving to send her to either S, P or C. We also have a younger D that is planning to go to UOP next year which will cost a lot too. My plan is if she is going to USC, I will help paying for part of medical school cost too since I only have to pay $10K/yr for USC. Anyway, really appreciate your inputs and I will show D all of your comments to help her making final decision...<br><br>", "<b>Username: pinkbubbletea</b><br><br>Congrats to your D!<br><br>Since she is hardworking, I honestly think that she would succeed anywhere, and that being said I would think it would be better if you chose USC. SC is also reputable and it being paid off will take a huge burdern off when she applies to med school. Plus, having a scholarship such as that will make her stand out from the other students being admitted and that's always a plus. Her comfort level at being at each campus should affect decisions too; if she like being in a humongous campus then it is a perfect choice for her.<br><br>Best wishes!<br><br>", "<b>Username: lcedcoffeee</b><br><br>Hi,<br><br>I happen to know a classmate with very similar circumstances, and I would say that your D would flourish at Stanford. It is worth the investment, and she deserves it.<br><br>", "<b>Username: gateway2517</b><br><br>@davev61<br><br>Congrats to your daughter, she has some great choices. I would suggest that you explain your predicament to the admissions offices at the schools not offering financial aid and see if you can negotiate for a better deal. I know several parents who have done this successfully. The worst they can do is say no.<br><br>", "<b>Username: Beyond</b><br><br>Your D is better off at Stanford or Princeton or Columbia. USC has a bad reputation. It is too much of a party school. Also my son got a scholarship there but we were not impressed with the way the host students behaved when we were there. Bad things they did that I cannot say on this forum. We are giving back their scholarship. But if your D is comfortable there may she should go but myself I would not turn down those three schools for USC.<br><br>", "<b>Username: phantasmagoric</b><br><br>Agreed with gateway2517 that you should talk to the financial aid office.<br><br>This is one of those really hard decisions. I want to say that Stanford is worth the $200k, and it most certainly is, but it's hard to say that it's worth it in the face of a $200k scholarship at another very good school. Which does your daughter like the most? Does she feel that she would genuinely like to attend USC?<br><br>Since you mention your other D may go to UOP next year, keep in mind that Stanford takes into account whether you have other children in college when determining financial aid. So once your other D starts college, assuming that such does have a significant impact on your finances, Stanford may give you significant financial aid. It might even be a good idea - whether she goes to S, P, or C - to defer enrollment for a year. By the time she starts, her sister will be in college as well and that could mean lots more aid from S, P, or C.<br><br>", "<b>Username: itsme123</b><br><br>for med school and biology major USC with Mork is great deal. take it.<br><br>s, p, and c, don't do much more for getting into med school that usc can't. she is guaranteed admission as long as she does well at school and mcat, whichm she's destined to, given her credentials. so take $ and the pride of usc network and all the fun that goes with being at usc. she may even go to s or c for med school. so take the $$.<br><br>", "<b>Username: mets1962</b><br><br>Save your money and go to USC. As a physician, no one cares where you attended medical school, let alone your undergraduate college! Your residency and fellowship are far more important. Save your $ for med school!!!!<br><br>", "<b>Username: angryelf</b><br><br>@beyond Are you a Mormon by chance?<br>You sound shocked that college kids drink and hook up. I can almost guarantee that whatever you witnessed happens at nearly every other school in the nation.<br><br>", "<b>Username: davev61</b><br><br>pinkbubbletea, itsme123, mets1962:<br>Thanks for some greats inputs.<br><br>gateway2517, phantasmagoric:<br>Great suggestion, we are planning on talking to the FA people early next week.<br><br>Beyond:<br>I believe the incident you mentioned did happen but I am not sure how common it is at USC. At the Explore, it seems to me the USC students were pretty well behave and they look happy with their college life.<br><br>", "<b>Username: 9help9</b><br><br>S2 is in exactly the same boat. Trustee Scholaship at USC and admitted to Stanford yesterday. He loved USC on Explore visit. He was waitlisted by Harvard, and rejected by Yale, so up until yesterday USC was it. Now Stanford has confused this issue. No need based aid for us, so Stanford will be full-pay, meaning loans, loans, loans. USC offering full-tuition for 4 years. How does a family objectively evaluate this choice? Money not being an issue, it would be Stanford.<br><br>", "<b>Username: mysticalheavens</b><br><br>I have this same problem, except WashU offered me full tuition and I also got into Stanford. I literally am confused and would feel bad turning Stanford down, but we are middle class and 60k a year would hurt my family<br><br>", "<b>Username: simba9</b><br><br>I'd go to USC. (Actually, I did go to USC.) It's not Stanford, Princeton or Columbia, but for an undergraduate education, it's not that far below them.<br><br>Being $200K in debt after graduation, and then adding medical school tuition on top of that...ouch.<br><br>", "<b>Username: phantasmagoric</b><br><br>The best advice anyone can give the above posters is just to contact the financial aid office, explain circumstances, and discuss the drastically more generous offers from other universities. Stanford has adjusted financial aid many times in the past to make up for the gap, or at least part of the gap, in order to make the decision easier for you. I wish everyone the best of luck in their negotations with the financial aid office. :)<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Yeah, I would talk to financial aid office and see if they enhance their offer. Otherwise, I'd take the SC scholarship. $200k can go a long way for other goals.<br><br>", "<b>Username: Mysonsdad</b><br><br>Do students from USC get accepted to medical school? Yes.<br>Can your daughter get into medical school with a lot less debt than if she goes to the other schools? Yes<br>Will ANYONE ever ask her where she did her undergrad? No<br>Go with USC and take the money.<br><br>", "<b>Username: EarthPig</b><br><br>Just a note regarding appealing to the financial aid offices. I know little about Stanford, but as for the Ivy schools, if the Mork scholarship is a merit scholarship, the Ivy schools are not allowed to match it. They can only award aid based on financial need. To appeal to their financial aid department, youll have to demonstrate that you dont have the money to pay.<br><br>If your daughter was granted financial aid by USC and not by Princeton and Columbia, then you would have evidence that someone else believes you dont have the resources to pay the bill in full. If you can show them that they misinterpreted your financial information or something has radically changed since you filed the FA forms (like you lost your job or your business fell apart or something), then they can also reconsider.<br><br>The Ivy League coaches would love to be able match athletic scholarships offered to athletes (which are another type of merit scholarship), but they cant.<br><br>", "<b>Username: Doener</b><br><br>Go to USC.<br><br>", "<b>Username: jamescchen</b><br><br>The decision is obvious: USC.<br><br>", "<b>Username: sportsmomma</b><br><br>If you didn't qualify for financial aid at Stanford, you don't qualify for financial aid--- how would appealing this based on a merit aid offer change things?<br><br>Stanford is an amazing opportunity for sure, but is it worth $200K more? This is a family decision. S decided it wasn't worth $100k more with med school in the future and is happy and thriving at USC. H and I (both S alums) would have had a hard time deciding. Glad S made the decision for himself.<br><br>", "<b>Username: Beyond</b><br><br>By the way, I am not Mormon. As I said before, I cannot tell you what happened when my son went there for the interview. It is not decent to mention on the forum. I have reported it to USC and all family members and friends agree he should not go there. I would pay and go to Stanford or any other schools. I am glad my son got into all the Ivy's plus Stanford, MIT and CALTECH. The Ivy schools give more money than USC. We plan not to go to USC!!. It is a choice you have to make and I do not think that it is a bad school academically. USC is ranked high than UCLA. My family made a choice that it will not be the university my son goes to or any family member!!!.<br><br>", "<b>Username: stanford78</b><br><br>Sounds like quite a story Beyond.<br><br>But you know its really unfair of you to completely trash an entire institution and (at least several of) its students with highly charged claims and then say you can't be specific. How is anyone to judge your credibility. That is the most despicable sort of character assassination and it shouldn't be allowed here.<br><br>", "<b>Username: docfreedaddy</b><br><br>USC has a bad reputation? That is a brash statement that warrants support from you. My daughter and I visited USC as she was a finalist for a trustee scholarship. We were both incredibly impressed with the enthusiasm, articulateness and friendliness of the students and faculty. I find you comment odd and question its motivation.<br><br>", "<b>Username: hope4usc</b><br><br>USC is my dream school and I say Stanford, I admit its<br>Much better :( I wasn't confident enough to apply. Stanford for sure bro<br><br>", "<b>Username: rosiesteinbach</b><br><br>I am in a similar situation choosing between USC and Stanford, but I have generous aid to both and will probably be picking Stanford.<br>I would recommend going with USC in your situation, however. I fell in love with the campus and the students and the general environment at the school when I went to the Explore program. The faculty were extremely gracious and the students seemed genuinely proud of their school. Research is also extremely easy to obtain at USC. I was offered merit research for three years before even accepting the offer of admission (the main reason I hesitate on not attending). My big aspiration there was to end up working with a specific professor in biomechanical engineering, and all the STEM students I asked confirmed I could nonchalantly ask said professor about research and almost undoubtedly find a spot on his team at some point during my education. It's beautiful school with a wonderful reputation in the sciences, and though there is definitely a lively \"row,\" it's not hard to stay entirely away from that scene if you so desire (or so my overnight host told me).<br><br>", "<b>Username: lacrossemom</b><br><br>I am surprised you are not getting any aid from Princeton since they are extremely generous with aid for middle class families. If not, then I guess the question is if you can afford the 50/60 a year? If so, let her enjoy going to whichever school she likes best. What incredible options in such a hard acceptance year.<br><br>If you are concerned about when your other child is in school, talk to financial aid office to see the impact of aid next year for your family.<br><br>Good luck and congratulations again!<br><br>", "<b>Username: Beyond</b><br><br>I am not really trashing USC. It is a good school and I liked it when I visited but my child did not like the incident that happened there. He applied there and got the scholarship but now he /she prefers to go where he will be comfortable. Every one has different views of schools and that is why visiting a school is necessary to make up your mind. Go to USC if you want to. My advice was that I would choose Stanford. Remember, you are going to spend four years in that school so choose it yourself and nobody should tell you where to go. Good luck and you would not go wrong with your choice. Congratulations!!!. By the way, I personally enjoyed the Explorer Days.<br><br>", "<b>Username: angryelf</b><br><br>\"\"As I said before, I cannot tell you what happened when my son went there for the interview. It is not decent to mention on the forum. I have reported it to USC and all family members and friends agree he should not go there.\"\"<br><br>What's the point of saying it if you aren't going to give any hint as to what the issue is?<br>It may not be \"decent\" to mention it, but it sure beats just leaving it up in the air.<br><br>It honestly sounds like you are either just trying to trash the university or are a complete prude. Either way, you really should not post something like that with no detail.<br><br>", "<b>Username: hope4usc</b><br><br>I think you should say what happened...<br><br>", "<b>Username: docfreedaddy</b><br><br>Like many of you, acceptance to Stanford, Harvard, Yale is viewed as a remarkable achievement. To be one of the 6% or so invited to attend is a clear, rewarding marker of where you stand in life relative to your peers at this point in time. By comparison, USC had 46000 applicants and accepted 2650. Of those 2650, 100 were awarded trustee merit scholarships, or about 4%. 4% USC trustee merit vs. 6% Stanford admit. Hm. Something to consider. I don't have the GPA or SAT's of the 375 Finalists in front of me and don't have that information for the 100 who were awarded the Trustee Merit Scholarship, but I recall the Finalists' stats met or exceeded those I have seen published for Stanford.<br><br>University rankings are just that--University wide. Often having little bearing on the undergraduate classroom experience or campus wide social/intellectual learning experience.<br>I visited USC with my daughter for her Trustee Merit interview holding the same preconceptions as many posting here. I was truly shocked to find such an engaged, articulate and happy student body--everywhere. The place seemed alive and vibrant.<br><br>I spent 3-6 hours 3/week for 8 weeks the past two summers at Stanford. Granted, summer is not regular session. I agree the atmosphere is a lovely office park setting and a very peaceful one. But, it did not feel like a vibrant campus. Students seemed self-absorbed, few made eye contact, it was just weird. I plan to spend more time on campus this month, as will my daughter. I don't know if having 44% science and engineering majors provides a distinct campus vibe. I am curious to go back soon to see.<br><br>No doubt Stanford has world class engineering programs, medical school and information science programs which serve well as an incubator for the fine tech and biotech industries in Silicon Valley. But, what does it offer to the humanities undergraduate major in comparison? How much of Stanford's ranking is based on science/engineering/medicine graduate programs as opposed to the day-to-day experience for an undergraduate?<br><br>I have heard and read the classes can be large at Stanford, especially in undergraduate required courses. By comparison, the Thematic Options honors program at USC is offered to those accepted in lieu of all required core courses. The goal is to create a small liberal arts college within a larger college. Faculty apply and are unique to the program, classes are small with an emphasis on writing skills. Courses are interdisciplinary and emphasize critical thinking.<br><br>My daughter may well decide to attend Stanford. My purpose in writing is to share my experience and invite feedback since I am trying to weigh options from my perspective as a parent and PhD who has taught PhD candidates. Also, to move beyond the generalities of reputation and ranking to specific experiences. At this point, the decision for my daughter is Stanford or USC. We are each in our own way comparing two exceptional options we are very grateful she has. Bottom line--which will provide the richest, most intellectually stimulating and enjoyable undergraduate experience?<br><br>", "<b>Username: ArnoldZiffel</b><br><br>I dont know what happened during the visit to USC, but college students do some pretty stupid things.<br><br>Im going to leave college names out of this, but can tell you that all of the following have taken place at elite colleges (and these stories are all about people I knew at my college, or people I personally know from other elite colleges  I can tell you that none of these occurred at Stanford or USC):<br><br>- Having 100 proof alcohol blasted down multiple peoples throat via a fire extinguisher at high pressure.<br><br>- Stealing a campus police car and attempting to drive it in the river.<br><br>- Filming a guy having sex with a girl through the guys window, and showing the film to 100 people at a big party (the guy knew about this, and the girl didnt, as you probably can guess).<br><br>- While very, very drunk, two guys stole a small airplane and drove it 20 miles down a remote two-lane highway at 3AM before abandoning it.<br><br>- Stealing a town bus and driving it all over a good-sized city, picking up people, often old ladies, and providing them with personal rides to their destinations. They eventually returned the bus to the station. This was an annual occurrence at this school.<br><br>- Pushing a piano out the window.<br><br>- When a highly sought-after football player was being recruited, the host players and the recruit popped all the tires on a car that was parked on the edge of campus during his visit.<br><br>- Getting all athletic recruits good and drunk at a party was standard practice where I went to college (30 years ago  perhaps that has changed, but I doubt it), and this was at a non-scholarship school.<br><br>I dont know what happened at the visit to USC, but all manner of deviant behavior goes on when you have a bunch of 18- to 22-year-olds without Mommy and Daddy there to watch them.<br><br>Are these acts reprehensible? Most of them are, anyway. And half of them took place at my hyper-elite school. The video star, whose performance took place just before graduation, had his degree withheld by the school and his med schools contacted (they retracted his acceptances) because of the described event and some unproven sexual harrassment and molestation allegations. The others were never caught (or were essentially allowed to escape). The video star eventually became a physician, unfortunately, somehow, and I have mercifully never seen him again. All of the others became respectable citizens after they grew up.<br><br>This is the kind of stuff that goes on at any campus, unfortunately (and my son better not do this kind of stuff). I wouldnt judge USC by something that one small handful of students did, and we dont even know what this event was, but Im guessing that the worst of these events are on par with what occurred during the USC visit.<br><br>Unless youre sending your kid to one of the service academies, events like these are going to take place, and you have to hope that youve raised your kid well enough to be sensible and to resist peer pressure.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"By comparison, USC had 46000 applicants and accepted 2650. Of those 2650, 100 were awarded trustee merit scholarships, or about 4%. 4% USC trustee merit vs. 6% Stanford admit.\"\"<br><br>That's not true. USC accepted 8,400 students, 9,400 including spring admits this year. The reason that USC gives out those merit scholarships is that, of the superstar students who apply to USC (far fewer such students apply there than to Stanford), nearly all of them choose to attend another school. Most of Stanford's class is made up of Trustee-caliber students. Looking at acceptance rates (6% vs. 4% trustee) tells you nothing - USC's applicant pool is on the whole weaker than Stanford's.<br>\"\"I spent 3-6 hours 3/week for 8 weeks the past two summers at Stanford. Granted, summer is not regular session. I agree the atmosphere is a lovely office park setting and a very peaceful one. But, it did not feel like a vibrant campus. Students seemed self-absorbed, few made eye contact, it was just weird.\"\"<br><br>Any student who has been at Stanford during the school year and during the summer will tell you: they are nothing alike. The campus is not vibrant during the summer. During the school year, it is. This is the case at most schools. Stanford's campus is also filled with high-school students during the summer, so perhaps they're the ones who seem self-absorbed.<br>\"\"But, what does it offer to the humanities undergraduate major in comparison?\"\"<br><br>Stanford is currently <a href=\"http://www.timeshighereducation.co.uk/world-university-rankings/2011-2012/arts-and-humanities.html\" rel=\"nofollow\">ranked</a> #1 in the world for the humanities and arts. It's also <a href=\"http://www.timeshighereducation.co.uk/world-university-rankings/2011-2012/social-sciences.html\" rel=\"nofollow\">ranked</a> #1 in the world for social sciences. All of Stanford's departments in the humanities and social sciences are ranked in the top 5 by US News; the NRC rankings are similar. This isn't a new development - Stanford has long had top-5 departments in the humanities and social sciences, but people pay more attention to its STEM departments, which are also among the best. As THE notes:<br>\"\"the wrote: Stanford University knocks Harvard University off the top spot in the arts and humanities subject rankings. With Pulitzer prizewinners and MacArthur Fellows leading its liberal-arts programme, the relative newcomer (founded in 1891) has proved more than a match for its illustrious Ivy League rival.\"\"<br>\"\"the wrote: Stanford University, joint second with Harvard University in the overall top 200 rankings, takes top spot in the social sciences table.<br><br>The institution has a strong record of producing leading economists and boasts several living Nobel economics laureates among its world-class faculty.<br><br>These include 1992 winner Gary Becker from Stanford's famous Hoover Institution and his colleague Douglass North, who shared the Nobel the following year for his work on economic history and institutional change.\"\"<br><br>\"\"docfreedaddy wrote: I have heard and read the classes can be large at Stanford, especially in undergraduate required courses. By comparison, the Thematic Options honors program at USC is offered to those accepted in lieu of all required core courses.\"\"<br><br>75% of Stanford's classes have fewer than 15 students, and only 2% are over 120. USC can't compare to that. I'll add that when you calculate the \"average experience\" for students (larger classes affect more students, smaller classes affect few students), the difference between the two is even larger.<br><br>There's a reason that HYPSM don't have some subset of their students in an honors college-type program. It's because the undergraduate division itself is an \"honors college,\" with elite students, small classes, and tons of opportunities in research and the like. Lower-ranked schools established honors colleges <i>in order</i> to attract more of these elite students. But it stratifies the student body and exalts a subset of them over the others. They don't have the resources to offer all these opportunities and small classes to their entire student body.<br><br>", "<b>Username: docfreedaddy</b><br><br>A few moments ago, I reviewed Stanford's web page and USC's. The school web pages reflect the tone of the atmosphere I experienced and have heard from parents whose children attend. USC seems far more vibrant and rich. Were it not for the rankings, I would have expected USC to be the far superior school. You and everyone else can review the web pages and visit the schools. You might be quite surprised as well.<br><br>", "<b>Username: zenkoan</b><br><br>docfreedaddy, I think it's true that USC has made, and is continuing to make, great strides. It is harnessing its alumni network to create endowed chairs, facilities, etc. and is in the process of materially raising the caliber of the university. But truthfully, at this point in time--which is the relevant juncture for your daughter's decision--USC simply can't compare to Stanford, even if you confine your comparison to the small \"honors\" subset contingent at USC. In a couple of decades that may change, but that's not pertinent for your purposes.<br><br>With respect to the humanities here--it's already been pointed out that Stanford has absolutely world-class humanities departments, even though the (amazing) tech and engineering sides get all the media attention. I've taken many courses in the philosophy (both logic and ethics) and linguistics departments, and they have been, without exception, excellent in all respects.<br><br>If I were a parent I could definitely understand wanting to consider very carefully a full-tuition offer from a good school like USC. It's a big cost differential for sure. But I think that can also (understandably) create a tendency to try to equalize the opportunities in your mind, as a rationale for choosing the less-costly option. And there is nothing wrong with that choice, but it doesn't mean that the opportunities are in fact equal; it just means that you may accord different values to them than some others might.<br><br>BTW, I have been on campus in the summer as well, and it bears little resemblance to the atmosphere during the rest of the year. During the summer the campus is overrun with many programs that are really just money-makers for the university, and the level of academic intensity that characterizes Stanford during the regular terms is largely absent. This is common during the summer at Stanford's peer schools too.<br><br>Good luck to your daughter in her decision, and I hope she has a fine experience wherever she chooses to attend.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"reviewed Stanford's web page and USC's. The school web pages reflect the tone of the atmosphere I experienced and have heard from parents whose children attend.\"\"<br><br>What do you mean by \"web pages reflect the tone of the atmosphere\"? In what way? Are you saying you're basing your judgment on the web page and second-hand hearsay from the parents of kids who attend, rather than on actual students' experiences (as shown here)?<br>\"\"USC seems far more vibrant and rich.\"\"<br><br>Vibrant, no; but rich? That's the general perception about USC. :p<br>\"\"You and everyone else can review the web pages and visit the schools. You might be quite surprised as well.\"\"<br><br>I don't need to - I've attended. ;)<br><br>", "<b>Username: solemn</b><br><br>From docfreedaddy in a different thread:<br><br>\"You raise the expected, valid points regarding Stanford and in no way am I detracting from Stanford's reputation. Your comment regarding \"a campus with students whom you KNOW are academically, athletically, and artistically gifted, the best of the best in the entire world\" seems to strike a chord. My point in citing the relative statistics is simply admit rates are viewed as indications of exclusivity, which is not limited to Stanford or Harvard. Most trustes award students at USC have been admitted to one or more Ivy's or Stanford, but choose not to attend. What I can say is that something quite incredible is happening at USC presently that I would not believe without seeing it with my own eyes. The vibrancy and dynamism is infectious, the programs for the \"best of the best\" are engaging and innovative. I hope I do see the same level of vibrancy when i soon visit Stanford again and hopefully not students simply basking in the glory of seeing themselves the \"best of the best\". As an aside, being intellectually superior in intelligence does not equate to superiority in emotional intelligence. My daughter was accepted to Stanford and is extremely bright, likely the brightest in her private school. To her credit, however, her friends may be somewhat bright, but have superior personal qualities, including superior emotional intelligence. Maybe personal qualities, not quantified on SAT scores and GPA's, or excelling in a sport or art form, account for what I saw at USC, but not Stanford. Hopefully, I will be struck by the vibrancy and happiness exuding from Stanford undergrads on my upcoming visit.\"<br><br>I would argue that admit rates tell only part of the story about a school's exclusivity. More important, I think are the yield rates -- of the students who are accepted, how many matriculate? A 2010 article in the Daily Trojan reveals that only 45% of Trustee Scholarship winners actually attend USC, and I don't think yield rates for the scholarship would change dramatically in two years. <a href=\"http://dailytrojan.com/2010/02/03/5-5-percent-of-applicants-selected-as-scholarship-finalists/\" rel=\"nofollow\">5.5 percent of applicants selected as scholarship finalists|Daily Trojan</a><br><br>In contrast, 70% of students accepted to Stanford matriculate. \"Something to consider,\" no? Perhaps that 55% of students who did not attend USC did not find the \"vibrancy\" that you saw... or perhaps they had offers from better schools. I don't doubt that most Trustee award winners are accepted to other Stanford-caliber schools, but the data suggests that even with the scholarship, they're still selecting Ivy League colleges and universities.<br><br><br>It's insulting, frankly, for you to suggest that Stanford students are merely basking in the glory of being the best of the best. Stanford students are on the whole very humble (and, as an aside, very vibrant and dynamic as well).<br><br>Your comment about emotional intelligence is a red herring, and I can assure you that there are more students with high EQ's at Stanford than USC.<br><br>As someone who has visited both schools during the actual school year, I can assure you that Stanford students are more vibrant and intellectually curious than USC students. There may be \"honors\" colleges at USC where students are intellectually curious, but like phantasmagoric said above, there's a reason why such programs don't exist at Stanford-caliber schools.<br><br><br>Frankly, as an alleged holder of a PhD, I find it suspect that you would take impressions on different schools based on a sample that is not even representative of the student body (Stanford's summer session) and from their websites (though I do admit that USC's main photo of Professor Castells's research looks more vibrant than the student with the robot on Stanford's webpage, if that's what you mean by \"vibrant\").<br><br><br>To be fair, cost may be an issue, but ceteris paribus, please don't think that USC is a better school than Stanford.<br><br>", "<b>Username: APOL</b><br><br>Hi davev61~<br>Judging from your OP, it sounds like $$ is not the final criteria for selecting a college, but rather one facet. Another facet may rest with the student body itself. Has your child had a chance to visit any one of these schools? If so, which one/s caused her face to light up with the prospect of attending? Her body language may tell you more than words.<br>My DD had a definite impression after visiting. Yours may also.<br>IF $$ is the final factor, then USC is clearly the winner. IF $$ is not, then there are clear differences between these colleges-USC,S,P,and C. Which one would \"float her boat\"?<br>~APOL-a Mum<br><br>", "<b>Username: stanford78</b><br><br>I believe it is a violation of CC rules to post in any language other than English.<br><br>From CC's Terms of Service:<br><br><b>Language</b>. All posts will be in English.<br><br>;)<br><br>", "<b>Username: docfreedaddy</b><br><br>Yes, visiting USC for two days of interviews with my daughter as a Finalist for the Trustee Merit Award has been the impetus for a surprising, even to me, consideration of USC vs. Stanford. The reason is not just the seeming happiness, vibrancy, articulateness and friendliness of the USC students, but the apparent reasons for it. USC seems to be devoting considerable resources to undergraduate education with tremendous individualized support and opportunity for students. They seem to well value their highest performing students, most of whom have had Ivy or similar acceptances. The extent this comes through to students and the positive effect on a student may be an intangible to consider. Is it a plus to be an especially highly regarded student receiving lavish bonus opportunities or just another brilliant undergraduate student?<br><br>Interesting, the gap in SAT's and GRE's with the \"average\" USC and Stanford students at all reported deciles is narrowing considerably. USC clearly notes they look for excellence and passion in non-academic areas. Perhaps they are attracting a different group of students from Stanford with differing personal qualities and attributes. Neither better nor worse, but different. As I indicated elsewhere intellectual intelligence is quite different than emotional intelligence, a quality not included in rankings.<br><br>Bottom line is I have unanswered questions about Stanford. I will be spending time on campus in the coming weeks and will meet with the son of a good friend who is a dorm advisor, along with some of his advisees. My daughter has a friend from her HS who is currently a freshman who she is contacting. We will both visit for admit weekend at the end of the month<br><br>Rankings certainly support the superiority of Stanford. In fact, Stanford holds extremely high US and world rankings. Looking at the factors rankings are based on, it does not seem they relate especially well to undergraduate education and are all based on a similar core including ratings by faculty at other schools, faculty salaries and faculty awards. These measures seem highly correlated. Judging from some of the posters who appear to be faculty, I suspect there is a network effect such that an Ivy or Stanford faculty may well be more prone to judge a currently similarly ranked school higher than a USC, in part a self-identification and \"halo effect\" from current rankings, rather than current programs. As an aside, this would be similar to BCS rankings where the \"elite\" BCS schools are more commonly being beaten in playoffs by non-BCS schools, causing much discussion of the ranking system.<br><br>I am simply looking at this from the perspective of removing pre-conceived notions and taking each school and what they are offering in this case as I find them. The input received from all on this site is extremely helpful. I want to emphasize I expect the visits to Stanford in the coming weeks and the admit program to provide very valuable information for a \"head to head\" (that's funny!) comparison. Thanks again.<br><br>", "<b>Username: beenthere2</b><br><br>If medical school is in the future, two considerations:<br>1. Med school at Stanford is 90K/year, so saving 200K may be a good idea, even if you can afford Stanford undergrad.<br>2. Because medical school admission is almost completely number-driven, she may be able to get a higher GPA at USC.<br><br>", "<b>Username: docfreedaddy</b><br><br>Yes, visiting USC for two days of interviews with my daughter as a Finalist for the Trustee Merit Award has been the impetus for a surprising, even to me, consideration of USC vs. Stanford. The reason is not just the seeming happiness, vibrancy, articulateness and friendliness of the USC students, but the apparent reasons for it. USC seems to be devoting considerable resources to undergraduate education with tremendous individualized support and opportunity for students. They seem to well value their highest performing students, most of whom have had Ivy or similar acceptances. The extent this comes through to students and the positive effect on a student may be an intangible to consider. Is it a plus to be an especially highly regarded student receiving lavish bonus opportunities or just another brilliant undergraduate student?<br><br>Interesting, the gap in SAT's and GRE's with the \"average\" USC and Stanford students at all reported deciles is narrowing considerably. USC clearly notes they look for excellence and passion in non-academic areas. Perhaps they are attracting a different group of students from Stanford with differing personal qualities and attributes. Neither better nor worse, but different. As I indicated elsewhere intellectual intelligence is quite different than emotional intelligence, a quality not included in rankings.<br><br>Bottom line is I have unanswered questions about Stanford. I will be spending time on campus in the coming weeks and will meet with the son of a good friend who is a dorm advisor, along with some of his advisees. My daughter has a friend from her HS who is currently a freshman who she is contacting. We will both visit for admit weekend at the end of the month<br><br>Rankings certainly support the superiority of Stanford. In fact, Stanford holds extremely high US and world rankings. Looking at the factors rankings are based on, it does not seem they relate especially well to undergraduate education and are all based on a similar core including ratings by faculty at other schools, faculty salaries and faculty awards. These measures seem highly correlated. Judging from some of the posters who appear to be faculty, I suspect there is a network effect such that an Ivy or Stanford faculty may well be more prone to judge a currently similarly ranked school higher than a USC, in part a self-identification and \"halo effect\" from current rankings, rather than current programs. As an aside, this would be similar to BCS rankings where the \"elite\" BCS schools are more commonly being beaten in playoffs by non-BCS schools, causing much discussion of the ranking system.<br><br>I am simply looking at this from the perspective of removing pre-conceived notions and taking each school and what they are offering in this case as I find them. The input received from all on this site is extremely helpful. I want to emphasize I expect the visits to Stanford in the coming weeks and the admit program to provide very valuable information for a \"head to head\" (that's funny!) comparison. Thanks again.<br><br>", "<b>Username: StanfordParentx2</b><br><br>Hello OP and Congratulations to your daughter on having such hard won options. I recall having a similar set of choices for both my kids. There were scholarships to be had for merit not need based (we find ourselves at the borderline of need but that is another thread). It made for April being a long month. Ultimately we sat down with each kid and went over the scenarios of how much each cost, how much we as parents could/would contribute and how much the kid was expected to contribute via jobs during school and summers depending on their choices. One kid is science, the other is humanities. One kid has med school in front of them now and the other is still in school with a future waiting to unfold. Both chose Stanford. The science kid worked hard, loved the school- yes vibrant, engaging, wonderful Stanford and graduated per our financial agreement without debt. She paid more personally for her percentage of the agreement then most pay for say those expensive California state school's 4 year tuition.<br>The other kid also chose Stanford and as I said, that story is still in progress. I can say the latter kid feels like it is an Academic candy store. Thrilled with classes, profs and the whole Stanford feel. So, if it's a matter of the money being there regardless then come up with different plans, lay them out and let the student decide what type of future they wish to take on.<br><br>Best wishes.<br><br>", "<b>Username: HSMCCP</b><br><br>If she's going to be a premed, she should just go to USC w/ full tuition. She's going to have to pay hundreds of thousands for med school later on --- save money now while you can, otherwise she'll be stacked with loans and debt. Plus, for med school, she needs to have a high GPA (doesn't matter what school she goes to, med schools don't care about this and simply want high numbers) --- USC will be easier than Stanford, Columbia, and Princeton (which have grade deflation, especially for Biology) to get a high GPA as a premed.<br><br>", "<b>Username: docfreedaddy</b><br><br>That makes sense for pre-med. She is a gifted writer (per her mentors). Her focus is journalism and literature. She was named an Annenderg Scholar in USC's school of Journalism, trustee award (full tuition) and invited to apply to the Thematic options Honors program and can double major at USC. We are both less familiar, thus far, with Stanford's similar program offerings. The description on Stanford's web page for their Freshman humanities program are oddly relatively limited and under construction. We both will be spending much more time at Stanford in the coming weeks.<br><br>", "<b>Username: Copterguy</b><br><br>You can get a great education at USC -- and at most other top universities. Often it's more about the individual student and how much s/he puts into the experience and takes good courses and gets involved in the campus intellectual life. The difference is that Stanford, Columbia, etc. have a better academic reputation and there's the luxury -- elite college -- aspect of it. In terms of the quality of education, I don't think there would be significant difference. In terms of the academic reputation, the difference is not worth $200K for me, and I would send my child to USC. But ultimately you have to decide whether you want to pay all that money to say your child went to a very fancy school.<br><br>", "<b>Username: docfreedaddy</b><br><br>I think it is important to maintain a respectful attitude in these discussion. I was actually responding to your comment which does not reflect student's self-evaluation, but your perception of their self-evaluation:<br><br>\"a campus with students whom you KNOW are academically, athletically, and artistically gifted, the best of the best in the entire world\"<br><br>Further, you stated,<br><br>\"Your comment about emotional intelligence is a red herring, and I can assure you that there are more students with high EQ's at Stanford than USC.<br><br>What is the basis for your assurance? Do you have an objective basis?<br><br>\"As someone who has visited both schools during the actual school year, I can assure you that Stanford students are more vibrant and intellectually curious than USC students\".<br><br>Again, that is a meaningful, but subjective assessment. As it is subjective, it would be useful to know what, if any, affiliation you have with Stanford.<br><br>Thank you again for your input.<br><br>", "<b>Username: docfreedaddy</b><br><br>Two things I have recently learned:<br><br>1. The US News and other rankings warrant close scrutiny with regard to validity for undergraduate education quality.<br><br>2. The University rankings, whether valid or not for undergraduate programs, strongly reinforce the self-perception of \"top\" ranked schools and the perception of those applying.<br><br>My goal is to identify the relative merits of these two choices culled from others, including \"prestige schools\" as opposed to merits based on reputation. The latter subject to many factors including a ranking system few likely examine carefully. The only reason for this exercise was an incredibly favorable impression of USC after peaking carefully under the hood vs an incredible reputation and ranking for Stanford.<br><br>", "<b>Username: docfreedaddy</b><br><br>Thank You Stanford parentX2,<br><br>The decision is my daughter's and she is doing her own \"due diligence\". As the parent of two bright children, you probably also are comfortable with their sense of what is best for them, yet independently investigate factors involving big decisions in their lives. I find the strong attitudes and beliefs of some posting fascinating, as well as the power of rankings which are likely often unexamined with regard to their basis and validity for undergraduate education in a University setting.<br><br>", "<b>Username: lacrossemom</b><br><br>Can't wait to learn where she decides to go. She has such great options.<br><br>", "<b>Username: placido240</b><br><br>\"\"\"As someone who has visited both schools during the actual school year, I can assure you that Stanford students are more vibrant and intellectually curious than USC students\".\"\"<br>Football player whom we know quite well goes to Stanford. He has all the \"intellectual vibrancy\" of a doorstop. But . . . well, you know . . . it's PAC12 Football. I do enjoy all these generalizations on CC. Stanford is VERY well known for catering to its athlete class. Indeed, Staford is kind a barbell institution: very smart Asians on the one hand, intellectually vacuous athletes on the other, with a mix of weird band members in between. Stanford truly has to be among the most over-rated undergraduate institutions ever.<br><br>", "<b>Username: docfreedaddy</b><br><br>Well, that is a different perspective from plantasmagoric and solomn!<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"Indeed, Staford is kind a barbell institution: very smart Asians on the one hand, intellectually vacuous athletes on the other, with a mix of weird band members in between. Stanford truly has to be among the most over-rated undergraduate institutions ever.\"\"<br><br>This is so completely false. I was about to post in the 'why not Stanford' thread about misconceptions about Stanford. One of the most common ones is that the athletes are 'got in easily' or 'are dumb.' Consider that only about ~800 students in the student body are varsity athletes (a little over 10%), or 200 per class. Of those, most are in a sport where recruitment has 0 effect on admissions. Of those 200, a large portion are walk-ons. And even those who were recruited have to be approved by the admissions office before recruitment can continue. See this:<br><br><url>http://online.wsj.com/article/SB10001424052748704364004576132503526250500.html</url><br><br>In fact, it's because Stanford's admissions standards are so high that the pool of potential athletes is significantly narrowed. It's also the reason that Stanford has lost coaches before - in one case a few years ago, the basketball coach abruptly left Stanford in anger a few weeks after the admissions office told him that they refused to admit a basketball player he wanted to recruit.<br><br>Consider that the best student-athletes are those that are a) amazing athletes, and b) amazing students. Where do you think these students end up? At Stanford, of course, because it can offer them top athletics, top academics, and above all, an athletic scholarship. By contrast, schools such as Harvard and Yale are stuck with those who are mediocre students but strong athletes (these students don't usually get into Stanford), or mediocre athletes but strong students. They end up with the less desirable athletes simply because they can't offer athletic scholarships and because they don't have the top athletic teams like Stanford.<br><br>USC on the other hand ends up with athletes that are dumb as rocks. IIRC, USC has come under fire from the NCAA for not maintaining academic standards, which says a lot considering how low the minimum is set. In various rankings, Stanford always comes out at the top in the country for both the academic performance and athletic performance of its teams, including its football team. And athletes at Stanford don't major in fluff majors like \"sports science\" (i.e. a major in gym). They major in engineering, sciences, social sciences, etc. For example, Andrew Luck, the #1 NFL draft pick, is a civil engineering major. There's a reason that Stanford's graduation rate for athletes is the highest in the nation among D-I programs (comparable with its overall graduation rate). USC's graduation rate for athletes isn't very good.<br><br><a href=\"http://www.gostanford.com/sports/w-swim/spec-rel/040612aaa.html\" rel=\"nofollow\">Bollier Earns Top Academic Honor as Academic All-Pac-12 Announced - Stanford University's Official Athletic Site</a><br><br>Stanford athletes would take serious offense at the suggestion that they are \"intellectually vacuous.\" Honestly, do you think that athletic = automatically not interested in intellectual pursuits? How naive. The Rhodes Scholarship committee would disagree with you. Most students at Stanford would tell you that nearly all athletes are just as intelligent and hardworking. Were it not for their athletic gear, they'd be indistinguishable from the rest of the student body.<br><br>", "<b>Username: zenkoan</b><br><br>um, placido240: you were rejected from Stanford, if memory serves? Or maybe it was your kid? Your post reminds me of a particular Aesop's fable. ; )<br><br>", "<b>Username: Ironman1478</b><br><br>placido240, i go to USC and you can say the same about USC. honestly, i would tell TS to go to USC due to the extreme cost of stanford. they are both great schools and in a few years USC will have an equal academic reputation as stanford. so much great scientific research is going on at USC its crazy and we are consistently beating MIT, stanford and the UCs in engineering competitions, especially our electrical engineering/CS robotics program<br><br>", "<b>Username: solemn</b><br><br>@docfreedaddy,<br><br>I find it curious that you're quick to criticize me for providing subjective assessments, and then subsequently endorse placido240's view that Stanford has a dumbbell culture, a ludicrous idea that phantasmagoric quite nicely refutes. Cognitive dissonance, perhaps? (Never mind that placido240 blatantly lumps together \"smart\" and \"Asian.\")<br><br><br>My point in saying that students at Stanford know that they're among the best of the best was not to seem elitist; rather, it was to point out that students at Stanford need not worry about the quality of discussions they'll be having, or that any of their peers don't deserve to be there. With such a stellar pool of applications, the admissions committee can afford to pick the best of the best (and, sadly, leave many of the best in the reject pile). Everyone there is on equal footing, and there is no stratification created by honors colleges like the type at many public universities and USC, for example. I'm not saying that stratification is a bad thing, necessarily -- but the campus cultures at USC and Stanford are, from my personal observation, fundamentally different.<br><br>Obviously, I have no objective assessment for EQ, but I make my assertion based on 1) my personal visits to both campuses, and 2) the admissions committee's ability to read students' essays and recommendations, and I would imagine that they tend to pick students whose emotional intelligence is high. But my second point is disputable. Certainly, though, the USC supplement gives fewer opportunities to explicate yourself to the committee than Stanford's.<br><br>I am an admitted student to Stanford, and have visited both schools during the school year, unlike you. And from talking with students at both schools, as well as observing and investigating both schools' students' academic work and research, students at Stanford are more intellectually engaged. Finally, know that there are real advantages to going to a school where the dominant aspect of the entire school's culture is academically-focused, rather than fun-focused or restricted to a subset of the school.<br><br>Finally, I can assure you that my defense of Stanford is not consciously motivated by rankings, and it seems like a red herring to me to claim rankings are a substantial factor in influencing our opinions of Stanford or other top schools.<br><br><br>By no means am I criticizing USC, as it is an excellent institution. But Stanford is just in a different league. Rankings, flawed though they may be, reflect Stanford's reputation, and do not drive it.<br><br>", "<b>Username: phantasmagoric</b><br><br>Stanford is not great because it's ranked high; rather, Stanford is ranked high because it is great. I don't care for overall undergraduate rankings, which are arbitrary and misleading. I do put stock in subject/departmental rankings, even if they are graduate ones, because the relationship between graduate and undergraduate strength in a given subject is about the same at Stanford (the same can't be said of most other schools, where the two are distinctly separated, and an undergrad's experience in a top department can be noticeably worse than a grad student's). And those subject rankings demonstrate quite well why Stanford is deserving of its reputation.<br><br>", "<b>Username: docfreedaddy</b><br><br>Hi Phantasmagoric and Solemn,<br><br>I appreciate your input and believe there is substantial value to the intellectual distillation process in these discussions. It seems rankings do hold considerable importance to both of you, as they do to the college bound consumer. Please note I have a professional and personal background in measurement science and am intrigued with this discussion simply because my careful inquiry and assessment of USC did not correlate well with its ranking.<br>It was but yesterday that I focused on the validity of rankings, first by reading what they actually measured, then looking to see what others have published. i'd appreciate your thoughts on the USNWR ranking as assessed by Bob Samuels, President of the University Council. His analysis would likely be of interest to all:<br><br><a href=\"http://www.huffingtonpost.com/bob-samuels/how-the-us-news-world-rep_b_699264.html\" rel=\"nofollow\">Bob Samuels: How the U.S. News &amp; World Report College Rankings Are Destroying Higher Education</a><br><br>I will look for other opinions from additional credible sources.<br><br>", "<b>Username: solemn</b><br><br>@docfreedaddy,<br><br>Please cite evidence of my saying that rankings \"hold considerable importance\" to me. That I think Stanford is a stellar school does not mean rankings are considerably important to me. Do not put words in my mouth.<br><br>If I'm not mistaken, your \"careful\" inquiry and assessment of USC amounted to perusing the school website (akin to taking a political party's assertions at face value) and briefly visiting the school. I would be curious, though, to know how many schools you've visited and conducted your rigorous analyses on? Did you talk with several faculty at all of the schools? Sit with several current students and hold in-depth conversations with them? Talk with them about the quality of their academic research? Ask them what they do in their spare time? Ask them what kinds of opportunities the university opened up to them?<br><br>The image schools project will inevitably be polished to the outsider, and on the surface very little distinguishes one college student from another (I assure you I could not tell, on the surface, a Harvard student from a USC student).<br><br>I don't doubt that the USNWR rankings are toxic to American higher education; rankings, however, are totally irrelevant to the discussion of the relative merits of Stanford and USC.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"It seems rankings do hold considerable importance to both of you, as they do to the college bound consumer. Please note I have a professional and personal background in measurement science\"\"<br><br>You ask others \"to maintain a respectful attitude in these discussion\" yet you continually patronize us. I am not college-bound, nor currently attending Stanford, but pursuing a PhD. I have more perspective on this than you think. I have already stated that I don't put any stock in overall rankings, yet you don't seem to believe me. Here's an article that I've often posted and endorsed about the US News rankings, written by the previous Stanford president Gerhard Casper (dated, but still relevant):<br><br><a href=\"http://www.stanford.edu/dept/pres-provost/president/speeches/961206gcfallow.html\" rel=\"nofollow\">Criticism of College Rankings - September 23, 1996</a><br><br>But even presidents of universities, chairs of departments, deans of schools, etc. all agree that departmental rankings make much more sense. That's because a department is not as complex an entity as a university, and its quality is judged by mostly academic factors, without regard to the many other factors that would be relevant when choosing a university (such as student groups, study abroad, etc.). You can see the quality of a department by the faculty, the students, the postdocs, the researchers, the facilities, the curricula, the programs, the courses, the resources. These are what make up a department, and these factors can be pinpointed, unlike the more vague/flawed measures of US News (\"alumni giving\" and \"value added\") and other rankings. The resulting rankings show why Stanford is among the very best in almost any subject, and why USC isn't. (FWIW, for my field of study, USC is easily one of the top 5, ahead of schools like MIT; I respect it very much.)<br><br>", "<b>Username: phantasmagoric</b><br><br>For the record, the faculty alone proves why Stanford is leaps and bounds ahead of USC. These are the faculty awards most often cited in comparing the faculty quality among schools - these are currently on faculty:<br><br><b>USC</b><br>National Academy of Science: 12<br>National Academy of Engineering: 35 [see <a href=\"http://www.insidehighered.com/news/2009/06/08/usc\" rel=\"nofollow\">this</a>]<br>American Academy of Arts &amp; Sciences: 21<br>Institute of Medicine: 13<br>American Philosophical Society: 6<br>National Humanities Medal: 1<br>National Medal of Science: 1<br>National Medal of Technology: 1<br>Nobel: 3<br>Pulitzer: 0<br>MacArthur: 2<br><br><b>Stanford</b><br>150 National Academy of Science (12.5x as many)<br>94 National Academy of Engineering (2.7x using USC's #, 4.3x using NAE's)<br>263 American Academy of Arts and Sciences (12.5x)<br>64 Institute of Medicine (5x)<br>51 American Philosophical Society (8.5x)<br>2 National Humanities Medal (2x)<br>18 National Medal of Science (18x)<br>2 National Medal of Technology (2x)<br>17 Nobels (6x)<br>4 Pulitzer Prize<br>24 MacArthur (12x)<br><br>This doesn't include countless other awards whose numbers USC does not publish, probably because no faculty hold those awards (like the Presidential Medal of Freedom, Wolf Prize, National Academy of Education, etc.). As you can see, Stanford's faculty is far more distinguished, despite the fact that USC's faculty is twice the size of Stanford's.<br><br>", "<b>Username: docfreedaddy</b><br><br>Thank you phantasmagoric. The compilation is impressive and one I would not be able to readily compile. It is clear from these awards that Stanford is highly regarded in science and engineering. I notice that even the American Philosophical Society \"promotes useful knowledge in the sciences and technology\". This seems in keeping with the data I am aware of that 44% of students are science or engineering majors. My daughter's interests are in non-science areas--literature, writing and journalism.<br><br>Is it possible to parse out the awards for each school for non-science faculty?<br><br>Secondly, it is important for my purpose to know how many of the awardees have regular teaching responsibilities for undergraduate rather than graduate students.<br><br>The lessons I recently learned from the college rankings may apply to the faculty awards as well. I was unaware of the history of the rankings, their lack of face validity, reliability, concurrent validity and predictive validity. Put simply, they were ill-conceived, offer little information about the quality of teaching and have been found deficient by educational researchers and administrators including from Stanford. A relevant criticism is criteria are selected which favor a handful of Universities including Stanford. Yet, they are relied upon by a naive public which in part help create a self-fulfilling prophecy.<br><br>The basis for the above awards, then comes into question. For instance the American Philosophical Society only accepts members nominated by resident members of the NPS, much like a fraternity. It may well be that the criticism of the college ratings applies here as well with awards made not necessarily upon merit but disproportionally through affiliation with APS members favoring preselect groups.<br><br>What is apparent is that elite group status, no matter how achieved, in our culture has significant advantages and in this regard I wholeheartedly agree Stanford likely offers a decided advantage over being a named scholar, honors college attendee and trustee awardee vs. one of many very bright students, I think!<br><br>The key question is what substantial reliable and valid data do I or any prospective parent/student have regarding the likely quality, intellectual and overal personal reward, not to mention personal fit, of one potential undergraduate experience over another? I have yet to identify such a measure.<br><br>One of the articles critical of college rankings posited the best predictor is how the student feels visiting and investigating the campus. The campus that excites and give the \"this is it\" reaction is the one. While non-intellective on the surface, this could well be the ultimate, reliable and valid summary measure, a melding of instinctual mammalian brain and neocortex. I am hoping my daughter has such a response when she visits Stanford once again.<br><br>", "<b>Username: Boondocks</b><br><br>Has this thread strayed from the original question of whether Stanford is worth six to ten times more than what USC costs (from the OP's perspective, anyway)?<br><br>Let's try to help the original poster, and not get into minutia.<br><br>", "<b>Username: DrGoogle</b><br><br>Football will be better at Stanford. :D<br><br>", "<b>Username: UCBChemEGrad</b><br><br>None of USCs Nobel faculty were at USC at time of award.<br><br>", "<b>Username: docfreedaddy</b><br><br>Does that tell us USC is attracting top faculty or is not fertile ground for producing them? Or is it a comment on the selection process?<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"The basis for the above awards, then comes into question. For instance the American Philosophical Society only accepts members nominated by resident members of the NPS\"\"<br><br>I figured you would make this argument. By this logic, we can't trust any awards because they could be based on some form of cronyism. But know that all these awards have an objective basis as well - such as required number publications and citations. Those who win major awards have usually won major awards before, so it's a sustained level of achievement, based on their impact and contributions to a field. It's not like USC faculty are on the same level as those at Stanford, but Stanford faculty get the awards because of cronyism. No, the research quality of most faculty at Stanford is objectively superior. They publish less, they're cited less, they're less influential on the whole.<br><br>Many of those awards are to professors of humanities/social sciences (AAAS, Pulitzer, Wolf, etc.). If you want to see the achievements of such professors individually, go to the department websites, click on each professor's webpage, and you'll see that they are all very accomplished.<br>\"\"The key question is what substantial reliable and valid data do I or any prospective parent/student have regarding the likely quality, intellectual and overal personal reward, not to mention personal fit, of one potential undergraduate experience over another? I have yet to identify such a measure.\"\"<br><br>It is completely dependent on one's personal preference. If you reject all the measures that you come across, then that's something you have to contend with. For me, that measure was research. Research quality in a given department is highly correlated with the many factors I mentioned before. And I was right in terms of those benefits for me. That may not be the case for everyone, and you need to figure out what is important to you. Or rather, to your child.<br>\"\"Does that tell us USC is attracting top faculty rr is not fertile ground for producing them? Or is it a comment on the selection p<br>rocess?\"\"<br><br>One can't say - it's completely dependent on each Nobel. For the record, two of USC's Nobels are 82 and 84, and one started at USC last year.<br><br>", "<b>Username: SiValley</b><br><br>There is no objective measure by which USC can be rated higher than, or even come close to, Stanford. Stanford generates a lot of envy, which may explain all the misguided attempts to compare USC to Stanford. USC is a great university in its own right, and is serious about making their way to better rankings - good for them. Stanford is in its own league. Just like Berkeley. There are many Ivies and all on the East Coast, but MIT, Caltech, Stanford and Berkeley are unique.<br><br>", "<b>Username: phantasmagoric</b><br><br>^ USC's administration is envious of Stanford (not a bad thing - Stanford has a lot to be thankful for), which is why their plans for the 21st century have frequently referenced/compared USC to Stanford. Both schools were founded about the same time, but they took two very different routes. (USC even took the Cardinal color 15 years after its founding, 3 years after Stanford did.)<br><br>", "<b>Username: Whan</b><br><br>Docfree, regarding the exclusivity thing and the 4% rate for the scholarship, I find pure statistics holds no value when comparing colleges. For example, I was admitted to the 8-year medical school MSP program at Rice university (a 0.8% admission rate, &lt;15 students admitted) along with full tuition but I choose to come to Stanford instead. Your D has already been admitted to these schools, so it's time to let go regarding what the admission statistics means for the \"reputation\" of the schools.<br><br>As far \"social intelligence\" and similar skills, there's plenty of room for learning here too. While perhaps some of the students are pretty absorbed in their academics and nothing else, there are plenty of opportunities here to develop one's emotional intelligence. I'm going to throw in a shameless plug for the greek system here; joining a fraternity last year was one of the best decisions I've made.You end up knowing many of the people in your class, learning to deal with new social situations, and also building important friendships and networks. Finally, keep in mind that Stanford has significantly fewer students while also having a larger campus. You probably miss a lot of the vibrancy taking a tour around campus during the day, since many people hang out within their residences and out during the evening.<br><br>", "<b>Username: docfreedaddy</b><br><br>Thanks Whan for the solid straightforward opinion!<br><br>", "<b>Username: docfreedaddy</b><br><br>SIValley, There seem to be few objective measures for comparison for undergraduate education period. Your comment that Stanford generates a lot of envy is significant. It reflects an odd perception that you apparently believe. USC appears to be secure in who it is and where it is going, from their point of view, which is rapidly rising in prominence. I sense more an uneasiness from those posting for Stanford that they do hear footsteps. One thing I know from being a triathlete, you don't turn around to see where your rival is. I sense a turning around.<br><br>The schools seem very different and likely serve a temperamentally and behaviorally different student, but from recent SAT scores, barely distinguishable. It may well be or may be becoming simply a matter of \"best fit\" for an undergraduate student for either school.<br><br>", "<b>Username: docfreedaddy</b><br><br>Phantasmagoric...an even more pointed example of self-perception. USC had Stanford in its crosshairs. The reference appears not to be jealousy, but a well operationalized goal for their ascendency. USC is committed to continuing its rise which even Stanfordphiles would have to admit, has quite an impressive trajectory.<br><br>", "<b>Username: bluenotebook2</b><br><br>My friend was also very brilliant and faced a similar decision. Her parents didn't make very much money and she wasn't given too much financial aid at Stanford, but she chose to go there anyways and hasn't regretted a minute of it.<br><br>", "<b>Username: docfreedaddy</b><br><br>Hey Bluenote. What did she major in?<br><br>", "<b>Username: bluenotebook2</b><br><br>she majored in engineering, I think, so it made a lot of sense! she's now re-thinking her major, but is completely enamored with Stanford and the multiple opportunities there. good question though- I forgot to mention that and I'm sure that played a big role! However, her parents had just bought a house and didn't have savings. Different factors, for sure.<br><br>", "<b>Username: bluenotebook2</b><br><br>I wish you the best of luck, and congratulations on your daughter's accomplishments! I hope I can make my dad as proud someday.<br><br>", "<b>Username: docfreedaddy</b><br><br>Thank you, Bluenote2, that is very kind of you. In her particular situation, each school offers a tremendous amount. The decision is hers to make. She will be making multiple visits to each school this month and determine where she fits best based on academic programs offered and overall atmosphere. I am and always have been very proud of her and confident she will make the best decision for her. i wish you the best in your education quest as well.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"USC appears to be secure in who it is and where it is going, from their point of view, which is rapidly rising in prominence. I sense more an uneasiness from those posting for Stanford that they do hear footsteps.\"\"<br>\"\"USC had Stanford in its crosshairs. The reference appears not to be jealousy, but a well operationalized goal for their ascendency.\"\"<br><br>I've watched the collegiate landscape for a few years now and know quite a bit about how academia works. Since you have also gone through academia, you should know as well.<br><br>Countless measures of institutional quality prove why USC is nowhere near Stanford right now (note: that is different from undergraduate education quality). USC has managed to game the rankings in the past few years in order to get a higher spot in US News, but as the Casper article I linked to you before noted, universities change very slowly, unlike rankings. A university's quality works like this: their financial resources allow them to build world-class facilities, which allows them to recruit high-quality faculty (who are ultimately what a university is judged by), which allows them to get more research funding, which allows them recruit the best students, all of which increases their prestige and all of which indirectly has an influence on their financial resources, and so on.<br><br>Back in the early 1900s, the endowment landscape had not yet formed, and so the ascendancy of any college was fair game. At the time, Stanford, Chicago, Caltech, etc. (even MIT, Cornell, Berkeley) were still in their infancy. Today, however, things are very different. The endowment landscape has solidified, and a distinct upper echelon of universities has formed almost exclusively because of their financial resources. While you and other USC fans may hate this, it is the reality: money is what allows the university to grow and surpass other universities. In short, money talks.<br><br>Part of the stated goal of USC's new fundraising campaign is to augment their endowment by $3 billion. But the-10 schools are not going to sit on their laurels while USC does this; they too are going to raise vast sums of money to augment their endowments. USC's $3.3 billion will grow, but so will top-10 schools' endowments. In 5 years, USC's endowment will be about $8 billion. But the schools it wants to overcome will have upwards of $20 billion in assets. Stanford will have upwards of $50 billion in assets. USC - among many other schools - has little to no hope of ever catching up to the top 10. Every step that USC takes, the top competitors will also take, and they already have an advantage in being able to take that step. USC would need to <i>exceed</i> their pace, which is extremely hard, since their pace is already far ahead of USC's. Even with USC's campaign (which many have considered to be overly optimistic - they have raised only 1/6 of the campaign during the quiet phase, when large campaigns usually raise nearly half during the quiet phase, so USC's campaign may well run out of gas too soon), it <i>still</i> won't come close to breaking the top 10. The best USC can hope for is a serious economic depression greater than the last one, which would level everyone's assets and put them on even footing with USC. Do you think that's likely?<br><br>And USC has explicitly stated goals of becoming one of the top few (a la HYPSM) influential universities. You gotta have dreams, right? Even USC's president acknowledges it's a long, long way before it can even reach the top 10, much less become level with Stanford. IMO, it'd be lucky to break the top 15 (top 15 <i>not </i>according to US News, but to the financial resources), but I do think it'll definitely make it to the top 20, alongside Emory, Vanderbilt, Rice, etc.<br><br>", "<b>Username: docfreedaddy</b><br><br>Thank you Ph..... As always, I enjoy your comments. Please note my primary interest is a dad's due diligence for two \"Finalist\" choices of my daughter's college acceptances. She is a most able individual who will be making her own choice based on a sense of \"fit\" with Stanford and USC after further visits. I am confident she will make the best choice for her given her investigative abilities to ascertain the intellective and student body qualities of each and her own sense of herself. For my part, I judge both Stanford and USC to be excellent choices for her, each with its own character and advantages.<br><br>As you note, many of the points you raise relate to graduate education and the perception and rankings of university programs, as opposed to undergraduate. While this is less relavent to my immediate concern, it is quite instructive and engaging in its own right. I am primarily struck by the broad and seemingly valid criticism of rankings and the extent rankings correlate with endowment. I certainly agree that sufficient funds are needed to attract world class faculty and sustain a university, yet the degree of correlation seems to beg other bases. As an analogy, money is often though to bring happiness or quality of life. It does, but only up to the point basic needs are met without struggle. A university's largesse may feed upon itself, but in itself will not sustain excellence. Vision and execution will. Another analogy may well illustrate other operative factor in the rankings. Our culture is drawn to wealth and most perceive the wealthy as enviable, enough to buy many lotto tickets. Further, the wealthy tend to associate with each other and limit entrance to their class. What is operative in rankings based on voting by those from the top 5 ranked schools (with top endowment), the 1% if you will and the rest (the 99%). How many guidance counselors really know each school well vs. voting the money? How many of the top 5 really just vote for each other both for rankings and individual award candidates? I suspect factors such as these account for a significant degree of variance.<br><br>You note that USC has raised just 1/6th of its 6 billion total during the quiet phase which was just one year. What you do not note is most universities extend the quiet phase for two or three years, hence have a larger base % before announcing. A recent post on college confidential that seems accurate indicates USC had 1.7 billion raised as of March 2012 and there is speculation an announcement will be made im May (2 billion). USC clearly expresses much confidence in defying convention with a 1 year quiet phase and has produced dour expressions from some including you. But, what if they do reach their goal or reach it ahead of schedule? How will that affect the attitudes and perceptions of the critics?<br><br>You make the valid point that while USC is raising funds Stanford and even more well endowed universities will be doing the same, hence USC will never catch up. USC had about 3 billion in endowment funds at the end of 2011. They have announced plan to raise 6 billion by 2018. That is a 200% increase. I believe Stanford had 13 billion in endowment. Are you aware of any plan or announcement for Stanford to raise 26 bilion over the next 6 years? Or how about Harvard at about 27 billion? Any announcement or plan for Harvard to raise 54 billion in the next 6 years?<br><br>One can argue they don't need to and obviously neither Stanford or Harvard will keep pace with the percentage endowment growth anticipated for USC. What does this mean? My only point is something quite dynamic and exciting is happening at USC. Perhaps it is a function of their growth phase as an institution, perhaps a function of vision and leadership. I see it in their programs and the vitality felt on campus and it appears it will be reflected in the endowment/university ranking measure.<br><br>This is not to take away from Harvard or Stanford. They are mature, remarkable institutions who do have much challenge to maintain their place as mature universities. As a parallel with the technology corporate world, well known to Stanford, Microsoft enjoyed unparalleled growth and generated much excitement for a while when Facebook did not yet exist. Organizations change, grow, evolve, maintain or decline. I think for a college student, the growth phase may be the most enriching and exciting. Perhaps I'll start a ranking for endowment percentage growth and see what unintended valid or invalid attributes are attributed to those ranked. Are you in?<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"many of the points you raise relate to graduate education and the perception and rankings of university programs, as opposed to undergraduate. While this is less relavent to my immediate concern, it is quite instructive and engaging in its own right.\"\"<br><br>I think you're less concerned about it than you perhaps should be. At top private schools, graduate education and undergraduate education are not as distinctly separated as they are at most other schools. At Stanford, the two are intimately connected; they are inseparable. It makes little sense to ignore graduate strength when it has such a profound effect on undergrads.<br>\"\"What you do not note is most universities extend the quiet phase for two or three years, hence have a larger base % before announcing.\"\"<br><br>But that's missing the point, which is that a university only leaves the quiet phase once it has exhausted the core of its major donor base. That doesn't mean that they won't get large donations later on in the campaign - but USC is keenly aware of which of its alumni are rich enough to donate huge sums and has already courted them. Thus, it exits the quiet phase and opens the campaign up to the public. Doing this with only 1/6 of the total raised does not bode well for the campaign, but of course USC has a better idea of its alumni base. I'm just pointing out that it's odd when you compare it to every other multi-billion dollar campaign, which gets 1/3 to 1/2 of its total during the quiet phase.<br>\"\"I believe Stanford had 13 billion in endowment. Are you aware of any plan or announcement for Stanford to raise 26 bilion over the next 6 years? Or how about Harvard at about 27 billion? Any announcement or plan for Harvard to raise 54 billion in the next 6 years?\"\"<br><br>Stanford has a $16.5 billion endowment as of the end of FY2011, but that number is $19.5 billion including the assets that act like an endowment but are not legally 'endowment.'<br><br>Stanford does 'need' to raise $26 billion as you suggest. The growth I indicated before is simple investment returns. Since the economy is buoying, the endowments have shown strong growth. Assuming a 20% return (this past year it was 22% and in recent years has gone even higher), Stanford would have $49 billion in 6 years, or $58 billion starting from $19 billion. Even assuming a 15% return would yield $38-45 billion within 6 years. Of course, a university is able to achieve higher endowment growth by augmenting it with donations, so that it grows at a rate higher than normal (re)investment would allow.<br>\"\"obviously neither Stanford or Harvard will keep pace with the percentage endowment growth anticipated for USC. What does this mean?\"\"<br><br>They most certainly will keep up with it, and likely exceed it. This is partly because they have some of the most elite investors managing their endowments. Furthermore, Stanford has proven that its fundraising prowess far exceeds USC's and even Harvard's. Stanford's 5-year campaign had a goal of $4.3 billion and reached that goal in 3; it finished with $6.23 billion.<br><br>If you've kept up with the news on this, Harvard is about to announce its own fundraising campaign, which will probably be record-setting, considering that it's been a decade since Harvard had a campaign (in elite higher education, that's a very long time between campaigns), which is mainly because of delays from their president being fired and the recession. Those involved in planning the campaign have said it will be at least $6 billion, and rumor has it that it could be upwards of $10 billion.<br>\"\"My only point is something quite dynamic and exciting is happening at USC\"\"<br><br>I don't think you quite understand how run-of-the-mill this \"exciting something\" is at elite universities. Yes, it's new for USC, which is trying to put itself among these universities. But multi-billion dollar campaigns, new endowed professorships, large sets of new buildings, etc. are very routine at the top privates. Columbia and Cornell, for example, are both currently in the midst of $5 billion campaigns, and will likely raise $6+ billion within an 8-year time frame (in other words, they are matching and/or exceeding USC's rate of fundraising for its current campaign).<br><br>I know I probably sound like a negative nancy, but I'm being realistic. This is the reality of elite higher education, and it's important not to get caught up in the feel-good promotion that USC is espousing and to put its efforts in context. It is ambitious for USC to set its sights on placing itself among the most elite universities in the world, and it's made many recent gains that are in stark contrast to its previous growth, for which it deserves praise. But make no mistake: this growth is merely approaching the growth of tippy-top privates, at which point it will not be \"on par\" with them. Rather, in order for it to catch up in absolute terms, its growth needs to <i>exceed</i> their growth. Furthermore, it needs to <i>sustain</i> this superior growth for an extended period of time in order for it to catch up to them. Then, it needs to sustain that superior growth for an even longer period of time in order to surpass them. Then, as long as its growth rate does not dip below the others', it will remain solidly ahead of them.<br><br>But remember that the growth of these elite universities is far above average, so even matching the growth is a challenge, much less exceeding it and sustaining it. Now imagine that USC manages to bump past some top privates - how do you think they will react? They will redouble their efforts to maintain their position. They will not go down without a fight, and there's no reason to believe that they wouldn't be successful in maintaining their position. And USC has to fight through <i>all of them</i> before reaching the behemoths that are Stanford, Harvard, MIT, etc. which are a completely different, above-and-beyond force to reckon with. Do you see now why the road ahead for USC is not just bumpy, but dark and likely unnavigable?<br><br>Consider, also, the capital ceiling that each of these schools faces (and as I said before, the physical capital is where a university's strength begins). USC's core campus is very constrained by the surrounding city, and so its expansion is severely limited; it's currently trying to redevelop buildings it owns that are integrated with the city (similar to NYU). Harvard has exhausted its core Cambridge campus and is expanding across the river to a largely undeveloped 350+ acre area, which will double the current size of its core campus.<br><br>On the other hand, Stanford has thousands of undeveloped acres contiguous with its core campus. Within time, it will use this land to begin expanding its academic facilities (esp. west campus), as well as creating housing for all grad students and all faculty/researchers, something that USC, and even Harvard, will likely never be able to do. Stanford is poised to become the first fully residential, fully integrated university in the world. The extent of the advantage that this will confer upon Stanford is unknown, but it's likely immense. It's part of the reason that Harvard has been desperate to develop its Allston campus, in order to keep pace with Stanford's capital growth, something that no university today has been able to match. If even Harvard hasn't been able to do that, do you think USC will?<br><br>", "<b>Username: docfreedaddy</b><br><br>Stanford had publicized ambitious plans to build a NYC campus, then quietly withdrew them. Perhaps they recognized the limits of life on the farm vs. a dynamic city environment or the project exceeded their projected endowment forecasts. In any case, announcing such an exciting development, then quietly tiptoeing out of it seems to indicate a bit of faltering.<br><br><br>Your projections for endowment yield are of interest. As you are aware, past performance is no indication of future performance. With regard to past performance, Harvard and Stanford had endowment losses in the 20% range a few years ago. A 25% return is necessary to just recover equity from a 20% loss. Few macroeconomists are confident in conditions for sustained economic growth and performance of equities going forward.<br><br>Typically, and reasonably conservatively, universities go beyond their silent period when donations abate. USC seems to be confident in taking an atypical path. You seem to be unwilling to acknowledge the indications that they do have 1.7 billion at present. Will you be willing to adjust your dour perspective if they announce 2 billion raised by May 1, 2012?<br><br><br>The objectives of graduate faculty and graduate students is of necessity on publication and securing grants as well as ascending the department structure (securing tenure, promotion). Teaching undergraduates then becomes a distraction or at least not the highest or sole priority in major research institutions. I do not agree that there is necessarily a positive association between undergraduate and graduate education.<br><br>The excitement I refer to has nothing to do with fund raising and endowment totals, but the vibrancy of student and faculty evident on campus and in the classroom. I am hoping my daughter finds the \"exciting something\" in the student body on her upcoming extended visits to Stanford. Unlike USC, it is not an immediate or widespread impression. Perhaps with more time and diligence an extended search will uncover it.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"In any case, announcing such an exciting development, then quietly tiptoeing out of it seems to indicate a bit of faltering.\"\"<br><br>No. It withdrew from the competition because the EDC of NYC was doing a bait-and-switch.<br>\"\"the Daily wrote: the city required Stanford to proceed with the project even if the city revoked the $100 million it promised to the competition winner. ...<br><br>They wanted us to indemnify them for anything they had done, anything that had happened. So for example, if somebody sued about exposure to chemicals 20 years ago, we would have been liable; and thats an example.<br><br>Hennessy added that the city also backtracked on the amount of land they had promised. Originally, Stanford believed they would be granted land from shore to shore on Roosevelt Island. But New York cut back the land offer, which meant that Stanford would have to pay to buy additional land if they wanted to build the campus for which they originally planned.<br><br>Finally, Hennessy said Stanford could not see eye to eye with the city on how quickly the campus could scale up.<br><br>We would not compromise our faculty hiring standards, Hennessy said. Particularly when many faculty already believe they live in Nirvana[that] increased some of the issues for us in terms of how to scale up.<br><br>Hennessy and the faculty committee resisted the citys push to ramp up quickly.<br><br>This needs to be one university, two campuses, not an A campus and a B campus, Hennessy said. Clearly, a smaller campus but it cant be different quality-wise. And that I think was a real point of differentiation between Stanford and what the city wanted.\"\"<br><br><url>http://www.stanforddaily.com/2012/01/30/stanford-officials-reflect-on-nyc-negotiations/</url><br>\"\"As you are aware, past performance is no indication of future performance. With regard to past performance, Harvard and Stanford had endowment losses in the 20% range a few years ago.\"\"<br><br>Of course, as did USC. Recessions, which occur about every decade, continually knock down investment performance, which yields a more modest 10- or 20-year annualized return. Over the past 20-30 years, Stanford has been able to get upwards of 12-13% annualized returns; getting into the double digits for that year range is excellent and requires a highly diversified portfolio. Stanford's endowment has continually outperformed all general market benchmarks <i>because</i> of its diversified portfolio. In fact, all the mega-endowments have seen unprecedented growth because of this diversification. Even when you account for the recession, they have still been growing at rates far greater than before, and that's a reflection of a changing philosophy in investment.<br><br>Either way, you can bet that whatever Stanford's return rate is, USC will at best match it, at worst fall far behind.<br>\"\"USC seems to be confident in taking an atypical path. You seem to be unwilling to acknowledge the indications that they do have 1.7 billion at present. Will you be willing to adjust your dour perspective if they announce 2 billion raised by May 1, 2012?\"\"<br><br>I have acknowledged it. I am not impressed by it as you are, because I have a bit more knowledge about this. And my attitude is such not because it's USC; if this were Stanford, I would be skeptical as well. My perception may be \"dour,\" but it is realistic.<br>\"\"Teaching undergraduates then becomes a distraction or at least not the highest or sole priority in major research institutions.\"\"<br><br>You are making a fundamentally flawed assumption about every research university. When the undergraduates are as accomplished, intelligent, and capable of advanced learning and research, as Stanford's undergraduate student body is, the integration with the graduate division is easier and more natural. So it is not just \"publication and securing grants\" that matters here. As I said before, undergrads have access to the small classes offered as graduate courses; grad students take undergrad courses and vice versa. Both kinds of students learn together. Undergrads have access to the same facilities that are built to facilitate the research carried out by the faculty, researchers, postdocs, and grad students. They have access to all the same resources. It is integrated; this is not the case at the vast majority of universities, including USC and top public schools.<br><br>The combination of research, facilities, resources, etc. all play into an undergraduate's education. That is the nature of a research university. Teaching is still great at Stanford. But I'll add that most students are more than capable of learning on their own; even if the teaching were bad, their learning would not be harmed. As has been oft-discussed on CC before, if you need someone to get in front of you and teach in order for you to learn, you have much bigger problems to worry about than the quality of the professor's teaching. That's a discussion for another day, but the point is that most of the real teaching that a professor does is in his/her engagement with students. That occurs through small classes (overwhelmingly more numerous at Stanford than at USC) and through research. In short, the research-focused nature of the graduate division complements, not detracts from, undergraduate education.<br>\"\"Unlike USC, it is not an immediate or widespread impression.\"\"<br><br>It actually is - you're just basing your perception on a short visit during the summer, when the campus is relatively sleepy.<br><br>", "<b>Username: docfreedaddy</b><br><br>I am troubled by your seeming uncritical acclaim for Stanford. Are you employed by Stanford to manage its reputation on these boards?<br><br>Your quotes regarding the abrupt departure by Stanford are incomplete and misleading:<br><br>\"Meanwhile, The New York Times reported that the University, with no experience building in New York, recoiled at meeting terms laid down by the city after its proposal was submitted, while Cornell, with extensive experience in the cityits medical school is in Manhattanexpected such negotiations. The New York Times quoted a city official as saying, Stanford could not or would not keep up. \"<br><br>Perhaps Stanford dropped out to save face:<br><br><a href=\"http://www.betabeat.com/2011/12/21/aerial-video-flyover-cornell-technion-12212011/\" rel=\"nofollow\">Stunning Aerial Video of How Cornell-Technion Campus Will Change the Landscape of New York | Betabeat  News, gossip and intel from Silicon Alley 2.0.</a><br><br><br><br>Diversification has not worked as macroeconomic factors have made markets highly correlated. Trying to defend diversification to defend Stanford is an odd stretch. The ten year average for Stanford was 9.3% with a 27% loss in 2008.<br><br><a href=\"http://www.bloomberg.com/apps/news?pid=newsarchive&amp;sid=aY7Q_PLwFGoE\" rel=\"nofollow\">Stanford Endowment Loss Prompts President to Suspend Smoothing - Bloomberg</a><br><br>Presenting Stanford as infallible and with a seeming bias detracts from its many accomplishments.<br><br>I will not detract from Stanford or its students. The perception that Stanford students and the campus environment is relatively less vibrant than USC has been observed by many from the business and academic community. I do not mean this as a jab at all nor am I condoning it, but what must be the impression of many involved in NYC? Quoting again from the article you cited:<br><br>\"Cornell, Stanfords main competitor and the ultimate competition winner, announced a $350 million gift hours after Stanfords withdrawal, prompting speculations that Stanford had pulled out after hearing about Cornells donation in advance, an allegation that Stanford administrators have denied.<br><br>Meanwhile, The New York Times reported that the University, with no experience building in New York, recoiled at meeting terms laid down by the city after its proposal was submitted, while Cornell, with extensive experience in the cityits medical school is in Manhattanexpected such negotiations. The New York Times quoted a city official as saying, Stanford could not or would not keep up.\"<br><br>Finally, each school seems to attract different types of students with different proportions of science vs. humanities majors and likely other meaningful yet-to-be specified personal differences as a basis. Perhaps others have input in this regard.<br><br>I do think an open discussion of these two private California universities is of benefit to me and perhaps to others. An unrealistic or selective presentation of Stanford is not of benefit to anyone and seems more an ivory tower debate than a true quest for understanding.<br><br>", "<b>Username: hope4usc</b><br><br>I'm tired of all you people posting long posts haha<br><br>", "<b>Username: zenkoan</b><br><br>docfree, way to give a left-handed compliment to phantasmagoric. No, Stanford doesn't employ people to participate in these forums--as if a school universally regarded as one of the very finest on the planet would have to do that! LOL<br><br>phantasmagoric does have an astonishing degree of familiarity and information about Stanford, however, and he's frequently donating his efforts here so others, you included, can make realistic comparisons based on the current state of factual affairs--rather than on wishful thinking or rationalizations. Everyone who gets a big merit discount at a good school would like to try to minimize the differences between that school and an insanely great one; that's human nature. But that desire has no bearing on the facts. And, obviously, every person must determine for himself the extent to which he is willing to pay, or take on debt, to avail himself of the more costly choice. Nor is this the zero-sum game some people make this out to be--the fact that Stanford is in a whole other league than USC at this time doesn't make USC any less strong than it is. Each is what it is, and costs what it costs. Attempts to equalize manifestly unequal things in your mind, whether to rationalize major cost differentials or otherwise, probably won't help clarify the decision in a meaningful way. Again, I hope that whatever decision your family reaches, that you will all be satisfied with it.<br><br>", "<b>Username: docfreedaddy</b><br><br>The decision is my daughter's who is uninvolved and not privy to my postings. Yes, there is some cognitive dissonance. If you read my post, my concern was with P's. If you believe I was providing a left-handed compliment and not gently commenting on an absurd degree of selective information, bias and prejudice, I am even more concerned about objectivity in self-perception in the bubble on the Farm. Neither NYC, Cornell or many others share such an insular perspective. There is a broad world which responds to a range of positive values beyond endowment totals and awards/accolades from crony institutions.<br><br>Stanford is a great institution which I admire, but it seems self-awareness and a belief you know more than others may be an area for further growth. I have no vested interest where my daughter attends and money is not a consideration. The best undergraduate experience for her is and if she chooses Standford I think she is sophisticated enough not to fall prey to the apparent insularity issues that can develop for some.<br><br>", "<b>Username: zenkoan</b><br><br>uh, no docfree, I wasn't suggesting that I thought you were praising phantasmagoric by asking whether he was a hired spokesperson, but you inadvertently did so, since the depth of his knowledge aroused your suspicions, which are inaccurate. And fyi, phantasmagoric regularly describes aspects of the Stanford experience that he thinks could be further improved; he's not \"absurdly\" biased/prejudiced, just calling things as he sees them from his informed vantage point, and always supplying relevant data to substantiate his statements. So, there's no call for smug or condescending remarks to students who are sharing their views in an effort to help others in their decisions. Good luck to you.<br><br>", "<b>Username: docfreedaddy</b><br><br>I am sorry you see my remark as smug or condescending. I was attempting to restore balance to an open forum and perhaps encourage a redirection to my original question. Yes, P obviously devotes a great deal of time to this forum, but if you read my specific comments above, I am concerned with the extent he appears to speak with authority and may mislead others when in fact he is presenting partial information that only supports a most favorable view of Stanford. Not everyone has the time to fact check. Omitting contrary information which you have available is not an \"informed vantage point\" but bias--perhaps unintentional and borne of \"school spirit\", but not helpful to anyone seeking a valid perspective.<br><br>While a tired cliche, in the Stanford NYC proposal there clearly are two sides to the story. P presents but one, quite indisputably, if your read the entire article (some sections P. omitted I quote above). The comment about being employed by Stanford was purely tongue in cheek, again referring to bias. By no means am I suggesting that Standford admin really employs such people, I was just exaggerating for effect the point of bias present.<br><br>I suppose the more significant comment is that an undergraduate or graduate education, especially in a highly regarded university, would be expected to cultivate openness, rather than bias, especially in a forum such as this where an attempt is made to secure a range of opinions to assist in evaluating two undergraduate programs. This is not a debate or a political party discussion, but an attempt to secure useful and valid information. As such, I think due care needs to be taken to be responsive to the original question and objective with information provided.<br><br>", "<b>Username: phantasmagoric</b><br><br>docfreedaddy, I'm surprised that someone like you would make a personal attack rather than respond maturely. I certainly don't have 'uncritical acclaim' for Stanford - I've criticized Stanford for many things (did you see my extremely long post on the 'why NOT Stanford' thread? You posted on it right after I did). But for the current topics of discussion, there is little to criticize Stanford for - the integration of graduate and undergraduate education, the growth of its financial assets, the sheer size of its capital growth. All of this is incontrovertible.<br><br>I'm simply offering a more realistic explanation for how universities work. You seem to be relatively uninformed about how university capital growth works, and that's something I've spent time learning about. Do you disagree that USC must not only exceed the growth of its competitors, but sustain that growth in order to surpass them, which is USC's explicitly stated goal? Do you disagree with the points that I'm making? If so, you should state why and offer evidence to the contrary.<br><br>You can choose to believe that Stanford left the NYC competition \"to save face\" - based on an article from a self-described gossip site that was speculating a few short days after the competition's end, rather than on an article published a month later in which Stanford's highest administrators were interviewed. It's not \"selective information, bias and prejudice\" to exclude gossip from a news source with no credibility that was released when there was much confusion about what exactly happened. But it's surprising that you would prefer that outdated speculation, since you're ostensibly here to get perspective and learn something. (You can lead a horse to water, etc.)<br>\"\"Diversification has not worked as macroeconomic factors have made markets highly correlated. Trying to defend diversification to defend Stanford is an odd stretch.\"\"<br><br>This is uncontested fact. If you read about the mega-endowments, you'd know that it's precisely because of a diversified portfolio that they have grown to absurd heights. It's called the Yale Model:<br>\"\"wikipedia wrote: Central in the Yale Model is <b>broad diversification</b> and an equity orientation, avoiding asset classes with low expected returns such as fixed income and commodities.\"\"<br><br><a href=\"http://en.wikipedia.org/wiki/David_F._Swensen#The_Yale_.28or_Endowment.29_Model\" rel=\"nofollow\">David F. Swensen - Wikipedia, the free encyclopedia</a><br><br>And no, I'm not some insider who wrote that in the article to boost Yale or whathaveyou. ;)<br>\"\"An unrealistic or selective presentation of Stanford is not of benefit to anyone and seems more an ivory tower debate than a true quest for understanding.\"\"<br><br>There are meaningful differences between Stanford and USC; some of them are in Stanford's favor, some of them are in USC's favor. However, for the past several posts, you have brought up nothing for which Stanford could be criticized. Further, through rose-tinted glasses you're exalting USC and then faulting me for supposedly having bias. Notice that I have thus far refrained from calling you biased (you claim that you aren't, but it's quite obvious you are), and my 'biased' replies are only in response to your off-color claims favoring USC.<br>\"\"but it seems self-awareness and a belief you know more than others may be an area for further growth\"\"<br><br>Actually, it is you who first put forth that belief, by outright stating you have knowledge and experience that we do not. You called for others to remain respectful, then you yourself patronized other posters. Finally you've shown multiple times that you haven't informed yourself about certain topics - for example, when you suggested with a comically \"gotcha!\" tone that Stanford would need to raise $26 billion in the next few years (ignoring the normal investment growth), or when you discussed the quiet phase, or recently when you suggested diversification is an \"odd\" reason for high growth (in reality, this is the very first fact that one learns about why the largest endowments have abnormally high returns).<br>\"\"I was attempting to restore balance to an open forum\"\"<br><br>Then you should focus your efforts where such balance exists; what you've focused on, however, factually is in Stanford's favor. If you want to talk about having a wider range of professional disciplines, then that's in USC's favor. If you want to talk about the arts and film studies, that's in USC's favor. If you want to talk about access to city life, that's in USC's favor. If you want to talk about the benefits of having a highly international student body, that's in USC's favor. But topics such as capital growth are not, by any objective standard, in USC's favor.<br>\"\"he appears to speak with authority and may mislead others when in fact he is presenting partial information that only supports a most favorable view of Stanford.\"\"<br><br>Please provide <i>credible evidence</i> that contradicts my points, in particular with regard to diversified endowments, capital growth, the quiet phase of a university campaign, the NYC competition, and any other points that you find to be 'biased' or 'untrue.'<br><br>FWIW, I wouldn't sound biased if you weren't continually rejecting and/or misrepresenting simple reality.<br><br>", "<b>Username: docfreedaddy</b><br><br>P. Thank you. Yes, you are correct. I have no desire to criticize Stanford in any way. Your input is most interesting from a number of perspectives. I believe you have been helpful to the maximum extent possible in fulfilling my goal to differentiate the day-to-day environment of USC and Stanford.<br><br>", "<b>Username: 9help9</b><br><br>Ok. Everyday when I wake up I'm convinced S2 should go to USC with the Trustee Scholarship; and everyday by bedtime I'm convinced Stanford (with no aid) is too good to pass up. I feel like we're stuck, -like in the movie \"Groundhog day.\" Unfortunately (and perhaps intentionally) Stanford's admitted student weekend isn't until April 26th. The big question remains: Is the Stanford undergraduate education worth $200k more than the USC undergraduate education?<br><br>", "<b>Username: ewho</b><br><br>The \"bedtime\" headache should be easier to deal with than the morning one, and your kid should be happier to get what he wants, by using your $. :)<br><br>Stanford does it on purpose to make the admit weekend so close to May 1. They try to give you enough time to think over, and if by the admit weekend you are still undecided, you most likely would come to Stanford after admit weekend.<br><br>", "<b>Username: simba9</b><br><br>\"Is the Stanford undergraduate education worth $200k more than the USC undergraduate education? \"<br><br>I've gone to both schools, though at the graduate level. I'd say the answer is \"no.\"<br><br>", "<b>Username: docfreedaddy</b><br><br>Can you elaborate?<br><br>", "<b>Username: phantasmagoric</b><br><br>To be clear, simba9, you took at least one class at a Stanford grad program, but were never enrolled in a degree program, correct? Of course you can still make the judgment that a Stanford education isn't worth $200k over USC (as I implied in my first post, though admittedly I've never gone to USC), but since you were never a student in a degree program at Stanford, nor did you pursue an undergraduate curriculum, it's a little misleading to use your background (\"gone to both schools\") as evidence of authority.<br><br>", "<b>Username: anxiousfather</b><br><br>That is a no-brainer. USC full tuition. Duh! (And I have a child at Stanford!)<br><br>", "<b>Username: 9help9</b><br><br>I wish we could've been as sure as you are! But for us it was anything but a no-brainer. Only yesterday, when S2 was notified his Trustee Scholarship was upgraded to the Stamps Leadership Scholy did he decide on USC.<br><br>How well has Stanford lived up to its reputation for your daughter/son?<br><br>", "<b>Username: anxiousfather</b><br><br>9, my son has done well at Stanford, and he has enjoyed the experience. That said, I suppose the same would be had he chosen another institution. I will tell you, if he had been offered a full-ride at USC, I would have advised him to take it. I do not believe it is worth the premium over a school like USC.<br><br>", "<b>Username: zenkoan</b><br><br>Obviously, there will be a large subjective element for each person when considering whether a certain premium is worth paying for one school versus another. They'll take into account the student's interests and plans, the family's resources and other financial commitments, et al. One thing I would suggest adding to the mix is the fact that, outside of CA, there isn't yet much awareness of the strides that USC has made in recent years. It takes quite a while for perceptions to catch up. As of now, most people outside of CA think of USC as having a great film school, but don't otherwise think of it in distinguished terms. So if having the global reputation for across-the-board excellence is very important to you, you would place some measure of premium on that, in addition to many other factors too numerous to list. Stanford and its peer schools are loaded with students who turned down full rides or full tuition offers at other good schools, but only a student and his/her own family can determine whether doing so is the best overall decision in that particular case.<br><br>", "<b>Username: anxiousfather</b><br><br>zenk, yes, but they're asking for opinions here. USC has a strong reputation outside of California thanks to the US News &amp; World Report rankings. I live in Texas and have a younger son graduating from HS this year, whose friend chose USC over other strong schools. The question is whether a free education at USC is worth turning down Stanford, and the answer has to be yes. You're not talking about a 2nd rate school here.<br><br>", "<b>Username: zenkoan</b><br><br>I think highly of USC myself, anxiousfather, and I understand what the question is. I am suggesting that part of the answer to the question involves the limited extent to which USC's strides have been widely recognized outside of CA. I've come to know more about USC since moving to CA for college, but before that I lived on the east coast and elsewhere, and few people in those locales are familiar with much about USC other than its great film school. I'm not endorsing that kind of reductionism in evaluating colleges, but it's still operative for the time being. As I said above, everyone will have a subjective take on the importance of that, depending on their circumstances.<br><br>", "<b>Username: Boondocks</b><br><br>I live 3000 miles from California, and never has my first thought of USC been of its film school.<br><br>The graduates of USC Ive run into have for the most part done very well, and none were in the film industry.<br><br>Ive always thought of it as a first-rate university, probably a tad below the elite schools. I think US News ranks them about #25 (for whatever their ranking means), which seems awfully good for me.<br><br>When I was looking at schools 35 years ago, they called USC the University for Spoiled Children, implying it was a long ways from 2nd rate.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>University of Second Choice<br>University of Scholastic Compromise<br>University of Special Connections<br>University of Spoiled Children<br>University Surrounded by Crips<br><br>All those nicknames don't really apply anymore...except maybe the special connections.<br><br>", "<b>Username: smilldeb</b><br><br>Wow, it's nice to see so many others having the same questions about this issue. My S also is deciding between Stanford which has offered no financial aid and our appeals so far have been to no avail even though all his other universities offers have granted us an avg 25k of need aid. Trustee Scholarship to USC? or Stanford? Stanford is his dream school and a better fit for size, etc. He's being highly recruited by a couple D3 schools too that he's been admitted to but he's determined the money at USC is worth more to him than his desire to attend the his other options with the exception of Stanford. Just went to the local Stanford admitted student reception this week as he can't attend the Admit student day at either Stanford or USC. We'll attend the local reception for USC later this week. Hopefully it will help him decide but like many of you, he'll likely attend Grad School, likely Law School. But Stanford also has a a Coterm program that would allow a grad/undergrad degree simultaneously which would help make the investment more worthwhile since he's considering a double major anyway. Tough decisions! I'm still hounding the Stanford FA office before he makes a decision either way.<br><br>", "<b>Username: bluebird</b><br><br>USC was my son's safety school. He was all set to attend the scholarship interview and admit special event then he received a likely letter from Stanford. The next day he canceled USC. There was no comparison between getting a scholarship at USC vs full pay at Stanford for him and our family. That being said he would have been very happy if USC would have ended being the best school he got into, he loved it when he visited.<br><br>", "<b>Username: anxiousfather</b><br><br>blue, I suppose money is not an issue in your case, which is great. For most, however, a full ride at a school like USC would be compelling enough to forgo Stanford at full price.<br><br>", "<b>Username: hillary21</b><br><br>just a word of gratitude &amp; appreciation to phantasmagoric &amp; zenkoan. always appreciate their posts, comments, insights, etc. very objective, fair and respectful. their efforts to posts here are really commendable. i was a long time lurker here, and last year we have to make a big difficult decision. son made it to stanford but had many free ride offers from other elite univ, USC included among others (USC was his safety private univ cause we know he'll get full ride). he also made it to Cal as regents scholar plus leadership scholarship, and UCLA regents plus dream fund scholarship, both giving him almost free ride (plus a lot, lot more comps) bec im a custodial single mom, but different story with stanford cause S dad's income has to be considered. in fact, bec of $ considerations &amp; all the offers that came with it, we actually already did submit SIR with another university, but at the very last minute, backed it out and chose to go to stanford instead.<br><br>again, i am very thankful for all of phantasmagoric &amp; zenkoan's very objective and valuable posts. it helped us decide in a lot more ways than one. S is now a very happy student at stanford and doing well and we have absolutely no regrets, and not living with any what-ifs in mind, even though we have to pay, S has to work and take loans. i cannot say this enough, but there is nothing like Stanford - the world-class education, the experience, the environment, the facilities, the staff/admin/professors and students themselves, and a lot, lot more. everything is just world-class. imo, this is the only university worth foregoing any free ride fr another (elite) university. there is just nothing like Stanford.<br><br>", "<b>Username: anxiousfather</b><br><br>hillary, nice to have differing opinions. My son chose Stanford over Columbia and a state flagship school, so it is nice to see that people feel it is worth it. He did not, however, have any full ride offers (didn't apply;-) to such schools as USC.<br><br>", "<b>Username: simba9</b><br><br>Phantasmagoric, I took about 10 or so graduate-level classes for credit at Stanford when I worked there. They ranged from Computer Science to Math to Literature. I already had a graduate degree from USC, so these were purely for \"the joy of learning.\" You can do that when you get old. Plus, I got a good discount on tuition.<br><br>You do get a feel for what classes are like when you're sitting in them.<br><br>As for why I think Stanford + $80K is the wrong choice in this case - if the OP wanted to be a high-tech entrepreneur, or an academic, or was interested in making business or political connections for later in life, then paying an extra $80K for a Stanford degree would probably be worth it. Otherwise, what one learns in a USC undergraduate class isn't going to be much different than what one learns in the same Stanford undergraduate class. It'll be the individual effort of the student that gets them into medical school.<br><br>I hope I don't sound like I'm slamming Stanford. It's a special place, and I love it. But honestly, the difficult part about Stanford is getting in. Once you're in, I don't believe it's any more difficult than other schools that might be considered top 30 or 40. I'm no Einstein, but I certainly wasn't intimidated by the other students or subject matter.<br><br>", "<b>Username: phantasmagoric</b><br><br>simba9, I agree. I think it's hard to say that Stanford is worth $200k (or $80k, however much it is) over a school like USC if that cost difference is a burden - although, as you mention, certain areas such as entrepreneurship are a different issue. I don't think you're slamming Stanford, but I did want to be clear on what experience you (and anyone else) have had with both schools.<br><br>", "<b>Username: simba9</b><br><br>I have no idea why I was using $80K. My brain is turning into swiss cheese.<br><br>", "<b>Username: phantasmagoric</b><br><br>Thanks hillary21 - I'm glad that our posts have been helpful. It's great that you and your son have no regrets and that he's enjoying Stanford (it goes by fast!). I agree that Stanford is a very special place, but I can also understand why some parents can't stomach spending a great deal for a Stanford education, esp. in the face of a more generous offer from another great school such as USC or Regents at a UC.<br><br>I really hope that Stanford goes back to being tuition-free soon (there would be far fewer headaches, like 9help9's, if it did). Given normal endowment growth, this will be feasible within 3-4 years, so hopefully by then the administration will realize that, for many people, no matter how amazing Stanford is, money is the most important issue. Here's to hoping there are fewer \"Stanford vs. ____\" threads in the future. :)<br><br>", "<b>Username: fall2016parent</b><br><br>Is anyone worried about the spur of incidences around USC?<br><a href=\"http://news.yahoo.com/gun-usc-robbery-tested-links-murder-chinese-students-000531195--sector.html\" rel=\"nofollow\">Gun in USC robbery tested for links to murder of Chinese students - Yahoo! News</a><br>Normally I would advise to take full ride, but if it is not causing undue hardship, go with Stanford.<br><br>OK..editing to say..saw you have other financial concerns. But money aside, I am not feeling too comfortable with what is going on at USC. Granted these incidents can happen at any campus..but..<br><br>", "<b>Username: ModernMan</b><br><br>Though tragic, these events are not unquie to USC. All urban campuses in a major cities will have crime, ie Berkeley, Chicago, Yale, MIT, UPenn, and yes USC.<br><br>", "<b>Username: phantasmagoric</b><br><br>fall2016parent, there was another robbery at gunpoint after that incident as well:<br><br><a href=\"http://www.huffingtonpost.com/2012/04/18/usc-students-robbed-jeremy-hendricks-arrested_n_1434936.html\" rel=\"nofollow\">USC Students Robbed At Gunpoint Again: Jeremy Hendricks Shot &amp; Arrested (VIDEO, UPDATE)</a><br><br>While this does happen elsewhere, there's no denying that some campuses are in a more dangerous area. Since students frequently go into the surrounding areas (either because they want to or because they have to, e.g. a large portion of undergraduates at USC do), extra caution has to be taken, but even that sometimes isn't enough.<br><br>One thing is certain - the Stanford campus and area are not nearly as run-down as the USC area (there's a reason that USC put up a wall).<br><br>", "<b>Username: smilldeb</b><br><br>@hillary21, I can relate to your story as it's the same position we are in. I, too am a custodial single mom but with my S's dad's income, Stanford has not granted any financial aid which we're still appealing as he did receive some excellent aid at other private universities that considered his dad's income too. But having a full tuition to USC, nearly full ride to Cal (which he's eliminated), or participating in varsity sports at a couple top 25 ranked D3 universities with financial aid packages has made it difficult. I think he'll commit to Stanford anyway. We'll find a way to make it happen but with three at university next year we will incur a lot of debt. I'm glad to hear you felt your decision has been well worth it.<br><br>", "<b>Username: simba9</b><br><br>Discouraging people from attending USC because of the neighborhood reminds me of people being warned away from California because of earthquakes. The odds of anything happening in either case is very low, but that doesn't stop people from exaggerating the risks.<br><br>", "<b>Username: phantasmagoric</b><br><br>^ that's a bit different though. Logically, it's better to go to a school in California if you're worried about major earthquakes, since all the building codes are very strict, and you would likely be fine if one hit. By contrast, if a major earthquake strikes on the East Coast, lots of people will be in trouble because their building codes are weak (and the fact that the East Coast has earthquakes so rarely makes the next one that much more likely to happen soon).<br><br>But crime statistics don't lie, and you're far more likely to be mugged in some areas than others, and certainly more likely to be mugged than to be hurt in an earthquake. I'm not saying that's a reason to turn down USC (esp. in the face of the Trustee scholarship), but the two aren't the same in likelihood.<br><br>Since USC doesn't offer most of its students housing, they have to live in the surrounding areas, which are still crime-ridden. This was talked about in news stories about the shooting - USC's lack of housing is being partly blamed for the student deaths.<br><br>", "<b>Username: hope4usc</b><br><br>Davev61. Where will your d go?<br><br>", "<b>Username: docfreedaddy</b><br><br>Just back from thorough head to head contrast of Stanford and USC for non engineering, science and computer science majors. Absolutely no comparison.<br><br>", "<b>Username: phantasmagoric</b><br><br>One small, but significant, thing in USC's favor is how long this thread is - 120 replies. Before, a \"Stanford vs. USC\" thread wouldn't have been able to get more than 20 replies, so this <i>is</i> a small bit of evidence of USC's rise. ;)<br><br>", "<b>Username: UCBChemEGrad</b><br><br>^ If money weren't a factor, the thread would have had 1 reply.<br><br>", "<b>Username: docfreedaddy</b><br><br>I am the original poster. Money is not a factor as indicated previously.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>^ Mmmmkayy....<br>\"\"My D got into Stanford, Princeton and Columbia with no financial aid at all. She is also admitted into USC with Mork scholarship (50K/yr). She is majoring in Biology, planning for medical school later on. She really like USC but also very excited at the possibility of getting top education at either S, P or C. The question is if Stanford or top Ivy undergrad education is worth $200k more than USC? Especially since she will go, hopefully, to medical school one day which makes undergrad school become less significant in the over all picture. I will pretty much drain all of my saving to send her to either S, P or C. We also have a younger D that is planning to go to UOP next year which will cost a lot too. My plan is if she is going to USC, I will help paying for part of medical school cost too since I only have to pay $10K/yr for USC. Anyway, really appreciate your inputs and I will show D all of your comments to help her making final decision...\"\"<br><br>", "<b>Username: fall2016parent</b><br><br>^I agree. OP did make it sound like money was a factor. When people took their time to reply, they did so based on that. Otherwise, yes, it is a no-brainer.<br><br>", "<b>Username: 2Leashes</b><br><br>If a family makes up to $100,000 Stanford will give you full tuition. You only pay for room and board. And, they even have some leeway with that, ie; if you go a bit over that. And, they do a sliding scale as the salary goes up. They are VERY generous.<br>And, you're guaranteed housing on campus for all 4 years. My husband is an alum and we would have LOVED it if our daughter had been admitted two years ago. And, it would have been the least expensive school for her.<br><br><br>I am surprised you are not getting any aid from Princeton since they are extremely generous with aid for middle class families. If not, then I guess the question is if you can afford the 50/60 a year? If so, let her enjoy going to whichever school she likes best. What incredible options in such a hard acceptance year.<br><br>If you are concerned about when your other child is in school, talk to financial aid office to see the impact of aid next year for your family.<br><br>Good luck and congratulations again<br><br>", "<b>Username: docfreedaddy</b><br><br>Sorry, I was the original poster on another content area for the same question, but was moved over here by the administrator. Money is not an issue for us. Surprisingly, Stanford paled in comparison to USC for non-engineering, computer science, science and math undergraduate areas as well as the vibrancy of the student body, especially their ability to relate to one another. Quite surprising indeed.<br><br>", "<b>Username: fall2016parent</b><br><br>\"\"Stanford paled in comparison to USC for non-engineering, computer science, science and math undergraduate areas as well as the vibrancy of the student body, especially their ability to relate to one another. Quite surprising indeed.\"\"<br><br>Can you elaborate? So you chose USC?<br><br>", "<b>Username: ewho</b><br><br>@docfreedaddy, Stanford accepted your daughter, you should be grateful for that. Now, she decided on USC, good for her. Anything that bashing on Stanford here is a reflection of your own education.<br><br>", "<b>Username: docfreedaddy</b><br><br>I was greatly impressed with Stanford as a now mature institution with deep ties to Silicon Valley. Its facilities and commitment to technology entrepreneurship are a centerpiece of its position statement and quite effective as evidenced by a recent 50 million dollar donation by Apple. Of note, if you read recent articles about Apple, Apple has avoided paying several billions dollars of taxes to the State of California by maintaining a 5 person office in Nevada. These tax dolars are desperately needed for public education in California and relatively insignificant to, though accepted, by Stanford.<br><br>As you likely know, a number of years ago a prior provost of Stanford, along with many others, aptly criticized US News Reports and other rankings. This past weekend the acting dean of Stanford emphasized twice in a brief address to admitted students and parents departmental and overall rankings of Stanford in USNWR. i believe Stanford culture has changed since its dynamic growth phase and perhaps not for the better.<br><br>The engineering facilities are striking and form a stark contrast to the humanities facilities which, though venerable on the outside, are dated and seemingly neglected on the interior. The humanities area most certainly seems the poor stepchild and like a stepchild an uncomfortable fit. Parents were told the humanities curriculum will be revised, but a timeframe and in what direction seem unanswered questions.<br><br>Since there is such identification and passion about the schools one attends, teaches at or identifies with, I will encourage each reader to come to their own conclusion. My observation is that the departments themselves parallel their online presentation very closely. Again, I had an interest in comparing Stanford and USC in humanities and journalism areas for undergraduate study:<br><br>1. Stanford's communication department webpage: <a href=\"http://comm.stanford.edu/undergrad\" rel=\"nofollow\">Communication: Undergraduate Program</a><br>USC's annenberg page <a href=\"http://annenberg.usc.edu/\" rel=\"nofollow\">USC Annenberg School for Communication &amp; Journalism</a><br><br>2. For Humanities:<br>Stanford's SLE Program: <a href=\"http://www.stanford.edu/dept/undergrad/cgi-bin/sle/\" rel=\"nofollow\">Structured Liberal Education | Structured Liberal Education</a><br>USC's Thematic Options <a href=\"http://dornsife.usc.edu/thematic-option/\" rel=\"nofollow\">Thematic Option > USC Dana and David Dornsife College of Letters, Arts and Sciences</a><br><br>The links will get you to the web pages, which if you are really interested, please explore in depth, especially the sample curriculum. Again, after visiting both schools, interviewing faculty and students and an immersion in the curriculum offered, there is no comparison in my opinion-- Stanford pales in comparison to USC in the humanities and journalism/communications areas.<br><br>", "<b>Username: zenkoan</b><br><br>docfree, may your daughter flourish at USC. They have a very good journalism school. However, the notion that Stanford \"pales in comparison to USC in the humanities\" is so absurd that it barely merits discussion, and this will be my final comment on the matter. It's not just a matter of rankings, of course, but every other meaningful metric, including faculty prominence and publications, overall student body, et al. As a single data point, Stanford had five Rhodes Scholars in the most recent year alone, and four of them graduated from the Colleges of Humanities and Sciences; only one from the College of Engineering. Again, my sincere best wishes to your family. I've no doubt that USC puts on a motivated, full-court press to attract its merit scholarship winners, and I hope it lives up to your kid's expectations.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Yes, \"pales in comparison\" is right:<br><br>English:<br>Stanford #2<br>USC #38<br><a href=\"http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-humanities-schools/english-rankings/page+2\" rel=\"nofollow\">Best English Programs | Top Humanities Schools | US News Best Graduate Schools</a><br><br>Psychology:<br>Stanford #1<br>USC #40<br><a href=\"http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-humanities-schools/psychology-rankings/page+2\" rel=\"nofollow\">Best Psychology Programs | Top Psychology Schools | US News Best Graduate Schools</a><br><br>History:<br>Stanford #1<br>USC #42<br><a href=\"http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-humanities-schools/history-rankings/page+2\" rel=\"nofollow\">Best History Programs | Top History Schools | US News Best Graduate Schools</a><br><br>Poli Sci:<br>Stanford #1<br>USC #62<br><a href=\"http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-humanities-schools/political-science-rankings/page+3\" rel=\"nofollow\">Best Political Science Programs | Top Political Science Schools | US News Best Graduate Schools</a><br><br>....<br><br>", "<b>Username: docfreedaddy</b><br><br>Zenkoan, Thank you for your well wishes. I was shocked by the substance vs. reputation of each school and the departments I cite, as well as the comparative between Stanford and USC in respective curriculum and sophistication of the students I spoke with. If you take the time to get to know the USC programs first hand, or even review the information provided, you might be as well.<br><br>", "<b>Username: docfreedaddy</b><br><br>Much has been written about the USNWR rankings, including by Stanford's former provost. Are you aware they reference graduate education and for department rankings in humanities are based solely on Academy-award type balloting?<br><br>Look, I am as shocked as you and would have absolutely loved to have by daughter attend a school much closer to home and enjoy the \"bragging rights\" of attending Stanford. To her credit, she examined the schools extremely carefully and independent of my due diligence and selected the program that appeared most inspiring, dynamic, well constructed, enjoyed by current students and supported by its university. I have no doubt that if she was a science, engineering, computer science or math major she would have chosen Stanford.<br><br>", "<b>Username: zenkoan</b><br><br>docfree, though I said I was done commenting here, I must add one more, since I'd like to make clear that I'm not \"shocked\" by what you wrote; rather, I am entirely unpersuaded by it. Though I am glad for you that USC is appealing, there's simply no objective basis for your assertion about the relative quality of the programs. (And I had to chuckle at the conclusion you drew from your observation that Stanford's engineering facilities are newer and more impressive than the humanities buildings--state-of-the-art engineering education absolutely depends on the maintenance and continuous updating of physical facilites; humanities and writing, not so much.; ) ) Yes, Stanford is updating its humanities curriculum to make sure it continues to best serve its students and continues to shine a bright light on the purposes and goals of other educational endeavors--that's what world-leading universities do. Honestly, I wish you all the best, as I do everyone on these forums. But a Lamborghini doesn't pale in comparison to a Volvo, no matter how much one might wish it would. That's not to say that for some people the Volvo doesn't offer more appropriate value--but that's a different assessment than one relating to their respective intrinsic merits. This is all I've been trying to get across in this thread since it started. Cheers, and peace out.<br><br>", "<b>Username: davev61</b><br><br>First of all, let me express my sincere thanks to all of you that contribute to this thread. I had several long talks with my D about all the valuable points that had been brought up in this thread. We also talked to the FA office and have our case reviewed, nothing was changed unfortunately. But through the process I realized how much she love Stanford. Right after she got the acceptance from Stanford, she showed her younger sister her 6th grade essay about her dream of going to Stanford one day. So I told her it will be a sacrifice for the family to send her to Stanford, but she really deserve it. Hopefully she will make it worth it.<br><br>", "<b>Username: docfreedaddy</b><br><br>Zenkoan,<br><br>It is odd that you would assume i would want to persuade you or a few of the more uncritical supporters of Stanford of anything. I began an earnest quest with common assumptions shared by many. I have found, though, that the validity of current rankings are completely untested, but as examined found inadequate. Secondly, some schools and some departments seem overrated compared to rankings and some underrated. In depth visits with a probing eye and questions yields the most useful (valid) information.<br><br>I do sense an insecurity and lack of graciousness at Stanford from the top down. There seems much more emphasis on Stanford's ranking than a decade ago and sense of unease when the day to day basis for the ranking is questioned or challenged. That is not very Lamborghini-like.<br><br>I am writing for anyone who was in my position a few short months ago having visited a campus or several and finding the rankings not concordant with their experience. Hopefully, the exchanges here will give them a head start on their considerations. I do think the emphasis on rankings and tone of the posts from a number of strident Stanford supporters is most useful information in itself.<br><br>", "<b>Username: ewho</b><br><br>@Zenkoan, let it go....<br><br>@davev61, I am happy for your decision. My son did the same four years ago when he decided on Stanford over Yale. He is finishing in two months and will start working for Google soon.<br><br>", "<b>Username: zenkoan</b><br><br>LOL docfree. I don't think you're trying to persuade me of anything; I think you're trying to persuade yourself. I come from a fairly long line of Ivy grads, and one of the main reasons I love Stanford, and have from the beginning, is the strong sense of security and genuine confidence, and lack of pretense, among all affiliated with it. This is among its principal distinctions from its true academic peer schools. Stanford surely has \"strident\" supporters, but that's because it is sui generis, and we're justifiably proud of our school's unique culture. Nothing insecure about it. ; ) All the best to your new Trojan.<br><br>And, yes--I'm really done now. : ) Two papers due in two days!<br><br>", "<b>Username: docfreedaddy</b><br><br>Best of luck on your papers. Hopefully there was enough substance in our discourse to benefit others.<br><br>", "<b>Username: BandTenHut</b><br><br>Oh my god, zenkoan, did your monocle fall out as you typed that second-to-last post? Christ.<br><br>", "<b>Username: zenkoan</b><br><br>Almost, BandTen--the Gulfstream hit a bit of turbulence over the Seychelles, causing my top hat to slide down perilously close to the monocle. Would love to chat more, Old Chap, but deadlines beckon. ; )<br><br>", "<b>Username: davev61</b><br><br>@ewho,<br>Thanks and congrats to you and your son. Working for Google, Wow!<br><br>", "<b>Username: smilldeb</b><br><br>davev61, I'm happy to see someone else who chose Stanford over the Trustee Scholarship as it helps me know that we were not the only crazy ones. Fortunately, Stanford's review of our FA package did result in a large change for this first year at least. We have 3 in college for one year and know that the Aid package will disappear after the first year so it was a tough decision to turn down a 4 year guaranteed scholarship to a great university. But Stanford was my S's first choice from the beginning. We were unable to attend either admit day due to other conflicts but after attending the local receptions it made the choice even more difficult. Both are great universities but it really came down to where he felt most comfortable. As a Trojan alum, myself, it was tough to see him turn down USC but I knew it was the right decision for him. He's the one that will spend the next four years at university. USC wasn't even near the top of his list until the Trustee Scholarship was awarded so that sort of says it all about where his heart belongs. Congrats on your D's decision.<br><br>", "<b>Username: phantasmagoric</b><br><br>Since docfreedaddy first started posting, it was obvious that he was biased in favor of USC but pretended to be even-handed. The more he talks about Stanford, the more he shows that he's trying to convince himself - by trying to convince others - that USC is just as good or better than Stanford. Cognitive dissonance at its best.<br>\"\"though venerable on the outside, are dated and seemingly neglected on the interior.\"\"<br><br>= evidence that he is seeing what he wants to see. In reality, the main quad buildings are continually renovated, many of them recently at a very high price (they had to be gutted and reinforced with steel). Anyone who has been in the main quad can see that the facilities are very nice. Of course many of the engineering buildings will seem shiny and new - they were just built! It's hard to see how the humanities could be a \"stepchild\" when there's an overcommitment of faculty - i.e. more faculty than would be necessary given student demand. The humanities rely almost completely on university endowment for operations, so it's not like the university treats them poorly. ;)<br><br>US News is a ballot-like rating, but the NRC rankings are not. In the S-ranking for communication, Stanford is rated 1-3 (the highest of all comm programs); USC, 17-37. The other NRC rankings for humanities also show that Stanford is far ahead of USC. Not even USC administrators would say their humanities departments can compare to Stanford's (the #1 school in the world for humanities).<br><br>Criticizing Stanford for someone there mentioning US News rankings is absurd, esp. when USC is absolutely <i>obsessed</i> with rankings. Anyone can read about this online <i>straight the horse's mouth</i> - USC is unashamedly driven by rankings and repeatedly sets goals for where it will be ranked and by what year, etc. Stanford doesn't have that attitude, because it doesn't need to - it's ranked high by doing what it does naturally.<br><br>It's also hilarious to me that docfreedaddy is trying to tell <i>others</i> about graciousness. What's gracious about going on the Stanford forum just to put others down - \"your campus is boring,\" \"your students are rude,\" \"your humanities suck in comparison\"? Priceless.<br><br>", "<b>Username: docfreedaddy</b><br><br>Phantasmagoric--This is a public site. My intentions have been quite clear. You and others have witnessed a problem solving approach to reconcile my biases with my observations and firsthand experience to perform my due diligence as parent for a very special daughter I love who had narrowed many excellent college choice to two. i expect other parents and students may find them selves in a similar position in the future and look to this board for guidance. It is with them in mind that I am responding.<br><br>Yes, I had biases, strong ones. I chided my daughter for applying to USC when she told me she did. My knowledge base was from years ago. The Trustee Finalist designation that came with the acceptance required that the 375 Finalists and their parents spend a weekend at USC with a full two day schedule of colloquia, presentations, informal contact with faculty and students and time to just wander around and meet students. I begrudgingly went. I was shocked by the quality of the faculty, provost, deans, students and particular programs. The entire campus, student and faculty were vibrant and engaged. it was impossible to retain my bias and prejudice.<br><br>If my daughter had not applied to USC, she would be at Stanford. I posted my experience and received a number of balanced responses. I read those from you and a few of your cronies which disproportionately focused on ratings/rankings. That did encourage me to review rankings, appreciate how influential, but truly limited and untested from a measurement science perspective (concurrent and predictive validity) for undergraduate education rankings are.<br><br>I do think the tone and perspective of your writings and others is revealing and hope it does not go unnoticed for any parents or students in the future. I encourage all to understand thoroughly the limitations of rankings, especially in contrast to the power they hold at present. I think it is most interesting that what I learned most from the few dominant posters is not how Stanford personally inspired anyone or touched their lives and was special to them, but that it is special because of its graduate rankings.<br><br>I am pleased and proud of my daughter for not being swayed by reputation, but painstakingly evaluating which environment offered her, overall, the most inspiring and beneficial setting to develop her gifts. I wish the same for all other parents and students.<br><br>", "<b>Username: fall2016parent</b><br><br>Aside from rankings, not every college is a fit for everyone.<br><br>I also tend to agree that instead of throwing a 'no way' thread in a college website(and that is happening at all the other college sites as well), it is important to remember that these sites are primarily dominated by students who think of this as their dream schools. Or are looking forward to attending these schools next Fall. When people throw in these negativity, it causes a damper on current applicants, current students and future students.<br><br>I agree with the poster that said - ok, Stanford or (you can put whatever name) offered you admission. You decided that something else is better fit for you financially and socially. Ok..move on, no need to now come back and bring out the negatives that swayed you. Students AND parents need to remember the sensitive nature of these postings and how it affects current applicants and admitted teenagers who are already struggling with college indecisions.<br><br>", "<b>Username: UCBChemEGrad</b><br><br><a href=\"http://tfm.usc.edu/spring-2012/the-audacity-of-usc/\" rel=\"nofollow\">The Audacity of USC | Spring 2012 | Trojan Family Magazine</a><br>\"\"If you live west of the Mississippi and you want to be involved in a private institution that is permanent, influential, consequential and international, you have two choices: Stanford and USC. USC is going to appeal to people who appreciate the breadth of our offerings  we have a myriad of professional schools, plus a great liberal arts college, strong athletics and tremendous creative work and arts. So theres this critical mass to make a difference in the world.<br><br>Where do you see USC in the next 10 years?<br><br>We will have a greater number of transformative faculty. We have many, but we do not have enough to match our ambition. We will have a number of top Ph.D. programs, which will train the next generation of the professoriate. USC will be the place that people emulate, not just with respect to education, but also with respect to the kinds of results we produce  whether in the lab, in our scholarship, in our creative work or in our teaching. You will hear our name throughout the world.\"\"<br>\"\"The strategic vision also differs a bit from its predecessors in that it puts more emphasis on great Ph.D. programs. And theres more explicit emphasis on great faculty  retaining the transformative faculty we already have, adding more and creating new transformative faculty within our ranks as we nurture and mentor our junior professors. Faculty keep a great university moving forward to ever higher achievements of academic excellence.\"\"<br>Looks like they're gonna focus on grad programs and faculty more than pushing for better undergrad...undergrad can improve rankings only so much.<br>\"\"USCs ambition is to be the greatest research university of this century.\"\"<br>But it'll probably take them about a century to get there...<br><br>", "<b>Username: davev61</b><br><br>@smilldeb,<br><br>Thanks and congrats to you and your S. Anyway, I really understand how difficult a decision it must be for you and you S, we are pretty much in the same boat. Trustee or Mork scholarship is a really big deal, but I do not want my D to deal with \"what if ..\" question later on in life. She earns it, that is how I see it. But I got to give you props for being able to send three kids to college. I am sure they appreciate it and will make the best out of the experience..<br><br>", "<b>Username: phantasmagoric</b><br><br>docfreedaddy,<br><br>Nobody has ever implied that Stanford is special because of subject rankings - that's not what inspires or touches students. The subject rankings were presented to you after you made some pretty absurd claims, e.g. in one of your first posts, you were casting doubt on the strength of Stanford's humanities departments. Several pages later, you still hold onto that absurd bias. You keep railing against undergraduate rankings <i>when not one Stanford poster here has used them as evidence</i>. We've even said to you that nobody cares about these undergraduate university rankings and that we too have the same criticisms, yet you continue to assert that we put stock in said rankings. Nobody does. Further, you aren't even holding USC to the same standard - people there care <i>far</i> more about rankings, as its administration has engaged in it a lot and can't seem to go five minutes without mentioning rankings and how USC has \"gone up 1 spot since last year!!\" Yet this somehow gets past you.<br><br>I think it's rather telling that of your 45 posts on this site, only <i>one</i> is in the USC forum. Nearly all are in the Stanford forum, and nearly all proclaim how USC is in some way better than or equal to Stanford (more the former), including that one post in the USC forum. If you really believed that, one would think you'd spend more time engaging with the USC forum - but no, most of your efforts are spent here trying to convince Stanford posters that USC is better than or equal to Stanford. When we called you out on your assertions, you continually evaded lines of debate, patronized us, and attempted to maintain the illusion (delusion, rather) that you're even-handed, just here to get information, etc. Your real motives have been clear for quite a while; your bias has also been painfully obvious. Nobody is fooled.<br><br>I'm willing to bet anything that if USC and Stanford cost the same, you would not be expending so much effort pumping up USC and railing against Stanford. I'm sure your daughter will have a great time at USC, and that USC offers a lot. You don't need to keep trying to convince us of USC's greatness - you seemed to have convinced yourself of that, so mission successful. ;)<br><br>Best of luck to your D at USC :)<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"USCs ambition is to be the greatest research university of this century.\"\"<br><br>Oh man this cracks me up. <i>No </i>top university explicitly endeavors to be \"the greatest research university of this century\" - at most, they say \"one of the greatest.\" USC is developing a hilariously sad case of delusions of grandeur. It's the sort of thing where anyone with knowledge of academia has some second-hand embarrassment just hearing it.<br><br>And yes, docfreedaddy, I'm being harsh, and intentionally so - USC deserves it. I would cringe if I heard a Stanford administrator say that.<br><br>", "<b>Username: docfreedaddy</b><br><br>fall2016parent--I fully agree with your comment. Even though this is a Stanford cite, I am surprised at the vehemence of criticism for USC in this case to the extent of being absurd. Students coming to these cites and parents deserve balanced responses. For instance a previous post raised the tragic violence that occurred near USC and cited crime statistics as evidence that Stanford and Palo Alto are better choices. However, any university in a city, Columbia in NYC, Yale in Hew Haven, U of P will be in areas of higher crime than Palo Alto, but a sense of balance would also at least give lip service to richness of culture and range of enriching opportunities for an undergraduate a vibrant city would offer relative to the critique to Palo Alto offered by Stanford students. I personably believe that it is a valuable maturing process for a student to be able to be drawn to a dream school, but receive assistance to measure it against the reality of what it is discerned to be and appears to offer to them.<br><br>", "<b>Username: phantasmagoric</b><br><br>^ that \"previous poster\" who brought up the recent robberies at USC is fall2016parent. ;) Someone pointed out in the next post that this sort of thing happens at every urban campus. I then pointed out that it's undeniable that some areas are more dangerous than others. There was plenty of \"balance\" in that line of discussion. He/she was asking whether anyone was \"worried about the spur of incidences around USC,\" not about the cultural offerings of a city.<br><br>", "<b>Username: docfreedaddy</b><br><br>Phantasmagoric--I was much impressed with the letter a former Stanford Provost or president wrote to USNWR critical of their rankings. This past admit weekend at the seminal presentation by the current provost in Memorial Chapel, Stanford's rankings were a cornerstone of the provost's talk. He mentioned Stanford's rankings twice and with dramatic pauses and emphasis the standings for all departments. Nowhere was there the a caution or attempt to educate an impressionable audience that the rankings are based on graduate school rankings, what the bases for the rankings are or the question of untested validity. Why the change in the administration's perspective? It is simply unfair to cite USC admin's attention to ranking, which was not present in my contact with USC as it was at Stanford, and not be mindful of your present administration's central focus in his keynote address and presumably elsewhere.<br><br>I see numerous references to the graduate rankings above and Stanford's standing from the vocal core on this blog, so I am not sure what you are referring to in saying they are not \"used as evidence\" here as well.<br><br>As far as comparison of specific programs, I offered links to the Stanford Communications and SLE programs (the latter I appreciate learning about on this forum) and invited comparison to the USC Annenberg journalism and communications undergraduate program and the Thematic Options Honors program. Suggesting that an informed and critical appraisal of the programs be initiated by anyone truly interested is \"casting doubt\" is simply not accurate. I emphasized that the web pages comport with the presentations from the respective programs and contact with program administrators students and faculty I took part in. The goal, if not for you, is for others to examine in depth, rather than accept generalities, cursory impressions or worse biases or judgements formed on \"rankings\" alone.<br><br>I posted on the Stanford cite because my disquiet was with Stanford. USC far exceeded my expectations for the areas of interest and I had no lingerings issues to try to resolve there. I very much would have wanted my daughter to attend Stanford--closer to home, great reputation, and was hoping to find the key to remove the doubt and concern borne from firsthand experience.<br><br>I have no interest in debating which is a better university. My goal was to combine whatever could be gained from this website with discussions with close friends who currently have students at Stanford (none at USC), my own experiences at Stanford in the service of identifying which of two settings would offer the richest environment for my daughter to develop her skills and interests. In the end it was not Stanford. Am I surprised, yes, given my preconceptions. Does this take anything away from Stanford. Absolutely not and I am please that it will open the door to another deserving student on the wait list who hopefully, with their family, have diligently and thoroughly investigated their top choices and conclude Stanford is best for them. I hope it has been a good learning experience for all.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"not be mindful of your present administration's central focus in his keynote address and presumably elsewhere.\"\"<br><br>Funny - one person mentions rankings and apparently it's a \"central focus\" of the entire administration (and the \"cornerstone\" of his talk - when he mentioned it.... twice). I'm willing to bet that one of the rankings that the provost referenced was from THE, which recently put Stanford at #1 in the world for humanities, edging out Harvard - quite an accomplishment.<br><br>In general, admins don't mention rankings and have repeatedly downplayed them. USC on the other hand does not, and if you don't believe me, I can show you plenty of sources straight from the horse's mouth where USC admins trumpet rankings and emphasize their need to get into the top X or top Y.<br>\"\"the graduate rankings above and Stanford's standing from the vocal core on this blog, so I am not sure what you are referring to in saying they are not \"used as evidence\" here as well.\"\"<br><br>I said: \"You keep railing against <b>undergraduate rankings</b> when not one Stanford poster here has used them as evidence.\" Your efforts to be sly are not going unnoticed.<br>\"\"invited comparison to the USC Annenberg journalism and communications undergraduate program and the Thematic Options Honors program.\"\"<br><br>Yes, you invited comparison, then immediately went on to proclaim that \"Stanford pales in comparison to USC in the humanities and journalism/communications areas.\"<br>\"\"\"casting doubt\" is simply not accurate\"\"<br><br>Really? You've now said multiple times that Stanford \"pales in comparison in the humanities.\" Isn't that casting doubt? \"Critical appraisal\" is right - you're being overly critical of Stanford's humanities because you're trying to prove to yourself that USC is better. Not even USC faculty/admins are arrogant enough to say that USC's humanities are on Stanford's level, much less better. They know USC doesn't match Stanford in this respect right now, but are determined to change that, which is admirable. But they aren't going to stick their heads in the sand and pretend that USC is better than Stanford right now for humanities - that would be absurd.<br><br>", "<b>Username: BandTenHut</b><br><br>There's no need for idle speculation and innuendo about 'certain neighborhoods' when you're talking about campus crime... they do publish statistics on these things:<br><br><a href=\"http://www.stanford.edu/group/SUDPS/safety-report/toc.shtml\" rel=\"nofollow\">SUDPS - Reporting Crime &amp; Suspicious Activity</a><br><a href=\"http://capsnet.usc.edu/dps/asr/index.cfm\" rel=\"nofollow\">CAPS Website</a><br><br>Personally I would rule out Stanford for writing the name of their university in, ugh, <i>Papyrus.</i><br><br>", "<b>Username: docfreedaddy</b><br><br>\"Funny - one person mentions rankings and apparently it's a \"central focus\" of the entire administration (and the \"cornerstone\" of his talk - when he mentioned it.... twice)\"<br><br>When the one person extolling Stanford's rankings is the Provost and he does so during the admit weekend keynote address in the Memorial Chapel to admitted parents and students that is extremely significant. I would encourage you to obtain a copy of the address or if it was videoed, review it to see for yourself the Provost's dramatic emphasis on rankings. At present, you simply seem argumentative and exceedingly biased. I think we both have provided enough of a sample of our perspectives and motivations for other individuals in the same position I was in to make their own judgements about the usefulness of our posts and what they might say about the various schools.<br><br>I will again say cost is not a factor for me. I don't qualify for financial aid, like Stanford, none of the other schools she was accepted to offer trustee awards. I hd no idea USC offered a merit award and to me at the time of application based on the little I knew, USC was not a serious consideration. USC had no merit award application, but just culled the applications and named Finalists. I value education highly. My daughter has been in private school since kindergarten. I have been and am more than happy to support private education as well as public education for various districts through property taxes.<br><br>As I have said, the decision was my daughter's. She knows tuition is not a financial burden for us and was not a factor in her decision. Your comment to the contrary further seems to separate your objectives in any discourse we have from mine and as often said in other contexts, I take yours and others with similar comments to be your own and not to reflect on the fine institution Stanford is.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"that is extremely significant.\"\"<br><br>No, it isn't.<br><br>It's extremely significant when it's a pattern of behavior. That isn't the case here. It is the case, however, at USC.<br>\"\"position I was in to make their own judgements about the usefulness of our posts\"\"<br><br>Yes, people can see that you continually make false or misleading claims that you refuse to substantiate, and when called out or backed into a corner, you simply ignore the evidence that proved you wrong. In fact, several times throughout this thread, you didn't bother replying to posts/claims that presented such evidence.<br><br>And yet again you claim others are biased while sidestepping the obvious fact that you're strongly biased in favor of USC. The difference is, reality is biased in favor of Stanford.<br><br>", "<b>Username: docfreedaddy</b><br><br>phantasmagoric--attempting to minimize the significance of your Provost speaking from prepared remarks at a gathering of newly admitted students and parents in the Memorial Chapel in the weekend keynote address is absurd and a substantial distortion of the significance of the Provost's position and what he said.<br><br>In that vein, I can certainly understand how you, or a like behaving cohort, would view anything I wrote as an unsubstantiated claim. Fortunately, all is available for anyone to review. This is not a high school debate. I did choose to ignore comments that were incendiary, arrogant, pedantic and not seemingly related to having an instructive discourse to illuminate some questions that I thought were vital to my daughter's decision and presumably will be to others in the future in a similar position.<br><br>It would seem you will not be satisfied unless you \"win\" some debate I have not been having with you. If so, I will concede that what I experienced through a focused investigation of each undergraduate program in the non-science areas that interested my daughter was not \"real\", the perceptions my daughter came away with were not \"real\", I imagined Memorial Chapel was filled to the brim with admitted students and their parents listening as your Provost spoke and in fact reality is just how you see it for me and everyone else. I can live with that.<br><br>", "<b>Username: phantasmagoric</b><br><br>It's only you who is choosing to read that much into two remarks from the provost in a single speech. From that, you're concluding that it's \"central to the administration\" - but it's not as though those two remarks were the focus of his entire speech, nor does he represent the entire administration, nor is it a pattern. Do you see why it's absurd to generalize from this small instance? I can point you to tons of instances of USC's administration showing their obsession with rankings. Now that's a pattern.<br><br>You also ignored plenty of non-combative comments presenting evidence contrary to your assertions. It's hard to take you seriously when your reasons for believing what you do include such illustrative experiences like \"the campus was boring when I briefly visited over the summer\" and \"look at the websites! USC's is better.\"<br><br>It's funny that you assert that you <i>haven't</i> been having a debate with me (or others, presumably), when you just spent no fewer than 12 paragraphs replying to me and others on this page alone. This back-and-forth certainly isn't some idle conversation over tea. ;)<br><br>", "<b>Username: soomoo</b><br><br>I just wanted to jump in and say that I was also in the audience for the Provost's speech. It was terrible. I'm really surprised that he was the keynote speaker.<br><br>My husband and I just figured he had to do the speech because the president is on Sabbatical. We sort of wrote it off.<br><br>The rest of the programs were amazing though. The students presenting/speaking were especially good. My son happily turned down Princeton to accept his spot at Stanford.<br><br>", "<b>Username: docfreedaddy</b><br><br>To those in a position of making an important life decision, achieving a reasonably accurate \"peak under the hood\" is most definitely not idle conversation. There were many detailed discussions that could have been undertaken, but my sense has been any discussion about Stanford that did not primarily pay homage to its ranking was taboo for several vocal participants here and did undermine a potential for this vehicle to benefit all concerned.<br><br>I will continue to conclude that prepared remarks in an august location as a keynote address by the provost with the emphasis he provided does represent the administration's position. I don't grasp how you could view this otherwise.<br><br>Your pejorative restatement of my comments made previously provide an apt illustration of why many responses to you were necessary:<br><br>You said above...\"It's hard to take you seriously when your reasons for believing what you do include such illustrative experiences like \"the campus was boring when I briefly visited over the summer\" and \"look at the websites! USC's is better.\"<br><br>What I said was the time (280 hours) I spent on campus over the summers raised concerns and the need and desire to spend time during the school year which I had the opportunity to do as did my daughter.<br><br>With regard to the websites my comment was that the websites paralleled my experience with the programs. However, it is of interest in itself to view various department representation across universities. For those who do not have the opportunity to personally visit the departments, talk to administrators, students, attend classes, lectures or colloquia, the websites can contain a relative wealth of information obtained with minimal time or effort.<br><br>While we obviously have different perspectives and likely different values, like you, i do not want mine to be misstated or misunderstood. The urgency and stakes for future students trying to establish their perceptions and reality are too high to not provide them accurate, unambiguous positions which are not distorted or marginalized to allow them to reach their own reasoned conclusions.<br><br>", "<b>Username: zenkoan</b><br><br>Wow--taking a break from my writing marathon, and I'm incredulous to discover that this dopey thread is still alive. I have no interest whatsoever in continuing the underlying topic, having said all there is to say about that, but I'll add a couple of quick comments:<br><br>(1) Prof. Etchemendy, who filled in for Pres. Hennessy at the Admit Weekend address, is an absolutely brilliant mathematical and semantic logician--I'm thinking about approaching him to see if he might serve as my advisor, but I'm going to wait until Hennessy is back to ask. I didn't hear his talk, but I wouldn't be surprised if it was more of a \"just the facts\" kind of thing than Hennessy usually gives, given Etchemendy's steel-trap mind. He'a probably not as entertaining, nor quite as charismatic, at the podium as Hennessy can be, but Provosts fill in for Presidents on sabbatical; that's part of their interim job. I've never once otherwise heard, or even heard of, any faculty or admins. here touting Stanford's rankings, in my entire time on campus. (Nor have I ever once heard anyone talking about his gpa, or his SAT scores, or that kind of thing. As I have mentioned previously, people here are generally self-confident and secure, and that was very magnetic to me during my deliberations.)<br><br>(2) Welcome to the Farm, soomoo's son!<br><br>And now, back to my remaining paper.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"The urgency and stakes for future students trying to establish their perceptions and reality are too high to not provide them accurate, unambiguous positions which are not distorted or marginalized to allow them to reach their own reasoned conclusions.\"\"<br><br>Oh yes, this thread will affect the lives of hundreds - no, thousands - of students for decades to come. You are providing a public service here! How dare we taint the perception of your assertions with facts, evidence - indeed reality? Preposterous!<br><br>You keep charging that I or others care so much about rankings, so I looked over my posts in this thread. Out of the 26 of my posts, I presented rankings exactly twice: once, when you were initially asking about the strength of Stanford humanities and social sciences (at the time, you seemed to be under the impression that Stanford's strength was solely in STEM fields), and once again, when you recently started asserting that USC was superior to Stanford in humanities and communication (when in reality, nearly everyone considers Stanford to be superior in both). Two other times I mentioned rankings - once, to explain that I think undergraduate rankings are absurd and that subject rankings make more sense (although I did not present any), and again, to present you with the critical article from the past Stanford president. Somehow, based on that, you concluded that I must be obsessed with rankings.<br><br>Don't forget that most of our debate focused on capital growth, financial resources, and the integration of undergraduate and graduate education. Don't forget that you were the first one to levy a personal attack (asserting that I must be hired by Stanford). Don't forget that when I nicely asked you to point out what it is that you disagree with, and to provide evidence, you bowed out and did not respond. By the way, I'm still interested:<br>\"\"Please provide <i>credible </i>evidence that contradicts my points, in particular with regard to diversified endowments, capital growth, the quiet phase of a university campaign, the NYC competition, and any other points that you find to be 'biased' or 'untrue.'\"\"<br><br>", "<b>Username: phantasmagoric</b><br><br>I remembered reading Etchemendy mention the THE rankings in recent Faculty Senate minutes. Straight from the horse's mouth (emphasis mine):<br>\"\"He continued, I have one announcement. <b>The president and I never look at rankings. </b>But somebody brought to our attention the Times Higher Education University World Rankings, a ranking of all universities in the world. [The rankings are divided among different disciplines.] In Engineering and technology, we rank number five. Clearly, they dont know what theyre talking about.<br>[ Laughter ]<br>Provost Etchemendy continued, Physical Sciences is number five. Pretty good. No other university, by the way, ranks as high as we do in all of these areas simultaneously.<br>Life sciences, number five.<br>Health, preclinical, clinical health, number six.<br>We did rank number one in two subjects. Arts and Humanities  Stanford is the top university in the world in arts and humanities. And it is the top university in the world in social sciences.<br>[ Applause ]<br>Provost Etchemendy: So the engineers and physical scientists, I know you feel that we dont love you -- we will love you when you get your rankings up.<br>[ Laughter ]\"\"<br><br>He <i>jokes</i> about the rankings (\"I know you feel that we don't love you\" - hahaha). I'm willing to bet these were the rankings he mentioned. And it is a small bit to be proud of - Stanford's the only university in the world to have made it in the top 5 in all broad disciplines. If this were USC's accomplishment - hell, if USC made it into the top 20 in any of them - it'd be bellowing it from the rooftops (though they still constantly trumpet the fact that they made it into the top 25 in US News). Apparently, in docfreedaddy's book, when one Stanford administrator mentions this accomplishment, Stanford should be shamed for it. When USC does it, oh it's because something \"exciting and inspiring and unique\" is happening at USC. ;)<br><br>I'd give Etchemendy a break right now for his terrible speech: his job as provost is as time-consuming as the president's (if not more so - look at Stanford's org chart, the provost manages tons of units), they just finished a $6.2 billion campaign in which the provost is an important fundraiser, and he's taking on the duties of both president and provost right now while Hennessy is relaxing after the exhausting campaign (which Etchemendy can't do, as much as I'm sure he'd love to). I feel kinda sorry for him right now - the poor guy can't get a break. One thing's for sure: he's going to make a fantastic president when Hennessy steps down.<br><br>", "<b>Username: BandTenHut</b><br><br>It is not even close to true that 'nearly everyone' (whoever nearly everyone may be) considers Stanford superior in communications. Here is one meaningless ranking that rates USC's Annenberg school #5, with Stanford outside the top 10: <url>http://annenberg.usc.edu/News%20and%20Events/News/~/media/PDFs/newspro.ashx</url><br><br>"]}