{"title": "mit vs harvard vs stanford vs yale", "comments": ["<b>Username: ttauri</b><br><br>Background - International Applicant from India applying to these 4 need-blind financial aid schools.<br>Context - Deciding which one to apply for early action.<br>Reason - In case I get admitted (I may have a small chance, I have an olympiad medal), my number one priority is going to be to earn money and repay the investment on my education. Even with the need-based scholarship, it is going to cost me about 70000 USD (according to Harvard’s calculator) which is a lot of money for my family. Hence I would like to apply for the school which has maximum job opportunities in the USA (or other countries) for Indians which will help me repay my investment.<br>Interests - My main interests are Physics + Maths but these are negotiable. I am willing to study anything from CS to business management to Economics as along as (i) it is not arts or soft humanities and (ii) gives a really well-paying job to justify the price spent. I am pretty sure that I will enjoy learning them based on my experience with learning topics by myself until now.<br>Factors to consider - Which school has the best aid policy for international historically, the H1B situation for Indians, do companies from USA/other countries hold job fairs where Internationals (Indians) are allowed, is the job a well-paying one where I can reasonably expect to pay back the cost of my education in one or two years ($100000 per annum salary in the USA)<br>Question - Which school and which major gives suits me the best?<br>Additional Question - How accurate is Harvard’s Financial Calculator for International Students in India (it is the only calculator which works for internationals). A few friends told me that the calculator is very biased for internationals and the actual amount needed to pay is almost 6 times what is shown on the calculator and that this is true for all the 4 schools. Is this actually true (actual experience will help here immensely)?<br><br>", "<b>Username: ttauri</b><br><br>EDIT - I meant applying “Early Action” to the school which suits me best. Obviously I will be applying to the rest of the three in Regular Action.<br><br>", "<b>Username: Eeyore123</b><br><br>You have a lot of research to do. If your criteria for a major is “whatever pays the most”, you don’t understand admissions to these type of colleges.<br><br>", "<b>Username: ttauri</b><br><br>@Eeyore123 It might not be important for you, but it is really important for me and my family<br><br>", "<b>Username: makemesmart</b><br><br>I hope other more experienced posters will chime in, but Yale is pretty actively seeking kids interested in STEMs and are heavily recruiting them (doesn’t mean a shoo-in for anyone for sure!) good luck.<br>How’s your other stats look like? India has very prestigious stem schools such as IIT, have you considered getting the undergraduate degree in India then come here for postgraduate degrees then work? It might be the best of both worlds: getting great education with little money borrowed.<br><br>", "<b>Username: ttauri</b><br><br>@makemesmart  Yup, that is the plan B.<br><br>", "<b>Username: tk21769</b><br><br>For any of those four schools, the admission chances for international students probably are in the low single digits. For example, a poster in another thread reports that MIT’s class of 2022 international acceptance rate was 2% (115/4714).  For applicants from India, the rates may be even lower. For HYSM, I wouldn’t count on much if any boost from EA over RD (unless perhaps you are a recruited athlete, legacy, or other “hooked” applicant).<br>Stanford apparently is not need-blind for international admissions.<br><br>", "<b>Username: ttauri</b><br><br>@tk21769 I typed in Stanford by mistake instead I wanted to type Princeton. Yes, I am aware that chances as abysmally low and yes I do have good stats to at least bother applying. Just wanted to apply EA to the school which has best jobs for Indian nationals. That’s all. I have a good back up here in India. Can you help me? Salary statistics are not useful as the scene for Internationals is very different.<br><br>", "<b>Username: ttauri</b><br><br>@tk21769 Also I am very concerned about the accuracy of the calculator. Do you have any information regd that?<br><br>", "<b>Username: milee30</b><br><br>“the H1B situation for Indians”<br>Bad and getting worse by the day.  My husband came to the US on an H1B visa, one of my close friends is an attorney that practices immigration law, and I own a business that manufactures electronic products so I’m cognizant of the process.<br>You absolutely should not assume you will be able to find work here under an H1B when you graduate.  If that is part of what makes your plan realistic, pick another plan.  The US government has greatly reduced H1Bs available, is increasing review of existing H1Bs and generally making it as difficult as possible to obtain an H1B.  Employers are well aware of the issues and mostly unwilling to take them on, so they are changing their hiring away from H1B employees.<br>As wonderful as all those colleges are, you just cannot rely on getting a job under an H1B when you graduate.  I can’t emphasize this enough.  Make other plans.<br><br>", "<b>Username: tk21769</b><br><br><br>\"\"<br>Also I am very concerned about the accuracy of the calculator. Do you have any information regd that?<br>\"\"<br><br>Sorry, no. The calculations tend to differ from college to college and the underlying formulas are not made public (as far as I know).  I’d expect HYPM to be among the most generous schools with aid to international students … IF you get in!<br>Have you considered colleges in any other countries (such as Canada)?<br><br>", "<b>Username: ttauri</b><br><br>@milee30 Thanks for the sensible advice. Just to clarify, I’m okay with a well-paying job anywhere in the world and I am finding it a bit difficult to believe that graduates from a top school like MIT/Harvard can’t get jobs. If not them then who does? Can you elaborate a bit?<br><br>", "<b>Username: ttauri</b><br><br>@milee30 Just to be clear, I don’t just want to go to the USA. I would only be going in case I get admission to these top colleges. Surely, there must be companies to hire top graduates from these top colleges for employment with a decent income in the USA itself?<br><br>", "<b>Username: milee30</b><br><br>https://hbr.org/2017/05/the-h-1b-visa-debate-explained<br>https://www.businesstoday.in/current/economy-politics/new-h1b-visa-rules-lead-fewer-applications-indian-it-firms-us-daily/story/274011.html<br>https://www.zdnet.com/article/for-indian-it-the-h-1b-is-dying-long-live-the-h-1b/<br><br>", "<b>Username: milee30</b><br><br>Of course you will be able to get a job.  But to get a job in America (which you state in your OP is part of your requirement to pay back your education) you will need an H1B visa.  I’m telling you it’s getting very, very hard to get an H1B and it could get even harder by the time you graduate.  So if an American $100k+ job requiring an H1B visa is part of your plan, rethink the plan.<br>A degree from any of those colleges is highly marketable and if you didn’t need a visa or were an American citizen, it would be very realistic to assume you could get a $100k+ job upon graduation.  But you aren’t in that situation; you will need an H1B and I’m telling you that isn’t something you can count on.  Employers are increasingly avoiding applicants who have to obtain an H1B because it’s just so hard to get one.<br>Companies love to hire employees with degrees from those top colleges; what companies don’t love is dealing with our current immigration system.  So you ask - who is getting those jobs?  Americans.<br><br>", "<b>Username: ttauri</b><br><br>@milee30  I get it! The H1B situation is bad. But that still does not answer my question. Do you actually know whether MIT/Harvard Indian graduates were successful in getting good jobs in the USA in 2018? I would love it if someone shares this information accurately (could not find anything on net)<br><br>", "<b>Username: makemesmart</b><br><br>Employers might want to hire equally qualifying students that don’t have to go through the H1-B saga.<br>Of course it is not impossible. I would encourage you to apply and he happy with your plan B.<br><br>", "<b>Username: milee30</b><br><br>With as few Indian nationals who graduate from Harvard and MIT each year and not knowing the details of their personal situation, how could you possibly gather enough meaningful data to draw any conclusions?  You’d have no idea if the few examples one could find were people who were married to a US citizen so pursuing permanent residency that way, were granted their H1B under the older, more relaxed rules, had a family connection in the hiring company that meant the company was willing to go through the rigamarole, etc.<br>Would you really base a $70k+ decision on anecdotes with little verifiable detail?  Seems risky.<br><br>", "<b>Username: collegemom3717</b><br><br>There is simply no meaningful difference between these universities in terms of “the school which has best jobs for Indian nationals”.<br><br>\"\"<br>is the job a well-paying one where I can reasonably expect to pay back the cost of my education in one or two years ($100000 per annum salary in the USA<br>\"\"<br><br>The odds of you earning $100K/pa the year after graduating are tiny: IB / Wall St jobs at top tier firms is pretty much the only path, and those jobs are ferociously competitive to get.<br>And even if you get one of those jobs, you have to live in NYC, and your plan of saving $70K in 2 years means that you would have to live on ~$45K/pa  ($100- $17K Federal Taxes - $3K NYC taxes - $35K).<br><br>\"\"<br>Yale is pretty actively seeking kids interested in STEMs and are heavily recruiting them<br>\"\"<br><br>I don’t see Yale ‘recruiting’ STEM students, and certainly not for international students.<br>I don’t know why you want to apply EA. Harvard, Princeton and MIT are explicit that there is no admissions boost to applying early (I am out of date on Yale SCEA- somebody else might know better),<br>Finally, you misunderstood @Eeyore123’s point: they were saying that it is important to understand the admissions process, and what each university is looking for if you want to be admitted. Just showing up with good stats and a medal - even an Olympiad- won’t be enough.<br><br>", "<b>Username: bouders</b><br><br>If you want a good degree where you can get a well paying job after graduation with minimal immigration hassle, look at Canadian schools.<br><br>", "<b>Username: Twoin18</b><br><br>“The odds of you earning $100K/pa the year after graduating are tiny: IB / Wall St jobs at top tier firms is pretty much the only path, and those jobs are ferociously competitive to get.”<br>Or a tech job with FB, Google etc. To me that’s more plausible than Wall St for an international student. But you’d be much better off targeting Stanford for that and living in Silicon Valley wouldn’t be cheap either.<br><br>", "<b>Username: Eeyore123</b><br><br>The reason it is difficult to have post graduate employment statistics for students from India is that for Harvard, there is only about 5 per year. That is across all majors. There are High Schools in the US that send more students to Harvard than the whole country of India.<br><br>", "<b>Username: Lindagaf</b><br><br>Sorry OP, but your post is sooooo naive. Forgive me, for I’m going to be brutally honest. It’s great that you are actively thinking about your future and how to earn money, but you need to read post 1 again. Each of those colleges, including Stanford (oops, I meant Princeton, right?) is aware that thousands of international kids are looking for the same thing as you, including financial aid. They are not going to admit you unless you give them what they are looking for. They won’t admit you because YOU want a good career and can’t afford the tuition without aid. You have to offer them something that any other student from India can’t offer them.<br>There are 19 students right now in Harvard College. That’s roughly five a year, and the number is down from previous years. How many kids do you think apply from India? Apply, by all means, if you know what any of those colleges is looking for. But these colleges are not the same as each other. Yale is nothing like MIT. Harvard isn’t Princeton.<br>Your chances aren’t even in single digits. They are in decimal points. If you invest a lot of time and energy on what will most likely be a fruitless effort, you are missing opportunties to apply to other colleges where you might have a much better chance of acceptance.<br><br>", "<b>Username: Conformist1688</b><br><br>One further point: at all the universities you are targeting you will have to take some classes in “arts or soft [sic] humanities”.<br><br>", "<b>Username: collegemom3717</b><br><br>Tx for the add, @Twoin18 -  and you are probably right that they are more in line with the OPs areas of interest.<br>The underlying logic holds - the jobs are highly competitive (as in, ~3m applications for ~4000 hires at Google) and the regional cost of living is such that saving $35K / year will be hard- but more relevantly to the OP, none of the schools on the OPs list crack the top 19 colleges that Silicon Valley hires from (MIT comes in at #20)*<br>Also, building on @Lindagaf’s post: the structure of how university status works is different in the US than in India: famous names are obviously a help, but they are not make-or-break. You can apply to Google & take their test with a degree from University of Alabama at Huntsville- which, with the right test scores can be tuition free.<br>*sample sources:<br>https://qz.com/967985/silicon-valley-companies-like-apple-aapl-hires-the-most-alumni-of-these-10-universities-and-none-of-them-are-in-the-ivy-league/<br>https://money.cnn.com/2015/04/09/technology/google-people-laszlo-bock/index.html<br><br>", "<b>Username: simba9</b><br><br>The H-1B process is a lottery. This year there were 190,000 applicants for 65,000 visas. Getting a degree from Harvard or MIT will pretty much assure that you’ll be one of those applicants, but that’s all. At that point, you have the same chance of getting an H-1B visa as someone from any other school. There are an additional 20,000 H-1B visas available for those with Masters degrees.<br>The number of H-1B visas granted hasn’t decreased.  Rather, the government is less willing to give them out to entry-level workers. When the program was first started, the visas were only meant to be used for those with hard-to-find skills, but companies instead used the visas to bring in cheap workers with unexceptional skills. That includes new college graduates, and it undercut American workers.<br><br>", "<b>Username: CU123</b><br><br>I suspect that those few that get in from India come from fairly wealthy families whose kids have had the best of private education.  This seems to be more the reality then a student who comes from a situation needing significant FA.  My DD has a roommate from India at UChicago and she is a full pay private education type.  So like most posters are saying is that not only will it be difficult to get accepted it seems that there are very few that get in needing FA even being need blind for internationals.  Obviously still apply, but open your window up to some less selective colleges and don’t plan on getting a job in the US after graduation. In four years it could be better or worse for H-1B and that is not really knowable.<br><br>", "<b>Username: ttauri</b><br><br>@CU123 I know for a fact that that is not the case at least for MIT. Consistently, for the last 4 years, ALL (with the exception of a few) students admitted to MIT have had Olympiad Medals (multiple) + stellar academic records. I don’t think all of them will be so rich.<br><br>", "<b>Username: collegemom3717</b><br><br><br>\"\"<br>Consistently, for the last 4 years, ALL (with the exception of a few) students admitted to MIT have had Olympiad Medals (multiple) + stellar academic records.<br>\"\"<br><br>@ttauri, when you throw down gauntlets like “I know for a fact”, be prepared to defend your argument. What is your evidence that “with the exception of a few” every single student who has been admitted to MIT in the last 4 years has IMO Medals? Did you mean to say every student from India? If so, again, what is your information source?<br><br>", "<b>Username: Eeyore123</b><br><br>Number of undergraduates from India by school:  Harvard 19, MIT 20, Yale 42, Stanford could not find data. If you divide by 4 you get the number of new students per year.<br>Phillips Academy 2017 matriculation:  Harvard 16, MIT 7, Yale 7, Stanford 4.<br><br>", "<b>Username: CU123</b><br><br>Again I’m only talking about internationals from India, and your telling me all these winners(and all from India) were not well off and needed FA to attend…I’ll will agree that most internationals need that kind of profile to be admitted to MIT.<br><br>", "<b>Username: millie210</b><br><br>Even if it’s true that all students admitted to MIT have Olympiad medals and stellar academics, the converse is not necessarily true. That is, you can not infer from that fact that all, most or many applicants with medals and great grades get admitted to MIT.  For all you know, the bare minimum required for an Indian applicant to be accepted at MIT is medals + grades + full pay and most people who fit that description get rejected.<br>You keep asking about whether schools have good jobs. I don’t know whether it’s just your turn of phrase or a misapprehension about how college grads get jobs. Schools don’t have jobs. Employers come to schools to do interviews. All of the schools you’re considering have many excellent companies coming. Exactly which companies will be going to which schools 3-5 years from now is a question no one can answer. There are also job fairs at schools. I’d be shocked if any job fair bars non-US citizens at the door. But just because you talk to someone or even have an interview doesn’t mean they’d be willing to hire you. All the people telling you about visa difficulties should be listened to. And, of course, you can send a resume anywhere you like.<br>Application hint: If you tell any of those schools that the reason you want to go there is to leverage their name and prestige to make a lot of money, you will be rejected. First, all of these schools, while certainly hoping and expecting to produce many financially successful alumni, are about much more than than the paychecks for your first few years. Second, your reasoning is circular. You need to go to a fancy, expensive American school so you can make enough money to pay back the cost of going to a fancy, expensive American school. It’s hard to see why your planB isn’t your plan A.<br><br>", "<b>Username: skieurope</b><br><br><br>\"\"<br>for the last 4 years,  ALL (with the exception of a few) students admitted to MIT have had Olympiad Medals<br>\"\"<br><br>I sometimes have difficulty because English is not my native language, but it seems to me that if there is an “exception of a few” then the statement that all of the 5 (on average) admitted Indian applicants have an Olympiad medal is not even close to reality. If I were an Indian applicant, I’d be more concerned with the 5 number than the medal. But I guess it’s just me. <br><br>", "<b>Username: ttauri</b><br><br>@millie210 Everyone calm down! I already have admission to the best ranked university in India and it will cost me nothing (due to a scholarship) to go there. So I do have a solid PLAN B. But it is a research institute (IISC) and although right now I am happy to go into a research career, I want to keep my options open. That is my reason to apply.  Secondly,  it is not as if we will have to take out a loan or something. We do have a ok salary + excellent assets (300000$). Now, in the case I do get admission to these 4, my objective will not be research but a corporate career. If I want to do research I will obviously go to IISC then probably go to US for PHD. Based on my (limited) research on net, I have come to understand that a corporate career pays far more in USA than a research career.<br>All of you have told me one thing that its a lottery if I end up getting job in USA or not and even then 100K is a slim possibility. Thank You, this is the advice I need. Please bear with me and help me with some more things also. Do  graduates from these top 4 get good jobs in other countries (EU, Singapore, Canada) and if they do is it a good enough to job to pay back 70K in 2-3 years?<br><br>", "<b>Username: ttauri</b><br><br>@makemesmart<br><br>", "<b>Username: ttauri</b><br><br>@collegemom3717 @Lindagaf<br><br>", "<b>Username: jzducol</b><br><br>@ttauri Sounds like you have a great backup plan; you’ve got nothing to lose by trying HYSM.  Out of four you are interested in, MIT is probably the least holistic, most difficult for boys but a bit more predictable if you have distinguished STEM achievement.  Lot of multinationals recruit from HYSM and station them overseas with good pay, so your visa situation may not be a deal breaker.<br>IMO, Yale gives you the best chance–though still small–out of the four because the school is trying very hard fill its class with strong STEM kids.<br><br>", "<b>Username: ttauri</b><br><br>Another thing, India’s top engineering institute in IIT BOMBAY and the top branch is COMPUTER SCIENCE (in india marks decide which branch you can take). From IIT BOMBAY. Every year a significant number of students (more than 10 from batch of 120) get offers in USA for more than 100K. Now, the question which comes to mind again is that if a tech company from USA is willing to hire 1 in 12 CS grads from India’s top college, it is reasonable to assume that they will hire 1 out the the 5 Indians from the world’s best college. Similarly most companies from Europe/singapore/australia must be looking to hire CS graduates from MIT?<br><br>", "<b>Username: ttauri</b><br><br>sources<br>https://timesofindia.indiatimes.com/city/mumbai/microsoft-offers-most-us-jobs-highest-pay-at-iits-on-day-one-of-placements/articleshow/61887269.cms<br>https://www.quora.com/What-is-the-average-salary-of-an-IIT-Bombay-CSE-graduate-1<br>https://www.quora.com/How-do-IITians-and-BITSians-get-a-package-of-over-1-crore/answer/Aman-Goel-9<br><br>", "<b>Username: ttauri</b><br><br>IIT fees are 13K USD for 4 years, so it is not as if it’s a paltry amount. The real question is whether it is worth spending 5 times more not just for better pay but also better contacts/quality of education.<br><br>", "<b>Username: jzducol</b><br><br>If your goal is getting a CS job with more than $150k you can do that with an associate degree from Santa Clara U and pass the Google/Facebook hiring tests. A degree from Harvard/MIT gives you no advantage.<br><br>", "<b>Username: ttauri</b><br><br>@jzducol Keep in mind that (1) I am Indian (2) I dont think Santa Clara U gives need based aid to internationals + need blind admission so exactly how is that going to help me?<br><br>", "<b>Username: ttauri</b><br><br>The real question is how is the job scene for Indians graduating with CS in MIT/Harvard/Pton/Yale<br><br>", "<b>Username: jzducol</b><br><br>^ If you are looking at the degree from investment return perspective an associate degree from a community college for 13K USD is a much surer thing than counting on an full ride offer from MIT.<br><br>", "<b>Username: ttauri</b><br><br>and to everyone saying my post in naive and all, bear with me, that’s exactly the reason why I am asking questions early.<br><br>", "<b>Username: ttauri</b><br><br>@jzducol Thanks for the advice. All I wanted to make sure was whether it is WORTH APPLYING. In case I do get in I can obviously then get down to the economics and make a decision. This is the first post which says APPLY. All other made me feel very scared, almost as if a Indian will be unable to get a job after MIT!<br><br>", "<b>Username: jzducol</b><br><br>If you have gotten nothing to lose other than time and effort why not apply.  Let us know how it turns out next April.  Good luck!<br><br>", "<b>Username: Eeyore123</b><br><br>If you do win the lottery by getting an acceptance and you have a net cost of $17k/year, will you be able to pay it? You as the student will not be able to get a loan for that amount. You questions about being able to repay in a short time, makes me think that you will have to borrow if the NPC is correct.<br><br>", "<b>Username: milee30</b><br><br>“almost as if a Indian will be unable to get a job after MIT!”<br>This is an over reaction to something that wasn’t said.  Your OP specifically stated that your plan required that you are able to get a $100k job in America to justify your family’s investment.  Many people responded to that exact point - that due to the H1b situation, you cannot count on the $100k American job.  That is not remotely the same thing as saying you shouldn’t apply to those schools or that an Indian with an MIT degree cannot get a job.<br><br>", "<b>Username: Lindagaf</b><br><br>Is the goal to get rich? You need to get into investment banking, finance, etc… The schools you mention here are not necessarily the best place to do that. A 30 seond search came up with this: https://news.efinancialcareers.com/uk-en/199099/top-50-universities-getting-front-office-investment-banking-job<br>Why aren’t you considering LSE or UCL? Those grads do pretty well for themselves.<br><br>", "<b>Username: ttauri</b><br><br>@Eeyore123 @Lindagaf @milee30 I apologise for not giving correct info. As I stated earlier it is not as if I have to take out a loan. My parent do earn a decent salary (20000$ combined) and we have assets worth 300000$.<br>My issue is that is there a reasonable chance of getting a 100K job or equivalent pay job in other countries (which no one except one poster has addressed)<br>I am ofc going to apply and will update in April.<br>Will be helpful if someone has actual anecdotal experience from relatives friends etc who were international students (preferably Indian) and what type of jobs they were able to get etc?<br><br>", "<b>Username: ttauri</b><br><br>The issue here succinctly was this, I have admission to a very good college in India which I can attend for free (IISC) . On the other hand it pretty much restricts my scope to research, which I love doing but I may change my preference in the next 6 mounts so my priority right is getting admission to a good tech (engineering) school in India (IIT) or outside. I do have pretty decent credentials to ensure that it makes sense to at least apply. What I am worried about is this, if I am sure that the investment to go to USA for undergrad studies is mostly NOT going to be a good one, then there is no point applying at all and using this time going something else. Even a reasonably got chance (more than 50 percent) of earning a good enough salary anywhere in the world will be enough to justify this investment of time. This is what I am objectively trying to asses. I may have been very bleak regarding my financial situation in my first post, but it was a bit of overreaction.<br>Phrasing it scourger way, IITBCSE grads earn the highest salaries in India and the world. Even if a Indian MIT grad would be able to earn at least this much (preferably more) ON AVERAGE then it would be worth my time to apply.<br>The second issue I was facing was this, which college has the best culture/fit due to which it has the best opportunities for tech jobs for internationals (don’t include Stanford as it’s too costly for international students ).<br>Again, thank you everyone for taking it your time even though you all going owe me anything.<br><br>", "<b>Username: ttauri</b><br><br>Just some stats<br>MIT Website states that the average salary for undergrads is 88000<br>Let’s assume that for internationals this is more closer to 75000<br>This is across all courses.<br>I am assuming that CS students would earn more than the 75000 average hence it should definitely be possible for significant amounts CS international grads to get 100K at least .<br>All this is assuming I do get through the H1B lottery, if I don’t then<br>Are there any good jobs available to MIT grads in Europe. I am not aware of salaries in Europe but I am summing that visa situation there is much more friendlier to Indians than USA. If yes, is the salary enough to pay back 70k with in 2-3 years?<br><br>", "<b>Username: ttauri</b><br><br>It might seem that I speculating too much when I don’t have admission at all (and going by the abysmal admit rate of Indians this is the most likely result) but I want to have as much info as I can have before i commit to apply and I crossover this is the best place. If anyone knows done better website where I can ask these question, feel free to recommend!<br><br>", "<b>Username: Eeyore123</b><br><br>For MIT 2017 grads with a BS entering industry, the median salary was $85,000 according to MIT.<br><br>", "<b>Username: jmtabb</b><br><br>I think you are trying to get a hard answer when there are no hard answers available.<br>With only 5 Indian graduates per year at any of these schools, the odds of someone here having firsthand knowledge of exactly what you are asking for is pretty small.<br>And you have made comments that make people question why you are looking at these US universities and how you will pay for them.<br>So I’ll cut to the chase a bit -  your chances are low.  Very low.  You need to be able to explain why Harvard, Yale, Princeton, MIT (or wherever) is the correct next step for you, in a convincing way that does not include “so I can get a great job that pays $100k when I graduate”.<br>Do you have a chance of admittance at one of these schools?  Presumably yes given the Olympiad medal you have referenced.  But schools will also need top grades, top test scores and an interesting narrative.  And there are still no guarantees.  My daughter’s high school had two students with big accomplishments apply to MIT last year -  one was a Siemen’s Science award winner and the other was an ISEF award winner.  One was admitted to MIT, the other waitlisted.  Both are of Indian descent, but I do not know if they are US citizens.<br>Can you get a well paying job right out of university?  Sure.  No one here can tell you what the salary will be, where the job would be, and if it will let you pay back your expected loans on the schedule you are suggesting.  If you cannot get a well paying job out of any of these  universities, the problem will be something other than the name of the school you attended.<br><br>", "<b>Username: momofsenior1</b><br><br>Not sure how accurate this website is but it breaks down pay scales at MIT by degree and major.  https://www.payscale.com/research/US/School=Massachusetts_Institute_of_Technology_(MIT)/Salary/by_Degree<br>Try asking your specific question about work visas on the international student forum on CC.   You may get more answers.<br>I think the reason you are getting frustrated with the responses here is that no one can predict how long it will take you to pay back student debt.  There are just too many variables - the main one being the cost of living where you get a job.   And unfortunately, cities with highest starting salaries tend to have the highest cost of living.<br>As far as H1B visas, my husband’s last company stopped interviewing international students for both internships and full time work because there were just too many hoops for them to jump.    Even renewing existing employees visas has become problematic.     It’s absolutely not something you can count on.<br>You can also do a google search for average CS salaries in Europe and you’ll get a country by country breakdown.  It varies greatly.<br>I will end by echoing the sentiments of the other posters that if payback is your main criteria for US university, you aren’t going to be able to put together a compelling application.    Schools here want to know what you can contribute and bring to their campuses.     It’s not enough to want to go to a prestigious school that provides aid, everyone wants that!<br>IMO, you have nothing to lose by applying since it sounds like you an afford the application fee.    If you are accepted, then worry about if it makes sense.   I think you are putting the cart before the horse.<br><br>", "<b>Username: Eeyore123</b><br><br>Trying to have $70k in free cash flow in 2-3 years is going to be tough. Never underestimate your ability to spend what you earn. If you would have told me in high school that I would be earning what I am today, I would think I would have a lot more spending money. The problem is your feeling of wealth is very localized. If you are making $200k/ but everyone around you makes $300k, you will feel “poor”. If instead you are around people making $100k, you will be “rich”.<br><br>", "<b>Username: donnaleighg</b><br><br>Entry level CS jobs from great schools (or even not so great schools) may well pay over 100k, which sounds like a lot, but they are almost always in cities where the cost of living makes it hard to save more than 10k or so (after taxes). Just a fact of life. I know, both my kids are in that situation. Not complaining-- they are debt free, but there’s not a whole lot of room to pay off debt.<br><br>", "<b>Username: millie210</b><br><br>All the schools you’re interested in have career services offices. Why don’t you just email them, explain that you’re from India, love their school, but want to be realistic about your ability to find employment in the US after graduation and ask them what the current situation is for Indians w/o us citizenship or a green card who want H1-B visas?<br>Please do not tell them how you’ve got to make big money right away.<br><br>"]}