{"title": "cal berkeley vs carnegie mellon vs univ of maryland in engineering", "comments": ["<b>Username: Roark345</b><br><br>Son was accepted into:<br>Cal EECS, Tuition/ Room $57,700<br>CMU ECE, tuition/room $67,794<br>UMD CE, Received FULL RIDE tuition/room/books $0<br>Cal and CMU are very good in EECS and ECE but UMD Computer Engineering isn’t too shabby. Parents can pay without getting loans but is Cal or CMU worth all that money? We are talking about $270,000 vs $0. Son worked very hard to get to this point, would encouraging him to take UMD undermine his achievement? Will he thrive/feel challenged at UMD? Parents have said to S if he goes to UMD we will pay for his JD/MBA (currently he is thinking about joint degree for grad school) or else he will have to pay for grad school himself.<br>I would like to hear CC’s thoughts. I haven’t been on CC too long but I have been very grateful for people’s candor and willingness to share important information during this crazy college application process. Torn, we don’t know what’s best…please advise.<br><br>", "<b>Username: ucbalumnus</b><br><br>If he wants JD or MBA, the $270,000 less debt will mean more options in career and life choices.<br>Maryland is a respectable enough school that it is impossible to ignore that price difference. It even has famous alumni, including a founder of a big well known computer company.<br><br>", "<b>Username: osuprof</b><br><br>UMCP is a solid school as far as CS and ECE are concerned. If he wants to consider CS - cool things are happening with a new building (because of a 31 million dollar gift from an alumnus).<br>I know high GPA students from UMCP get into absolutely top grad schools (I know of one who went to Stanford for CS PhD, and then spent sometime on faculty of Harvard!). Sergey Brin himself went from CS undergrad to Stanford’s PhD program.<br><br>", "<b>Username: Roark345</b><br><br>Will he have good grad school opportunities going to UMD undergrad?  He is in Computer Engineering at UMD. He doesn’t want to major in CS.  Should we worry about the cost of grad school now?  If he is motivated couldn’t he figure out a way by being a TA to lower costs in grad school?  The problem is he prefers Cal Berkeley or CMU.<br><br>", "<b>Username: osuprof</b><br><br>@Roark345<br>Among grad schools, the only one I see being hard to access from a good (but not top 3-5) state school are the MBA programs. Feeder school data from M7 business schools suggests as such. High GPA and research experience at UMCP --&gt; pretty good  for PhD programs in computer engineering. I don’t think law schools place that much emphasis on undergrad school, though I am not particularly knowledgeable in this area.<br>If he wants to go for a PhD program in computer engineering, money won’t be an issue … if a school wants you, it will pay for you to attend. Law and business schools are a different matter.<br>I can see that it is a hard decision. In any case, congratulations to your son on his accomplishments and being in position!<br><br>", "<b>Username: ucbalumnus</b><br><br>For “grad school”:<br>PhD program:  funded with tuition waiver and stipend (usually for doing teaching assistant or research assistant work)<br>JD program:  expensive, admission mainly based on college GPA and LSAT score ( http://lawschoolnumbers.com )<br>MBA program:  expensive, admission significantly depends on good post-graduation work experience<br><br>", "<b>Username: sevmom</b><br><br>“Will he thrive/feel challenged at UMD.”. Any computer engineering curriculum is going to be challenging.  Since you have already  let him know you can help with grad study if he picks UMD, this may be something you will just have to let him decide. I hope he picks UMD since picking the others could impact his finances down the line.  He has a great opportunity to receive an education from a wonderful university for free!  He is very lucky. Good luck with the decision.<br><br>", "<b>Username: rjkofnovi</b><br><br>This is easy.  Take the free school here!<br><br>", "<b>Username: Roark345</b><br><br>@osuprof and @ucbalumnus thank you for the good info, will share with S.<br>@sevmom I totally agree its a great opportunity.  We are not sure if he is mature enough to realize this.  His friends are going to exciting schools so to be stuck in his instate school is not very exciting.  We are trying to give him as much info as possible and consequences to the different paths and letting him choose (but it is VERY hard).<br><br>", "<b>Username: CU123</b><br><br>For engineering, UMD is virtually a no brainer where he should graduate at the top of the class and have a world of opportunity open to him either in industry or grad schools.<br><br>", "<b>Username: ucbalumnus</b><br><br>Show him how much a top 14 law school will cost (tuition plus living expenses for 3 years).<br>Have him calculate how long it would take to pay off that amount of debt if he has spent all of the college money for undergraduate instead of taking the highly respectable full ride option.<br><br>", "<b>Username: osuprof</b><br><br>I looked over the bingo sheet for computer engineering at UMCP. It is a high quality program – 130 credits,  many computer science  classes, together with computer hardware and basic EE classes.  I happen to have direct knowledge of the CS classes – they are challenging!  No direct knowledge of ECE classes, but I don’t think their faculty likes being left behind (in inflicting pain …).<br><br>", "<b>Username: Roark345</b><br><br>My brother who graduated from the School of Engineering at UMD many moons back tells me NOT to send S there.  He says the drop out rate from engineering is too high and because it is so large S can easily get lost.  Brother says to send S to CMU where the class size is much smaller and a lot more attention is given from the professors.  My brothers point of view is we have saved the money use it for undergrad and with successful undergrad S will figure his way through grad school.  S will find a way if he wants it bad enough.  Let him get loans and pay it off.  Or get TA positions or research positions.  Let S decide.<br><br>", "<b>Username: rjkofnovi</b><br><br>^^^^Perhaps your brother would like to contribute some money towards the additional<br>240K expenditure?  Your son is not an average student.  No one who gets accepted to UCB or CMU is average.  Also. Things have changed a lot since your brother was in school.<br><br>", "<b>Username: eyemgh</b><br><br>No brainer, UMD.<br>If you want to change his life FAR more than the choice between these schools will make, take half the savings, invest it in a total market fund, and give it to him for a future birthday.<br>The drop out rate at UMD is higher because it’s far less selective than CMU. Your son’s previous achievements are well correlated with future success.<br><br>", "<b>Username: Roark345</b><br><br>@rjkofnovi enjoying your very direct points <br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> Roark345:<br>\"\"<br>My brother who graduated from the School of Engineering at UMD many moons back tells me NOT to send S there. He says the drop out rate from engineering is too high and because it is so large S can easily get lost.<br>\"\"<br><br>Decades ago, many state flagships (probably including Maryland) were not as selective as they are now.  Because engineering curricula were and are rigorous, the washout rate was high back then as many less prepared students decided it was too hard.<br>But a strong student of the type to earn a full ride merit scholarship is likely to be one who can handle the rigor of an engineering curriculum.<br><br><br><br> Roark345:<br>\"\"<br>Brother says to send S to CMU where the class size is much smaller and a lot more attention is given from the professors.<br>\"\"<br><br>How much is your brother offering to contribute?  The decision really belongs to whoever is attending and whoever is paying.<br><br>", "<b>Username: sevmom</b><br><br>Agree , ignore your brother unless he is paying.  My H went to CMU in engineering.    He had no interest in our kids going there. Just not worth the additional cost and not a good fit socially for them  either.  They went to state schools in Virginia for engineering  and are no worse for wear!<br><br>", "<b>Username: Roark345</b><br><br>Thank you all!!!  Great advice!  We were at Berkeley earlier this week.  I totally understand the appeal now.  The weather was incredible.  We are off to CMU tomorrow (for the 3rd time).  We will crunch a bunch of numbers this weekend.  I will post once a decision is made.<br><br>", "<b>Username: sevmom</b><br><br>Have a good trip to Pittsburgh. I was just there last week and drove through the<br>CMU campus.   If the expensive privates remain on the table, it might be a good idea to reinforce with your son that you do not intend to pay for graduate studies if he goes to a full pay private .  He may be hoping  you would change your mind on that (and maybe you would?) .  If there are younger siblings that also need to be factored in, consider the precedent that is set by the older<br>one 's choices/options.  Good luck!<br><br>", "<b>Username: rjkofnovi</b><br><br>^^^Berkeley is expensive too for an OOS student.<br><br>", "<b>Username: sevmom</b><br><br>Yes,  Berkeley is a public school.  And definitely expensive for an OOS student.  Are there any other schools still in consideration ,either public or private,  maybe with merit aid, that would be less expensive? If you are very affluent though, may not be an issue.<br><br>", "<b>Username: Roark345</b><br><br>We do have a younger child. We have told both we will pay 4 years but can’t pay 7/8 years each.  S took Michigan off the table because out of state, it costs about the same as Berkeley out of state. S rather go to Cal.  Michigan, Cal and CMU will not give any merit aid and we can’t get need based aid.  S read this post and said I should mention two points. At all these schools he can graduate in 3 years because of all his AP credits. Also, we learned he can get a TA position at Cal sophmore year. These two points will bring down costs significantly. Will this change anyone’s mind who are pro UMD?<br><br>", "<b>Username: sevmom</b><br><br>No, but he  seems determined to not go to UMD , and that is a hard thing to get past. You might want to double check on whether or not all  AP credits will be accepted at the other schools.  And make very  sure he understands that the money stops after undergrad and that you have his sibling and your retirement to consider as well.<br><br>", "<b>Username: ucbalumnus</b><br><br>Be careful about assuming that AP credit will make it easy to graduate two semesters early. Check how they apply to subject requirements, not just number of credits.<br>Also, does he want to have to graduate early, versus being able to take more in or out of major electives?<br>Also, do not count on getting a UGSI job at UCB for CS 61A as a sophomore. Preference for such jobs goes to juniors and seniors by semesters attended, among other requirements. https://eecs.berkeley.edu/resources/gsis/prospective/ugsi<br><br>", "<b>Username: eyemgh</b><br><br>It may look like he can graduate in three years, but it’s HIGHLY unlikely. Even if he walks in with 25, 30, even 40% of the total credit volume, he’ll have to take certain classes in strict sequence, and some of them will only be offered during specific terms that might not align with his progress.<br>My son started with quite a few meaningful hours in mechanical engineering. He tested into Calc III, Physics II, and completely out of Chem and several GEs. He printed his curriculum sheet and traced through all of the prerequisites from senior project, backwards through his entire curriculum, to plot the most efficient path. There was no way to cut it below 4 years. He took a couple of light quarters (12 hours) and still only had 15 of 45 quarter hours left his senior year. The problem was, half of them were senior project. He decided to use his time taking graduate classes and will walk with a BS/MS in about 4.5 years.<br>What ends up happening in an engineering curriculum is that a lot of the GE hours go unused.<br><br>", "<b>Username: suzyQ7</b><br><br>Graduate in 3 years at Cal? No way. In state students in California can barely finish in 4 years because of impacted majors. I don’t get the allure of Cal… huge classes!<br><br>", "<b>Username: sevmom</b><br><br>I don’t get the allure of Cal either at $57,700 vs. $0 . But I am not the kid or the one paying the bill!<br><br>", "<b>Username: ucbalumnus</b><br><br>Actually, graduating in four years from UCB is not generally a problem. Majors are impacted (limited in enrollment) so that the departments can offer all of the students in the major the courses they need.<br><br>", "<b>Username: suzyQ7</b><br><br>Also, there is a very good chance that Amazon is going to put HQ2 in Nova/Montgomery County, MD. All the CS schools in the area will immediately become HOT HOT HOT. Internships galore.<br><br>", "<b>Username: eyemgh</b><br><br>Personally I never understood the allure of Cal either. The classes are giant (Intro to CS is the largest lecture in the nation with over 1000 students) and they rely heavily on TAs for instruction. The campus is amoeboid with pretty parts, but no clear edges. I guess it’s all very personal. They do place CS grads into great jobs and the graduate school is one of the best in the world.<br><br>", "<b>Username: learning19</b><br><br>Congratulations to OP.<br>if you do not mind, can you share the process of applying for full ride scholarship for UMD.<br>Did you apply for scholarship or automatically considered for scholarship based on test scores and GPA?<br>is UMD known for giving scholarships to out of state students too?<br><br>", "<b>Username: aunt_bea</b><br><br>Our UC schools have huge lecture halls and classes do get into the hundreds, often, for prerequisite courses.<br>If your son plans to do post grad work, will he have access to profs for LORs?<br>My dd had a lot of GAs teaching her courses.<br>Oh, and Cal is UBER competitive.<br>You plan on paying for that^???<br><br>", "<b>Username: suzyQ7</b><br><br>Paying 60K for a school like UCB where the vast majority are paying less than 25K (Cal residents) is crazy to me.  I totally get why California students want to go there (cheap and high ranked and close to home) and they live with the cons - huge classes, impacted majors, geographically homogeneous student body, etc because it’s highly ranked and cheap. At least at CMU, you are paying for a private school experience. Smaller classes, plenty of sections, geographically diversity, etc.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> suzyQ7:<br>\"\"<br>At least at CMU, you are paying for a private school experience. Smaller classes, plenty of sections, geographically diversity, etc.<br>\"\"<br><br>CMU SCS computer science courses do not appear to be that small, according to the class schedule, which lists many of them with several discussion/recitation sections associated with a lecture: https://enr-apps.as.cmu.edu/open/SOC/SOCServlet/search .<br>Students going into CS at a highly selective state flagship or private school known for CS should not be surprised that the popularity of the CS major means large classes.  Even places like Stanford and Harvard (700) and Harvey Mudd (200) have large class sizes for their introductory CS courses.<br><br>", "<b>Username: sevmom</b><br><br>CS  has exploded in the last few years .  It has become very hot.<br><br>", "<b>Username: Roark345</b><br><br>Had a busy day yesterday.  Drove to CMU early ran around campus to 6 different tours/info sessions/meetings and drove back.  On the drive back S and I had a long discussion.  More on that below.<br>@eyemgh  You are right the intro classes are large at Cal.  Monday we learned some of the intro to CS classes are 1800!!!  Yes 1800 students in one class.  I asked how large are junior EECS classes he said some are 600 students.  Upper classman classes with 600 students!  I thought this was insane.  Looks like S can graduate in 3 years at CMU.  We went over all of S AP’s and grad student showed us how each AP will eliminate a class requirement.  We are verifying this with a CMU ECE advisor.  Grad student pointed out with taking just 8 more classes S can graduate with a master’s in 4 years.  This sounds very appealing.<br>@suzyQ7  Yes, Amazon is coming to MD.  Reminded S.<br>@learning19   S received the Banneker Key scholarship at UMD.  There is also the Presidential scholarship.  Yes, out of state can get merit scholarships.  For the BK full ride you need to be about top 250.  Apply by Nov 1st and you will be considered for all scholarships.  We received notice around early Feb for the interview.  400 get the interview.  150 get the full tuition.  250 get the tuition/room/board/books.  S interview was late Feb.  Panel of 2 interviewed S.  S said they asked very insightful questions.  They had complete knowledge my S’s application.  I heard you need to have wide variety of AP’s not just in your area of interest.  For example, my S wants to study engineering.  Not only does he have lots of AP’s in math and science but also in history and English.  Need perfect or close to perfect stats, strong EC’s and solid essay.  There is a CC thread on BK.  Search: Banneker Key 2022 Discussion.  Good luck!<br>I think I have a slightly better understanding why S does not want to go to UMD.  At all the schools there are lots of group projects ie in lab break outs of engineering classes, senior project, Honors group project at UMD.  In those group projects S does NOT want to be the one carrying the project.  He hates being the one most interested.  He has had this complaint most of high school.  He has said several times throughout high school he does not like being the smartest student.  He wants to feel like he is in the middle of the pack not at the top.<br>S said even his smart friends who end up at UMD become unmotivated.  Program is too easy so they have lots of time playing computer games.  His friend at CMU is so busy because the work is very hard he has no time to play games.  All the students around him are motivated/driven and are not interested in playing games.  He says this is the type environment he wants to be in.<br>S has a teacher he highly respects (and I highly respect) at his high school.  I suggested meeting with this teacher this week and lay out all the options and listen carefully to what he says.<br>I have come to the conclusion I will not twist his arms and force UMD on him.  I do not want a bitter unhappy college student.  Fortunately, we are in the position he can go to the college he wants to (unfortunately this may mean he does not get JD/MBA later on).  Ironically, because we told S our only requirement in his college applications is that he must apply to UMD and then he received this scholarship we are in this predicament now.  Isn’t life fun?<br>My dilemma:  As a parent is it my responsibility to listen to S and have confidence his knows what he wants or is it my responsibility to force what I believe is best for him and he will (hopefully) come around to see the logic 4 years from now.<br><br>", "<b>Username: suzyQ7</b><br><br>Thanks for the update! Is UCB off the table?<br><br>", "<b>Username: Roark345</b><br><br>@suzyQ7 Your post yesterday about UCB was right on point.  I absolutely agree with you.  S still loves the weather, energy and location to tech but I believe your points trumps S’s points. For me it’s sliding off the table.<br><br>", "<b>Username: katliamom</b><br><br>I’m a huge fan of Cal. (Alma mater.) I really think it’s one of the most exciting schools/areas you could pick to go to school. I have family members that recently graduated from Cal and had no problem doing it in 4 years. (One was able to graduate a semester early, in fact.)<br>That said, given the choice between Cal and CMU at a similar price point, I totally see CMU as a rational option.  CMU is a renowned science and tech school that would offer a more personal, personalized education and  likely easier access to faculty and research. Cal is notorious for its bureaucracy and minimal customer service, something frankly you should expect when paying over $50K per year.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> Roark345:<br>\"\"<br>I asked how large are junior EECS classes he said some are 600 students. Upper classman classes with 600 students!<br>\"\"<br><br>Looks like they let the L&S CS major expand to 550 students per year (despite the minimum 3.3 college GPA in the prerequisites for L&S undeclared students to enter the major), to go along with the 300-400 in EECS (which is tightly regulated at the frosh and transfer admission levels).  L&S CS appears to be the second largest major on the UCB campus (economics is larger), a very different situation from the early-to-mid 2000s when the number of students was under 100 per year in the wake of the tech bubble crash.<br>According to the class schedule, the upper division courses with over 600 students appear to be CS 170 (algorithms) and CS 188 (artificial intelligence).  On the other hand, there does not seem to be much interest in the EE side of EECS, since the upper division EE courses have enrollments under 30.<br><br>", "<b>Username: sevmom</b><br><br>CMU is not for everyone   Fit is very important there.  Can’t imagine that it is so “renowned” for engineering that it is worth a major premium over UMD.  There are smart kids at every engineering school. He would have no shortage of very smart peers at UMD.<br><br>", "<b>Username: Roark345</b><br><br>@katliamom Thank you for your candor!  I totally agree CMU = more personalize education and access to faculty and research.<br>@ucbalumnus Your access to the schools data is very impressive!<br><br>", "<b>Username: sevmom</b><br><br>Good luck with the decision!<br><br>", "<b>Username: Roark345</b><br><br>@sevmom Thank you!  This is not easy <br>Does anyone have good stats solely on undergraduate Berkeley EECS vs CMU ECE related to:<br>Student Faculty Ratio<br>of FT faculty<br>of Grad Teaching Assistants, and<br>Information on grading practices, such as bell curves?<br>I’m getting conflicting information, though the general consensus is that Berkeley has a worse faculty/student ratio and it seems that none of the CMU grad assistants are TAs (they are just research assistants).  I also realize some of the Berkeley data may be skewed because certain basic classes are taken by students in unrelated majors.  Just trying to compare these two majors as opposed to the schools at large.<br><br>", "<b>Username: ucbalumnus</b><br><br>Look at the online class schedule for each school if you want to see class sizes.<br>http://www.berkeleytime.com has grade distributions by course for UCB. Don’t know if CMU has anything similar. http://www.ourumd.com/ has grade distributions for Maryland. Presumably this is desired because of law school intentions?<br>“Research assistant” commonly means a PhD student being paid a stipend and tuition waiver for some research assistant work. So if one is leading a discussion or recitation section of a class, that is functionally like what is ordinarily called a teaching assistant or graduate student instructor.<br><br>", "<b>Username: eyemgh</b><br><br>$270,000 vs. free. That’s a CMU education or a UMD education and $3,000,000 when he turns 58. That’s the true difference when you consider the opportunity cost of the money ($270,000 at 6% annually for 40 years). Alternatively, it’s $1,500,000 at age 48. It would be a nice bridge between an early retirement and his fully funded 401k at 59.5.<br>He might get a slightly better experience at CMU, maybe even a superior experience. What he won’t get though is an experience that’s even remotely close to $270,000 more valuable financially. You all have to decide if you are flush enough to provide that as a gift simply based on the experience.<br>It’s unfortunately too late for this option now for you, but we had a plan for just this case. Not believing ANY undergraduate degree from ANY school is worth a quarter of a million dollars, we simply told our son that any program that netted out over $200k was off the table. The only schools he applied to, in addition to meeting all the requirements that he wanted out of a school, were schools that had reputations of granting good merit aid to high stats students.<br>Tough choice, but the financial implications are real.<br><br>", "<b>Username: katliamom</b><br><br>Agree with above: CMU &gt; Cal… but free UMD totally trumps CMU.<br>The fact is, he’ll take pretty much the same classes at UMD and be competitive for many of the same internships as CMU. And a year or two after graduation most employers won’t care where he went to school, but rather what he accomplished at his last job.<br>You can sweeten the idea of UMD by promising your son a great trip to Europe. (Even after paying for it, you’ll have saved a fortune over CMU.)<br><br>", "<b>Username: sevmom</b><br><br>UMD is ABET accredited and I’m sure recruiting is good there. That is what is very important at the undergraduate level in engineering.    UMD is a well respected school. There will be very many motivated,  top students there in the engineering program. The family needs to decide for themselves though  if the sustantial cost  is worth it to go elsewhere.<br><br>", "<b>Username: ucbalumnus</b><br><br>Perhaps the student can make an account here and ask on his own (and read the cost arguments directly instead of second hand)?<br><br>", "<b>Username: Roark345</b><br><br>@eyemgh @katliamom @sevmom Going back to the drawing board to make the UMD option sweeter.<br>@ucbalumnus Good idea!  Will suggest it.  He has been reading this thread but his own will be better.<br><br>", "<b>Username: ucbalumnus</b><br><br>Another reason to keep costs down: a student who does not have immediate financial pressure is not forced into making career and life choices based on short term financial concerns, but instead can choose to prioritize longer term career development. See the posts below:<br>https://talk.collegeconfidential.com/discussion/comment/21432324/#Comment_21432324<br><br>", "<b>Username: BuckeyeMWDSG</b><br><br>Are you comfortable co-signing all those loans for him? If something happens to you like a job loss and you are not able to co-sign for him, do you have savings to access to cover the price difference so he can finish?<br>http://www.finaid.org/calculators/loanpayments.phtml<br>for $270,000 in loans “it is estimated that you will need an annual salary of at least $372,860.40 to be able to afford to repay this loan” paragraph below results table of calculator<br>Never mind, see these won’t be loans, lucky him! <br><br>", "<b>Username: Roark345</b><br><br>Thank you College Confidential community!  You have helped my S come to his senses.  This was a very difficult decision for S.  Last month was very emotional.  With CC community’s overwhelming consistent message, lots of friends and family talking to S and giving unemotional facts, parents twisting his arms and negotiating a deal……… S picked UMD!  Logically it was a wise decision (emotionally he is still a bit sad).  So glad it is all over.  Unfortunately, now I need to start scheduling college visits for my D <br><br>", "<b>Username: suzyQ7</b><br><br>Very wise decision. He is now 300K richer! Hopefully you will chip in for some special perks with all that savings.<br><br>", "<b>Username: learning19</b><br><br>@Roark345, Congratulations once again.<br>Sorry about posting away questions on your thread.<br><br><br>can you please let me know if you filled out a FAFSA form for Banneker Key scholarship?<br><br><br>Does UMD have supplemental essays? D says she could not find it on coalition app or on their website.<br>Does UMD have any supplemental essays or honors essays?<br><br><br>for one of the scholarships (not Banneker Key), the website says they will consider following “academic achievement, extracurricular activities, awards, honors, and an essay.”<br>https://admissions.umd.edu/finance/freshman-merit-scholarships<br><br><br>can you please let me know how to find that essay topic for this scholarship?<br><br>D wrote her coalition app essay. but we are unsure how to determine the strength of the essay. Any tips how to figure out if it is a strong essay?<br><br><br>"]}