{"title": "wharton vs stern", "comments": ["<b>Username: dannydalt64</b><br><br>Hi all! I’m in a bit of a dilemma…<br>Just about a few weeks ago, I had finished hearing from all of my schools and I was delighted to find out that I had been accepted to both Penn(Wharton) and NYU(Stern). As excited and grateful I am for the opportunity, now comes the most important part, the decision-making process which has been quite difficult for me and my family.<br>NYU had told me that they’d be able to cover 90% of my tuition (about 45K annually) if I were to attend Stern. As for Penn, I have not received any financial aid, and though I will be visiting the school soon and meeting with a FA representative I do not expect to get much. Penn has been my top choice for a while, but the money provided by NYU would also be a big plus too. Given the scenario, it’d great if anyone could give me their input on the situation.<br><br>", "<b>Username: garymui</b><br><br>Are you talking about undergrad or grad school?  I did Wharton undergrad (M&T) and then got my MBA at NYU (part-time while employeed).  For what it’s worth, I definitely felt that the Wharton undergrad classes were more advanced (and harder) than the Stern classes.  This could be an undergrad / grad difference, but the caliber of students at Wharton was higher than at Stern.<br><br>", "<b>Username: dannydalt64</b><br><br>@garymui At the undergraduate level. Do you feel attending Wharton would outweigh the financial burden?<br><br>", "<b>Username: f2000sa</b><br><br>Attend Wharton if you can afford.<br><br>", "<b>Username: IB_Xavier_2017</b><br><br>@dannydalt64 Wait for UPenn’s offer first, I am sure it will be pretty good. I am also sure you will make the decision that is right for you. It’s not the School, but what you do that defines you.<br><br>", "<b>Username: aoeuidhtns</b><br><br>Can you afford wharton tuition? Also, what are your career goals?<br><br>", "<b>Username: garymui</b><br><br>As IBXavier2017 suggested, I’d wait for the Penn offer before deciding anything. Penn is need based so if NYU’s offer was based on need, I wouldn’t be surprised if Penn’s offer was similar in terms of family contribution. If you are keen on pursuing business, I would recommend Wharton.  It is what you do with it but I know I got job interviews based on the Wharton degree. For me there are other factors that would lead me to Penn like coordinated dual degree programs you can do with Wharton undergrad (I was accepted into Wharton and then transferred into M&T) and even though it is an in urban setting, it still have a very campus feel to it.  NYU will pretty much be an all urban setting.<br><br>", "<b>Username: dannydalt64</b><br><br>@aoeuidhtns I’m not 100% but I’m considering concentrations of Finance, Operations/Info Systems, Social impact and/or a math minor. Problem go into investman banking short term/temporarily  and go into the analytic/managing aspect is of organizing for-profit global impact organizations (atm, might change)<br>My family really wants me to go to NYU (understandably) bc of money and the fact that it is still a decent school on its own. For me, however, I would prefer Wharton as not only is it oftened regarded at a #1 business school burn I feel that I would be a much better fit at the school socially and campus. But then again idk if the money is fully worth that experience. The money I received from NYU is tuition remession based (not need) so I’m unsure of how Penn will respond to that.<br><br>", "<b>Username: Publisher</b><br><br>NYU Stern is the clear choice if the cost difference is $23,000 per year for NYU Stern versus about $69,000 per year for Penn Wharton. The cost difference over 4 years is about $184,000 ($46,000 X 4) plus interest. NYU Stern finance is one of the best undergraduate programs in the world. Lots of internship opportunities.<br>Earn a NYU Stern degree, work for two to three years, then get an MBA from Wharton, Columbia, Northwestern, Chicago, Harvard, Stanford, MIT, Dartmouth, UCal-Bezerkley or even from Duke, Virginia, Michigan and you will be much better off than just having an undergraduate degree from Wharton. Or get a one year specialty masters degree in finance, data science, etc. if that is your career goal.<br>Do NOT pay sticker price for Wharton when you have a very substantial discount from NYU Stern. If you pay sticker for Wharton in light of your Stern offer, then you should be dismissed from business school, common sense school & anything related.<br>What would you rather have for essentially the same out-of-pocket dollars (unless you get an MBA scholarship which are readily available for female MBA candidates):<br><br><br>A very expensive University of Pennsylvania Wharton undergraduate degree or<br><br><br>An affordable NYU Stern undergraduate degree from one of the best finance schools in the world & a prestigious MBA from a top school based on your career goals after working for 2 or 3 years post undergraduate school ?<br><br><br><br>", "<b>Username: Publisher</b><br><br>I could reasonably argue that an NYU Stern undergraduate degree combined with almost any top 30 MBA degree is worth substantially more & costs the same or less than just an undergrad degree from Wharton. And yes I have figured into the cost analysis lost wages for an additional two years of schooling.<br><br>", "<b>Username: lmao2018</b><br><br>@Publisher I think your cost analysis is off. With the undergrad degree from Wharton you won’t need the MBA. The total cost of an MBA is ~$170,000. When accounting for the lost wages (assume a decent IB job), then it’s probably around $400,000 after taxes. So NYU + MBA is definitely more expensive, and realistically the Wharton undergrad is more impressive than NYU + MBA in most cases. That said, I would probably just avoid the MBA altogether unless you feel financially comfortable and get into a top program.<br>Penn is also a better school overall, so if you decide finance isn’t for you then you’re better positioned. It’s a tough decision. Good luck either way, I’m sure you’ll fund success regardless.<br><br>", "<b>Username: Publisher</b><br><br>Strong female MBA applicants tend to get healthy scholarships to MBA programs. Plus, I did not calculate that OP would be earning $300,000 per year (your figure) in years 3 & 4 after undergraduate school.<br>OP has already saved $184,000 plus interest on undergraduate study;<br>Probably get at least a 50% MBA scholarship very possibly higher than 50%;<br>More reasonable loss of earnings after tax for 2 year = $200,000; (A Penn Wharton MBA starts at $147,000 salary & bonus, but OP would not have a Penn Wharton MBA–just a BS/BA).<br><br>", "<b>Username: Publisher</b><br><br>US News ranks the top finance programs:<br>FINANCE:<br><br><br>Penn-Wharton<br><br><br>Chicago–Booth<br><br><br>NYU–Stern<br><br><br>Stanford<br><br><br>Columbia<br><br><br>MIT<br><br><br>UCal–Berkeley<br><br><br>Harvard<br><br><br>Michigan–Ross<br><br><br>Northwestern-Kellogg<br><br><br><br>", "<b>Username: Publisher</b><br><br>As OP is also considering Information Systems, US News rankings for grad programs:<br><br><br>MIT<br><br><br>CMU<br><br><br>Texas–Austin<br><br><br>Minnesota<br><br><br>University of Arizona<br><br><br>NYU–Stern<br><br><br>Stanford<br><br><br>Univ. of Maryland<br><br><br>Penn–Wharton<br><br><br>ASU<br><br><br>Georgia Tech<br><br><br><br>", "<b>Username: lmao2018</b><br><br>@publisher Hm? You lost me on your math. Assuming taxes at around 40% then it’s (400-170)/.6 = 383k over two years. That’s actually less than anyone I know made in two year combined after being out of schools for two+ years. So that number could be higher, but sure maybe the MBA is half cost. It’s still much more expensive than the gap between Wharton undergrad and Stern in this case.<br>I fully understand the decision to go with Stern if the financial burden is too high on the family. It just seems silly to say it’s too high but then get an MBA which is even more expensive and generally less impressive than just having gone to Wharton for undergrad.<br><br>", "<b>Username: Publisher</b><br><br>As I wrote above, with an NYU Stern degree, OP could pursue just a 10 month specialty masters if she does not want to commit to a two year MBA. At least after working for 2 years after undergraduate school, OP should more clearly see her desired career goal/path making the graduate degree–whether one or two academic years–quite focused & valuable.<br><br>", "<b>Username: lmao2018</b><br><br>@Publisher You keep editing your post so it makes it hard to keep up.<br>Wharton Undergrad - $184,000 plus interest<br>NYU + MBA - $80,000 for half cost MBA +  minimum $230,000 in lost wages.<br>Wharton undergrad is also better than most NYU + MBA/Masters programs.<br>But yes, you can push the cost down the road to make sure you really want to pursue the field first. You also can be perfectly fine with just the Stern undergrad degree. It’s a tough decision, I was just saying the cost analysis isn’t so simple. There’s a lot of variables.<br><br>", "<b>Username: Publisher</b><br><br>@lmao20118: What do you think that a Penn-Wharton BS grad would be earning in years 3 & 4 out of undergraduate school ?<br>Also, are you asserting that a NYU–Stern degree in finance will not get similar opportunities as a Penn-Wharton BS ?<br>I only have figures for average starting salaries & bonus of MBA grads. NYU-Stern = $137,534 & Penn-Wharton MBA = $146,761 for 2015.<br><br>", "<b>Username: lmao2018</b><br><br>@publisher I think reasonable all-in compensation is around $450k. I know a lot who made more than that and some who made less. If they’re in finance then that seems like an okay estimate.<br>Banks generally pay 140-200k all-in first year. Then it scales up. If you’re in PE it’s higher (250k in third year minimum but some pay up to 400k, and HFs even more). This a path that can be achieved at either Wharton or Stern, but is of course easier at Wharton.<br>I don’t mean to assert that. Lots of Stern kids do very well. Wharton does do better, but is it worth $184,000? I would say no. But I wouldn’t go to Stern just because you plan to get an MBA.<br><br>", "<b>Username: Publisher</b><br><br>Good point. NYU–Stern BS in Finance should get similar opportunities as Penn-Wharton BS Finance.<br>Do you agree ? If so, the MBA or the 10 month specialty masters is a bonus while OP saved $184,000 plus interest & could get a full tuition MBA scholarship as women are sought after by MBA programs.<br><br>", "<b>Username: Publisher</b><br><br>What the MBA/Specialty Masters degree options do for OP is give her an opportunity to refocus her career/career objectives & the opportunity to change industries & employers if so desired.<br>If not needed, then OP has $184,000 plus interest benefit for earning a top finance degree.<br>P.S. I agree that if OP does not pursue finance or information systems  or international business (Penn–Wharton #5 & NYU–Stern #9) at NYU Stern, then OP needs a plan & a reevaluation. But as presented, NYU is the better choice at such a significant discount.<br><br>", "<b>Username: lmao2018</b><br><br>@publisher I generally agree. Since OP indicated that the cost matters to her family, then Stern with $184,000 saved seems like the smartest path right now.<br><br>", "<b>Username: lmao2018</b><br><br>But there is a somewhat reasonable case why choosing Wharton is actually the better decision, especially if you like the culture/campus a lot more and potentially want to switch majors, so this isn’t a ridiculous question.<br><br>", "<b>Username: ccfk1221</b><br><br>oh come on stop with this endless calculations here…you cant predict whether or not she wants to do MBA etc etc<br>NYU is a better option assuming UPenn doesnt come up with a better offer. Stern is a top school anyway and being in NYC is great. Stern has preferential treatment over any other major at NYU when it comes to recruiting and all banks/finance companies come to campus. UPenn is somewhat overrated in my view…<br><br>", "<b>Username: lmao2018</b><br><br>@ccfk1221 Well generally people support statements and decisions  with a bit of information, hence why it’s helful to to approximate the costs of each option. How about you try - what makes you think Penn is overrated?<br><br>", "<b>Username: ccfk1221</b><br><br>@lmao2018 no point wasting time speculating on whether a person will or will not do MBA etc - based on current offer NYU is a better option. Penn is a good school but the additional cost isn’t worth it as you can find same exact (if not better) role after Stern - not to mention networking and other opportunities by being in NYC<br><br>", "<b>Username: Publisher</b><br><br>Another way to view OP’s situation is through a best case/ worst case analysis. Not every Penn–Wharton grad gets, or even wants, the highest paying career on Wall Street. Even if obtained, not all stay, not all survive. If the economy is great, then NYU Stern grads are going to get recruited just like Penn-Wharton grads for finance. If the economy is weak, then OP has $184,000 plus interest advantage plus a prestigious finance degree from NYU–Stern.<br>@ccfk1221: Whether or not OP wants to obtain a graduate degree is not the core issue; it is that by saving $184,000 plus interest, OP would have the option of obtaining a graduate degree. OP may want to get a law degree or put the savings to use in another fashion or just enjoy life without the pressure of large student loans.<br>I think that everyone has something to contribute to this thread.<br><br>", "<b>Username: ccfk1221</b><br><br>@Publisher agreed just think we are overanalyzing a relatively simple question here<br><br>", "<b>Username: Publisher</b><br><br>With respect to US News rankings of undergraduate business programs, US News ranks the top 215 undergraduate business programs. Penn–Wharton is #1 and NYU-Stern is tied at #5. Location is important. The financial center of the US is New York City followed by Chicago & San Francisco. NYU’s NYC location makes interviews & internships easy as it does for securing outstanding adjunct professors.<br>For readers of this thread, the top 13 of 215 ranked undergraduate business programs are according to US News:<br><br><br>Penn–Wharton<br><br><br>MIT<br><br><br>UCal–Berkeley<br><br><br>Michigan–Ross<br><br><br>NYU–Stern<br><br><br>Univ. of Texas–Austin<br><br><br>Carnegie Mellon University<br><br><br>Cornell<br><br><br>UNC<br><br><br>Virginia<br><br><br>Indiana–Kelley<br><br><br>Notre Dame<br><br><br>USC<br><br><br><br>", "<b>Username: lmao2018</b><br><br>@ccfk1221 It’s probably the biggest decision OP has made in her life to date, so being thorough seems warranted. Stern does very well but Wharton does open a few more doors and generally places better. The difference in placlement is probably not substantial enough to pay $184,000 when it creates a burden for your family. The MBA is interesting because it changes the cost dynamic somewhat. I don’t know the actual numbers (OP could look them up if they care) but if 40% of Stern graduates get an MBA while only 20% of Wharton students do, then there’s a 20% chance that Wharton further saves you around $400k all else equal.<br>I agree with the above posts though, Stern is the safer path. For certain individuals and certain circumstances it would make more sense to attend Wharton given the edge in placement, MBA necessity, and preference for campus/culture, but it’s dependent on the individual and is a riskier path to take. To be clear, I think In this case Stern seems like the better option unless OP really loves Penn, would consider switching majors potentially, and her parents are able to help with the cost without burdening themselves too much.<br><br>", "<b>Username: aoeuidhtns</b><br><br>@dannydalt64 if you’re going into ib, then just go Wharton and be over with it. Don’t worry about tuition – you’ll make 100k+ all-in your first year working. If you’re considering finance, remember your salary growth is near-exponential, so go to the best school, as the street is very snobby about prestige.<br>Also, don’t listed to people who are comparing Wharton UG vs. Stern UG+MBA. You are comparing Wharton UG vs. Stern UG. If you’re going to start throwing an MBA into the equation, then Wharton is still a better target school for HBS, GBS, Wharton grad than Stern is.<br><br>\"\"<br>OP has already saved $184,000 plus interest on undergraduate study;<br>Probably get at least a 50% MBA scholarship very possibly higher than 50%;<br>More reasonable loss of earnings after tax for 2 year = $200,000; (A Penn Wharton MBA starts at $147,000 salary & bonus, but OP would not have a Penn Wharton MBA–just a BS/BA).<br>\"\"<br><br>This is pretty bs math. MBA salaries are equal for the same job no matter which school you go to — i.e., MBB will pay $140k base regardless of the MBA program they are hiring out of. The only reason schools have different starting salaries is because some schools place more of their class into finance vs. consulting. And, scholarships will be higher for people with more impressive resumes (i.e., wharton).<br><br>", "<b>Username: ccfk1221</b><br><br>MBA in my view is a waste of time and money - if you have a great role stick with it and see where it takes you if you dont then it might make sense but MBA not necessarily can help plus the cost associated with MBA is just too high in my view<br><br>", "<b>Username: Publisher</b><br><br>The above post contains several errors.<br>For example: \" And, scholarships will be higher for people with more impressive resumes (i.e. Wharton).\" This is as incorrect as a statement can be. Scholarships typically specify the qualifications. Most are for female & minority applicants to MBA schools. As far as resume considerations, it is primarily what one has done in the post undergraduate years. = one’s work experience–although grades (GPA) & school are considered.<br>“Also, don’t listen to people who are comparing Wharton UG vs. Stern UG & MBA.”  Wharton finance & Stern finance majors compete for the same jobs. Pointing out that OP would save enough for an MBA if Stern UG is chosen reveals value & flexibility. Not all Wharton finance get their job of choice; and, if they do, not all remain as they may not fit, get fired or leave on their own.<br>“MBA salaries are equal for the same job no matter what school you go to…” Yes, but the salary differentiation is supplied by the schools to US News & pay reveals much about the type & location of the positions into which MBA grads of a particular school get. This sentence also is a reason NOT to go to Wharton for $184,000 plus interest extra since Stern finance & Wharton finance grads compete for the same jobs at the same pay level.<br><br>", "<b>Username: preppedparent</b><br><br>I would choose Wharton. You won’t need to worry about money.<br><br>", "<b>Username: Publisher</b><br><br>@preppedparent:  That’s nice. Are you willing to pay the extra $184,000 for OP’s Wharton degree ?<br><br>", "<b>Username: Publisher</b><br><br>OP: Wharton grads get MBAs as well. Although falling out of favor, typically 40% to 50% of Wharton grads got their MBAs at ages 27 through 29. Hard to believe that those high income earners would give up their positions to return for two years of school, however, unless wanting to change employers and careers, or their careers hit a roadblock due to not having an MBA. Very recently that figure has fallen to 27% of Wharton grads going back to school for MBAs at ages 27 to 29.<br>OP: In short, if $184,000 plus interest means nothing to you, then feel free to go to Wharton. But, if you are going to major in finance, NYU Stern will put you in competition for the same jobs as a Wharton finance major.<br><br>", "<b>Username: aoeuidhtns</b><br><br><br>\"\"<br>This is as incorrect as a statement can be. Scholarships typically specify the qualifications. Most are for female & minority applicants to MBA schools. As far as resume considerations, it is primarily what one has done in the post undergraduate years. = one’s work experience–although grades (GPA) & school are considered.<br>\"\"<br><br>MBA scholarships are an entirely different beast. They are used to secure students that they want to add to their class. For example, GSB was just ousted recently for using scholarships to secure people coming from a private equity background, and these people most certainly do not face financial constraints nor were they underrepresented candidates.<br><br>\"\"<br>Wharton finance & Stern finance majors compete for the same jobs. Pointing out that OP would save enough for an MBA if Stern UG is chosen reveals value & flexibility.<br>\"\"<br><br>Yes, I agree they compete for the same jobs, and Stern places very well on the street (although typically at different firms), however you’re still facing an uphill battle coming out of any school but Wharton.<br><br>\"\"<br>Not all Wharton finance get their job of choice; and, if they do, not all remain as they may not fit, get fired or leave on their own.<br>\"\"<br><br>[<br>This isn’t a valid argument — you can say the same thing about Stern grads.<br>Make no mistake, Stern is a great choice for IB, but if you also have the option of going to Wharton then it’s a no brainer. There’s a great post made about this regarding MBA schools as well, [Value of a Top 10 MBA](https://gmatclub.com/forum/value-of-a-top-10-mba-213365.html), in which the basic premise is that a degree from HBS or GBS is worth full tuition vs. a full-ride at any other school. I would apply that same logic here.<br><br>", "<b>Username: rjkofnovi</b><br><br>“Yes, I agree they compete for the same jobs, and Stern places very well on the street (although typically at different firms), however you’re still facing an uphill battle coming out of any school but Wharton.”<br>Nonsense.  HYPS will place you anywhere a Wharton degree will take you.<br><br>", "<b>Username: lmao2018</b><br><br>@rjkofnovi you’re attacking a niche point unrelated to the actual question in this thread. Regardless, Harvard and Wharton do place slightly better than Yale and Princeton, and Stanford is hard to measure because of its west coast proximity. If someone is dead set on finance then Wharton and Harvard are clearly the best schools to attend.<br><br>", "<b>Username: Publisher</b><br><br>@aoeuidhtns : You seem to have backed off your earlier incorrect statement & have adopted my position as your own regarding MBA scholarships. As I stated, MBA admissions committees evaluate candidates based on one’s post undergraduate work history primarily, then consider other factors.<br><br>", "<b>Username: Publisher</b><br><br>Just to refocus: OP is debating between the number 1 & number 3 finance majors at Penn-Wharton & NYU-Stern respectively at a four year cost difference of $184,000 plus interest.<br>And OP has shared that cost is a concern to her & her parents.<br><br>", "<b>Username: lmao2018</b><br><br>But as was hinted at earlier, there are a lot of schools in between Wharton and Stern that don’t have a specific finance program so the ranking is somewhat misleading. Taking out that much in student loans isn’t feasible, but Penn wouldn’t ask it either. OP’s family can probably pay the tuition, and only they can decide if it’s too much of a burden.<br><br>", "<b>Username: Publisher</b><br><br>Whether in the form of loans or taken from the parents’ investment accounts, their is a loss of earnings similar to interest accruing on a loan.<br>OP has shared that her discount at NYU-Stern is in the form of tuition remission; financial aid, therefore, may not come into play–although this is not certain as the tuition remission may have negated the qualification for any need based aid.<br>OP is in a great situation with tuition remission as NYU tends to award aid largely in the form of loans rather than grants.<br><br>", "<b>Username: lmao2018</b><br><br>Interest in a savings account versus interest on loans are two different amounts. That aside, if you actually took out that much debt it would be hard to repay even with a high paying job and it would create a massive amount of pressure to really flourish at Wharton. If it’s the parents sacrificing their savings then it changes the dynamic because there’s no longer a worst case scenario where you have a huge debt burden that you can’t get rid of for years and years. Without knowing the financial situation of the family it’s hard to know how big of a difference $184,000 is to them. Penn is generally okay with financial aid for those who need it. So If they’re simply shortening their vacation a few days and traveling to Florida instead of Greece, it’s probably worth it. Stern is good, Wharton is better.<br><br>", "<b>Username: preppedparent</b><br><br>@Publisher  I don’t think money will be a problem for a Wharton Grad.<br><br>", "<b>Username: r8ns8n</b><br><br>I would definitely choose Stern. Stern has an amazing reputation in the business world and is great with jobs and internships right in the city. A huge scholarship from Stern makes this a no brainer decision from my point of view.<br><br>", "<b>Username: privatebanker</b><br><br>I am in the finance business and m and a.  It is not I repeat not more impressive to go to Wharton undergrad than a stern undergrad and say Fordham mba. Much less Colombia hbs or Stanford. MBAs I’ve been in the business for 27 years. It’s just not accurate. It might not be better head to head with info sys or cyber<br><br>", "<b>Username: lmao2018</b><br><br>@privatebanker It definitely depends on where you’re working somewhat, but my firm wouldn’t consider interviewing someone from Stern or Fordham unless they had some other type of spectacular item on their resume. Top Wharton students are much more desired, as are HBS, GSB, and to a lesser extent Columbia MBAs.<br><br>", "<b>Username: privatebanker</b><br><br>The statement was Wharton undergrad alone is more valuable in the marketplacd than stem with a hyps mba.  I say that is just not true at any level. My point was stem coupled with Fordham mba definitely gets a look than a straight undergrad especially anything outside of a entry level 3 year banker program.<br><br>", "<b>Username: lmao2018</b><br><br>My point was in respect to Wharton undergrad alone. Someone coming from banking or HBS/GSB is coming in at a higher level than the Wharton undergrad, but it’s one of the few ways to actually break in. A Fordham MBA or similar would likely be ignored.<br><br>", "<b>Username: privatebanker</b><br><br>I must have misread a post along the way. I thought it was saying to the op that the Wharton undergrad was more valuable than stern and a HBs Stanford tuck type combo. Which is rubbish. I was saying stern plus Fordham was An example of it not even taking that level of mba<br><br>", "<b>Username: dannydalt64</b><br><br>Ik this thread must be dead by now lol, but I’d like to keep everyone updated if they (by any chance) bother to check this again.<br>I ended up choosing Penn! I thankfully got 20K a year from them, so it ended up being better than nothing<br><br>"]}