{"title": "pomona college vs johns hopkins", "comments": ["<b>Username: Drawcodawn</b><br><br>I recently was admitted off the waitlist for Pomona. I’m extremely grateful to be in this position but it also presents a difficult choice. If anyone could give their opinion about both schools, I would really appreciate your suggestions!<br>Intended major: some combination of Computer Science, Cognitive Science, Linguistics, Philosophy<br>Pomona: Diversity; intimate feel and culture with the student body and professors while having resources/research of the large school (Claremont consortium); small classes and priority for undergrads; very good location/vibes and laid back (higher quality of life); strong academics in neuroscience, math etc; high endowment per student.<br>JHU: More recognition everywhere? (I might not want to stay on the west coast to work. personally, I don’t care about prestige but it is what some people consider); stronger alumni network; however the location is a minus, I really didn’t like Baltimore that much when I visited; a larger school with more opportunities and more qualified faculty (not sure how accessible they are considering profs are spread thin over their research and grad, postdoc students)? cut-throat from quite a few people I talked to? have one of the best natural language processing research center and a center for leadership education where I can do stuff like entrepreneurship. (I’m not sure whether I need to learn business or management as an undergrad; I can always learn this later)<br>Both schools cost about the same. So this is not a differentiating factor. I’m planning to do grad school and go into something in artificial intelligence, or work as a consultant in the field. Not quite sure. I think it’s important to note I’m Canadian so I might come to Toronto to do AI stuff at the Vectors Institute since Canada really wants to develop their tech industry.<br>Again I’m not 100% sure of my understandings; these are simply what I heard from talking to students, parents etc. I really value everyones opinion, and if any AOs wants to chime in that would be awesome.<br>Thanks again!<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> Drawcodawn:<br>\"\"<br>JHU:  … cut-throat from quite a few people I talked to<br>\"\"<br><br>Probably due to a large number of pre-meds there.  But it looks like your majors of interest are not the ones that tend to attract that many pre-meds, and you do not appear to be a pre-med.<br><br>", "<b>Username: aquapt</b><br><br>Neuroscience attracts tons of pre-meds. The pre-med mindset will affect your experience at either school, but probably more so at JHU where it is the reason so many seek out the school.  CogSci not quite as pre-med dominated as neuroscience, because many CogSci majors are more oriented toward Linguistics and/or CompSci.  Pomona has a joint department of CogSci and Linguistics, and offers a computation-oriented track of the CogSci major. Being in the consortium with Harvey Mudd further deepens the CS and AI offerings. But JHU is strong in CompSci too.<br>Both schools have strong departments in all of your areas of interest. And I don’t think you have to worry about the strength of Pomona’s reputation within any academic or academic-adjacent community. Neither should inherently advantage or disadvantage you for grad school admissions relative to the other.<br>As you know, the vibes and environments are much different. I think it’s safe to say that Pomona is more nurturing and undergrad-focused, whereas Hopkins will have more going on at the graduate level if you want the exposure to that. It’s a least a clear choice between two distinctly different experiences!  Both top-notch - congrats on having this tough decision to make!<br><br>", "<b>Username: Drawcodawn</b><br><br>@aquapt thank you for your insight. How about Pomona outside the academic community? Eventually I will not be in school. Or does the undergrad reputation not matter as much as grad school?<br><br>", "<b>Username: aquapt</b><br><br>People who know colleges at all know the top LAC’s - Williams, Amherst, Pomona, etc.<br>People who don’t know colleges have still heard of HYPS and the like. They’ve heard of Hopkins because of the med school, but they will call it “John Hopkins” until your ears bleed. <br>Once you go to grad school, it will be the reputation of the grad school that will matter anyway, other than the occasional person who will bond over the undergrad school because they or someone in their family went there too.<br>There are reasons you might want to choose Hopkins over Pomona, but the name recognition isn’t a great reason IMHO.  Neither school is lacking anything vis-a-vis reputation.<br><br>", "<b>Username: intparent</b><br><br>Mudd recently put some limits on CS electives due to the overwhelming number of non-Mudd students taking CS classes at Mudd.  I wouldn’t count too heavily on taking many CS classes at Mudd.<br><br>", "<b>Username: Drawcodawn</b><br><br>@aquapt ok I see. Im curious whether you are a parent? You seem very experienced.<br>@intparent thanks for the info. Is there any way to get around it? And also what do you think of my situation?<br><br>", "<b>Username: aquapt</b><br><br>Yes, I’m a parent of a Scripps student and a Rice alum. (Hence the logo mashup) But I’ve known about Pomona for a long time. One of my best friends in HS (on the east coast) went to Pomona for undergrad and is now a Dean at a top 20 University. It has been a top-notch school for a very long time. I don’t have much direct experience with JHU, though, other than friends who went there for medical-related postgrad programs.<br>Yes, the popularity of CS programs at Mudd and Pomona has led to staffing and course-registration issues.  Majors get priority for required classes, but not for additional electives beyond the requirements, and people are understandably unhappy about this. Hopefully some solutions will be found, but it is an issue.<br><br>", "<b>Username: prezbucky</b><br><br>I would call these roughly equally prestigious among people in the US who know colleges. It sounds like you aren’t dwelling on rep, which is good – I just wanted to throw that out there for anyone else reading, who does care.<br>They are so different that if you figure out your main preferences – things most important to you – you’ll pick the place that presents the better fit.<br>Key differences – bear in mind that some of these are typical in a U vs. LAC matchup and should not be thought to reflect poorly on Hopkins or Pomona per se:<br><br>Pomona will have smaller classes, especially in survey-level courses, and easier access to profs.<br>JHU offers more majors and classes (compare Pomona's class offerings to see how they compare in terms of breadth -- I'll assume both schools offer the majors you listed above...)<br>JHU has some D1 sports and far more research opportunities... but also far more competition for coveted research spots. (JHU does have the #1 research budget in the US, a plus if that might interest you; but available research at Pomona, meager as it is by comparison, is far more likely to go to undergrads). <br>Hopkins has an urban setting, while Pomona is more small town/suburban.<br>Weather: four seasons vs. the southern california season.<br>Hopkins does have a rep for competitiveness, but that is bound to be the case wherever pre-med is so popular. Pomona, by virtue of its less pre-professional vibe (typical of LAC vs. U...), is bound to be less competitive overall. But that doesn't mean the kids majoring in whatever you choose will be more or less competitive at either school.<br><br>These are just some of the things you might consider. I would put academic fit first: majors, classes, distribution requirements/curricular style, class sizes, overall vibe if you can get a handle on it, etc. After that, think about the environment/setting and social vibe, dorms, etc.<br><br>", "<b>Username: intparent</b><br><br>I’m not sure it is fair to say JHU offers more classes given the ability to cross register at the 5Cs.  With the exception of a few areas (CS electives at Mudd right now and some art classes), I’ve not heard of students unable to get the cross registration courses they want.  Of course, you still have the issue that you’d have at all colleges — frosh and soph register later and get slimmer pickings.  But JHU has that, too.<br>No, I don’t think there is a way around the CS electives issue at Mudd.  It isn’t clear what all the steps are that will be taken to resolve it, and they are working on it, but it is possible that Mudd students might have an edge in getting those courses in the next couple of years.<br>I don’t have much opinion beyond that.<br><br>", "<b>Username: Drawcodawn</b><br><br>@intparent by opinion I mean which you would pick if in my shoes?<br><br>", "<b>Username: intparent</b><br><br>That is what I meant.  I don’t have an opinion. <br><br>", "<b>Username: SDCounty3Mom</b><br><br>I’m a mom and a Pomona alumna. If you’re interested in participating in research, Pomona will provide extraordinary opportunities, and you will be able to work directly with faculty. You might take a look at the faculty bios in your departments of interest to see what you think of the people you’ll be interacting with. If you’re an ideas person who likes to ask and answer questions and be challenged to develop your own theories, Pomona is a good fit. If you feel comfortable with, and are invigorated by the idea of developing a personal rapport with esteemed faculty, Pomona is a good fit. I still visit with my favorite faculty mentor over 20 years later. The cross-registration is indeed a cool feature of the Claremonts. Each school does have its personality and reputation behind it, but all the schools are strong, selective, and well-resourced, so it’s a powerhouse there. There’s one central main library for all the schools, one campus ministry center, one student health/counseling center, one main bookstore, one student newspaper.<br>Have you visited Claremont? It’s very suburban and not particularly stimulating. You can easily walk to the adjacent “Village” which has a movie theater, coffee shops, and restaurants, and it’s cute and pleasant but nothing that’s really going to ignite any curiosity or provide a lot of opportunities. The surrounding suburbs are even more ho-hum. So there’s really nothing particularly advantageous about the environs there other than it’s a convenient climate that doesn’t impact your life much except for some days in the fall when you will wish you had air conditioning. But if you don’t love Baltimore, then that’s not a real factor I suppose. In my era, Pomona was relatively weak on career development and tended to send many students to either graduate school for PhDs/academia or med school, and the main supported direct placement into full-time jobs was the management consulting route. There were pockets of weak departments and some use of questionable part-time faculty for classes like calculus – but that’s old data so not worth much. All the Claremont schools talk about internship opportunities but be aware that “Los Angeles” is a solid hour by train from Claremont, so this resource has some challenges built in. Pomona places a strong emphasis on diversity and most of the community there are students of color. In that, it feels very similar to southern California as a whole, where there’s no one racial majority.<br>It’s the most selective liberal arts college in the nation with a huge endowment. Still, most everyday people on the street will not have heard of it, so if you want that nod of recognition when making small talk, Pomona isn’t the one. Having said all these things, I’d choose Pomona again based primarily on one key principle: it’s devoted to undergraduates. I think it makes sense to attend the school that is all about undergrads when an undergrad, then attend a grad school where grad students are a priority. In all, you’re in a great and enviable position – congratulations and good luck!<br><br>", "<b>Username: Corinthian</b><br><br>I’m the parent of a Pomona rising senior, and I’ll stick up for the village of Claremont as a nice albeit suburban town. Here’s a map. http://www.thevillageclaremont.com/map.html. I’m tagging @nostalgicwisdom for more feedback. I will say that the Pomona CS Department is struggling with the same issues as HMC’s, which is demand that exceeds the amount of faculty available. Basically you have to be a CS major to have the necessary priority to get in classes. They will hold spaces in the introductory classes for the incoming freshmen, but after that you’d better declare a CS major asap.<br>My D is an Econ major who is trying to complete a CS minor and she was shut out of the class she wanted last Spring semester as a junior. Generally cross-registration is easy and seamless but be aware that for your major some departments will require that you complete certain courses at Pomona (e.g., the Econ department requires that you take the 6 core classes for the major at Pomona). My D is currently doing an internship one of the Federal Reserve Banks. She’s only been there a few days but her boss, a senior Research Economist at the Fed, told her that she is on the “right tail” in terms of the amount of research experience that his interns have had.<br><br>", "<b>Username: Drawcodawn</b><br><br>@SDCounty3Mom I have visited mudd last summer and passed by Pomona but didn’t have time to do the tour. I absolutely love the laid-back, neat, cultured environment. I’m fine with not going to schools. thank you for input!<br>@Corinthian I think I will major in cs so that should be fine. How easy is a double major?<br><br>", "<b>Username: intparent</b><br><br>Even CS majors at Mudd (who are Mudd students) have limitations on electives at the moment.  Declaring a CS major isn’t a fix for the issue mentioned above.  The issue is being worked on, and likely will be better by the time the OP is a junior and is ready for more electives, but it is something to be aware of.<br><br>", "<b>Username: katliamom</b><br><br>One non-academic insight: For international students, I’m a big fan of the East Coast. Unlike California, it has an extensive public transportation system that would allow you to explore Washington DC, New York, Boston – some of the most dynamic cities in the U.S. in addition much of the east coast seaboard. My daughter - raised in Western U.S. - loved her opportunities to explore this part of the country. Without a car.<br><br>", "<b>Username: nostalgicwisdom</b><br><br>Congratulations on getting off the waitlist. I’m a 2016 Pomona grad, so I can give you some specific, current insights.<br>All of the fields you are interested in are excellent at Pomona, and a liberal arts college and community can be a particularly stimulating way to explore numerous disciplines and connect readily with people across different interests.<br>It sounds like your long-term goal is a career within computer science. Here’s a look at the pros and cons of Pomona’s CS at present:<br>Pros:<br><br>The community of students, faculty, and alumni is exceptional. People look out for one another and are encouraging, supportive, and kind. Your feedback is taken seriously and whenever you need help or advising, there is a lot of receptiveness to that.<br><br><br>Prepares you well academically for graduate school. Pomona is one of the top feeder schools on a per capita basis to computer science PhD programs. In fact, many people who are presently at grad school have told me the teaching and individual attention is clearly far above that of the major university they are a part of (in their own classes and in their TA capacities for undergrads there). <br>Excellent outcomes. Whether you want to go to a reputable graduate program or top notch industry job, Pomona will help you get there. I've never heard of anyone having difficulty on this regard. The Claremont Colleges are collectively seen as a target school by many tech companies, and ample on-campus recruiting and interviews make it easy to land a job or internship. Many of my friends leave with six figure salaries straight after graduation in many of the famous tech companies. For graduate school, I can't think of anyone who didn't end up at a top 10 program (MIT, Berkeley, Cornell, etc). Pomona is also one of the top schools for students getting STEM fellowships like the NSF, Goldwater, Churchill, etc.<br>Easy to engage with research and get funding for internships, independent projects, conferences, etc. This is just true for Pomona in general- there is a lot of money and programs designed to help students fund whatever they are passionate about. Harvey Mudd has a 5 college summer computer science research program as well. <br><br>Mixed:<br><br>Doing internships in LA. There are a surprising number of tech companies within the metro area, so theoretically, that would enable students to gain other experiences during the year. Most of them are in West LA/Santa Monica, however, which is quite far from Claremont (50 miles or so). Public transportation will take you 2.5 hours each way, so it’s pretty necessary to have a car. But then you have to deal with LA traffic. There are a couple of tech experiences a bit closer- Pasadena, Downtown LA, USC Innovation Lab. Getting to DTLA from Claremont via public transportation is pretty straightforward.<br><br>Cons:<br><br>Classes are not as small as they are in other departments of the college. Pomona’s average class size is 15, but it is difficult to find a CS class with fewer than 25 students. That said, almost none tend to be over 50 either, and even in larger classes professors take the time to know the students individually.<br><br><br>Lots of interest, but not the most ideal set-up to accommodate it. Getting into CS classes is tough if you're a non-major (they advise students to declare immediately upon arriving). If you're a CS major, you'll definitely have priority in order to graduate with the degree within four years, but many popular electives can be locked out. Pomona did just hire 2 more full time faculty, so hopefully that helps a bit. Mudd is presently in their own crisis for CS and honestly, there's a lot of uncertainty about what will happen. I think you can count on Mudd if you want to do research with a professor there, but if you want to get into a specific course, it's probably going to be a lottery (for them and for us). <br>The emphasis is pretty theoretical and isn't the sort of pre-professional, project based work that you would want to present to someone in the industry. Students and liaisons step in to cover that aspect (hackathons, student led teaching, collaborative service-based projects, etc), but the department itself is very academic. One way to alleviate this is to do Harvey Mudd's Computer Science Clinic, in which you do an industry-based project as your senior thesis. It's open to CS students regardless of home school. Most students will intern in their summers while doing research during the school year at Pomona, allowing them to be prepared both for academia and for the industry. <br>Smaller course selection within CS- at the end of the day, most of your experiences will be coming from Pomona, and it's a small school with just 1600 students and 240 professors in total. <br><br>===<br>You mentioned Johns Hopkins’s stronger alumni network. I have a close friend at JHU, and that’s actually one of her biggest complaints with the school. She said that it can be difficult as an undergrad to benefit from alumni experiences. All of the various constituent colleges like Bloomberg, Med School, etc. have independent identities. I think what you’re referring to is that JHU is a larger school, so the alumni reach is much bigger. But in terms of actually connecting to alums and being advised from them, I feel like a small LAC like Pomona fosters a special dynamic to give back. Forbes says that 31% of Pomona grads donate, ranking it #25 for “Most Grateful Grads”, while JHU is 13% and ranks #48. I’ve seen a lot of my CS classmates come back to Pomona to seek out interns for the companies they’re working at, and there’s also a larger network of 5C alums eager to support one another! So you’re not only looking at people from Pomona, but from Mudd, Scripps, Pitzer, and CMC as well who you can reach out to.<br>That said, JHU is definitely more well-known, and is a world-class research university. I believe their philosophy department was just given a $75 million dollar gift. And it seems you’ve identified specific facilities that excite you. So I can see the dilemma.<br>Obviously, I’d pick Pomona, but I’m biased. But I think if you’re confident about graduate school, Pomona can help launch you to the best ones out there (and the top facilities involved with them) while giving you a transformative, once in a lifetime liberal arts college experience. Pomona is known for its rigorous academics coupled with a high quality of life & happy students. The Claremont Colleges really enrich the experience and help the school feel larger and more exciting. I’m looking at a website of ratings based on student reviews, and out of 10 (the maximum):<br>Johns Hopkins vs Pomona-<br>Education Quality: 8.4 vs 8.8<br>Individual Focus: 6.6 vs 9.1<br>Collaboration: 6.6 vs 8.9<br>Friendliness: 7.4 vs 9.2<br>Faculty Accessibility: 7.3 vs 9.3<br>Social Life: 6.0 vs 7.5<br>Scholastic Success: 7.7 vs 8.9<br>Extracurricular Activities: 7.0 vs 8.0<br>University Resources: 7.3 vs 8.5<br>On another website:<br>Overall Experience at Pomona- 4.65/5<br>Overall Experience at Johns Hopkins- 4.04/5<br>It seems that students are more content at Pomona <br>Good luck with your decision- there are pros and cons to both. They’re almost opposites of each other to an extent, but you’re sure to have a great experience either way!<br><br>", "<b>Username: momofsenior1</b><br><br>My daughter sat in on a bunch of engineering classes at JHU and was pleasantly surprised with how relaxed the vibe was and the report students had with their professor.     It was a week before exams and no one seemed particularly stressed and there were lots of smiles and laughter.     Baltimore is a pretty cool city that gets a bad rap but there is lots to do, great museums that actual abut campus, and free transportation to Inner Harbor.  It’s also an easy trip to DC.<br><br>", "<b>Username: nostalgicwisdom</b><br><br>Oh, and since you mentioned double majoring- it’s pretty straightforward. You can major in any of Pomona’s 48 areas regardless of experience. One thing is that our majors require more courses than those at peer LACs, so you want to plan it out and let your advisers/department chairs know in order to fit everything in within four years. You can see some specific data here: http://www.pomona.edu/administration/office-registrar/reports-and-statistics/majors-and-minors (click the Double Majors tab). I see that CS/Linguistics and CS/Philosophy has been completed in the past.<br><br>", "<b>Username: Drawcodawn</b><br><br>@nostalgicwisdom thank you so much for your detailed response. Are you a cs major? I’m mainly concerned that Pomona is not well-known outside of companies and academia, if I do work internationally (coming back to Canada). My parents are worried about prestige, and I can see why. I can see it potentially coming in handy when interacting with people less acquainted with schools. My thoughts are if I go to a reputable grad school it will not matter. For the JHU facilities I’ve identified, I’m not sure I will be able to contribute as much or take part in more specialized projects until later. I do think Pomona is more than sufficient in this respect. Do you personally have experience with the clinic program at Mudd and/or research at Pomona?<br><br>", "<b>Username: stevensPR</b><br><br>@Drawcodawn I would reach out to some JHU faculty and CS majors for more data points - especially on their facebook groups, reddit, and via e-mail.  You will be surprised at the response.<br>JHU does have more lay and professional name recognition than Pomona at the professional level which will help if you do not choose to go to grad school.  It also helps that all of the FANG companies recruit on campus for JHU - not sure if the same is true for Pomona (doubtful).  JHU’s comp sci major is also world renowned (especially for cyber security) and small which helps tremendously.  It doesn’t help that Pomona’s CS program is not even ABET accredited let alone recognized.<br>To say JHU’s reputation is primarily medical is a bit shortsighted.  JHU is well known in silicon valley - far more from my subjective experience versus any LAC given none of them having an engineering school save for Mudd (which is also a relative unknown).  It helps that JHU’s ex-president is heavily involved in the community and Stanford (Will Brody).  And it doesn’t hurt that IBM’s ex ceo and chairman of the board (Samuel J. Palmisano) is a JHU alum.<br>Contrary to @nostalgicwisdom  Go to US News and compare JHU to Pomona:<br>Alumni giving rank: #6 amongst all universities (37.5%) vs Pomona (27.6%) 54th amongst all LACs.<br>Academic Reputation: JHU (4.6) Top 5 amongst all universities versus 4.4 for Pomona - top 20 amongst LACs.<br>Disclaimer:  Former JHU undergrad alum and MIT grad alum working at Google now in Mountain View.  I would choose JHU in a heartbeat and it also helps they wanted you first.  If you tell people in the valley you majored at Comp Sci at Pomona, a non-insignificant amount would have assumed you went to Calpoly Pomona since the latter actually has an engineering school.  No need to make that distinction with Hopkins.<br>As for the network, yes it exists.  I and several other JHU grads have referred fellow JHU alums to Google.  We have an SF JHU young alumni chapter that takes care of other alums for tech jobs too.<br>Pomona isn’t even the top ranked LAC in US News and it does not compare to Hopkins from a CS level.<br><br>", "<b>Username: privatebanker</b><br><br>Hopkins is not a better school they are both outstanding. Top of the collegiate food chain good.  But like Berkeley, Johns Hopkins has a global brand that shouldn’t be dismissed out of hand. But more importantly is where you will feel empowered to do your best work.<br><br>", "<b>Username: Drawcodawn</b><br><br>@nostalgicwisdom I’m curious to see what you think of @stevensPR opinion? Thank you everyone for giving your opinion I really appreciate it.<br><br>", "<b>Username: nostalgicwisdom</b><br><br>No, but a lot of my close friends are, and I’m part of the Facebook CS community. I was a science major in another department, so I can speak about research at Pomona.<br>It’s easy to get involved- you can start from the moment you arrive on campus! I started in the second semester of my first year. The intro courses do a good job connecting you with the department so you can learn about each professor’s research interests and see where you want to build experience. You mentioned an interest in AI, so here’s a perspective from a recent grad to see her CS experiences both in and outside Pomona: http://www.pomona.edu/news/2018/03/22-chinasa-okolo-%E2%80%9918-coding-more-inclusive-computer-science<br>During the school year, you do research as a course- in your case, either CS199RAPO (Research Assistantship) or CS199IRPO (Independent Research). I believe there are some funds available for students who need work-study money as well. These are courses you create which are advised by a professor. Grad schools love these because it shows independence and direct research involvement. There’s also a game lab at CGU: http://www.cgu.edu/center/claremont-game-lab/<br>Most upper-division labs at Pomona are structured to involve an independent research project. The work I did in two of my labs (required courses at Pomona!) was presented in research conferences, and one was turned into a paper.<br>During the summer, there are three opportunities you can use. Summer Undergrad Research Program, SURP, pays $440 per week and funds about ~200 students to engage with research with professors on-campus. An additional 30-50 projects are funded for off-campus unpaid research opportunities or independent proposals. Pomona College Summer Experience Funding (SEF) is done through the Career Development Office and funds unpaid or low-paying internships (you come up with the budget); I benefited from that to do research at a major university. Harvey Mudd sponsors a 5C summer research program in CS which sponsors 70 students for research: http://www.cs.hmc.edu/research/ This isn’t as difficult to benefit from as it sounds, since the vast majority of CS students across the colleges do an internship over the summer rather than staying on campus.<br>Thesis is optional for CS at Pomona, but highly encouraged if you want to go to grad school. You can do an academic thesis (with independent research) advised by a CS professor at either Pomona or Mudd- there’s an agreement between the two schools to combine professor expertise in order to manage thesis led research proposals. As seen above, Chinasa did her senior project with a Pomona professor. The alternative is Clinic, in which you are given an industry project by a company and work in teams to come up with solutions/insights. You can learn more about Clinic here (http://www.cs.hmc.edu/clinic/info) and see specific projects here (https://www.cs.hmc.edu/clinic/projects/). I counted 9 people from my class in the link for 2015-2016.<br><br>", "<b>Username: 57special</b><br><br>Any reason you’re not considering going to U of T or Waterloo? Both are excellent for CS, and the cost would likely be far less.<br><br>", "<b>Username: stevensPR</b><br><br>@privatebanker from an undergraduate education perspective, agreed.  From a CS major perspective, there is a disparity in terms of knowledge learned given ABET accreditation exists for one and not the other.  OP can also take grad level CS courses in AI, System Design, or other focus areas at JHU which helps tremendously as well.<br>@Drawcodawn If you’re interested in AI, just reach out to Carol Reiley (JHU alum and wife of Andrew Ng - both needless to say are well known in the field of machine learning and AI and have been known to chat with JHU CS majors).<br><br>", "<b>Username: Drawcodawn</b><br><br>@stevensPR I fully understand your points and thank you for the advice. Do you know Carol personally? Do I NEED to take those grad level courses as an undergrad? I’m leaning towards Pomona b/c of the environment and I think I can synthesize more of my interests.<br><br>", "<b>Username: momofsenior1</b><br><br>JHU admissions folks said they have more research opportunities than they have students to fill them so research shouldn’t be a problem there either.<br><br>", "<b>Username: stevensPR</b><br><br>@Drawcodawn I’ve met Carol quite a few times around the valley - I would consider her a strong acquaintance.  You absolutely do not NEED to take the grad level courses to graduate.<br>I implore you to reach out to other JHU and Pomona CS alums to get additional data points before making a significant decision.  It shouldn’t be made just from opinions from people on this thread - who are not all well versed in CS or have not experienced what you personally will go through.<br><br>", "<b>Username: intparent</b><br><br>I think they are very comparable from a CS reputation viewpoint.<br><br>", "<b>Username: Drawcodawn</b><br><br>@stevensPR I have actually talked to people in CS at both schools. Both schools seem to have v promising grads going into the best grad schools and solid careers. I’m asking about the grad level not as a requirement, but was curious how much it be of benefit to me given I’m still scratching the top of iceberg of AI. What do you think of the atmosphere of Hopkins, in classrooms and around the city? I’ve heard admissions say “it’s not cut-throat” (obviously) and but I have heard negative experiences from current students. What is your take on this?<br><br>", "<b>Username: stevensPR</b><br><br>@Drawcodawn I would say it is a benefit.  At google, it is extremely difficult to break into deep mind unless you have graduate schooling or prior AI knowledge which is just simply not provided at the undergrad level.  This is not even taking account changes such as blockchain that is being introduced more at the grad level as well.  So exposure in this category will deepen your expertise and will be helpful in getting you to the right group within google AI or FAIR (Facebook’s AI group) should you choose that path.<br>As for cutthroat competition, it is a myth and frequent rumor mill spread by people who did not get in or go tot hopkins.  People study together.  When you go to the library or dorms, you will frequently find study groups. They compete together against the tests and not against each other since the school does not have grade inflation.  When you ask the source of these cutthroat rumors, they are time and time again by non Hopkins alums.  This goes for the premeds as well.  Ask current Hopkins students if it is cut throat there before passing judgement.<br>I personally had a blast and met my best friends at Hopkins.  We had a great time partying, hanging out in fells point close to the harbor, going to DC, chilling at federal hill and around mount Vernon in Baltimore as well.  My friends and I all graduated while having great social lives and are all now doing well as doctors, engineers, lawyers etc etc.<br><br>", "<b>Username: nostalgicwisdom</b><br><br><br><br>Does ABET accreditation matter in CS? I don’t believe LACs without engineering are even eligible to apply, since ABET is an engineering based institution. As mentioned, the CS outcomes from Pomona are phenomenal, with students readily landing tech jobs at the top companies and graduate school destinations. If there’s some evidence that Pomona CS students are suffering in comparison to students from other schools, I’d like to see it. Facebook, Apple, Amazon, Google, and Alphabet all recruit across the 5Cs, and while I don’t believe Netflix does, I just found 10 Pomona alumni who are presently working there and 7 at Mudd through LinkedIn. I could easily reach out to them. Tech recruiting is not something that the CCs are weak at. And as previously mentioned, I’ve never heard of anyone from Pomona complaining that their education did not serve them well for grad school.<br><br><br>I was referring to this: http://www.forbes.com/sites/schifrin/2017/08/02/2017-grateful-grads-index-top-200-best-loved-colleges/<br><br><br>It’s silly to discount Pomona as “isn’t even the top ranked LAC in US News”. Johns Hopkins “isn’t even the top ranked university in US News”, so don’t bother with them. Doesn’t that sound absurd? If we’re going by rankings that actually are combined, Forbes ranks Pomona 10th (including the #1 LAC) and Hopkins 30th, while Times/WSJ rates Pomona 26th and Hopkins 17th. That’s hardly any different.<br><br><br>I can tell you that people constantly turn down Berkeley, Carnegie Mellon, Cornell, U of M, and yes, Harvey Mudd, alongside other distinguished CS programs to come to Pomona. Ask the CS majors at Pomona what other schools they were considering, and you’d be surprised. There is no denying the research powerhouse strength of Johns Hopkins and its name brand, as well as the fact it has a larger, more resourced (not necessarily BETTER- in terms of quality of teaching, undergrad focus, community, etc) department. This is a classic case of small LAC vs. big university, and there are genuine reasons for picking the former without resulting in anything significant to one’s potential outcomes. LinkedIn Career Insights lists the six most similar schools to Pomona as Harvard, Berkeley, Stanford, Brown, Yale, and UChicago. It may not have the same name brand as Hopkins, but at least in the USA, the people who recruit and read applications hold it to high esteem. For graduate school, it has a track record of sending students to distinguished programs. I can’t speak about the Bay, but I have experience with the east coast and found Pomona to be largely recognized.<br>The advice about connecting with students and alumni directly is good, though. It would be good to get some perspective from undergrads at either schools to better understand the strength and weaknesses of each program, as well as alumni about how their school prepared them.<br><br>", "<b>Username: stevensPR</b><br><br>@nostalgicwisdom why should we trust a ranking (aka Forbes) that had Pomona as #1 just 3 years ago and JHU around #60 last year?  I didn’t know schools could deteriorate or improve so much tremendously in such a short time frame relative to others.  It is more absurd to treat the Forbes ranking as grounded in any semblance of truth.<br>You can do a comparison of per capita CS alumni using LinkedIn at FANG for Jhu CS versus Pomona CS. It should be a telling insight.<br><br>", "<b>Username: Drawcodawn</b><br><br>@stevensPR what do you mean by at FANG? And for alums would contacting people on Linkedin work?<br><br>", "<b>Username: stevensPR</b><br><br>@Drawcodawn I could be cheeky and say google it, but i won’t…;).  FANG is a term coined by Jim Cramer to refer to the best performing public tech stocks (aka Facebook, amazon, Netflix, google).  These are frequently offhandedly seen as the most desirable public tech firms to work for save for Amazon probably.  Collectively this acronym has taken on a respect equivalency to MBB for consulting, M7 for MBA or T14 for law schools.  You can probably expand FANG to include Airbnb, Uber, Snapchat, Apple as other desirable tech firms as well.<br><br>", "<b>Username: twoinanddone</b><br><br>I like Baltimore, so I’d go to Hopkins.  It is easy to get around the city or to DC.  For D1 sports it has lacrosse, but if you enjoy college sports there are several other schools in the area that are D1 (Towson, Loyola, Navy) and you could follow those teams. There are also the professional teams in both Baltimore and DC.  Pomona is not far from Anaheim and you’d have the Angels and the Ducks, but everything else is in LA.<br>I didn’t understand if you are from Toronto or just plan to live there in the future.  Hopkins is a lot closer if it is your home.<br><br>", "<b>Username: stevensPR</b><br><br>@pomonathrowaway looks like I hit a nerve.  I didn’t know my posts show a complete bias against LACs.  Seriously, grow thicker skin.  Come to the valley and we can survey these tech companies and alum success first hand.<br><br>", "<b>Username: stevensPR</b><br><br>@pomonathrowaway awesome job. I’m sure you included undergrad CS majors in your analysis only.  Doubtful, but one can hope.<br><br>", "<b>Username: Drawcodawn</b><br><br>@twoinanddone I am from Toronto. Not really into sports, but good to know.<br><br>", "<b>Username: Drawcodawn</b><br><br>@stevensPR undergrad is what I’m looking at. I can always apply for grad school at Hopkins or elsewhere. But presently it is not what I am considering. I just want to make that clear. And I’m really thankful for your answers.<br><br>", "<b>Username: stevensPR</b><br><br>@Drawcodawn absolutely.  We aren’t comparing grad schools here but merely available undergrad opportunities.  I think hopkins offers a half off masters should you choose that path later to its undergrads too.  What you need to consider right now is how CS majors like the school at both jhu and Pomona.  Not a single poster thus far has addressed that point adequately in this thread.  Get more data points.<br><br>", "<b>Username: nostalgicwisdom</b><br><br>If we’re speaking about FANG in particular, in my class’s CS cohort, I can think of 12 students who went to work at them directly. That’d be about 25% or so. 20% went straight to graduate school, while the other 55% worked for other companies (Intuit, Cisco, Lyft, Amazon, Microsoft, etc.) I’m not sure how these numbers compare to Johns Hopkins’s CS. As previously mentioned, outcomes are not the issue when it comes to CS at Pomona. I’ve seen that repeatedly and have looked enviously at my friends (seems like the easiest path to a six figure salary- straight out of college!)<br><br>", "<b>Username: stevensPR</b><br><br>@nostalgicwisdom it is harder than it seems.  Plus the average is not six figures unfortunately within all of CS.  Only google and Facebook primarily offers that to entry grads and the salary is low 100k plus stock options that can’t be realized for some time.  Not to gloat, but 100k is tough to save on in the Bay Area where these companies are located.  MV rent for a nice one bedroom with amenities is around $3k average per month for instance.<br><br>", "<b>Username: stevensPR</b><br><br>@pomonathrowaway<br>BTW, I just did the Linkedin query.  Amongst software engineers at FANG, Pomona has a total of 43 alumni working there.  JHU has 613.<br><br>", "<b>Username: Drawcodawn</b><br><br>@stevensPR Pomona has less graduates b/c a smaller school. I don’t think it’s comparable. Maybe look at the percentage going to FANG instead?<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> stevensPR:<br>\"\"<br>From a CS major perspective, there is a disparity in terms of knowledge learned given ABET accreditation exists for one and not the other.<br>\"\"<br><br>ABET accreditation does set a good minimum standard, but there exist good CS majors that are not ABET accredited (e.g. Stanford, CMU, UCB L&S CS).  In many cases, good CS majors do not have ABET accreditation because they do not have the non-CS science requirements needed for ABET accreditation.<br>What it does mean is that one may have to more carefully evaluate the actual CS offerings at a school where CS does not have ABET accreditation.  But it does not automatically mean that the CS major there is unsuitable.<br><br><br><br> nostalgicwisdom:<br>\"\"<br>Does ABET accreditation matter in CS? I don’t believe LACs without engineering are even eligible to apply, since ABET is an engineering based institution.<br>\"\"<br><br>There are schools whose only ABET accredited program is CS.<br>But it is likely that many schools do not bother because (a) it is not perceived as required like it is for (for example) civil engineering, (b) they do not require non-CS science for CS majors, and/or © they do not want to deal with the administrative work involved.<br><br>", "<b>Username: Drawcodawn</b><br><br>@ucbalumnus that’s very good to know. Thanks so much for the assurance. I was kinda worried about that.<br><br>", "<b>Username: stevensPR</b><br><br>@ucbalumnus  The real question is does a school have the ability to meet ABET status which is indicative of breadth of offerings?  Typically an engineering program does.  Can’t say that about all schools or even universities for that matter (Dartmouth for instance).<br><br>", "<b>Username: privatebanker</b><br><br>This is a bit of who is better -Tom Brady or Joe Montana.  Pomona or Hopkins. It’s not like the decision will impact your personal success. That’s up to you. And it could be easily Iowa State for the right person. Go where you feel best suited for siccess. But neither school will assure success or be an impediment in any way.  Hopkins has a much bigger international reputation.  Pomona big time rep with sophisticated employers and schools. The cocktail party Johns Hopkins is quite impressive as well as with the same employer and grad school crowd.  What motivates you.  What will push you to be your best.  I would choose Hopkins for the immediate recognition of value and the competitive  atmosphere. But as we have heard. Pomona is really tough too and Hopkins is collaborative in its own way.<br><br>", "<b>Username: Drawcodawn</b><br><br>@stevensPR and @nostalgicwisdom just an update. I’ve been speaking to a lot of Pomona students. I spoke to JHU students back when I went to SOHOP. both about what they do after Pomona to get more data points. I have to say quite a few students from JHU encouraged me to go to Pomona, although a JHU prof reached out to me about his research and about JHU. I have to I’m going to visit early next week before I make my final decision. Thank you again for both your help.<br><br>", "<b>Username: nostalgicwisdom</b><br><br>Good stuff! I’m sure you know this, but thought it worth repeating that the school session is out for the Claremont Colleges and most students don’t begin summer research until mid June or so. So the campus is going to feel really, really, empty. I believe most professors will be on campus and academic buildings should be open from 8-5- I’d recommend emailing in advance to schedule a meeting (they might have some students as well that you could talk to). The admissions office does hold tours and info sessions at 9/10/11 AM and it could be a nice way to connect with the officers. Definitely make your way up to the other Claremont Colleges up north to get a sense of how close they are (also, if there are professors at the other schools whose work interests you, you could speak to them as well). The library should be open as well. Have a great visit <br><br>", "<b>Username: Drawcodawn</b><br><br>@nostalgicwisdom I’m going to see Pomona and CMC (interested in their business and entrepreneurship). I’ve been to Mudd in the past. I scheduled a tour and an info session.<br><br>", "<b>Username: aquapt</b><br><br>If you do want to try to observe a class, there are a few (with faculty from throughout the 5C’s) being offered at Pitzer. Check out the list for the six-week session that is still going on, and see if there’s anything you want to request permission to sit in on. (Nothing jumps out at me as matching your interests, but see what you think.) https://www.pitzer.edu/summer/course-schedule/<br><br>", "<b>Username: nostalgicwisdom</b><br><br>^ Good suggestion- totally forgot about that! I’ve heard great things about Profs Novy, Morrison, Borowoski, and Zuckerman! Seems like you could hit Brain and Behavior right after your info session, tour, and lunch, or alternatively, you could spend the afternoon taking to a few Pomona professors, eat dinner at the Village, and then spend a bit of time for the late night classes (you most likely won’t have to stay the whole time). Just message the professors, let them know your purpose (you got off the waitlist at Pomona and would appreciate seeing what the academics look like at the Claremont Colleges), and I’m sure they’d be happy to accommodate you<br><br>", "<b>Username: Drawcodawn</b><br><br>@nostalgicwisdom @aquapt thanks for the suggestion! I don’t think any really matches my interests or my schedule. I think I will just talk to professors!<br><br>", "<b>Username: intparent</b><br><br>I wouldn’t consider a Pitzer class to have the same vibe as a Pomona class.<br><br>", "<b>Username: Drawcodawn</b><br><br>I just visited Pomona. I’m still very conflicted. This hopkins grad gave some solid reasons https://talk.collegeconfidential.com/johns-hopkins-university/2083174-pomona-college-vs-johns-hopkins.html<br><br>", "<b>Username: Corinthian</b><br><br>I don’t see any “wrong” choice here, not do I see any “perfect” choice.  Pick one and don’t look back.<br><br>", "<b>Username: nostalgicwisdom</b><br><br>Don’t you only have a few days to decide? I thought Pomona only gave students a week to commit or move on.<br>Just listen to your heart, honestly. As cliche as that is, you’re the only one who knows what you want out of your college experience and I’m sure you’ve confronted certain thoughts and feelings over the past few days. It seems like you’ve gotten a lot of perspective from people (I saw topics on other websites as well), though I will say a lot of it is JHU focused simply by nature of them being a much larger school. I could see a lot of misconceptions regarding Pomona with the perspectives detailed (including the one above), but at this point I don’t really find it worthwhile to “dispute” points raised. If anything, they can give you a sense for what colleagues and friends might perceive a degree from a top LAC to mean, whether or not that’s grounded in anything true. If the opinions of others is something which especially matters to you, and you want to impress others with your institution, then there is the appeal of Johns Hopkins which is widely renowned as a leading university. I will be honest with you that Pomona will not give you much in the way of immediate glamour, and not everyone can tolerate that. But as a recent graduate, I know I was able to have the best undergraduate experience there and can stand on my own accomplishments and perspectives rather than the public worth of my institution alone.<br>No point in overthinking this. Small LAC with the individual attention and undergrad-centered experiences, or big university with world-class professors and research? They are vastly different. Enough has been elaborated at this point regarding the pros and cons of either. One will clearly resonate with you more than the other. Good luck with your choice, and once you’ve made it, move on to imagining the excitement and possibility you’ll have as an incoming first year at either!<br><br>", "<b>Username: Drawcodawn</b><br><br>@nostalgicwisdom and everyone. I have 2 more days. I will let you know how it goes. But I will<br>Likely pick Pomona, I already got the merch lol. Just want to carefully process how I felt at each school.<br><br>", "<b>Username: Drawcodawn</b><br><br>@nostalgicwisdom I’m thinking about this all day and I’m still conflicted. If you saw my quora question, the answers present very good reasons for JHU and I love the school. But I love Pomona too!<br><br>", "<b>Username: tk21769</b><br><br><br>\"\"<br>Intended major: some combination of Computer Science, Cognitive Science, Linguistics, Philosophy<br>\"\"<br><br>@Drawcodawn, are you already familiar with JHU’s Human Language Technology COE?<br>(https://hltcoe.jhu.edu/about/)<br>Have you investigated opportunities for undergrads in this center?<br>Have you checked out ~related internship opportunities with firms/agencies in the Baltimore Washington corridor?<br>IMO they are both fine schools; one could make a good case for either one.<br>For your specific areas of interest, I would think JHU offers greater breadth/depth.<br>Maybe this should be a key consideration (more than prestige or name-recognition, which are high for both schools). However, if I weren’t satisfied that good opportunities extend to undergrads at JHU, I’d probably prefer the Pomona/Claremont environment. Have you contacted JHU departments/programs about how undergrads participate, what they’re doing after graduation, etc.?<br><br>", "<b>Username: nostalgicwisdom</b><br><br>I saw the quora thread. One of the posters hasn’t even started at JHU yet (he’s Class of 2022). One of them has no experience with Pomona or the Johns Hopkins undergrad program. The other makes a completely absurd point, IMO that because it’s not Harvey Mudd, Pomona shouldn’t be considered. Never mind that someone with your broad interests would definitely fit in better at Pomona than Mudd (they don’t offer philosophy, linguistics, or cog sci).<br>You’re going to need to think about the information you’re getting and where it comes from. Quora is a prestige  obsessed website with a international audience. This one values LACs more. All of us have our own biases. At the end of the day, it’s your decision and your life. If you’re going to be influenced on the whim by whatever anyone has to tell you, instead of thinking critically about what your own values are, you are going to regret the decision at some point.<br><br>", "<b>Username: Drawcodawn</b><br><br>@nostalgicwisdom that’s exactly what I thought. If Mudd offered me admissions I wouldn’t really go b/c of my interests. I’m writing out a cost/benefit point comparison for each school right now based on all the info I obtained and things I felt.<br><br>", "<b>Username: websensation</b><br><br>INO Pomona harder to get in. I tried to interest my kid to apply to Pomona but he really wanted to go to a big school.<br><br>", "<b>Username: stevensPR</b><br><br>Quora is indeed prestige obsessed.  Here are some opinions straight from the mouth of Pomona students and alumni.<br>https://www.quora.com/How-prestigious-is-Pomona-College-Do-the-employers-respect-a-Pomona-College-diploma<br><br>", "<b>Username: otisp</b><br><br>Admittedly biased, but FWIW my sister who received her BA at an LAC and advanced degrees at an Ivy, gave this advice to my Pomona kid when facing a similar decision: “You can always go to a big university for grad school, but you can only experience a small LAC as an undergrad.”<br><br>", "<b>Username: stevensPR</b><br><br>@websensation<br>Difficulty of admissions is subjective in this case.  Pomona has a slightly lower acceptance rate (8.4% versus 11.7% for Hopkins) but Hopkins has the edge in freshman test scores:<br>SAT scores of enrolled freshman for Pomona for class of 2021: 1330 - 1520<br>ACT scores of enrolled freshman for Johns Hopkins for class of 2021:  30 - 34<br>Percent of freshman in top 10% of class: 94%<br>SAT scores of enrolled freshman for Johns Hopkins for class of 2021: 1460 - 1480<br>ACT scores of enrolled freshman for Johns Hopkins for class of 2021:  33 - 35<br>Percent of freshman in top 10% of class: 93%<br><br>", "<b>Username: stevensPR</b><br><br>@websensation  Massive typos above as I have to get to work…=).  Corrected below.<br>Difficulty of admissions is subjective in this case. Pomona has a slightly lower acceptance rate (8.4% versus 11.7% for Hopkins) but Hopkins has the edge in freshman test scores:<br>SAT scores of enrolled freshman for Pomona for class of 2021: 1330 - 1520<br>ACT scores of enrolled freshman for Pomona for class of 2021: 30 - 34<br>Percent of freshman in top 10% of class: 94%<br>SAT scores of enrolled freshman for Johns Hopkins for class of 2021: 1460 - 1580<br>ACT scores of enrolled freshman for Johns Hopkins for class of 2021: 33 - 35<br>Percent of freshman in top 10% of class: 93%<br><br>", "<b>Username: nostalgicwisdom</b><br><br>2021 is a bad year to compare given the concordance issues with the new SAT and old SAT (also, Pomona’s CDS states 1370-1540, not 1330-1520).<br>If those numbers are accurate for Hopkins (they seem higher than what the admitted profile reports, which is usually not the case, but theoretically it is possible), then they’ve deliberately shifted their admissions process to be more numbers driven. Those numbers would be at or above what schools like Stanford, Harvard, and Yale reported this year.  At least from 2014-2016, JHU was ranked around 20 or so for entering student testing (one source here: http://www.businessinsider.com/the-50-smartest-colleges-in-america-2016-10) so going to top 5 or so is a big shift.<br>Pomona’s numbers have actually come down slightly despite more and more applicants, and I think it’s due to the opposite effect. They’ve cut down on a numbers driven process (at one point, Pomona was ranked 5th in the nation for highest entering student stats) in pursuit of a holistic one, though they still want top students (hence the high % ranked in the top 10%). Pomona has had the highest percent of underrepresented minority students of any highly ranked LAC or university for the past two years, alongside their commitment to socioeconomic diversity (top 10 by a ranking in NYTimes and one of only three private colleges to be there; JHU ranked 72), first-gen students, rural representation, QuestBridge, two cohorts of Posse, and other community-based partnerships.<br>Furthermore, compare what each admissions website has to say:<br>JHU: https://apply.jhu.edu/application-process/<br>We’re looking for students who can think beyond their limits, who don’t see ‘impossible’ as a roadblock, and who will not only elevate themselves, but also those around them.<br>Pomona: https://www.pomona.edu/admissions/apply<br>Evidence of:<br>Investment and involvement in a community or passionate pursuit<br>A love for learning, and a willingness to challenge yourself and go outside your “comfort zone”<br>An openness to new ideas and rejection of easy answers<br>An appreciation for a collaborative learning environment<br>Personal character — be it grit, kindness, diligence or serving others<br>Risk-taking and adventurousness<br>Creativity and innovation<br>Appreciation for the visual and/or performing arts<br>Is one harder to get into? I feel like a high stats student with good ECs and clear ambition could potentially count on getting into JHU in a way they can’t at Pomona. OTOH, the students scoring the 30 or below at Pomona might not be able to get into JHU.<br>I don’t think this is too important to a decision making process in particular, but I do find it intriguing that the schools look for different things. JHU really seems to stress challenging one self and seeking to be the best you can be. Pomona has more of the liberal arts character. It can be a good reflection of the sort of students who attend either one.<br><br>", "<b>Username: Drawcodawn</b><br><br>Pomona’s acceptance rate was 6.9% this year. Jhu is 9.9%. I believe Pomona selected around 6 Canadian applicants whereas jhu picked 10-15. But the selectivity doesn’t really matter that much to me.<br><br>", "<b>Username: nostalgicwisdom</b><br><br>Also, speaking of the quora link, the common story I see is that the name brand isn’t super great outside of academia but people are still able to get to top destinations for both careers and grad school, so one shouldn’t worry too much. Which is what I’d personally say as well- and it also seems to be the perspective of most recent grads. With one exception, and I mean, he’s entitled to his view, but that doesn’t mean he’s correct regarding outcomes (at least for the present- he’s a 2005 grad). Since he referenced Amherst and Williams in specific, there are data points from the three schools showing that the salaries across these schools are similar (CollegeScoreCard & PayScale), that tech/consulting/other prestigious gigs recruit similarly from the Claremont Colleges, and that Pomona is similar in terms of students receiving competitive fellowships or getting a PhD. Maybe back in 2005 Pomona truly did suffer when it came to pre-professional opportunities, recruiting, and such, but that hasn’t been my personal experience as a 2016 grad. I know Pomona definitely stepped up for funding internships and elevating career services in the four years I was there. I actually landed a couple of interviews in NYC where the employers spoke highly of the school, so it’s on the rise.<br><br>", "<b>Username: Drawcodawn</b><br><br>I think prestige is an important factor. But not right now. If doing well at Pomona can come close to guaranteeing a grad like stanford, oxford, cornell I’m completely fine.<br><br>", "<b>Username: stevensPR</b><br><br>@Drawcodawn<br>Doing well at Pomona or JHU will not guarantee a top grad program.  There are other factors at play in terms of getting into grad school.  But I can tell you that the number one grad school destination for JHU (outside of JHU) for last year’s graduating class was Harvard.  I went to MIT from Hopkins on a full fellowship (amongst the top 10% of entering grad students as did some of my other classmates).  Many of my other classmates across the engineering school also won extremely competitive national fellowships (NDSEG, NSFGRFP, Hertz) or individual full school sponsored fellowships at Princeton (Gordon Wu Fellow), Stanford (SGF program) and Harvard.  You will have no shortage of opportunities at JHU.  I graduated from JHU in 2015, so my experience is also recent.<br>See below for grad outcomes.<br>https://studentaffairs.jhu.edu/careers/news/2017-fds/<br>It also helps that the reputation of JHU in silicon valley is absolutely sterling - it is where you want to be if you want to be in tech.  What is not debatable is the fact that more employers will have heard of and recognize JHU here versus Pomona given JHU’s CS program is actually known.<br>@nostalgicwisdom JHU has had high stats for a while now.  It’s just been slowly going up over the years from the above 1360-1530.  Business Insider is likely using outdated data.<br>See here:  https://studentaffairs.jhu.edu/wp-content/uploads/sites/23/2017/01/2014_2015_EnrollmentReport.pdf<br>Class of 2021 enrolled stats:<br>https://hub.jhu.edu/2017/08/25/class-of-2021-overview-facts/<br>JHU’s combined range is 1480 - 1560.<br>Pomona also self reports the range of SAT scores for the class of 2021 which more or less matches the range above:<br>https://www.pomona.edu/sites/default/files/pomona-college-admissions-profile.pdf<br>Verbal - 670 to 750<br>Math - 660 - 760<br>There’s a definite discrepancy.  You can argue one school is more stats obsessed versus the other, but it could also be JHU is finding students that are more well rounded vs Pomona but with higher scores due to the STEM bent.<br><br>", "<b>Username: stevensPR</b><br><br>@Drawcodawn<br>here are the pomona destinations post graduation by major for the most recent 3 classes.<br>https://www.pomona.edu/administration/career-development/where-grads-go<br><br>", "<b>Username: stevensPR</b><br><br>Based on the above info, this is how Comp Sci graduates fared from Pomona for grad school.<br>Needless to say, not everyone (or anyone) is going to Harvard or Stanford.  There is one CMU, MIT, and Berkeley in the below list, however.<br>Class of 2017   Computer Science    Carnegie Mellon University  MS  Robotics<br>Class of 2017   Computer Science    Cornell University  PhD Computer Science<br>Class of 2017   Computer Science    MIT PhD Computer Science<br>Class of 2017   Computer Science    University of California - San Diego    PhD Bioinformatics and Systems Biology<br>Class of 2017   Computer Science    University of Southern California   PhD Computer Science<br>Class of 2015   Computer Science    Boston University School of Medicine or University of Alabama School of Medicine    MD  Medicine<br>Class of 2015   Computer Science    University of California - Berkeley PhD Computer Science<br>Class of 2014   Computer Science    University of California - Los Angeles  PhD Statistics<br>Class of 2014   Computer Science    University of Washington    PhD Computer Science<br>Class of 2016   Computer Science & Mathematics  Tufts University    PhD Computer Science<br>Class of 2014   Computer Science & Mathematics  University of Southern California   PhD Computer Science<br><br>", "<b>Username: stevensPR</b><br><br>If you can, I would get on linkedin @Drawcodawn and see if you can talk with Jason Yim from JHU.  He just graduated with a BS in comp sci from JHU and is going to Google Deepmind as a research engineer which is pretty unheard of as an undergrad.<br><br>", "<b>Username: Drawcodawn</b><br><br>@stevensPR interesting. thank you so much for providing the information. I need to make a decision by today so I don’t have much time left. But I will try to do some more research. Did you start working at google after grad school at MIT? What are the other factors you mentioned, and how did you manage receive the full fellowship?<br><br>", "<b>Username: Drawcodawn</b><br><br>@stevensPR by clicking on first destination of JHU for CS grad school, it appears that 9 at JHU, 1 at Stanford, 1 at CMU, 1 at UCL in 2017. Those are the notable ones. Given that pomona is a smaller school and people went to cornell, mit, and cmu in 2017, I think both schools have comparable destinations.<br>Also do you know about the 5 year BS/MS program for JHU cs? isnt MS what you get for grad school? So that combines the two?<br><br>", "<b>Username: stevensPR</b><br><br>@Drawcodawn Yes, it combines the 2. Some students manage to graduate with both a BS/MS in 4 years at no additional cost.  No GRE test needed as well.  Or you can choose to stay and do a 50% off Masters at JHU in your fifth year - guaranteed and a rare benefit not offered at most schools.<br>if you want a completer picture of the Class of 2017, go on linkedin.  There are several CS grad school students at Stanford from JHU for instance.<br>I worked for consulting at Bain & Co after MIT grad school and am now at Google as a product manager.  I was in the Ph.D. program at MIT but left with a fully funded master’s after I determined I didn’t want to stay another 4 years to complete the doctorate.<br>The factors for getting into a top graduate school with funding are research experience (first author publications help especially) and recommendations by notable professors. You will have no shortage of this at JHU with ample summer funding (see PURA and other funded research programs with JHU professors).  Test scores and GPA are next in importance.  Interviews will come into play as well.<br>I had my selection of funded grad schools (Caltech, Stanford, MIT, Columbia, etc) when I applied.  I didn’t graduate at the top of my class (had about a 3.7 GPA - average at JHU is about a 3.4 now).<br>I started research sophomore year and got published in a few publications as did some of my classmates during junior year.  My professor earned his Ph.D. from Stanford and is a well respected researcher as are most professors at Hopkins. His recommendation sealed the deal as my grad school interviewers knew who he was and held his opinion in high regard.<br><br>", "<b>Username: Drawcodawn</b><br><br>@stevensPR how are you finding where people go the grad school on LinkedIn? What are you searching?<br><br>", "<b>Username: Drawcodawn</b><br><br>Hey everyone, I’ve decided to commit to Pomona College. Thank you so much for the help! <br><br>"]}