{"title": "boston university vs boston college", "comments": ["<b>Username: syenna00</b><br><br>Hi,<br>I know this is a common question, however, some input would be greatly appreciated. Some background information about me is that: 1. I am undecided (No idea whatsoever) 2. One offers slightly more money 3. Two of my siblings have attended one of these schools 4. My parents prefer the school that neither of those said siblings attended (though they liked the school).<br>Thank you guys in advance for any input you can give me!<br><br>", "<b>Username: privatebanker</b><br><br>A Mystery wrapped in a riddle.<br>It depends on major and your personal preferences.<br>But since you are asking. I would vote BC. Lovely campus vs none. Higher ranked overall. Although in the top 50 they are all excellent Selectivity on a huge rise at BC although already super select. Meaning smart classmates. Large and growing endowment. New buildings and investment in infrastructure. Brand new field house with beautiful gym, pools and dance rooms for students. The brand new Schiller integrated sciences center which will be cutting edge in cross disciplinary research. New school of engineering adding to science chops. Excellent pre health consulting. And a d1 acc football and basketball team right on campus for fun activities. Hockey too. So many clubs and access to city without being fully integrated into the city.<br><br>", "<b>Username: undergrad2018</b><br><br>It definitely comes down to your preferences and vibe. BU has an urban campus connected to the city (albeit a pretty self contained one confined to a stretch of Commonwealth Ave), whereas BC has a traditional (and very beautiful) collegiate campus ~30 minutes out by public transit.<br>Acknowledging the limits of stereotypes, BU kids are typically seen as trendier and more individualistic, whereas BC kids maintain a preppier, more mainstream image. BU students interact more with local schools, particularly MIT, than do BC kids by virtue of proximity.<br>Contrary to the previous post, I would say BU has made proportionally far greater strides in selectivity than BC; BC has been top-notch for some time, while BU just recently caught up to a similar standard of selectivity. The incoming GPAs and standardized test scores are nearly identical, and BU has a ~6 percentage point lower acceptance rate likely because it draws from a comparitively more extensive international applicant pool. Considering BU’s momentum relative BC, BU will likely make up the 5 spot difference in US News rankings and leapfrog BC by the time you graduate - if rankings are important to you / employers in your prospective field.<br>BC and BU have a similar endowment (~2 bil), but BU shares that amongst roughly twice the student population.<br>BU’s Kilachand center (CILSE) has the same focus on interdisciplinarity, and it was endowed with $100 million dollars by a donation last year that will mean it will dependably pump out ~$5 million in research per year at minimum. BU conducted $400 million in research last year, and BC conducted $193 million. Overall, BU typically carries more weight in the sciences.<br>Case in point, do research on your intended major/career, gauge which one would fit your vibe best, and know you’re picking between two great options.<br><br>", "<b>Username: privatebanker</b><br><br>Leapfrog BC. Perhaps.  Proof is in the pudding. For now they are 5 spots behind in UNWR. Not that rankings are all that. They’ve both been at this game for s long time.<br><br>", "<b>Username: suzyQ7</b><br><br>What is your intended major?<br><br>", "<b>Username: rickle1</b><br><br>If money isn’t a big decider and both schools accomplish your academic goals, fit should be an easy decider as these two couldn’t be much further apart. Both great schools but completely different feel. Hard to imagine you liking both equally based on their differences.<br><br>", "<b>Username: privatebanker</b><br><br>@undergrad2018   Contrary to the post you made earlier. I just checked Forbes all colleges top schools listing.  BC 49 and BU 86. Not saying this is all about rankings because it’s different for each kid.  But leapfrogging BC seems a little ambitious in the next three years.<br><br>", "<b>Username: WildestDream</b><br><br>^ Based on numbers, it’s clear that BU is the school with the momentum here. BU is now more selective than BC based on acceptance rate, and draws a nearly identical student body as BC based on stats, which wasn’t the case a few years ago. It’s also catching up and will probably surpass BC in the overall U.S. news rankings in the near future. BU’s been really ramping up it’s STEM offerings, and it looks like that’s paying off.<br><br>", "<b>Username: privatebanker</b><br><br>If acceptance rate percentage means adding another 10000 unqualified interested students makes it more selective. Then so be it. They can only take what they can take based on spots available.  So I would look at the average student admitted.  Not marketing prowess.  And when they eclipse BC on either forbes or USNWR I’ll agree. Until then it’s speculation and conjecture on your part.<br><br>", "<b>Username: evergreen5</b><br><br>It’s difficult to compare acceptance rates considering that BU offers ED while BC does not.<br>With the uptick in apps and lowering of acceptance rates everywhere this season, it will be interesting to compare data for the students who choose to enroll at these schools in fall 2018.  Past middle 50 ACT scores for enrolled students:<br>fall 2017 BC 31-33, BU 29-32<br>fall 2016 BC 30-33, BU 28-32<br>Depending on the program of study, these schools are close enough that ranking should not be a factor in the decision.  However, the campuses are so different that it’s hard to imagine a student not having a significant personal preference for one campus over the other.  OP, maybe you need to visit them again, talk with some current students, etc.<br><br>", "<b>Username: Hapworth</b><br><br>I think @rickle1 nailed it.  These two schools, though they both have “Boston” in front of their names, could not be more different.  Thus, all things being equal (financially, I mean), you should have a clear sense of what you want.  BC offers the more traditional college experience, complete with D1 football.  BU is more urban and appeals to a more independent student (not just because it is urban but because it is so large: 32K students vs. BC’s 14K).<br>I was surprised to learn, however, that both schools have high percentages of students that live on campus: 75% for BU and 82% for BC.  I would have guessed that a lot of BU students would not live on campus.  I was wrong.  I’m also guessing that at both schools a fair number of upperclassmen (seniors especially perhaps) choose to live away from school.<br><br>", "<b>Username: undergrad2018</b><br><br>@privatebanker If you check out Wall Street Journal’s ranking, you’ll find BU at 40th and BC at 60th. The most widely regarded and commonly referenced ranking is US News.<br><br>", "<b>Username: undergrad2018</b><br><br>@privatebanker I completely agree with you; rejecting 10,000 unqualified applicants does not meaningfully contribute to an institution’s selectivity. That being said, the 64,470 applicants to BU’s class of 2022 had an average ACT of 30 and an unweighted GPA of 3.66: http://www.bu.edu/today/2018/six-quick-stats-about-who-applied-to-the-class-of-2022/. Adding 4,000 applicants in one year with standardized test scores in the 95th percentile would, however, constitute a meaningful uptick in selectivity.<br><br>", "<b>Username: privatebanker</b><br><br>There both really good. Schools. I would have loved either of them undergrad.<br><br>", "<b>Username: WildestDream</b><br><br>Since rankings were brought up: also check out the various “world” rankings, where BU far outranks BC. Worldwide, BU enjoys more recognition, so if you wanted to work outside the USA (i.e. Asia), BU may be the more marketable choice.<br><br>", "<b>Username: privatebanker</b><br><br>That I can agree with. If you want to work overseas go to BU<br><br>", "<b>Username: happy1</b><br><br>Two fine schools… think about the differences and see if you have a preference.<br>Some questions you might ask yourself are:<br>–Do you prefer a more traditional campus or an urban school?<br>–Do you like the idea of a Catholic college or do you prefer a non-sectarian school?<br>–Are you OK with the core curriculum at BC?<br>–Do you like big time sports (BC is in the ACC) or does that not matter a lot to you?<br>–Is one school better in your area of interest academically?<br>If you ask me personally, I’d choose BC.  I do think you have four undergraduate years and I like the idea of being on a more traditional campus.  But two reasonable people could come up with two different answers depending on their own preferences.<br><br>", "<b>Username: evergreen5</b><br><br>@undergrad2018 Indeed, BU has become more selective in recent years.  From your link, BU’s ED applicants increased 8% over last year and total apps increased 6%.  Also note that BC’s EA apps increased 15% and total apps increased 9% over last year.<br>I’m not sure how much the stats of the pool tell us without the context of the admitted stats and later, the enrolled student stats.  For BU, class of 2022’s admitted average ACT is 32 and SAT 1468 https://dailyfreepress.com/blog/2018/03/22/bu-admits-class-of-2022/.  For BC, 33 and 1448 http://bcheights.com/2018/03/26/bc-accepts-27-percent-2022-applicants/.  Enrolled stats for both will be lower.<br>It’ll be interesting to see where yield takes these schools this year.  If I recall correctly, both were overenrolled last year, so it makes sense that both were conservative in numbers of acceptances this year.  By my math, BU accepted about 14,184 this year, down from 15203 last year, aiming for a class of 3300, which would be a yield of 23%.  BC accepted 8400, down from 9200 last year, aiming for a class of 2300, which would be a yield of 27%.  We’ll see what happens with the waitlists.<br><br>\"\"<br>@Hapworth I’m also guessing that at both schools a fair number of upperclassmen (seniors especially perhaps) choose to live away from school.<br>\"\"<br><br>At BC, 3 years is the usual amount of guaranteed housing with junior year the designated year off, simply because there aren’t enough beds (this has been the case for &gt;30 yrs).  4 years guaranteed on-campus housing is an extra-special award given in the acceptance letter, for various groups and top students.  90% of seniors return to living on campus, a decades-long and much-loved tradition. https://bcheights.com/2018/04/29/more-students-opt-for-on-campus-housing/<br>OP, maybe it’ll take another visit, but ultimately it shouldn’t be hard to figure out which school suits you better.<br><br>", "<b>Username: privatebanker</b><br><br>If this isn’t a prank. I will play along. Yes of course BC<br><br>", "<b>Username: evergreen5</b><br><br>Reread the responses you got the first time.  Based on campus differences alone, you should be able to identify your personal preference.  No one else can help you make this choice and you’ve given zero relevant information for others to help you weigh factors.<br>Wasn’t the deadline 11 days ago?<br><br>", "<b>Username: syenna00</b><br><br>Hi,<br>I know this is a common question, however, some input would be greatly appreciated. Some background information about me is that: 1. I am undecided (No idea whatsoever) 2. One offers slightly more money 3. Two of my siblings have attended one of these schools 4. My parents prefer the school that neither of those said siblings attended (though they liked the school).<br>Thank you guys in advance for any input you can give me!<br><br>", "<b>Username: yikesyikesyikes</b><br><br>@evergreen5<br>I recommend people to look at test averages for matriculants rather than the admitted pool.  That is a far better measure of student quality.<br><br>", "<b>Username: evergreen5</b><br><br>^I would agree.  That’s why I posted stats for enrolled students in #10.<br><br>", "<b>Username: happy1</b><br><br>The OP hasn’t been back to CC since May 1 – I expect he/she decided on a school.<br><br>", "<b>Username: UrbanMum</b><br><br>BU is a bit more selective and it also has a smaller freshman class. Here are the stats for 2018 admissions:<br>Boston University<br>22% acceptance rate<br>3300 total freshmen<br>1468 mean SAT<br>32 mean ACT<br>Boston College<br>27% acceptance rate<br>8400 total freshmen<br>1448 mean SAT<br>33 mean ACT<br><br>", "<b>Username: Alexandre</b><br><br>UrbanMum, BC does not have 8,400 freshmen. It has 2,400 freshmen. Otherwise, your data seems about right, although I am not sure there is enough of a difference in the admit rate and standardized test scores to suggest that BU is more selective than BC.<br><br>", "<b>Username: privatebanker</b><br><br>It’s not more selective it’s less so. Bc has division one sports in the averages and bu is not at the same level.<br>BC is a higher ranked school than BU universally in the US and especially in business. BU has a bigger presence internationally.<br><br>", "<b>Username: privatebanker</b><br><br>Bc has a a target of 2297 freshman. 2400 was an over enrollment in 2021.<br>Bu has many more applications and bit the pool isn’t necessarily  as deep or talented pool once you get out beyond the a certain number of applications<br>People make a big mistake looking at admit rates as a sign of selectivity.  It’s a sign of application volume. If all students were equal then it would be true. But a school received 60k applications and 4000 were great the rest not competitive   School b has 10k apps because they are Jesuit and expensive. But they 4K admitted non athletes have higher stats tha school a.  You would have one school with a less than 10 percent acceptance rate and school b with a 40 percent acceptance rate. Your chances of getting in were not determined by acceptance rate. It’s the quality of the pool you are swimming in.<br><br>", "<b>Username: Alexandre</b><br><br>Agreed privatebanker. The strength of the applicant pool must be considered.<br><br>", "<b>Username: TomSrOfBoston</b><br><br>BC, as a Catholic, Jesuit school has a self selecting applicant pool.  Many students do not even consider applying to BC because of its religious identity.  Also families in search of merit aid are less likely to apply to BC.<br><br>", "<b>Username: Corbett</b><br><br><br>\"\"<br>People make a big mistake looking at admit rates as a sign of selectivity.<br>\"\"<br><br>The best-known college-rankings, from USN&WR, include an evaluation of “student selectivity” (among other things). And as far as USN&WR is concerned, acceptance rate is only a minor factor in determining selectivity. They evaluate selectivity using the following factors:<br>65% weight - SAT or ACT scores for enrolled (not admitted) students<br>25% weight - fraction of enrolled (not admitted) students in top 10% of their high school class<br>10% weight - acceptance rate<br>In other words, “selectivity” is not really determined by the number of students that a school turns away. Instead, it’s mostly determined by the quality of the students that a school attracts.<br>In the 2018 ranking, BC was ranked #28 for selectivity specifically, while BU was ranked #45. Note that these are just the ranks for selectivity, which is only one component of the overall ranking. BU ranked higher than BC in other components, like “faculty resources”, and so the overall rankings were closer.<br>So there is a good case that BC is the more “selective” school. However, it would be foolish to choose BC over BU solely on that basis.<br><br>", "<b>Username: IzzoOne</b><br><br>I agree on admit rates not being a great indicator of selectivity.  The modern phenomenon of low admit rates is largely due to the relative ease of applying to multiple schools combined with marketing programs to get as many to apply or not whether or not they are qualified.  A cynical view would be to say they are inducing unqualified students to apply to be rejected.  The number of high stat kids has not skyrocketed (although high school grade inflation is rampant).  Unfortunately, other metrics used by USNews are open to manipulation as well.<br>I would say historically, BC has had the better reputation and a more traditional campus experience.  BU has made some significant gains and is experiencing some of the trendiness that some urban campuses are experiencing.  It is difficult to say if that is going to continue or whether trends will change.<br>I think they are probably close enough in reputation that I would suggest going on fit.<br><br>", "<b>Username: TomSrOfBoston</b><br><br>When I was in college if you had a 3.0 average and an 1100 SAT both BU and BC were safeties.  Times have changed!<br><br>", "<b>Username: privatebanker</b><br><br>@corbett. The case was being made the other way. The original point was being made was the opposite bu being more selective over Bc.   BC is a bit harder to get into in general but a poor reason to choose.<br><br>", "<b>Username: ccfk1221</b><br><br>i love how the discussion got carried way and OP is nowhere to be seen…<br><br>", "<b>Username: WildestDream</b><br><br>BU has pretty much caught up BC in terms of selectivity. Lots of momentum. Academically, BU is more robust in more academic areas than BC.<br><br>", "<b>Username: privatebanker</b><br><br>Yeah. BU is has always been great. Everyone should just go there and be done with it.<br><br>", "<b>Username: TomSrOfBoston</b><br><br>BC does not have the alternate freshman entry option that BU has: CGS January-London program.  The stats for those students are not reported to USNews.<br><br>", "<b>Username: SwimmingDad</b><br><br>At my kids’ high performing suburban Boston HS, the edge in terms of selectivity goes to BC. BC attracts the preppy kids (my dad’s in financial services!). BU gets more a mix that is reflective of our HS which is almost 1/2 Chinese/Indian/Korean.<br>That said, you can do fine at either. It is completely about fit; they represent two polar opposites of Boston schools.  Good luck!<br><br>", "<b>Username: privatebanker</b><br><br>Tom. Don’t bother with the logic. Some posters are very interested in anti BC rhetoric. Maybe they where waitlisted there and can’t let it go.<br><br>", "<b>Username: Dancingmom518</b><br><br>I graduated from BU back in medieval times. Glad to see the BU-BC rivalry lives on.<br>Seriously, they are both good schools. Students should pick based on which one fits them best.<br><br>", "<b>Username: privatebanker</b><br><br>@Dancingmom518  :)&gt;-<br><br>", "<b>Username: happy1</b><br><br>The OP has not been back since May 1.  I expect he/she made a choice by that date.<br><br>"]}