{"title": "bc vs unc vs usc", "comments": ["<b>Username: Vincent1997</b><br><br>I have been breaking my head over choosing one over the other. I’d really appreciate any input that I can get. All three are great schools, but have certain advantages and disadvantages. My plan is the graduate with a bachelor, work for the government (alternatively go into banking right away) for a couple of years, get my masters and then work in banking.<br>UNC: I would choose this school, if it were not for the uncertainty of getting into the business program. I would hate myself, if I couldn’t get into the business program, when I had the option to go to another University and study business there.<br>USC: I really want to work on the east coast, but I think USC’s curriculum perfectly matches my current classes and I’d probably graduate the quickest. Additionally, I like the curriculum a lot.<br>BC: It seems like a school that would suit me well, but I don’t know if it’s worth to choose BC over UNC.<br><br>", "<b>Username: privatebanker</b><br><br>@Vincent1997<br>Congrats all super schools. You must have worked hard for the opportunities.<br>Did you get into Carroll school?  If so and you want to work on east coast in govt or banking my opinion would be BC. If not it’s a toss up. My daughter got into BC and USC but chose USC for the weather . She also had honors college at UF and full scholarship. UF isn’t UNC but it’s a top 10 USNWR public uni like unc.  It’s pretty close.<br>She is premed though not business. If she got into Carroll and not the other schools b schools it would be 100 percent BC<br><br>", "<b>Username: privatebanker</b><br><br>Also assuming costs are same or not part of your decision.<br><br>", "<b>Username: Vincent1997</b><br><br>@privatebanker Thank you for your response! I do consider costs, but it’s not my main concern.<br><br>", "<b>Username: VAMom23</b><br><br>UNC–no guaranteed admit to business<br>USC- On the eest coast–you are interested in working on the East Coast<br>BC–On the east coast. If you can study business there, what is the downside?<br><br>", "<b>Username: Vincent1997</b><br><br>@VAMom23 I’ve done quite some research about UNC vs. BC and it seems that most people hold UNC in higher regard. Things I hear are that BC has a lower salary, less exposure to wall-street and that it’s very localized around Boston. I am not sure how true those things are, which is why I am trying to get more input <br><br>", "<b>Username: VAMom23</b><br><br>@Vincent1997 I asked so that you can help yourself reach a conclusion.  That BC &lt; UNC CH in business (based only on what you say) won’t matter if you don’t have a guaranteed admit. The admission stats for UNC’s business school are really low, so you are taking a risk.  Do you have a back up major?<br><br>", "<b>Username: Vincent1997</b><br><br>@VAMom23 I don’t have a backup major no. Maybe I am naive, but I don’t think 50% is that low. I mean the acceptance rate to UNC as a transfer is only 30%, which makes me think that if I made it into UNC, then I will make it into the business school. Then again, you’re right. I will be screwed, if I don’t get in and there is always a chance.<br><br>", "<b>Username: privatebanker</b><br><br>Unc is an excellent school. And seems like where you would like to attend.  I’ve been there numerous times and think it’s a very nice place. Know a few grads and they are good kids and gainfully employed. But I have no idea where your stats are comming from regarding BC Carroll School of Management low pay and localized around Boston?  That’s utter nonsense. Sorry. A large group of students stay in Boston because Boston is very attractive and New England despite the weather gets a hold of you. So yeah BC is big in Boston. Which also the educational capital of the world. The mutual fund capital, genetics reasesrch and pharmaceutical. And hot tech.  And low pay. I could give you the list of superstar CSOM grads but that would be unnecessary.<br>Congrats on all the great options  Best of luck at UNC and enjoy the great hoops too!<br><br>", "<b>Username: Vincent1997</b><br><br>@privatebanker “Sorry” No need to apologize. I don’t feel targeted. I simple found people saying those things and hoped to get different opinions. Personally, Boston College is probably where I’d like to go the most. As far as social life, location etc… goes. I just don’t know whose opinion to believe. I am just trying to weigh the pros and cons. Any by the way my profile picture is only UNC, because I got rejected from UVA  <br><br>", "<b>Username: simonlee7</b><br><br>Did you get into all 3?<br><br>", "<b>Username: Vincent1997</b><br><br>@simonlee7 I got into UNC. USC should be almost guaranteed. I have not heard from BC, but I think I have a good shot.<br><br>", "<b>Username: CADREAMIN</b><br><br>@Vincent1997 I think you are still waiting to hear from USC? Is that correct? Did you apply to Marshall? Are the other schools transfer decision’s out yet - have you been accepted into them and need to make a decision on one or the other right away? Point is I think the answer for now is BC or UNC - choose between them, then make it a choice between USC and that winner when the time comes. Comparing two at a time is easier so things don’t get jumbled in your head.<br><br>", "<b>Username: Vincent1997</b><br><br>@CADREAMIN I got an SGR from USC/Marshall, but I have a 4.0 and will have a 4.0 again this semester. Only reason for the SGR was my calc class. I already paid a deposit for UNC, but I don’t really care about losing it.<br><br>", "<b>Username: CADREAMIN</b><br><br>East/west coast preference when you are done with school?<br><br>", "<b>Username: privatebanker</b><br><br>I would go to UNC as easily as UVA.  <br>Here’s a few  BC grads of note in recent times<br>Too many to name. But I here’s a few<br>Kevin Alloca 06. Head of YouTube culture and Trends, Google<br>Stephen Barry Managing Director Goldman Sachs<br>Nick Burns Undersecretary of State<br>Marty Walsh. mayor of Boston<br>Amy Poehler. Saturday night live<br>Chris  O’Donnell  Hollywood movie star<br>Ed Markey current. US Senator<br>Dr Peter Dervan Prof Cal Tech. Winner of the national medal of science<br>Peter Lynch vice chairman Fidelity Investments<br>Considered one of the greatest money managers in history<br>Carolyn Dever Provost. Dartmouth College<br>Jennie Chin Hansen president AARP<br>John Kerry   Secretary of State<br>Julianne Marveaux. President of Bennett College<br>Dr Ernest moniz. Secretary of Energy<br>Diane Morrison. President and ceo Campbell Soup<br>Like russert. nbc news son of former host of face the nation<br>Phil Schiller SVP of global marketing at Apple<br>Matt Ryan Luke keikley. Current nfl stars Doug Flutie of course and a bunch women Olympians<br><br>", "<b>Username: privatebanker</b><br><br>I hope you get into both USC and Bc.  If you go to usc you can watch out for my daughter for me. <br><br>", "<b>Username: Vincent1997</b><br><br>@privatebanker I appreciate all the information! I’ll let you know, if I go to USC haha<br>P.S. What does she think of social life there? I am sure there is lots to do, but is she ever able to “relax” and get personal space? I’ve seen the campus a few times and it’s beautiful, but it’s also very busy.<br><br>", "<b>Username: privatebanker</b><br><br>Sorry Vincent I don’t know. She’s a Fall Freshman. But all of the schools you like are world class in every way including facilities. BC facilities keep getting better. Except some forced triples for freshman. The new rec center opening this fall and the new science center for 2019 are awesome. Unc was the same. When went I was more impressed with their campus than duke and that’s rarefied air.<br><br>", "<b>Username: CADREAMIN</b><br><br>@vincent1997 there are a lot of lovely tucked away areas on the USC campus to get personal space. Of course the Ronald Tutor Center at lunch seems like Times Square in NYC, but once you get off the main paths, you would be surprised by all the lovely fountains and garden areas. I have been there close to 50 times and keep finding new corners of that campus. And the facilities themselves all have wonderful hideaways. The new Marshall//Business building Fertitta Hall is fantastic. The new Village is crazy impressive, so if you get into USC, don’t worry about finding your space there. You have wonderful choices ahead of you. My D didn’t choose UNC CH because with 80% NC students, she feared it would lack the diversity she is use to being in California. Just one perspective of many you can consider.<br><br>", "<b>Username: Vincent1997</b><br><br>@CADREAMIN I do like USC and it would ideal as far as transfer credit goes, because I am from OCC. I am just worried, because I want to work on the east coast and Marshall only sends about 10% of students there.<br><br>", "<b>Username: privatebanker</b><br><br>That’s hundreds of students. Why not you?<br><br>", "<b>Username: Vincent1997</b><br><br>@privatebanker I am not sure, if people simply choose to stay on the west coast, or if it’s hard to get job offers from the east. I think UNC and BC have lots of recruiting events by firms like GS, while USC doesn’t (at least for IB).<br><br>", "<b>Username: JenniferClint</b><br><br>I’d pick between USC and UNC (leaning towards USC).<br><br>", "<b>Username: privatebanker</b><br><br>I don’t now much about that part of USC.<br><br>", "<b>Username: Vincent1997</b><br><br>@JenniferClint Do you mind giving a little bit of insight?<br><br>", "<b>Username: JenniferClint</b><br><br>I think USC is a school on the rise because of how much philanthropic money it is attracting. UNC is a very solid university with a lot of great history.<br><br>", "<b>Username: Nomorelurker</b><br><br>@Vincent1997 ,S loved both UNC and USC but did not end up applying to UNC for the reason you mentioned (no guarantee of admit to the business school) plus OOS costs would be higher than merit from a private university like USC. He ended up getting merit at USC but chose another school in the end. Part of the reason was that he realized he did not want to commit to living in Southern California after graduation. Also, it was not the strongest fit after he spent a night there during interview weekend. Other schools did a better job with overnight visits. The University Village is impressive on the outside but less conducive to meeting lots of people as compared with a regular dorm, based on the suite arrangements. It’s not that you can’t meet people if you room at the Village. It’s just a little less easy as a dorm such as Birnkrant.<br>Costs are also very high (from rent to insurance to gas to you name it) in Los Angeles.That would be true of Boston as well. I think you are smart to consider what your ultimate goal is in terms of living and working after four years. Not everyone knows the answer but in your case, you seem to be pretty certain about working on the East Coast. Marshall Business school is strongest in L.A. and Asia. Many on CC are rah rah about the Trojan alumni network but I don’t think it rings true nearly like in Southern Cal. I would go with your instincts and choose either UNC or BC. If you are like my S, you’ll lean towards the school that is offering you a sure admit into the major you would like to study and where you click with the student body. You can take a chance on UNC and getting into the B school. If you don’t get into the business school, you could probably major in econ or something else. Raleigh would have the second best weather of the choices  but BC offers you the direct admit to the business school in the part of the country that you would like to ultimately work.<br><br>", "<b>Username: rickle1</b><br><br>BC actually does pretty well in Wall St recruiting. I’d call them a semi target. They also do well in the mutual fund business and finance in general. Boston is a major finance center and all of the major IB firms have local offices as well as recruit to NYC. Go on Linkedin and look at the alumni. Also go on Wall St Oasis and search for BC. I think it’s recruited as heavily if not more than UNC.<br>Both great schools in great places.<br>Where do you want to live? East coast has many different flavors.<br><br>", "<b>Username: moooop</b><br><br>I have a kid getting a business degree this week, & I have become very aware of how huge it is to go to college near where you want to work. Internships, interviews, networking, professors’ influence, knowledge of the job market…EVERYTHING is easier if it isn’t far away.  So going to USC when you know you want to end up on the opposite coast seems really silly.  Especially considering you might have 2 comparable alternatives.<br><br>", "<b>Username: Vincent1997</b><br><br>@Nomorelurker Thanks so much for that response! This is truly helpful. I am sure that lots of other students will read this thread and appreciate such information as well. I live in OC, so I am quite knowledgeable of the living expenses haha I’d think that Boston is slightly cheaper thou? Yes, you are right, I am definitely happier knowing, that I am guaranteed to attend the Business school.<br><br>", "<b>Username: Vincent1997</b><br><br>@rickle1 I think I would want to live near Virginia/Maryland. If the job offers are good enough, then also NY.<br><br>", "<b>Username: rickle1</b><br><br>UNC will place well in the DC area as well as Research Triangle and NYC. Looks like a good choice.<br><br>", "<b>Username: simonlee7</b><br><br>The BC business program has definitely gotten a lot more prestigious in the past decade with a lot of students who graduated there that I know who’ve gotten offers at Morgan Stanley, Goldman Sachs, etc. and a decent amount of exposure in NYC. It was also ranked #2 or 3 by Bloomsburg for best undergraduate business programs. It also has some really passionate fans and a great party scene. The only problem for me personally is that it’s not closer to downtown Boston like other schools. I would not count out BC if you get in, but that is just my opinion. A well rounded education like BC is definitely something I’d admire.<br><br>", "<b>Username: CADREAMIN</b><br><br>I also like the thought of BC since he wants east coast. Boston is such a great city.<br><br>", "<b>Username: t12inc</b><br><br>@Vincent1997 Im a bit confused where you are hearing that the Carroll School is less prestigious than UNC, especially in Business and even more especially in Finance (their strongest and most prestigious program by far). I’ve definitely seen a number of BC grads working in good groups in IB (among other things) on Wall Street, but much less so from UNC.<br>I would say that BC is a highly targeted recruiting school for BofA, Citi, UBS, DB, and Barclays, and a moderately targeted recruiting school for GS, JPM, and MS. Im not sure about Credit Suisse. BC also seems to get good coverage from the quality middle market and boutique firms, though the elite boutiques like to recruit from the top business ivys and Stanford.<br>Also, you should know that pay is standard in most banking jobs (but especially in investment banking) regardless of school. My undergrad was at a non HYPS target and I was offered essentially the same deal as all the other analysts regardless of whether they came out of Harvard and Penn or UMass. I wonder if some of the reason you are hearing bias towards UNC is that they have almost 2x the undergrads coming out and probably are more vocal in BC vs UNC threads.<br>That said, my friend who went to BC has often mentioned that if he had not liked the Carroll school he probably would have transferred… take that as you will.<br><br>", "<b>Username: Vincent1997</b><br><br>@t12inc Yes, you might be right about UNC having a bigger following. I just googled stuff like “BC vs. UNC Business” and the comments were almost always either “they are equal,” or “UNC is better.” Anyhow, I’ve decided to probably attend BC, if I get in; however, I want to see my transfer credit first … and then there is the issue that it’s about $20,000 more a year, but considering that UNC doesn’t offer guaranteed admission to business, I believe that it’s worth the expense. After all, I do get some Private school benefits as well.<br>By the way, do you know anything about USC and banking?<br><br>", "<b>Username: prezbucky</b><br><br>I think these schools are close enough in overall undergrad quality that you should decide based on fit and cost – not at all on rep (and they’re fairly close there too) – and BC seems like the best fit for you. If there is not a large cost difference negatively affecting the attractiveness of BC, I would put it at the top – again, considering your wish to work in Banking/Finance on the East Coast.<br><br>", "<b>Username: Vincent1997</b><br><br>One last question. Between the three, if location didn’t matter, which one would you say is the best? One of my ideas was to work for the government for two-three years, then get my MBA and then move on to IB. Is it advisable to not go into IB right away? I think if I do it this way, then my bachelor location wouldn’t matter.<br><br>", "<b>Username: Vincent1997</b><br><br>bump<br><br>", "<b>Username: privatebanker</b><br><br>The most important point of getting into a top rated  mba program is your undergraduate record and mcats. Go where you think you will be happiest and most engaged.<br>And top schools seem to like some work experience like HBS.<br>But no reason you can’t go direct from UG. No school will guarantee  you an IB career. Not Harvard not Princeton. It’s more competitive than this college search.<br>And you can find alums from every great school in IB.<br>And quite frankly I would suggest thinking a bit wider. Most people identify elite finance careers with IB. The real money is made in private equity. And hedge. PE really loves the high profile mbas. Some come out of banks and analyst roles but in my experience they are groomed as PE associates out of top  b schools.<br>They are the ones all the bankers are courting. IB coordinates the deals. PE own the deals.<br><br>", "<b>Username: rickle1</b><br><br>^^^Vast majority of the time it’s IB after YG for two yrs (analyst program), then top 15 MBA program, then PE / Hedge Fund. That’s the normal track for those looking to get in to PE or HF.  A great resource that provides tons of info on this and related topics (including consulting, corp finance, etc. is Wall Street Oasis at Wallstoasis.com.<br><br>", "<b>Username: Collegehelp4us</b><br><br>UNC returned our deposit last year when my so changed his mind. Bc has a stellar business school. If you pick UNC you have to be able to live with not getting into the business school. I don’t remembwr  the percentages. That being said plenty of people with liberal arts degrees work in banking. Good luck<br><br>", "<b>Username: Vincent1997</b><br><br>@privatebanker I am of course looking at stuff other than IB, but I think for the sake of asking questions on CC it’s the best “target.” So to be more specific, when I meant government job, I was talking about intelligence. It’s something that I might want to stick to, or at least use as a step in my career. I am not sure how intelligence jobs are regarded by MBA programs and Wallst, but I’d imagine that it’s quite interesting.<br><br>", "<b>Username: privatebanker</b><br><br>@Vincent1997   Those are great ideas. The govt post sound fun and interesting. No money but good connections for sure. Defense and national security industry in va and dc is a huge business when you go back to private industry<br>Also finance too.  There is a history of FBI agents coming though Bc over the years. The Irish Boston connection. I don’t know about know.<br>Did you hear back from Bc yet.  I just heard unc is growing it’s business school by 50 percent and there will be a 2000 ipchargr each year for the privilege of of those majors.  Not sure bigger is better but they will be putting money into it you would think.<br><br>", "<b>Username: Vincent1997</b><br><br>@privatebanker thanks for the response! I have not heard from BC, but I might hear on Thursday. Unfortunately, I think that the UNC business expansion won’t help me. I believe their current class size is very small. At least if you compare it to schools like bc and usc.<br><br>", "<b>Username: privatebanker</b><br><br>Good luck. Let me know or dm me when you decide.<br><br>"]}