{"title": "washu vs bowdoin", "comments": ["<b>Username: reindeercoffee</b><br><br>Hi all, I was admitted to both schools (among others such as UCLA, Wesleyan, BC, YaleNUS) and they’re my top picks right now. I’m having a really hard time deciding because I’m not sure how I’ll fit in at both schools.<br>I’m an international student and I want to study political science/philosophy (something in the humanities). I’m quiet in a bigger crowd but really can’t stop talking when I’m with my friends. I chose to apply to WashU as the academics are stellar and the vibe seems to be super friendly (really important to me because as a transitioning international student I don’t want to be homesick). What I’m looking for in a school is a tight knit community where everyone’s really friendly to each other, and a place where people have passions and are genuinely interested in intellectual conversations, etc.<br>One thing is I’m afraid Bowdoin would be ‘too small’ and a bit rural.<br>I was leaning quite a bit towards Washu, However, I joined one of the WashU Girls group chats and the entire chat history was filled with the girls talking about dabs, juuls, vaping, weed, etc. I have nothing against drugs and stuff but I don’t want to go to a school where that’s the biggest ‘thing’ if you know what i mean? And I’m not sure how huge greek life seems to be on campus… A lot of people in the facebook groups are planning to rush.<br>I guess I’m looking for personal experiences/insights into how my situation would determine a leaning towards a certain school.<br><br>", "<b>Username: Hamurtle</b><br><br>WashU has the higher rated PoliSci program, but it comes down to the following:<br>(1) Educational quality<br>(2) Financial affordability<br>(3) Overall fit<br>I would ignore the GroupMes.  My son is in a bunch of them and barely checks them at all.  And my advice is to not check/post at all.<br>There isn’t a big drug culture at all on campus.  St. Louis is definitely not Berkeley-we never noticed anything of the sort during our visits.<br>As for Greek life, it’s not that pervasive.  You are under no pressure to join.<br>WashU is a collaborative environment.  My son isn’t a PoliSci major (actually Biology/History) and is in multiple study groups.<br><br>", "<b>Username: Chipotbae</b><br><br>I wouldn’t worry at all, that’s definitely not the prevailing culture at WashU. I’m also a part of those exact same chats and groups, and if you look at the roommate spreadsheet (which is still a fraction of the incoming students) you’ll see a lot more variety in partying preference.<br>Wherever you go people will be into different things, but WashU actually has a great student culture where you’re not pressured or expected to do things you don’t want to do. I and the girls I’ve talked with so far are more into pizza and movies (but to each her own, of course). And no matter how much people want to party, we’re all going to get our butts kicked by hard (but engaging and cool!) classes and have to study a lot.<br>Like @Hamurtle said, WashU is super collaborative, and GroupMes don’t provide the whole picture  Best of luck with your decisions!<br><br>", "<b>Username: reindeercoffee</b><br><br>@Hamurtle the price of both schools are the same to me. I’m struggling to evaluate fit though. What are some good ways to do that? I’ve looked online at the classes, talked to some students… But it’s still a struggle to see how I fit in there in the mix. I can’t attend admitted student days either since I live overseas and it’s exam season.<br><br>", "<b>Username: Hamurtle</b><br><br>@reindeercoffee what country do you currently live in?  Maine and Missouri are definitely different.<br><br>", "<b>Username: reindeercoffee</b><br><br>@Hamurtle I live in a big city in China. Yeah I keep thinking of Brunswick, Maine as a rural-y seaside town and St Louis as a quiet sweet suburban kind of place.<br><br>", "<b>Username: doschicos</b><br><br>St. Louis isn’t suburban IMO although it won’t compare to a large Chinese city.<br>Brunswick ME is a small town but it has a lot of amenities and Portland ME is a cool city not far away. Boston isn’t too far either, really.<br>If like nature - mountains, ocean - I would definitely favor Bowdoin.<br><br>", "<b>Username: Hamurtle</b><br><br>And on the flip side St. Louis is fairly close enough to Chicago.<br>Big city in China could mean a lot of things.  Beijing and Shanghai are way different.  My wife’s home city in China is has a population of 6 million but it’s not that cosmopolitan in comparison to Beijing/Shanghai (it’s a Northeastern rust belt dump of a city).<br>If the OP is used to ‘big city life’ so to speak, Maine is going to be a major cultural shock.  Even St. Louis is way more different than most American cities.  It’s not as rushed as San Francisco/Los Angeles/New York.<br>WashU has an active Chinese students association.  Also if you’re not used to Western food, there are better options to get Asian groceries in St. Louis than heading to a Chinese grocery in Boston every other weekend.<br><br>", "<b>Username: reindeercoffee</b><br><br>@Hamurtle nah I’m cool with western food haha  Well I live in HK which is kind of like New York. I’m not sure if it’s the more physical aspect of culture shock (location, food, etc) that’s freaking me out or the fear that I won’t vibe well with the people there.<br><br>", "<b>Username: doschicos</b><br><br>“And on the flip side St. Louis is fairly close enough to Chicago.”<br>I’m not sure I’d consider 4.5 hrs driving close. That would be like saying Bowdoin is close to NYC. <br>You can get Asian groceries in Maine. Portland is an excellent food city.<br><br>", "<b>Username: Kiriel</b><br><br>I’m a current student at washu and I’d characterize the people here as very laid-back and intelligent. I’ve never had issues getting along with people here, but if you have any specific questions feel free to ask.<br><br>", "<b>Username: Parche</b><br><br>Agree with Kiriel. Our student thinks folks from St. Louis are among the nicest you will find. And that drive from Bowdoin to Boston can take an eternity – especially on weekends. The food scene in St. Louis is outstanding – and you don’t have to get in a car to enjoy it!.<br><br>", "<b>Username: doschicos</b><br><br>\"And that drive from Bowdoin to Boston can take an eternity – especially on weekends. \"<br>I would imagine most students would use Amtrak although there are busses.<br><br>", "<b>Username: reindeercoffee</b><br><br>@Kiriel do you feel like people there are quite tight knit? I feel like I’m someone who thrives when I have really deep and meaningful connections with my friends and peers.<br><br>", "<b>Username: Kiriel</b><br><br>@reindeercoffee  I would say so. It’s not like a big state school where people bond over large sports events or whatnot but I’m quite close to my friends that I have made in clubs and I see the same across others involved in greek life and other student organizations. The people here are all incredibly friendly so I don’t think most people have any problems making meaningful connections with their peers.<br><br>", "<b>Username: reindeercoffee</b><br><br>@Kiriel I hear a lot about how great washu is for premeds (and I don’t doubt it!), but what would you say about the humanities courses at washu? (namely polisci and philosophy). Are they “good enough” or would it be comparable to a humanities oriented LAC?<br><br>", "<b>Username: Kiriel</b><br><br>@reindeercoffee Hi, although I’m not too familiar with Washu’s polisci or philosophy programs I will do my best to answer your questions. I would say that Washu artsci does follow a “liberal arts” curriculum meaning that they place a heavy emphasis on well-roundedness being STEM or the humanities. I have a few friends doing polisci and are interning at various congressional offices so if you’re looking to go into politics Washu is a great place for that. If your plan after undergrad is to go into grad school, Washu is also very good as Washu has really great name recognition in academia and I have heard good things about grad school placements from all majors. Feel free to dm me with any further questions. If I can’t answer them, I can try to ask some friends.<br><br>", "<b>Username: college_query</b><br><br>My S graduated from Bowdoin. We used to live in the Midwest and had also toured WashU. Both are wonderful schools and you are fortunate to have such great choices.<br>Bowdoin is small, and was smaller than my S’s high school, but my S loved it there and made great friends he still keeps in contact with and gets together with.<br>The town of Brunswick isn’t what I would call “rural” but is a nice little college town. There is a train station and it’s easy to get to Boston. As far as transportation, the closest airport is Portland. When my S was coming back from breaks, he usually found other Bowdoin students to share a taxi with. Since he graduated, there’s a new Metro Bus that connects Portland to Brunswick.<br>St. Louis is obviously a different kind of place - the metro area is over 2 million. You can take the light rail commuter train from the airport to the campus. The WashU campus is very nice.<br>Both schools rank very highly for campus food.<br>Two of my S’s former roommates are in graduate school at UCLA and Harvard, so if your future plan is graduate school, I think either place would prepare you well.<br>I think the decision comes down to: would you prefer a small town in the northeast, or a larger city in the Midwest?<br><br>", "<b>Username: reindeercoffee</b><br><br>@college_query Wow thanks for the reply! Right now I’m sure that academically I want to go to Bowdoin but socially I’d fit better in WashU (from talking to people in my class and such). But I feel like the social aspect might be hard to judge because maybe I just haven’t interacted enough with kids from my Bowdoin class!<br>One thing that has been on my mind is the ‘hookup culture’ that has been extensively written about in Bowdoin. It’s probably hard to judge as a parent but would you/your son agree that this permeates the social atmosphere? Because if so It seems a lot like my high school right now (nobody in serious relationships, just hookups that become awkward social run ins) and it’s not the environment I want to be in. However, I’m not sure if I’m letting something ‘insignificant’ on the grand scheme of things get in the way of the ‘smart option’. Also, Bowdoin seems to be super sport-oriented and outdoorsy which isn’t something I’d describe myself as. That, and the concern that the international student support won’t be as extensive as at a bigger school.<br><br>", "<b>Username: doschicos</b><br><br>The majority of colleges will have a hookup culture these days. Some participate, some do not. I can promise you people hookup at WUTSL as well.<br><br>", "<b>Username: privatebanker</b><br><br>Bowdoin is very small which has plus factors and negative factors. It is really nice but the school year weather wise  is a short fall and the rest is winter. Maybe a brief touch of spring for the next few weeks. They have a great outdoors club that attracts almost the whole school but it’s winter sports and hiking for the most part.<br><br>", "<b>Username: Publisher</b><br><br>@reindeercoffee : In your case, the safer bet appears to be WashUStL even though both are outstanding options.<br><br>", "<b>Username: reindeercoffee</b><br><br>@doschicos yeah, I understand that. It just seems to be the overwhelmingly prevalent culture at Bowdoin, from what I’ve read many times over in their student newspaper and others who worry about it too on CC<br><br>", "<b>Username: reindeercoffee</b><br><br>@Publisher I think so too, and I think talking to my friends they’ve realized that too. As i’ve mentioned before I already know I prefer Bowdoin academically and WUSTL socially, and it’s really down to which one I value more which I’m unsure of. However a significant barrier right now would be with my parents, who are decidedly on the Bowdoin camp because of the better academics and ‘grad prospects’. I do agree that humanities wise, it has the edge.<br>I had a talk with them tonight (lots of tears involved) and it really comes down to the fact that yeah they understand that social life is a big part of college but “school is school” and the expenses they’re paying for me to study in the states should come with a good ‘return’ if that makes sense.<br><br>", "<b>Username: Publisher</b><br><br>What makes you & your parents think that the academics are better at Bowdoin College ?<br>To the best of my knowledge, this is not accurate. Both are outstanding schools with respect to academics. WashUStL is a much larger school, a university as opposed to a small liberal arts college, which offers a larger variety of courses & social opportunities.<br><br>", "<b>Username: doschicos</b><br><br>Both are fine academic institutions. It’s not like WUSTL is some faceless school with big classes. You’ll get the LAC-like small classes there as well. I think you should base your decision on fit.<br><br>", "<b>Username: privatebanker</b><br><br>I am sad for you. Your parents are making the best decision for you in their minds. It’s becsuse they love you and want all the best for you in life. If they can find an advantage for you the they want you to have it.<br>The problem is that wash u in some circles, especially anyone with New England or NE roots doesn’t know the school very well. Or USNWR moving bowdoin up the most recently has made a surge in interest.<br>It’s more about a top LAC versus a top small university. Wash u is just as good. But a bit different. There are other rankings out there. Find some that project how great wash u is and show them. Also they are top 20 in the most crowded category with heavy weights hypsdg and the ucs etc How would bowdoin rank if rated against that group. Very high but not number 3.<br><br>", "<b>Username: reindeercoffee</b><br><br>@Publisher I mean that for my major polisci (Govt and legal studies) it would be better at Bowdoin. I think that the two are definitely on par with each other academically, but just as how if I was Premed the choice would easily be WashU, Bowdoin has the edge on g&ls<br><br>", "<b>Username: mamaedefamilia</b><br><br>@reindeercoffee  Congratulations on your acceptances - there is no bad choice here.<br>My daughter considered both schools, we toured both, and she liked both for different reasons.  Here are my impressions:<br>Both places have smart, qualified, motivated students and strong faculty so there’s no bad choice on the academics.  Wash U is larger so there are more faculty and more courses available.  I don’t know about the Poli Sci department at Bowdoin but the one at Wash U has an excellent reputation.  Humanities overall are good quality - it’s much more than a pre-med program.<br>Wash U felt somewhat more pre-professional and applied than Bowdoin.  This is a matter of degree, not an absolute.<br>Bowdoin’s student body feels quite preppy and sporty, although Bowdoin also cares about diversity - being an early adopter of test-optional admissions reflects that commitment.<br>Wash U has a LOT of Asian and Asian-American students, which may be a plus for you.<br>Food is fantastic at both (at least by Western standards).<br>Hookup culture - you will find it anywhere.  And you will find students that are more geared towards serious relationships.  And you will find students that have yet to date.  Chances are, if you don’t party, it will be easy to avoid hookup culture.<br>Partying you will find anywhere but also it’s easily avoided.  Both campuses will have outside speakers, concerts, and other events that don’t involve drugs or alcohol.<br>Social media is not representative of student bodies as a whole.<br>Location: Access to Wash U is probably slightly easier.  You’d likely fly in to Chicago and then a domestic flight to STL.  Public transportation (light rail and buses) is very good.  For Bowdoin, you’d probably fly into Boston and then to Portland by train or air (Portland is a smaller airport with fewer flights) and then from Portland take a shuttle or train to campus.  St. Louis is definitely more urban (although Wash U is more suburban, surrounded by upscale residential neighborhoods and a shopping/restaurant/club area called the Delmar Loop which is within walking distance of campus).  There is also a huge and beautiful public park nearby with free zoo, museums, etc.  Given its a large metro area, internship opportunities nearby are likely to be more abundant than at Bowdoin.  Bowdoin is a small, safe, charming town.  If you like outdoor recreation, mountains and coastline are easy to access and the Bowdoin Outing Club is very active.<br>Both campuses have rail service right next door.  From Bowdoin you can take a train to Portland - medium-sized, picturesque, and nearby, or Boston, larger and farther away.  Light rail from Wash U can get you into the city of STL and from there, points farther afield.<br><br>", "<b>Username: Publisher</b><br><br>Bowdoin College is a great liberal arts college. But I am not sure that I agree that Bowdoin is clearly better in your desired area of study—I don’t know. I do know that political science & government is the most popular major at Bowdoin & probably a very strong department, but that doesn’t mean that WashUStl is not strong in those areas.<br>As you know, one school has 1,800 undergraduates & the other has almost 7,000 undergraduates. The larger school should have a wider variety of course offerings.<br>An important factor in favor of Bowdoin College is the 12 school exchange program which allows Bowdoin students to study for a semester or a year at other member schools which includes Dartmouth College, Amherst, Williams Mystic Seaport Program, Wesleyan, Wellesley, Smith, and 5 other schools<br>The other schools are Connecticut College, Mount Holyoke College, Trinity College, Vassar College & Wheaton College…<br><br>", "<b>Username: college_query</b><br><br>I can’t really comment on the hookup culture at Bowdoin, but I assume it’s probably similar at most college campuses. My S started dating someone the summer before his senior year in high school, and they kept up a long-distance relationship all four years of college, and are still together (moved to the same city) post graduation. So he wasn’t dating anyone at Bowdoin during his time there.<br>My S is not outdoorsy at all, and was not an athlete, but he does love cold weather. He had never been in the state of Maine before he did a trip the summer before his senior year of high school, but fell in love with Bowdoin and applied ED.<br>I think both schools are academic peers. My S did a minor in Government & Legal Studies (majored in History and a foreign language) and really enjoyed his time at Bowdoin. He is still on the east coast, finishing his second year of law school, and goes back to Bowdoin for homecoming and graduation.<br><br>", "<b>Username: Hamurtle</b><br><br>History, Philosophy, and Political Science are highly rated at WashU and I would make the call for WashU over Bowdoin.  But it’s OPs decision ultimately.<br>Somebody did mention the transportation factor.  St. Louis is closer to Hong Kong than Boston and Lambert International doesn’t have as many flight cancellations as Logan International.  If a winter snowstorm hits the Northeast, then the traffic situation is a mess.<br>St. Louis gets snow, but it’s more manageable.<br>One more question, what are your future career plans and how does name recognition fit in the future?   I bet very few people in Hong Kong/Asia in general have heard of Bowdoin.  Unless  you’re going to law/graduate school, a Political Acience/Philosophy major isn’t going to open too many doors in Asia.  Not that there is anything inherently wrong with that.<br>I admire someone who’s breaking the Asian STEM stereotype, but unless OP is related to Li Kashing or the Ho family, there isn’t much of a future unless the correct school is selected.  And Asian culture is still unfortunately close minded at times when it comes to education/careers.<br><br>", "<b>Username: doschicos</b><br><br>“unless OP is related to Li Kashing or the Ho family, there isn’t much of a future unless the correct school is selected.”<br>That is more than a tad hyperbolic.<br>Bowdoin is recognized as being one of the top LACs. For people who are prestige and ranking conscience, Bowdoin does quite well in that regard being #3 on USN rankings.<br>Let’s not let boosterism get in the way of solid advice.<br><br>", "<b>Username: Hamurtle</b><br><br>@doschicos not being a booster-just being realistic.  Asians still have an element of practicality.<br>For PoliSci I would even recommend UCLA over WashU and Bowdoin.<br><br>", "<b>Username: Hapworth</b><br><br>@Hamurtle ,<br>I will tread lightly here, as I do not want to stereotype.  For many international students, an American degree is prestigious.  Specifically, I read an article where certain Chinese families (the ones who can afford to do so, of course, which is a tiny sliver of the population) desperately want their children to attend an American college or university.<br>Any American college or university!<br>The OP can speak to whether this is true in HK.  But if you’ve ever wondered why there are so many international students at all sorts of American schools (not just elite ones; right now, there are international students attending–oh, I don’t know–Western Michigan U.), you have your reason.  The desire to study in America, coupled with the prestige conferred by a degree from an American school, attracts many bright students from outside the US.<br><br>", "<b>Username: reindeercoffee</b><br><br>@Hamurtle @doschicos Interestingly, no I am not related to Li kashing’s family but I do know some of his grandchildren well. Nope I’m not loaded btw lol – I’m thinking of doing polisci/philo as I want to get into non-profit work when I graduate. My mother works in civil service so that looks interesting too (perhaps a intl relations focused polisci would be good for that). RE: element of practicality: I would probably consider a double major in economics just to even it out for Hong Kong.<br><br>", "<b>Username: reindeercoffee</b><br><br>@Hapworth I think that what you said certainly resonates with some of the Asian population that chooses to apply to the US, but when you reach the majority sector in the first world, business oriented society of Hong Kong, a prestigious university + a ‘useful degree’ (economics basically) is what you’re after. Personally, at my school and community we mostly apply to the US and UK because culturally and education wise we fit in better in the Western sphere than here locally. But I digress…<br><br>", "<b>Username: prezbucky</b><br><br>Bowdoin and Washington U are both quite prestigious, with very strong academic reputations, and will offer nurturing academic environments. Bowdoin’s classes will generally be smaller, but that is a common advantage of LACs over U’s and no knock on Wash U. Wash U will offer more majors and classes.<br>Would you rather be in a semi-urban/suburban environment, or a small-town/rural environment? The outdoor charms of Maine or the city experience of St. Louis?<br>These student bodies, from what I have read, seem fairly well balanced – maybe a bit more nerdy than jocky, but both have their preppy side too. You can have fun at both, but neither is known as a particularly rabid party school.<br>The biggest differences will be some standard LAC/U differences and their settings/environments.<br><br>", "<b>Username: reindeercoffee</b><br><br>@prezbucky As someone born and raised in a bustling city, I have no idea how to judge which I’d prefer because I haven’t experienced the small town environment. Really wish I had the chance to visit <br>I’m not someone who’s terribly active in night life, and most of my social activities revolve around finding nice places to eat and hang out with my group of friends.<br><br>", "<b>Username: Hamurtle</b><br><br>If nice places to eat is a factor for school choice, I would go with St. Louis.  Underrated food scene and this picky Asian from California was pretty impressed.  And the son was impressed by the Asian food in St. Louis.<br>I’m not shilling for WashU-no skin in the game apart from my son attending.  I’m not like that guy who shills for Stevens and Hoboken on CC…<br><br>", "<b>Username: prezbucky</b><br><br>Wash U is known for its good food and the city of St. Louis offers more than Brunswick does. That said, I would ask in the Bowdoin forum, or simply google “top restaurants in Brunswick, ME” and check out what the town offers.<br>Off the top of my head:<br><br>St. Louis will have better ribs. It is also known for pizza, but good pizza can be found in many environs.<br>Brunswick will have fresh lobster, lobster rolls, seafood in general. I’m not much of a fan of seafood, but I loved the lobster rolls in Maine. It’s like a lighter/flakier, richer version of chicken salad.<br><br><br>", "<b>Username: privatebanker</b><br><br>Brunswick actually has a fairly hip food scene for the location.  Something like 40 restaurants and there was an Asian fusion one as well. Portland has it all too<br><br>", "<b>Username: doschicos</b><br><br>Let’s just say that St. Louis pizza is an acquired taste. I’m not a fan of processed cheese on my pizza.<br>Brunswick has much more than lobster. Good dining scene. Portland is relatively easy to get to and has amazing eats. The food scene in Maine is pretty good. Lots of focus on local, farm raised ingredients and locally owned restaurants. Music scene in Portland is good as well with a couple great venues.<br><br>", "<b>Username: reindeercoffee</b><br><br>BTW I don’t remember if I’ve mentioned but I was named a faculty scholar at Bowdoin. Are the opportunities/doors this could open worth letting go of for a seemingly better social fit?<br><br>", "<b>Username: Twinsdad499</b><br><br>My DD was also named a faculty scholar and will not be interested in the hookup/party culture. She is very bright like you and wants to make good friends, maybe be in the chamber choir and enjoy all that Bowdoin offers. Please know there will be students who will also be seeking alternatives to the hookup culture. She does loves the town of Brunswick though, especially the gelato place. Good luck with your decision! Hope to see you there!<br><br>", "<b>Username: reindeercoffee</b><br><br>@Twinsdad499 I wasn’t able to connect well (or as well) with my Bowdoin peers online, so it’s really refreshing to hear that there’s somewhere out there like myself! I definitely do value meaningful friendships above everything (social-wise), and I’m glad to know that this feeling will be reciprocated.<br>Do you have any info regarding the faculty scholars program besides the stipend? That’s really all I know about it from reading their website and the letter that came with my acceptance.<br><br>", "<b>Username: Twinsdad499</b><br><br>Not much more than it’s a one time grant to be used toward Study Away or internship anytime during her 4 years at Bowdoin.<br><br>", "<b>Username: privatebanker</b><br><br>What was the decision<br><br>", "<b>Username: reindeercoffee</b><br><br>@privatebanker @Twinsdad499 I ended up committing to Bowdoin!! Talked to a lot of people from Bowdoin (realized that I did proportionately more of this with WashU than Bowdoin which made me less certain about the latter in the beginning) and realized that it’s a great fit for me. WashU was hard to let go of too though, don’t get me wrong. I’m still waiting on chicago but at this point I’m not going to hold my breath, and am very happy with my choice  thanks all for the help!<br><br>", "<b>Username: privatebanker</b><br><br>Awesome!!’<br><br>"]}