{"title": "please help me before may 1st brown vs berkeley vs duke oos", "comments": ["<b>Username: Burrito12</b><br><br>Hi everybody!<br>I was fortunate to be accepted to many great colleges, largely because of the CC community’s help, and I’ve narrowed my choices to Brown vs. Berkeley (OOS) vs. Duke. After taking numerous coding classes in high school and doing many hackathons, I’ve figured out that I’d love to pursue CS and dabble in entrepreneurship and finance.<br>I’d hope to eventually work in either Silicon Valley, Boston, or NYC in the future. To sum my major preferences, the internship scene/alumni connections to Silicon Valley/Wall Street is most vital, but I also want an energetic, collaborative environment where people love solving real-world problems.<br>For a more detailed list of pros vs cons:<br>BROWN:<br>-Pros:<br>— Open curriculum (I’m interested in CS, finance, applied math, so it’d be easy to tie together in the open curriculum and become a well-rounded curriculum) (most important)<br>— Very collaborative/tight-knit CS community  (very important)<br>— Close to home (I live in MA)<br>— Large focus on undergrads, giving access to research, clubs, etc<br>-Cons:<br>— Not too well-represented or respected on Silicon Valley or Wall Street compared to Berkeley and Duke respectively (most important)<br>— Facilities/dorms/living spaces/campus seems run down<br>— Endowment is the smallest, which is visible in facilities and career center lack of staff<br>— Food isn’t that good<br>— Atmosphere is kinda too laid-back<br>DUKE:<br>-Pros:<br>— Great Opportunities for all my interests (majors in CS and math, along with markets and management certificate) (most important)<br>— Beautiful Campus with a large endowment<br>— Just lots of opportunities in general (Duke Engage, Duke Focus, etc)<br>— Career services tends to be really strong in recruiting/finance (very important)<br>— Great school spirit/ amazing alumni network<br>-Cons:<br>— In my opinion, the weakest CS program of the three and not so-strong recruiting to Silicon Valley (most important)<br>— Some people were too fratty and just made me feel a bit uncomfortable (though most people were very kind)<br>— Administration tends to be more secretive/not answer questions directly (they usually darted my “hard” questions)<br>— Many programs like Duke Engage were application based<br>— Atmosphere is kinda too laid-back<br>BERKELEY:<br>-Pros:<br>— The best CS program by far and strongest connections to Silicon Valley (most important)<br>— The best applied math program<br>— Beautiful campus<br>— Lots of opportunities to work with the brightest (very important)<br>— Very straightforward professors who answered my questions very honestly<br>— Very energetic campus with people bubbling to make a difference in the world with CS<br>-Cons:<br>— Class sizes are too large and student-teacher ratios are even bigger, so I fear being lost or getting the help I need (most important)<br>— Dorms are tiny<br>— Stressful atmosphere/competitive to get research/join top clubs (very important)<br>— Administration is tough to deal with<br>— Relatively large, but weak alumni network (very important)<br>— Difficult to stand out when applying for internships/jobs (very important)<br>Ultimately, one major question that’s in my head is whether I want to choose a small, private university that is mediocre at CS but offers many accessible opportunities or a large, research university that is the best at CS and has the most opportunities, but whose opportunities are hardest to get.<br>Also, money isn’t an issue, as all the schools cost around the same.<br>Thanks so much!<br><br>", "<b>Username: JenniferClint</b><br><br>I don’t know a lot about Brown and Berkeley but I’ll do my best to address some of the points you made about Duke.<br>1). Duke is a making a big push to encourage entrepreneurship (a lot of schools are doing this but most schools don’t have Duke’s resources).<br>https://entrepreneurship.duke.edu/education/duke-in-silicon-valley/<br>https://entrepreneurship.duke.edu/melissaanddoug/<br>https://today.duke.edu/2012/05/rubenstein-gift<br>2). Brown and Duke are both ranked 25th for computer science by US News. Duke is ranked higher for CS by QS. Individual rankings don’t mean much but it’s clear that one program is not significantly better than the other.<br>https://www.usnews.com/best-graduate-schools/top-science-schools/computer-science-rankings/page+2<br>https://www.topuniversities.com/university-rankings/university-subject-rankings/2018/computer-science-information-systems<br>3). Duke is definitely not “too laid back”. You can make the experience as challenging as you want it to be. Also, taking the coursework at any of these universities for granted is a recipe for disaster.<br><br>", "<b>Username: ucbalumnus</b><br><br>For Berkeley, are you in EECS or L&S? If L&S, you need a 3.3 GPA in the three prerequisite CS courses to declare the L&S CS major.<br><br>", "<b>Username: Burrito12</b><br><br>I’m in L&S, but I’ve done lots of programming in high school, so I’m fairly confident that I can get a 3.3<br><br>", "<b>Username: momofsenior1</b><br><br>Where do you think you’ll have the best opportunity to shine and explore your interests?   Do you have a preference of which cost you like better?   Where you want to live after graduation?      You have some wonderful options on the table.  You wont go wrong anywhere!  Congrats!<br><br>", "<b>Username: gardenstategal</b><br><br>It sounds like you’d feel most comfortable at Berkeley.   I wonder if you know that in your gut and have come up with the issues at the other schools to essentially back up what you’re feeling.<br>Fwiw, the social vibes at Duke and Brown are really really different.  Both are social,  if that’s what you mean by laid-back, but not in a way that would necessarily appeal to the same person.<br>All amazing schools, so I would pick based on where you think you would be happiest.<br><br>", "<b>Username: ciervo</b><br><br>I think you are mistaken about Brown’s reputation for CS in the tech world, it’s quite strong. Also, I wouldn’t go by those rankings–they do not evaluate the caliber of the teaching and support at the UG level, which Brown CS excels at.<br><br>", "<b>Username: Burrito12</b><br><br>@ciervo I know Brown’s reputation is strong, and UG CS is amazing. I’m just talking about its reputation relative to Berkeley.<br><br>", "<b>Username: Burrito12</b><br><br>@momofsenior1 They all cost relatively the same (Berkeley might be cheaper if I graduate in three years). I think Brown and Duke might let me explore my interests more, as they’re private schools. I think I’d ideally like to work in San Francisco, though maybe Boston or NYC if I take more of a tech-banking route.<br><br>", "<b>Username: preppedparent</b><br><br>Berkeley has everything you need to explore. And the CS dept is the best in the world. That said, it is a large University and CS is a competitive major. I think you can’t go wrong with Brown. It’s an ivy, its smaller than Berkeley. Between the 2 I’d choose Brown. Duke I just don’t see its appeal. Do you want to live in the South?<br><br>", "<b>Username: Burrito12</b><br><br>@preppedparent I don’t want to live in the South in the long-run, though I’d be fine with staying there for four years during my college experience. Duke’s main appeal is its heavy focus on finance, along with its many more opportunities than Brown. Its campus is also beautiful.<br><br>", "<b>Username: manyloyalties</b><br><br>Anyone who says Duke is “weak” in computer science or does not place well in Silicon Valley is wrong.  If you want to go to Duke, you should go and not think for a moment that its CS department is not strong enough.  Aside from having specific programs in Silicon Valley, recent articles make clear that Duke does very well on a per capita basis and is well regarded in SV.  Brown also is highly regarded and places well.  So, as with many threads, commentators are drawing absurdly fine distinctions between outstanding departments when, in the long run, there are no meaningful distinctions and fit is the best reason to choose.  Duke in particular, if it matters, is growing key AI and machine learning research areas in conjunction with Stanford and MIT and combining that with its best in the world statistics department.  Does that mean it is better than Brown’s great CS program, no, just that both are going to meet even a super high performing undergradute’s intellectual needs and professional goals.<br><br>", "<b>Username: momofsenior1</b><br><br>OP - I meant coast, not cost.  Sorry!         You have a hard decision to make but again, you will be successful at any of these schools.     Maybe start giving a numeric value to your pros/cons list?     For example, on a scale of 1 - 10, how important is class size?   Do that for each item you listed and then total them up and see what school ends up with the most “points”.<br><br>", "<b>Username: JenniferClint</b><br><br>This “do you really want to live in the south” thing is often used as a scare tactic by people who can’t make a credible case for why a student should attend their preferred school over Duke. Durham is a beautiful, vibrant city and the triangle is filled with great opportunities. In fact, the area is one of the finalists for Amazon’s new HQ.<br>What is Duke’s appeal? It is a very well rounded university with excellent graduate school/professional placement and a loyal alumni network. I don’t see what Brown gives you. Berkeley is clearly better for CS. Duke is clearly better for finance.<br><br>", "<b>Username: privatebanker</b><br><br>Berkeley if I had to choose<br><br>", "<b>Username: melvin123</b><br><br>This is really such a matter of fit.<br>I went to Duke, D will be going to Brown, and we both loved Berkeley when we visited for a 2 day program.  Although Duke is located in the South, most of the kids come from the Northeast/Mid-Atlantic, California and Florida.  Duke does not feel like a Southern school and even though it’s not located in a major city, there is constantly a lot going on with incredible speakers from all over the world and all sorts of research opportunities.  After taking the college tour, my D’s comment was “mom, there is so much going on there, it feels like they are throwing opportunities at you.”  FWIW, Melinda Gates went to Duke and has donated a lot of money there.  Duke is constantly is reaching out to its Alumni to create internships and all sorts of learning opportunities for its students.  Brown does as well: as a parent of a committed student I was already sent  information requests about whether there was anything I could contribute career-wise, and I know an alum who mentors kids in her industry.   Both Brown and Duke are well represented in Silicon Valley.<br>I think of the social life at Brown and Berkeley being similar.  Both are very collaborative places and the kids are very liberal and accepting.   Duke has more social striation and Greek life can be important.  Berkeley ultimately came off our list because we were concerned about the huge class sizes and ability to get the classes you want.  I also felt that the advising programs at Brown and Duke were better.  If we were in-state for Berkeley, my D would have gone there, but I just couldn’t see paying the out of state price when I think you get less services than you do at the privates.<br>But these were our impressions. Hopefully others can give you theirs too so you can get a better feel about if there’s a consistent theme.   Good luck, and you really can’t go wrong. Once you choose, don’t look back, only look forward.<br><br>", "<b>Username: BrianBoiler</b><br><br>We are not you and cannot make the choice for you.  Do you want to live on the East Coast or the West Coast?  If the East Cost, north or south?  Do you want to live in an environment that has you near Silicon Valley or not?  The good news is you really can’t go wrong on the education front.  I’d be cautious of CS ranking placement for undergraduate studies.  My son fell into that trap, and found out that at the undergraduate level it is either good school or not good school.  For your choices nobody would argue which category these three fall.  You live in MA, do you want to see your home often during the school year, either you visiting home or home visiting you?  Do you like the NE and could live nowhere else?  Are you open to a new adventure?  Notice, none of my questions have to do with academics, it is all about what makes you you.<br><br>", "<b>Username: bookmama22</b><br><br>I have nothing specific to add about the three schools as although different personalities and locations they are all outstanding schools and programs. The OP did make a reference to graduating in three years. That would not be likely at any of these schools or many other schools. Even if all required courses are completed in three years, many schools require 4 years of attendance and tuition payments. Not all eight semesters are required to be on campus attendance allowing for internships, semester abroad, exchange programs at other schools, etc.<br><br>", "<b>Username: preppedparent</b><br><br>Berkeley can be done in 3 years. Lots of kids do and the university widely accepts AP credit unlike private colleges. they are sensitive to the community college kids who transfer in and others who financially need to get it done in 3 years. My Berkeley student took summer classes and with AP could have been done in 3 years. I told her to take the extra year as she’ll be working the rest of her life.<br><br>", "<b>Username: Burrito12</b><br><br>Graduating in 3 years isn’t a consideration for me, much less a priority.<br><br>", "<b>Username: jym626</b><br><br>All 3 are great schools with pretty campuses (and Providence’s WaterFire is a cool event) but if working is SV is a top priority, then Cal is the clear winner. Take a look at this article. https://qz.com/967985/silicon-valley-companies-like-apple-aapl-hires-the-most-alumni-of-these-10-universities-and-none-of-them-are-in-the-ivy-league/  That said, both my kids work in SV and neither went to a CA school, so, there are plenty of routes to the end goal. Cal is just likely the most direct.<br><br>", "<b>Username: jym626</b><br><br>Here’s another article to read: http://www.businessinsider.com/silicon-valley-hires-uc-berkeley-grads-2017-5<br>and this is now a few years old but is a great visual https://www.wired.com/2014/05/alumni-network-2/<br><br>", "<b>Username: CU123</b><br><br>or SV hires SJSU grads…really if SV is your destination UCB would be best,  if you want the best education then Duke followed by Brown.<br><br>", "<b>Username: Burrito12</b><br><br>Thanks for your responses so far! If anybody has any pro or con to ask, please do so as this thread can hopefully help others in the future too.<br><br>", "<b>Username: Publisher</b><br><br>Did you apply to CMU (Carnegie Mellon University) ?<br><br>", "<b>Username: Publisher</b><br><br>@Burrito12: Just read one of your earlier threads in which you wrote that you were admitted to Georgia Tech & Illinois for CS. If accurate, why are you considering Duke & Brown ?<br><br>", "<b>Username: Burrito12</b><br><br>I’d choose Cal over Georgia Tech and uiuc. So now it’s a matter of whether I want a smaller , more accessible resourceful university such as duke or brown or a larger university with plentiful, though competitive opportunities at Cal.<br><br>", "<b>Username: JenniferClint</b><br><br>OP, it’s one thing to just get an entry level job in the valley. Another good metric of a university’s quality is how well its graduates do at the executive level.<br>Duke can lay claim to Tim Cook (Apple’s CEO), Eddie Cue (Apple’s Sr VP of Internet Software and Services), Jeff Williams (Apple’s COO), Amy Hood (Microsoft’s CFO), Scott Guthrie (Head of Microsoft’s AI and Cloud Computing divisions), Terry Myerson (EVP and former head of Windows at Microsoft), etc.<br>^ I’m sure that Brown and Cal have alums in high places but that list is pretty hard to beat. 3 of Apple’s 11 top executives have Duke degrees as do 3 of Microsoft’s top 16.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> JenniferClint:<br>\"\"<br>Duke can lay claim to Tim Cook (Apple’s CEO), Eddie Cue (Apple’s Sr VP of Internet Software and Services), Jeff Williams (Apple’s COO)<br>\"\"<br><br>However, Cook and Williams are Duke MBA graduates; they did not attend Duke for undergraduate study.<br>Cook:  BS from Auburn, MBA from Duke<br>Williams:  BS from NC State, MBA from Duke<br>Note that their undergraduate schools were in-state publics for them.<br><br>", "<b>Username: JenniferClint</b><br><br>^ I guess that’s a fair point. Still, Cue, Hood, Guthrie, Myerson is pretty impressive (and they’re all in technical positions except for Hood).<br>I know that you can come up with a list of Berkeley alums who’ve done exceedingly well in tech. I’m not trying to say that Duke sends more people to the valley or anything of the sort. Just pointing out that our graduates are often disproportionately well represented in the highest echelons. Not bad for a school that is supposed to have a sub par CS program!<br><br>", "<b>Username: privatebanker</b><br><br>Cook: BS from Auburn, MBA from Duke<br>Williams: BS from NC State, MBA from Duke<br>Which backs many posters who suggest state flagships or slightly less selective schools and save money for the prestigious MBA. That many times is knocked on CC.<br>Thanks for posting this. @ucbalumnus<br><br>", "<b>Username: JenniferClint</b><br><br>@privatebanker That works for tech but Wall Street firms are clearly obsessed with undergraduate prestige. Also, your odds of getting into a top 10 MBA program are significantly higher if you went to Penn, Duke, Dartmouth, etc. as an undergraduate.<br><br>", "<b>Username: privatebanker</b><br><br>@JenniferClint   Ok. I get what you are saying for sure .  However Wall Street is much bigger place than Goldmans IB three year analyst program et al. You are correct for those programs. It’s just such a small number.  when it is the universal default justification for most college decisions I simply feel it is misguided.<br><br>", "<b>Username: JenniferClint</b><br><br>Yes, I can see where you’re coming from too.<br>I think with most things what you do matters much more than where you go but there are some exceptions. Harvard’s neurosurgery residency program probably won’t seriously consider an applicant who didn’t attend a top medical school. Similarly, some VC firms virtually require their employees to have elite undergraduate degrees.<br>It’s probably also easier to excel as an undergraduate at an elite private school. Self-motivated students who are confident in their ability should definitely consider the state school option if it makes financial sense.<br>Finally, the mediocre (3.4-3.7) Penn student has a much better shot of getting to HBS than the mediocre Alabama student.<br><br>", "<b>Username: privatebanker</b><br><br>Well said  and accurate<br><br>", "<b>Username: sbballer</b><br><br>CS… Berkeley is the no-brainer… … the other schools are not even on the map.<br><br>", "<b>Username: theloniusmonk</b><br><br>“CS and dabble in entrepreneurship and finance.”<br>For CS and entrerpreneurship esp technology startups, Berkeley is the best choice, probably by a lot.  It wouldn’t compare as well for wall street but as others have said, wall street and if you wanted a data science job say at a wall street bank, Berkeley would do fine.<br>“I know that you can come up with a list of Berkeley alums who’ve done exceedingly well in tech.”<br>For sure, because there are many of them.  Apple, Intel, Mozilla, Zynga, among tech, also non-tech, Gap and Dean Witter as I found out.<br>Anyway, Berkeley is your clear choice here.<br><br>", "<b>Username: Burrito12</b><br><br>I did like Berkeley; it’s just I’m concerned that I’ll be lost/not have the access to resources I would at Duke or Brown.<br><br>", "<b>Username: privatebanker</b><br><br>Yes you wouldn’t not have access to the most brilliant minds in CS at Brown or Duke.<br><br>", "<b>Username: preppedparent</b><br><br>C clap clap clap A…L…I…California, California yea!!!<br><br>", "<b>Username: Burrito12</b><br><br>@privatebanker Sorry, what I meant to say is that there are so many students at Berkeley and relatively few teachers that I fear not getting the help I need.<br><br>", "<b>Username: CU123</b><br><br>…which is probably true.<br><br>", "<b>Username: CU123</b><br><br>graduate from UCB, Duke, or Brown with a 4.0 and you’ll write your own ticket to SV or anywhere.  Of course graduating with a 4.0 is easier at Brown then Duke then UCB.<br><br>", "<b>Username: warblersrule</b><br><br><br><br><br> Burrito12:<br>\"\"<br>I’d choose Cal over Georgia Tech and uiuc. So now it’s a matter of whether I want a smaller , more accessible resourceful university such as duke or brown or a larger university with plentiful, though competitive opportunities at Cal.<br>\"\"<br><br>It’s something to consider, yes. The UCs are a very sink-or-swim environment, and that holds especially true for the massively popular departments like CS. The courses in the intro CS sequence at Berkeley this year enrolled 1200-1400 undergrads each this spring – that’s 75% of Brown’s entire freshman class in a single lecture hall!* A go-getter willing to go after resources and opportunities aggressively will do well at a large research university, whereas a shrinking violet may not.<br>You said you liked Berkeley. Have you visited Brown and Duke?<br>*For comparison, the intro CS courses at Brown and Duke enrolled 150-180 students this year. Certainly not small, but a great deal smaller than Berkeley. Some would argue that once you get above 60 or so students in a lecture hall, the number of students in a lecture is inconsequential. Not sure I agree, but YMMV. You should compare the size of upper-level courses as well.<br>https://classes.berkeley.edu/<br>https://cab.brown.edu/<br>http://soc.siss.duke.edu/psp/CSSOC01/EMPLOYEE/SA/h/?tab=DEFAULT<br><br>", "<b>Username: JenniferClint</b><br><br>I hate relying on anecdotal evidence but one of my best friends had a very hard time at Berkeley. He was a casualty of the sink or swim environment. In fact, he doesn’t have a single professor that he can approach for a letter of recommendation. He might be an outlier but he was a brilliant student who picked Berkeley over some very good LACs (not WASP) and I can’t help but think that he’d have done better somewhere else. He feels the same way unfortunately.<br><br>", "<b>Username: privatebanker</b><br><br>@Burrito12<br>I know I was joshing a bit. I think you will be fine. Part of college is gaining independence and skills for your adult life. I am sure they have good resources at cal.  The other two are outstanding.  But I do know once you out the school tee shirt on and announce to the world where you are going you will feel great relief and excitement. It is easy to create anxiety around this and it isn’t necessary<br><br>", "<b>Username: rocket88</b><br><br>Getting into the L&S cs major at Berkeley is very competitive. You need more than the minimum 3.3 GPA I believe. Look into this carefully before choosing Berkeley.  Given that you have other good choices, I think this would make Berkeley a no go. Would you be happy waking up in your Junior year having to declare a math (or other) major because you didn’t get into CS?<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> rocket88:<br>\"\"<br>You need more than the minimum 3.3 GPA I believe.<br>\"\"<br><br>It is still 3.3.  https://eecs.berkeley.edu/academics/undergraduate/cs-ba<br>From https://talk.collegeconfidential.com/university-california-berkeley/2071932-grade-distributions-in-prerequisite-courses-for-gpa-based-goals.html :<br>L&S CS requires a 3.3 GPA in CS 61A, 61B, 70. https://www.berkeleytime.com/grades/?course1=2321-all-all&course2=2323-all-all&course3=2327-all-all indicates that the percentage of students earning a B+ or higher is:<br>49% in CS 61A<br>59% in CS 61B<br>47% in CS 70<br><br>", "<b>Username: Burrito12</b><br><br>@rocket88 I think it’s definitely a risk; however, I’ve already taken CS for a full year at a local college.<br>Moreover, out of the data ucbalumnus kindly provided, around half of the UCB students get a B+, which is pretty significant. I’m sure the amount would be higher for students who are actually trying to be CS majors (many of the students in CS61A and CS61B are taking the class just to try CS out).<br>Finally, if I don’t do well in those classes, then maybe CS isn’t for me. I like CS, but it’s not like CS is the only thing I love. I also love applied math, finance, and entrepreneurship, so I can definitely go down one of those avenues (though I really hope I can become a CS major).<br>My concern still lies with the class sizes/attention, but most importantly the competition for clubs, jobs, and research that I won’t have to face as much at Brown or Duke.<br>My thinking is that if I can coast through Brown and Duke and still have a decent experience with a decent job (through alumni network), imagine how far I can get if I bring my go-getter personality and have a bunch of advice at Brown or Duke. If I eliminate Berkeley, the question is still Brown or Duke though.<br>But obviously, Berkeley really prepares me for the real world, both in its “golden standard” CS degree among SV recruiters and the way that my go-getting skills will be utilized and trained. I’ll meet so many top students (at CS) that I might be able to form a startup with or develop deep connections with, though it’ll definitely be harder to make these connections than a school like Brown or Duke.<br>Thank you, everybody, for all your help by the way. Your responses are really informing me, and I appreciate your continued help.<br><br>", "<b>Username: Burrito12</b><br><br>@Publisher I applied to CMU SCS (waitlisted tho, but I have lots of other great choices, so definitely not down about that)<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> Burrito12:<br>\"\"<br>many of the students in CS61A and CS61B are taking the class just to try CS out<br>\"\"<br><br>Those who want to get a more beginner-level overview of CS would normally take CS 10.  Prospective CS majors without computing experience are also suggested to take CS 10 before CS 61A.  CS 61A is probably mostly EECS majors, prospective L&S CS majors, and prospective cognitive science majors, with probably a few from other intended majors who may find CS to be a useful complement.<br><br><br><br> Burrito12:<br>\"\"<br>My concern still lies with the class sizes/attention<br>\"\"<br><br>Online class schedules can help you see how large CS and other class sizes are.<br>UCB had 557 L&S CS and 401 EECS students graduate in 2016-2017.  Upper level EE courses are quite small, indicating that most EECS students emphasize CS.  As a result, CS class sizes can be very large (over 1,000 for CS 61A), even for upper level courses (sometimes over 600).<br>However, while most other schools have smaller CS class sizes than UCB, the class sizes may not necessarily be small in an absolute sense (100-300 for some at Brown and Duke).<br><br>", "<b>Username: ucbalumnus</b><br><br>Note that some of the UCB CS course materials are available on the web:<br>CS 10:  http://cs10.org<br>CS 61A:  https://cs61a.org/<br>CS 61B:  https://datastructur.es/<br>CS 70:  http://www.eecs70.org/<br><br>", "<b>Username: Nocreativity1</b><br><br>If class size is a concern you may want to consider the Focus program at Duke.   You are guaranteed as a freshman two classes that are small (less than 18 students I think). Please don’t hold me to it but check it out.<br><br>", "<b>Username: Burrito12</b><br><br>Yeah, the Focus program is definitely something I’d consider if I went to Duke.<br><br>", "<b>Username: jym626</b><br><br>FYI, This might be of interest, though its a little dated:  http://www.businessinsider.com/schools-with-the-most-alumni-at-google-2015-10<br>https://tech.co/top-feeder-schools-attend-want-job-google-apple-facebook-2015-01<br><br>", "<b>Username: Burrito12</b><br><br>@jym626 Thank you for this! Though I fear it only takes size into account (which would be unfairly skewed towards berkeley), not percentage of undergrads at either school.<br><br>", "<b>Username: jym626</b><br><br>@Burrito12 -<br>Stanford’s UG size is only around 8K and it’s atop the lists. Dont worry about % of undergrad vs  straight #. of employees.<br><br>", "<b>Username: Greymeer</b><br><br>At Duke you’d know your professors and they will know you by name. Duke is not as stressful as your other choices.  Duke wants you happy. Your employment opportunities are better at the other schools because employers want people who have been through the wringer. However you will learn the same stuff at any of these schools.<br>The two schools you’ve chosen are at extremes.<br>Impersonal, stressful, job opportunities, crowded … personal, easy going, less tech known, preppy<br>I have visited both CS departments and know their pedigrees. Duke’s department is a shadow of Berkeley’s.<br>Given these two choices I’d actually go with Duke. Because I don’t like crowds and like smaller class sizes. The job thing can be overcome.<br>The sweet spot here is GaTech. It’s half the size of Cal and twice the size of Duke, with the same CS resources and opportunities as Cal. It’s also cheaper than all of these and has twice the number of CS faculty.<br>University  Size (in faculty)<br>Carnegie Mellon University  131 … CMU claims 140+ in info session<br>Georgia Institute of Technology 93 … GT claims ~130 in info season<br>Massachusetts Institute of Technology   80<br>University of California - Irvine   61<br>University of Maryland - College Park   60<br>University of Michigan  59<br>Northwestern University 59<br>University of California - San Diego    57<br>University of Illinois at Urbana-Champaign  57<br>University of California - Berkeley 54 … no extra claims<br>University of Southern California   54<br>Duke University 52 … professor claimed ~30 in info session<br>Stanford University 52<br><br>", "<b>Username: Burrito12</b><br><br>Georgia tech has a higher student to teacher ratio than Berkeley haha, so I don’t think that solves my problems.<br><br>", "<b>Username: Burrito12</b><br><br>Any other thoughts will by highly appreciated!<br><br>", "<b>Username: Nomorelurker</b><br><br>Brown or Duke. CAL can be cut throat competitive, too large, and it’s not a great area around campus.<br><br>", "<b>Username: Burrito12</b><br><br>@Nomorelurker I definitely agree with your latter two points, but I’ve been given very contradictory information for your first point about Cal, which is currently my biggest deterrent from going to Cal. Some people say Cal, especially Cal CS is very collaborative (which CS is generally), while only pre-med and business are cutthroat. Do you have any experience with this?<br><br>", "<b>Username: ucbalumnus</b><br><br>UCB CS 61A and 61B course home pages do state that they are not graded on a curve, presumably to discourage cutthroatism that may be more likely in curve-graded courses full of pre-med or pre-business students.<br>But you still face some uncertainty with the 3.3 GPA requirement to get into L&S CS.<br><br>", "<b>Username: Nomorelurker</b><br><br>@Burrito12, CS is very competitive to get into at CAL, as you know. It is human nature to retain some of that competitiveness, but you can always find students who want to collaborate.<br><br>", "<b>Username: theloniusmonk</b><br><br>\"The sweet spot here is GaTech. It’s half the size of Cal and twice the size of Duke, with the same CS resources and opportunities as Cal. It’s also cheaper than all of these and has twice the number of CS faculty.<br>University of California - Berkeley 54 … no extra claims\"<br>What’s the source of this.  Berkeley claims 130 professors in EECS which has both EE and CS professors, in addition I just went the to the CS only faculty page and counted at least 80.   Of course they have a number of Turing award winners in addition to other accomplishments.<br>The CS faculty at Berkeley is as distinguished as it gets, only Stanford and MIT are in its class, that’s it.  If you want to tell the OP to select Duke or Brown that’s fine, but do not base it on the faculty.<br><br>", "<b>Username: theloniusmonk</b><br><br>“Some people say Cal, especially Cal CS is very collaborative (which CS is generally), while only pre-med and business are cutthroat. Do you have any experience with this?”<br>This is generally true, I know many kids who are in engineering and/or CS at UCB and  they are more collaborative than competitive.  EECS, the toughest major to gain admission  is direct admit out of HS so the students there are not cut -throat, and you’ll be taking classes with students in EECS.<br><br>", "<b>Username: Burrito12</b><br><br>Any other thoughts would be greatly appreciated!<br><br>", "<b>Username: Burrito12</b><br><br>Bump, sorry just panicking haha.<br><br>", "<b>Username: ciervo</b><br><br>What did you decide?<br><br>", "<b>Username: Burrito12</b><br><br>I decided to go for Brown! Thanks for your help!<br><br>", "<b>Username: ciervo</b><br><br>Congratulations! My daughter loved her four years there, especially the CS department.<br><br>", "<b>Username: Nomorelurker</b><br><br>@Burrito12, You made a great choice.<br><br>", "<b>Username: jym626</b><br><br>enjoy!<br><br>"]}