{"title": "ucb vs imperial college london", "comments": ["<b>Username: stevenz0601</b><br><br>Hello all,<br><br>", "<b>Username: meep1234</b><br><br>Where do you plan to settle after school? This could play a large role in what you do, as do tuition/travel costs.<br><br>I had to make a similar decision between UCL and UCB, but for math, I'd definitely stick with UCB - especially since location is not an issue. It is stronger in that field and has a better international reputation for it.<br><br>", "<b>Username: stevenz0601</b><br><br>I am probably going to do a postgrad in the US if I can in the future, so will going to UCB be better for that?<br><br>Also, which graduate degree is more highly recognized? Imperial does have a higher ranking so I would assume it is more recognized than UCB<br><br>", "<b>Username: meep1234</b><br><br>I would say so - especially for math.<br><br>In all honesty, those overall rankings mean nothing if you ask me - it's more just what the public uses to determine what's more \"prestigious\". Take the top few colleges for instance. Do you honestly think there's a huge overall difference between, say Harvard and Princeton? Certain departments may be stronger in each, but both are equally strong even though one is ranked higher than the other. Just look at the specific department you are interested in, and I believe UCB is better in math and has more of an international reputation in that field (I may be wrong, but from what I've heard...do some research to be sure, or wait for a more knowledgeable poster haha) .<br><br>", "<b>Username: stevenz0601</b><br><br>I understand what you mean; if UCB was 5 ranks lower than Imperial, I wouldn't have cared.<br>But UCB is ranked 21st and Imperial is ranked 6th; but UCB is higher ranked than Imperial in all subject areas, so I do wonder what is causing the difference in the overall ranking.<br><br>", "<b>Username: meakame</b><br><br>Probably proportion of international students. Imperial has far more international diversity than UCB.<br><br>I think you might also want to look at the strengths and focuses (foci?) of each individual math department. I don't have a clue what Berkeley or Imperial specializes in. But maybe you're interested in a certain field of math. Look up the classes available in both schools and compare the elective offerings in your area of interest. Of course, your interests may change, but you can work with the supposition that they won't change <i>too</i> much and go from there. Also look at the faculty and their research, if you're interested in that; are there any in particular whom you'd like to work with?<br><br>If you're applying for grad school in the US, it is a little better to study here as an undergrad in my opinion, because you'll get more exposure to what grad students do. In the UK there's quite a divide between the undergraduate and graduate population as I understand it; in the US, you'll get interaction through discussion sections, which you will eventually have to lead as a grad student in future.<br><br>", "<b>Username: Thomas_</b><br><br>Berkeley. And I don't generally say too many good things about Berkeley (look for my other posts) ;)<br><br>Why is it ranked so low compared to other universities? Have you looked at the ranking methodology? It most likely loses points for being public, which leads to a larger student/teacher ratio, maybe lower average SAT scores, and many other factors. These general rankings have nothing to do with \"how good\" the classes are and are only marginally important with regards to what kind of education you will receive.<br><br>Berkeley Math is easily ranked Top3 in the world in graduate rankings, using a methodology that actually is subject-specific. It beats Imperial hands down. And if you're looking to go to graduate school it's easily among the best in the world. International reputation is also a big one, as mentioned above.<br><br>As an undergraduate Berkeley may not give you a \"private school education\" with small classes, lots of personal help, and huge grade inflation, but it'll give you tons of more opportunities than Imperial would be able to, you just need to be proactive about them.<br><br>", "<b>Username: Thomas_</b><br><br>I didn't know Imperial is public. I don't even know if there's a public/private system in the UK. Even so, being \"public\" in the UK will have much different ramifications than being \"public\" in the US and I don't think that's comparable.<br><br>", "<b>Username: HillsofChino</b><br><br>if it helps at all, I knew of Cal since I was 5 years old, yet I've never heard of Imperial. Cal definitely has the brand power and recognition<br><br>", "<b>Username: meep1234</b><br><br>^Well, it would be the other way around if you lived in the UK.<br><br>", "<b>Username: Thomas_</b><br><br>^ Maybe, but not in many other places around the world. Go Asia and people will know Berkeley, not Imperial. Hell, even I as a non-UK European had never heard of Imperial before coming to this forum.<br><br>", "<b>Username: meep1234</b><br><br>Yeah, wasn't arguing with the recognition thing - just saying how the very first statement could vary. I also posted about Cal's international reputation in the first post btw.<br><br>", "<b>Username: BearFacts</b><br><br>Imperial College London sounds so cool.<br>You should go there.<br>UCB is ranked 21st (by whoever), so don't waste your time anymore.<br><br>", "<b>Username: meep1234</b><br><br>^....can't tell if you're serious or not...<br><br>", "<b>Username: stevenz0601</b><br><br>I've been looking at other ranking tables online... all of them are quite different, I guess I shouldn't make my decision based on them too much.<br><br>Reputation wise I really don't know, personally I have known about UCB before hearing about Imperial college and I am from neither US or UK, but does that mean UCB has a better reputation internationally?<br><br>How are the lectures in UCB anyway; would too many students be a problem? And how is the student life there? I've been to both London and San Francisco; although London's weather is not that great, but the city is quite amazing. (Didn't spend much time in San Francisco though, only 2 days in the city)<br><br>", "<b>Username: meep1234</b><br><br>Well, that doesn't always mean better international rep, but it does in this case ;P<br><br>Lectures are fine (even the 500 people ones). Just sit in the front if it bothers you, so you can't tell it's a huge auditorium and there are hundreds of people behind you.<br><br>Student life is cool too - I have no complaints haha there are tons of threads that have more details (posted in the last few days)...but don't count on going to the city too often haha it's more something people say they're going to do all the time, but never end up doing.<br><br>", "<b>Username: meakame</b><br><br>Actually, guys, Imperial is pretty well known in Asia. And sometimes even more so than Berkeley.<br><br>", "<b>Username: Hyaline</b><br><br>Go to Imperial, trust me ^^. UCB is just too damn big and apparently its filled with liberal extremists :P.<br><br>", "<b>Username: Hyaline</b><br><br>RML I completely disagree with you :S. Berkeley is a giant public university with an enrollment of 25,000 :P. You must be joking when you say UCB is considered more prestigious that Princeton in Asia; having lived in Asia my whole life, I assure you that the situation is the opposite of how you describe it.<br><br>Imperial is more prestigious than Berkeley, hands down and its far more difficult to gain admission to Imperial. And LSE is a lot more prestigious than Berkeley too ^^.<br><br>", "<b>Username: texaspg</b><br><br>OP - Are you in US or another country? Have you considered the costs?<br><br>If you are in another country and you are paying full fare for education, Imperial might be cheaper. You can graduate with a masters in 4 years.<br><br>The studies are different in UK vs US. You will be required to take a lot of coursework outside of your major while UK system forces you to concentrate on your major and nothing else with only year end exams deciding most of your grade.<br><br>It is important to think beyond a rank in some book. Think about the way the school system works in each location, what it will cost you, and whether you are considering a Ph.D. in future.<br><br>", "<b>Username: Hyaline</b><br><br>@RML, first of all, your'e generalizing Asia; maybe where you come from they know Cal better than Princeton but take my word for it, everywhere else, Princeton is better known that UCB.<br><br>Secondly from what I've seen of Asia, people know of Imperial better than they know of Berkeley.<br><br>Lets keep Princeton out of this because as far as I'm concerned you can't even compare a place like Princeton to a place like Berkeley; look at Princeton's the acceptance rates, average SAT scores and Alumni, then get back to me. Also, law school and business school usually only apply to post grad education, except perhaps in the case of Hass at Berkeley; so I don't see how Princeton could possibly suffer in the eyes of \"Asians\" if its competitors i.e. Harvard (which I daresay IS viewed highly by Asians in general), Yale, Stanford etc etc also don't have their own business school at an undergraduate level.<br><br>", "<b>Username: stevenz0601</b><br><br>@texaspg I am from neither the UK nor US, so the costs will be similar. I have heard about the fact that you can graduate with a masters in 4 years at Imperial, which I do like, but after that will it be hard to go to the US for my doctorate, or any other countries to find employment?<br><br>I am probably doing my masters in a different area compared to my undergraduate degree, will that be possible in Imperial? And if I am thinking about doing a doctorate, would Imperial prepare me better for that because of the school system?<br><br>", "<b>Username: tryingforcollege</b><br><br>Just as an FYI, I spent a lot of time in Asia over summer, and everyone knows about UC - Berkeley. Honestly I haven't heard myself of Imperial. Berkeley is just in the news more internationally...for whatever reason (remember those students who were in Iran and are now free). Hyaline - what can I say..I think you want to choose CMU or Duke (you or your friend or whatever)..and you are welcome to do so, with what fits your personality. Rankings are just guidelines..really.<br><br>", "<b>Username: tryingforcollege</b><br><br>To the OP: If your ultimate goal is to study in the USA, it might be better to come now that you are accepted (considering financing is not an issue).<br>Again ditch the rankings. Any student who is good enough to be accepted to both colleges, will be successful provided they work hard.<br><br>Oh...just saw this <url>http://www.dailycal.org/2012/04/02/al-gore-video-chats-with-uc-berkeley-students/</url><br>how cool is this?<br><br>", "<b>Username: stevenz0601</b><br><br>How long does it take to do masters degrees in the US?<br><br>", "<b>Username: tryingforcollege</b><br><br>I dont know if they have a combo 5 year bs/ms for math, but otherwise I think MS takes 2 additional years (source: family). By the way, UC berkeley ranks tops in math competitions as well.<br><url>http://www.maa.org/awards/putnam.html</url><br><br>Top 5 teams<br><br>1. California Institute of Technology<br>2. Massachusetts Institute of Technology<br>3. Harvard University<br>4. University of California, Berkeley<br>5. University of Waterloo<br><br>I think you are trying to over-analyse things. If London is your calling, go imperial else if the USofA is where you want to be, come to Berkeley.<br><br>", "<b>Username: Lucidwolfe</b><br><br>Most international students at Berkeley complete a masters along with an undergraduate degree within 4 years. This is even easier if you have done the A-levels which will allow you to waive some lower-division math classes, among others.<br><br>My high school was in south-east asia and from personal experience, Berkeley was way more difficult to gain admission into than any UK universities (except oxbridge and perhaps LSE) and generally considered to be more prestigious. Just as a reference, the number of students accepted into ucb in my year was only a fifth of that accepted by imperial.<br><br>Also it is much easier to obtain a work visa in the US than the UK right now so US definitely has a more friendly post-graduation environment for international students.<br><br>", "<b>Username: mathboy98</b><br><br>\"\"Personally I want to do a post-grad in perhaps finance related subjects after my undergraduate, so which university is better in that regard?\"\"<br><br>This makes things interesting, because UCB's top ranking in mathematics has to do with its faculty being some of the most reputed in the world, covering almost all disciplines. It is extremely strong in many fields of mathematics and has a top rated logic department too, which is a somewhat rare thing.<br><br>However, you plan on going into finance. I wonder if the remarks posters have made about math rankings are in any way applicable to you.<br><br>Something I can say as a UCB mathematics person myself is that it seems to invite majors who have a variety of other interests, including engineering, physics, and economics. This suggests it will meet your needs, as someone wanting to do work in finance probably should take a broad interest in a lot of things.<br><br>I think a lot of the reasons for recommending Berkeley on this thread are slightly flawed, given your plans, but I would still recommend it strongly.<br><br>However, this isn't to say that I don't also recommend Imperial strongly. Rankings are not only misleading for the undergraduate, but also graduate level. Is the overall research output of the faculty going to help every single graduate and undergraduate? Usually, it is very, very rare that the faculty aren't a lot more accomplished and experienced than you are, and quite possibly, than you ever will be, at a very highly rated school.<br><br>What I would look for at the undergraduate stage is good breadth of coverage of the key areas relevant to you and possibly a community which will expose you to what is out there. At the graduate level, you want a very well regarded school with faculty who will train you extremely well at the research areas you are interested in -- again, not the same as overall research output, or the existence of certain particular stars who proved things that almost nobody on the faculty understands.<br><br>UC Berkeley may not necessarily provide \"better courses\" like you said. It may provide more, and they'll often be good, but not all the faculty will teach with ideal levels of dedication.<br><br>", "<b>Username: mathboy98</b><br><br>@tryingforcollege: UC Berkeley does not tend to be as strong a Putnam contender as many other schools with strong mathematics departments. It has done very well in some odd years, but I would hardly make math competitions a reason to encourage attending.<br><br>", "<b>Username: mathboy98</b><br><br>\"\"Lets keep Princeton out of this because as far as I'm concerned you can't even compare a place like Princeton to a place like Berkeley; look at Princeton's the acceptance rates, average SAT scores and Alumni, then get back to me.\"\"<br><br>As someone well aware the average scores and such at Berkeley's undergraduate program are much lower, let us also remember that Berkeley accepts by percentage a ton of Californians, and is basically compelled to. In terms of academic departments and resources, it offers insane amounts to its students, but too bad because a lot of them will never make use of it. I think if you're among a lot of the strongest students at Berkeley though, for a lot of career paths there seems very little to no advantage to Princeton.<br><br>There is a high degree of randomness in admission to an Ivy League school, and so I don't think too much of someone until I hear what he/she actually can accomplish in a very specific way.<br><br>", "<b>Username: stevenz0601</b><br><br>I'm assuming Berkeley will open quite a few doors if I do decide to work in the US? What if I wish to work outside of the US?<br><br>", "<b>Username: fall2016parent</b><br><br>\"\"I'm assuming Berkeley will open quite a few doors if I do decide to work in the US? What if I wish to work outside of the US?\"\"<br>I wasn't going to answer this thread but here is my 2 cents. I think you really are wasting our time here. You should not need anyone to convince you. Think why YOU applied to these colleges. Why did YOU choose Berkeley? Why did you choose Imperial? At the end of the day, any college will get you where you want to be. You can choose Harvard or Princeton or State University of XXXXX, but it will be still YOU who will be responsible for what opportunities you avail.<br><br>These posts here are trying to convince you one way or other. At the end of the day, both are good places and it is YOUR decision. I personally feel you really are going in circles here and this thread has run its course :)<br><br>", "<b>Username: stevenz0601</b><br><br>I heard in Imperial the lectures notes barely provides enough for the tutorial sheets and exams. What about in Berkeley?<br><br>", "<b>Username: Thomas_</b><br><br>\"\"I heard in Imperial the lectures notes barely provides enough for the tutorial sheets and exams. What about in Berkeley?\"\"<br>That's such a big generalization it doesn't make much sense ;) Obviously that depends on major, class, and most of all, the professor in that particular semester and class.<br>\"\"In all my experiences in Asia (from acquaintances to close friends and relatives), Berkeley is regarded on the level of Stanford and MIT. Princeton isn't in the radar of most Asians. If you don't believe me, that's your choice and I'm not going to force you to believe me.\"\"<br>I don't have made quite the same experiences. I agree with you about Imperial and Princeton, most of my East Asian friends haven't even heard of them. However, by no means is Berkeley regarded as being on the same level as Harvard, Stanford, MIT, etc. Many don't know Berkeley but obviously know the previous three, mostly through media coverage. That being said, my experiences are in HK, Taiwan, Korea and Japan, countries different from those you've mentioned.<br><br>", "<b>Username: Hyaline</b><br><br>@RML, regardless of you amazing qualifications, as far as I'm concerned Princeton has a better reputation and is better known than UCB. My experience is concentrated in South Asia, the Middle East and China.<br><br>The reason I see Imperial as being more famous than Berkeley is because I go to a British school, in fact most schools in my area are British, hence people know of more English unis rather US unis. On an international scale those I've spoken still consider Imperial as being more prestigious, these people being family and friends.<br><br>", "<b>Username: Hyaline</b><br><br>However if you are right it would suit me since I was rejected at Princeton early and accepted to Berkeley :).<br><br>", "<b>Username: Alphavirus95</b><br><br>I am in this exact situation too. I recommend connecting with Facebook to the UC Berkeley app to get a feel for what the students are like. Hope this helps!<br><br>", "<b>Username: dustinthewind</b><br><br>Imperial is good, so is Berkeley. I have close family who go to both.<br><br>It comes down to this:<br><br>At Imperial (or any other UK university) it is very focused study. You applied for math, you study almost completely math. You graduate in 3 years. You go on vacations so often it'll appear to most that you're not even in school. The summer break in the UK system is 3 months -- the length of every single break in the US system combined. And they get another month or two off for winter and other stuff if I'm not wrong. It's almost like spending half a year out of school.<br><br>At Berkeley, you'll be getting a more \"well rounded\" education for sure. That, and a brand name that is recognized the world over. Imperial, not so much. Its better known in Asia, but tell anybody in the US that and you'll probably get a blank stare.<br><br>So in terms of job prospects in the US, Berkeley will be a leg up. In terms of getting the \"college experience\", once again, Berkeley. In terms of quality of education -- Imperial is more focused, Berkeley more well rounded.<br><br>If it were me, I'd pick Berkeley a hundred times over. London is gloomy. I can't stand the gloom and doom of London weather. Its something to think about.<br><br>p.s. rankings are ********. both family members, the one at berk and the one at imperial, are having trouble landing internships. i don't want to scare you, but the one at imperial is studying math just like you.<br><br>just like in business, the market is the most important thing. if you're in a huge market like software engineering where demand ALWAYS exceeds supply, you don't even need a degree to find work. if you're going to study math, you'll find your options to be much more limited. indeed, my cousin at imperial is now looking at doubling in another major because the job prospects for a math major don't look too good. not that he isn't brilliant at it -- its just the way the world works. you could be a master basketweaver and be out of work for decades. do math + econs. or math + CS. pure math is risky.<br><br>", "<b>Username: Hyaline</b><br><br>I don't have any tangible sources save perhaps the us news ranking which I'm sure everyone here as seen. I guess my supposition that Princeton is more prestigious than Berkeley is based more on intuition and the way in which people react to hearing the name \"Princeton\" than on any real rankings.<br><br>", "<b>Username: cadave</b><br><br>I'm not sure how widely read US News is outside of the US. It also focuses on undergraduate programs. Here's yet another ranking by a university in Shanghai. The rankings were created to gauge Chinese universities with their peers worldwide. It is apparently one of the top three most refereneced in the world. For 2011, Cal comes in at 4, Princeton 7, and Imperial at 24. Regardless of these rankings, you have two fine schools to choose from. Congrats.<br><br><a href=\"http://www.shanghairanking.com/ARWU2011.html\" rel=\"nofollow\">Academic Ranking of World Universities - 2011| Top 500 universities | Shanghai Ranking - 2011 | World University Ranking - 2011</a><br><br>", "<b>Username: ArrogantBastard</b><br><br>Berkeley is one of the few universities that literally <i>every</i> reasonably educated person in the world has heard of. Along with probably Harvard, MIT, Stanford, Oxbridge. The faculty, their research and the grad programs are truly among the handful of the elite in the world. Whoever says ICL is better known in Asia is clowning.<br><br>With that said, at the undergraduate level Berkeley is still a large, state school. It is not particularly hard to get into, its general student body not particularly strong, and while somewhat 'prestigious' in America, a Berkeley undergrad is not \"elite\" by any means.<br><br>Now with THAT said, ICL is a great school and its really hard to go wrong with either.<br><br>", "<b>Username: stevenz0601</b><br><br>How long does it take to finish an undergraduate in Applied Math at UCB? Because at Imperial, or any other universities in UK, Australia and NZ, Applied Math takes 3 years to complete. (Same as other degrees such as pure math, physics, chemistry; but degrees such as engineering does take 4 years).<br><br>", "<b>Username: Eloriel</b><br><br>Just want to chip in here; I was born and raised in Singapore and among most top-overseas-university applicants here (who obviously have done their homework and are very qualified), Imperial trumps Berkeley. Especially in Math and Science, but not in Engineering.<br><br>From MY own experience, my family and friends know what Imperial is and not Berkeley. In fact, my own parents and many other people I talked to almost forbade/discouraged me from coming here because they thought it was a crappy university. Others simply did not know what Berkeley is (as compared to Imperial.) This sentiment is pretty common among Singaporeans in recent years (so, RML, your Singaporean info might be a little out of date).<br><br>Can't speak for other countries though.<br><br>I also agree with several other posters that if you're in search of a more holistic environment, choose Berkeley. If you want to focus and specialise, go for Imperial.<br><br>", "<b>Username: meakame</b><br><br>\"\"Whoever says ICL is better known in Asia is clowning.\"\"<br><br>I don't appreciate being called 'clowning' when, first of all, I am actually <i>from</i> Asia, and Imperial is really more well known there, and secondly... nobody says \"ICL\". I'm sorry.<br><br>But that's not the point  and I think that basing university choice solely on reputation alone is a bad idea. Both universities are incredibly good at math (I know people who have turned down Cambridge math for Imperial math), generally very well-respected, and have degrees that can be completed in three years. You can't necessarily make a huge generalization \"X is better than Y\" because it's bound to vary from country to country and even from discipline to discipline.<br><br>Eventually it boils down to your learning style, as Eloriel mentions. Berkeley lets you try more things. Imperial doesn't. But if you are absolutely sure you want to specialize and not have to bother with humanities courses or the like, then Imperial might be for you. Also keep in mind that Berkeley uses a GPA system  so every class/final/midterm/assignment counts. Imperial, in contrast, only has a series of large examinations at the end of every year. Both systems have their benefits and drawbacks, and it's just up to which one you prefer.<br><br>", "<b>Username: Thomas_</b><br><br>Nobody doubts that Imperial is a great university. It might even be \"better\" than Berkeley at the undergraduate level if you are specializing, I totally admit that. However, it's basically a fact that Berkeley has a much better reputation worldwide because of it's graduate programs and research. That someone is from \"some country in Asia\" doesn't mean anything. You can't generalize onto other Asian countries because they are significantly different. Saying \"I'm from Asia, and it's like that in Asia\" is nothing but stupid.<br><br>", "<b>Username: Eloriel</b><br><br>\"\"That someone is from \"some country in Asia\" doesn't mean anything. You can't generalize onto other Asian countries because they are significantly different.\"\"<br><br>I agree with the second sentence.<br><br>But I disagree with the first; it does mean something. It means that in that particular country, so-and-so college is viewed as better than another. Sure, if your unit of analysis is the whole world or region, maybe that might be insignificant. But know at least that a part of Asia has a certain opinion, and that matters.<br><br>", "<b>Username: copperback</b><br><br>@Eloriel<br><br>You can't generalize your singular experiences and make such broad claims regarding the prestige/reputation of Imperial and Berkeley for an entire country. Your interactions are obviously with a very limited subset of the population and I highly doubt they are representative of the country as a whole. It's ignorant of you to just extrapolate from what limited experience you have talking to family and friends and claim that this is in fact representative of the general sentiment among Singaporeans. For what it's worth, I'm from Singapore as well, and my personal experiences do not corroborate with yours.<br><br>Besides, when it comes to the reputation of a college, all that matters (imo) is the views of companies, i.e. the hiring managers etc, since these are the people who you want to impress the most. If we are even going to consider anecdotal evidence, I'm more inclined to believe RML's assessment since he works for a large Asian bank and the people he comes into contact with are obviously in a better position to pass judgement on a college's reputation.<br><br>", "<b>Username: Eloriel</b><br><br>^true. But that also means all the others arguing on behalf of their experience with Berkeley > Imperial are also making the same mistake.<br><br>And you are, but that only represents the climate at that particular bank, no?<br><br>Seriously there's a point where this discussion becomes too specific to be useful for the OP, so I shall shut up now, but yes, my experiences apply to my circle, others' apply to their circles, etc.<br><br>", "<b>Username: phantasmagoric</b><br><br>My understanding has also been that Berkeley is far more prestigious in Asia, similar to MIT and Stanford, largely because of its reputation in the sciences and engineering. In all my time on CC, that's been one point that's never contentious, so it's news to me that Imperial is up there as well. <a href=\"http://www.worldbrandlab.com/world/2009/top500_7.htm\" rel=\"nofollow\">This ranking</a> of global brand power from an Asian organization puts Berkeley at #234; I don't see ICL anywhere in the top 500, but perhaps I missed it. In both the THE reputation surveys - the first one being 13,000 respondents, the second one 17,000 - Berkeley came out far ahead of ICL (72-74 vs. 22-23, i.e. more than 3x the prestige).<br><br>The QS rankings lost all credibility when they fluctuated wildly from one year to the next. Berkeley and Stanford, among others, were in the top 10, then the next year they dropped 10+ spots, etc. That's probably why QS and THE now do their own rankings; QS booted Stanford and MIT in favor of putting ICL in the top 5-6, which I think demonstrates the credibility of the ranking. THE's is definitely more well-known/respected. It's also supported by similar rankings like Shanghai.<br><br>Anyway, to the OP, don't base your decision on any world ranking. Your decision should depend more on where you want to work after graduating, which one has greater strength in your field of study, and which one you feel more \"fit\" with.<br><br>", "<b>Username: copperback</b><br><br>\"\"^true. But that also means all the others arguing on behalf of their experience with Berkeley > Imperial are also making the same mistake.\"\"<br>The only reason I called you out was because you insisted that your experience \"mean[t] that in that particular country, so-and-so college is viewed as better than another\" even after Thomas_ made his point about the folly of generalization.<br>\"\"And you are, but that only represents the climate at that particular bank, no?\"\"<br>Like I said, I don't hold much stock in anecdotal evidence, but the point I was making which you seem to have missed was that \"<b>IF</b> we are even going to consider anecdotal evidence,\" whose experience (yours or RML's) do you think is more relevant?<br><br><a href=\"http://www.topuniversities.com/university-rankings/world-university-rankings/2011/indicator-rankings/employer-review\" rel=\"nofollow\">QS</a> and <a href=\"http://www.timeshighereducation.co.uk/world-university-rankings/2011-2012/reputation-rankings.html\" rel=\"nofollow\">THE</a> offer somewhat more objective measures of reputation.<br><br>THE has Berkeley at #5 and Imperial at #13 in terms of reputation.<br>QS has Berkeley and Imperial tied at #4 in terms of employer reputation<br>and Berkeley at #4 and Imperial at #15 in terms of academic reputation.<br><br>EDIT: I agree with phantasmagoric regarding the QS rankings<br><br>", "<b>Username: Hyaline</b><br><br>Wow this has really snowballed hasn't it :D<br><br>", "<b>Username: meakame</b><br><br>Actually, this is something I'm pretty interested to know  RML, for those 3 people who chose Berkeley over Oxbridge, what were their reasons?<br><br>Might help the OP in evaluating his/her own reasons. Plus, I'm just curious.<br><br>", "<b>Username: meakame</b><br><br>I gotta agree that those are good reasons :) Berkeley CS and Engineering can't be beat.<br><br>Interestingly, I got into both Berkeley and Imperial, and I picked Berkeley, although not for any particular prestige- or discipline-related reasons. I didn't like the narrow focus of Imperial nor its one-big-exam format.<br><br>You've attended both US and UK schools; what would you say regarding the teaching style in both countries? Oxbridge has tutorials/supervisions... but does Imperial have something similar?<br><br>", "<b>Username: stevenz0601</b><br><br>@meakame Oxbridge's supervision is unique, Imperial doesn't have that; but Imperial does have tutorials (like most other universities I believe).<br><br>One of my family friends, who is going to Imperial, said the school was great, but one thing he had to admit was that the quality of lectures was not that great at times. He said that the lecture notes usually don't provide enough for the tutorial questions. How is it in this area at UC Berkeley?<br><br>", "<b>Username: mathboy98</b><br><br>\"\"In terms of quality of education -- Imperial is more focused, Berkeley more well rounded.\"\"<br><br>This poster had a very nice, useful post, though I've seen this point floating around, don't at all disagree, but think there's some clarification to be made.<br><br>Berkeley definitely doesn't force a well-rounded experience on you. For instance, some schools have a very rigid \"core\" requirement of courses, and Berkeley's doesn't really seem to compare to those. Usually, it is perfectly possible to take a very specialized curriculum. Further, Berkeley is such a giant academic school that the number of interesting classes in different topics is remarkable, so you can conceivably spend a LOT of time taking classes in a few areas. That option doesn't happen everywhere.<br><br>However, it is true that the point of the 4-ish year college model is to allow some experimenting to happen during the college years. I think English schools often have 3-year undergraduate degrees, 1-2 years of master's, and then possibly PhD for 3-4 years.<br><br>Sure, you have breadth requirements at Berkeley, but nothing that takes more than a course or so for many semesters in a subject outside one's specialty, and often there are so many easy classes you can take that you'll not really even think about your breadth requirements unless you specifically <i>want</i> to take an intense class in some of those areas.<br><br>So in some ways, I think going to a research powerhouse school with a lot of specialized activity going on both in terms of research and classes makes Berkeley a great place to specialize a lot too.<br><br>", "<b>Username: mathboy98</b><br><br>\"\"as far as I'm concerned Princeton has a better reputation and is better known than UCB. My experience is concentrated in South Asia, the Middle East and China.\"\"<br><br>I feel like these kinds of things are <i>so</i> dependent on what field you're going to, who you're trying to please, etc, that when giving advice, the best is to get more specifics before committing much. There are circles where UCB simply has a better brand name, and ones where Princeton does. There are some truths, such as the fact that Princeton undergraduate is elite in the U.S., whereas UCB isn't considered the same.<br><br>Yet that \"truth\" breaks down if you get down to specific majors and career paths. So why even bother?<br><br>", "<b>Username: d313711</b><br><br>I have a similar issue. Someone was accepted to Cal for CL&amp;S and Geography at Cambridge. While we think that Cambridge has a better brand name worldwide, Berkeley has a more well rounded education and better job prospects with a Econ degree. Please share your thoughts.<br><br>", "<b>Username: cadave</b><br><br>One thing that RML brought up in regard to admission is that Berkeley recently it did not admit a lot of international students. As recently as 2009, its international admit was only 5.7% of the total. It has steadily increased to 9.6% for 2011. The current chancelor has indicated that he'd like to see it increased to 20% over time. This is largely due to the fact that the state of California is going through a difficult financial situation and both out-of-state and international students pay signifiantly more in tuition than in-state students.<br><br>", "<b>Username: broodwar2</b><br><br>Berkeley>Imperial hands down. Noone even knows what Imperial College London is in Asia. They probably think since it's foreign country, it must be good.<br><br>When I say Asia, I am referring to China/Korea/Japan and not India. Who cares about India? Sorry guys.. you guys are too populated and not really... China too but it seems only handful of Chinese come to US.<br><br>Anyway, as with cambridge and Oxford, they could be better than Berkeley depending on fields, but overall, United States Univ.> English Univ.<br><br>Besides, people in US know Berkeley. They don't know what ICL is. Oxford and Cambridge they would probably know.<br><br>And Princeton, Darthmouth, and Penn are not that popular in Asia. They probably don't even know they are Ivy league schools. Popular I mean compared to Harvard and Yale level.<br><br>", "<b>Username: stevenz0601</b><br><br>What's the situation on applying for internships at UCB? Also, I may wish to do my masters at a different university, will going to UCB affect me in that area?<br><br>", "<b>Username: stevenz0601</b><br><br>Also, what is the accommodation like at UCB? Can students live on campus for as long as they want? Or do they have to leave after 1st year?<br><br>", "<b>Username: tryingforcollege</b><br><br>Do you usually need so much hand holding? Why don't you see the other posts..there is like a big post on dorms. Check out the website <a href=\"http://housing.berkeley.edu/\" rel=\"nofollow\">Residential and Student Service Programs, UC Berkeley</a><br><br>", "<b>Username: mathboy98</b><br><br>I think normally, campus housing at UCB is for 2 years or so, but students do at times live past the second year. This is what's normally the case -- I imagine there are exceptions, and/or I could be slightly mistaken.<br><br>", "<b>Username: nwcrazy</b><br><br>I'll chime in...<br><br>I completely agree with RML. In the US, the 4 horsemen of the top institutions are Stanford and Berkeley on the west coast AND Harvard and MIT on the east coast.<br><br>As an American who is half Japanese, I've come into contact with lots of Asians. I can tell you that Berkeley's pedigree is extremely strong. When I talk to people from China, Korea, or Japan, they have a reverence for Berkeley. In fact, my brother, who got his Ph.D from Berkeley years ago, tells me that people see him differently, even among the Ph.D crowd.<br><br>Believe me, hiring managers around the world have Berkeley high up on their radar screens.<br><br>", "<b>Username: flutterfly_28</b><br><br>Yes, Berkeley is very well-known and highly regarded around the world. I know most Indians think the top universities in the world are Harvard, Stanford, MIT, Berkeley, Oxford, and Cambridge.<br><br>And OP, this isn't how a forum works. You don't just make a thread and keep asking all your questions in it. Look at the UC Berkeley forum and you'll see threads about housing and classes and all of that. There's also a search function.<br><br>", "<b>Username: KitKatz</b><br><br>There is the option of graduating early if time is an issue for you. I have a brilliant applied math major friend who was only here for 3 years (including a couple summer session classes) to save money; granted, he worked his *** off, planned his schedule very carefully so he can graduate with an amazing GPA as well. He just got accepted to Yale for graduate school in math and plans on doing something in finance after.<br>Also, I think Berkeley gives its students more opportunity to explore different areas of study and to prepare themselves well for jobs (I can only say this about technical majors). One of my good friends is pursuing 2 majors (Statistics and Economics) and 2 minors (Demography and Industrial Engineering) to prepare herself for Econ grad school or actuarial work, and another is doing a CS + Stats double so she can be an analyst or a programmer. I also know quite a few people who are Math + some other major like Econ or Stats or some kind of engineering (because either they are just interested or they are afraid the pure math route might not work out for them and the second major is plan B) and quite a few who have more diverse interest and are Engineering + music or some other random/cool major. You can learn a lot of things by the time you graduate -- basically create your own little cluster of classes/major to cater to your interest or to prepare you for jobs.<br>I personally benefited a lot from UCB's flexibility and wide variety of classes -- I'm a Statistics Major but got really interested in IEOR through recommendation of a good friend :) and is also taking a bunch of CS classes on the side as well as Psychology classes. I don't know if the diversity of classes and flexibility are things you might be looking for but I think they are things you can consider in your decision.<br>My boyfriend's sister goes to Imperial College and I heard from him that the focus is very narrow, and you don't get the opportunity to explore classes in other departments as much.<br><br>", "<b>Username: iphone929</b><br><br>What is Imperial College. It isn't Oxford or Cambridge. General population would not know. General population is more likely to know Berkeley than Imperial College. As with Oxford and Cambridge, it may be other way around as they have been around for such a long time...It's like comparing Harvard with Duke.<br><br>"]}