{"title": "amherst vs dartmouth", "comments": ["<b>Username: gigichuck</b><br><br>Hey everyone!<br>I’m sure this particular question has been asked a thousand times and I’ve probably read through every single one of them lol. Before I commit to any school, I want to make sure I don’t leave any stone unturned. So a little backstory. I’m an international from Nigeria, and I’m sixteen years old. I was also accepted to Lafayette (Marquis Scholar), Wesleyan, and Minerva at KGI, in case anyone thinks I should really reconsider them. So those are my two top choices. Financial Aid is good at both, slightly better at Amherst, but hopefully they’ll match.<br>Right now grad school is not in the picture. My intended major is either Computer Science or Engineering. Either way I’d end up at Thayer  I haven’t had a chance to visit either. I’m also a very broke international, in case that matters. My financial aid is nearly the full cost of attendance.<br>Dartmouth pros:<br>Ivy status is cool.<br>I am very used to work hard play hard (though   definitely not the level of partying I should expect)<br>I love the scenery<br>Traditions (bonfire!)<br>D-plan and study abroad is amazing<br>The students seem really cool, nice, and I’ve met more Africans there<br>Dartmouth CS appears to be better<br>The soccer is good! (I love this sport. I hope to play it, but I don’t care if I don’t anyway)<br>Cons:<br>Em… frats, partying, alcohol? Cold!!!<br>Amherst pros:<br>5 college consortium<br>Nice town<br>Elite LAC status<br>Very welcoming and open community<br>Very diverse<br>Less partying (I think?)<br>Cons:<br>Cold!!!<br>Basically I’d be cold anywhere so oof.<br>Did anyone choose between the two? Which did you choose? Why? Tell me about the dorms, dining, the entertainment, and just life as a student.<br>Thank you so much!<br><br>", "<b>Username: Publisher</b><br><br>If you view fraternities as a negative, then Dartmouth College may not be the school for you.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>I don’t think there is a meaningful difference in the opportunity to party at Dartmouth vs. Amherst. Both have the opportunity to work hard/play hard – how much of each is up to the individual student. For what it is worth, a colleague gave a paper at Dartmouth recently and said that the Library was packed on a nice Friday afternoon – maybe students were getting the work done before the party hard, or maybe they were the work hard kids, but it seemed very intellectually engaged. In terms of culture, Amherst did have underground fraternities which have recently been banned, so Amherst is no stranger to the party scene. Amherst has worked hard to foster economic diversity.  Both have excellent soccer, at least on the Men’s side, which is what I’m familiar with. Dartmouth does have a Women’s Club team which – at the D1 level – is usually a very competitive program.  Amherst would have more of an intramural program. If you are interested in the possibility of trying out at either school as a walk-on player, contact the coach quickly to find out what, if any, opportunities there may be. On the D3 side, we’ve seen kids come to pre-season, and either make it or not.<br>It sounds like you somewhat prefer the scene at Dartmouth – if the money works out, they are both superb, so pick the one that feels more comfortable to you.<br><br>", "<b>Username: OHMomof2</b><br><br>Have you compared - since you are high need - funding for unpaid summer internships and research and study abroad and things like that? I know Amherst has tons of funding for these things (and help with the initial dorm stuff, coat, etc too), not sure about Dartmouth.<br>Career center at Amherst is very strong also, lots of programs, speakers, workshops etc.<br>I’m sure you know engineering is out if you choose Amherst. CS or whatever else. Easy double major too, if you like, with no required distribution courses.<br><br>", "<b>Username: PurpleTitan</b><br><br>I don’t think the transfer to Thayer is automatically guaranteed for outside students in their 2-1-1-1 plan. Something to look in to.<br><br>", "<b>Username: gearmom</b><br><br>When I had said work hard, play hard for Dartmouth, I did not mean clean playing as in sports but alcohol and beer pong. You are 15 years old turning 16. Another con for Dartmouth is the isolation especially in winter. Amherst has plenty of great outdoors also. No shortage of pretty scenery.<br><br>", "<b>Username: MYOS1634</b><br><br>Colloquially in the US<br>“play hard” in “work hard/play hard” is a way of saying “as serious about getting very drunk/high as about getting high grades, where getting drunk is a social activity appreciated by all including excellent students”<br>15-16 year olds don’t characterize themselves as “work hard/play hard” in the US as this implies regular drunkenness.<br>(End of us colloquialism lesson:) )<br><br>", "<b>Username: gigichuck</b><br><br>Lesson noted thank you  And I’m 16 turning 17<br><br>", "<b>Username: circuitrider</b><br><br>I’m not understanding the phrase, “I’ve met more Africans there [meaning, Dartmouth]” , if you’ve never visited? I’d be very careful about drawing conclusions about student culture, interaction, and “seeming cool” based solely on what you’ve seen on paper. I’ve met several African-American alumni from Dartmouth who will probably never contribute a dime to their annual fund because they were so disenchanted by their experience there. Your mileage may vary (YMMV), as they say on the net, but, the question of whether you have visited any of these schools needs to be cleared up.<br><br>", "<b>Username: gigichuck</b><br><br>@circuitrider No, no. Not in real life. Fellow class of 2022 students on social media. No I have never visited any of these schools.<br><br>", "<b>Username: gearmom</b><br><br>About age. 15 turning 16 or 16 turning 17 is another colloquialism. Sorry about that. It means that you will soon be having your birthday. You are not 16 turning 17 because you had your birthday at the end of last year. In mid December you were 15 and worried about the impact of age.<br><br>", "<b>Username: Scipio</b><br><br>Since you haven’t had a chance to tour, here is a brief aerial tour of Dartmouth:<br>https://www.youtube.com/watch?v=7GIXESEjfqo<br>(Turn on your speakers)<br><br>", "<b>Username: gearmom</b><br><br>Here is a long tour of Amherst (four parts) which shows dorms etc. They have a 300 acre nature sanctuary since you enjoy the outdoors.<br>https://www.bing.com/videos/search?q=virtual+tour+amherst+college&&view=detail&mid=0F36787B7707087A29510F36787B7707087A2951&&FORM=VRDGAR<br><br>", "<b>Username: gearmom</b><br><br>Ooops her are part 2<br>https://www.bing.com/videos/search?q=virtual+tour+amherst+college+part2&&view=detail&mid=126CEDE938DE99FF35D6126CEDE938DE99FF35D6&&FORM=VRDGAR<br>and part 3<br>https://www.bing.com/videos/search?q=amherst+college+part+3&view=detail&mid=9235943AF3FBE6D94FD29235943AF3FBE6D94FD2&FORM=VIRE<br>part 4<br>https://www.bing.com/videos/search?q=amherst+college+tour+part+4&view=detail&mid=F0CFD190BDACF5935D36F0CFD190BDACF5935D36&FORM=VIRE<br>does not cycle through correctly unless you hit these links or search<br><br>", "<b>Username: gigichuck</b><br><br>Which of the two is stronger in Computer Science?<br><br>", "<b>Username: TTdd16</b><br><br>I don’t think it’s fair to generalize about Dartmouth’s experience for Africans (or African-Americans) because of anecdotes from an individual or two on CC. Please do note that the chair of the Board of Trustees is an African-American woman, as is the newly appointed vice president of alumni relations.<br>And frankly, the frat/party culture stuff is overplayed here too. There’s a good percentage of students who aren’t active in Greek life at all, and you should understand that not all frats are the same–some are coed and very different from your typical image. Dartmouth students didn’t get accepted to a school of this caliber by partying their brains out in high school. The difference between Dartmouth and some other schools is that frat parties are generally open to everyone, which makes it a much less exclusive and more welcoming atmosphere than the party scene for many other colleges.<br>As far as the OP not having visited, with admitted student Facebook groups and then group texts/chats that develop, students can get a good feel of who’s in the class and make friends early.<br>So, one vote for Dartmouth, an astounding beautiful place with so much to offer. (But OP is right–it’s cold in the winter! Which is why the D Plan is a great thing.)<br><br>", "<b>Username: KeepItFair</b><br><br>Dartmouth has the better CS program.  Dr. Tom Cormen wrote the bible on Algorithms and teaches at Darmouth.  You will find many developers at Google, Amazon and Facebook who went to Dartmouth and the alumni network is very strong.  As for the climate? Does anyone think Amherst has a pleasant climate in the winter?  Dartmouth embraces winter and has their own ski mountain (and many Olympians).  And, if you change your mind, and no longer want to pursue CS, then Dartmouth has a world class connection to Wall Street.<br><br>", "<b>Username: privatebanker</b><br><br>Yeah I agree. Amherst is a big step down from Dartmouth academically. Not.<br>Just joking.<br>Both equally spectacular.<br>One is smaller<br>one is ivy brand known around the world<br>Amherst is known around the world by academics grad schools and sophisticated employers<br>Both sporty.<br>Both cold in winter.<br>Amherst is a bigger college town than Hanover but both with a nice vibe.<br>More students in general area in Amherst<br>5 college system in Amherst<br>Dartmouth offers the breadth/quality of offerings across disciplines unique to a university of its class<br>despite what you hear Dartmouth does have more of party/Greek life aspect than Amherst. But not that big of deal. It can be fun too.<br>You would find good friends at both schools.<br>Splitting hairs  At 16 soon to be 17 I would go to Dartmouth. Amherst will be a bit more serious and it’s size will make it a bit harder for someone with your unique background and age to find your group.<br><br>", "<b>Username: gearmom</b><br><br>@KeepItFair Winter sports are expensive which will be a problem. Dartmouth certainly does embrace skiing but this family will be reaching to afford the 4K a year. There would be more to do in Amherst if you are priced out of winter sports. Is Wall Street a viable option for internationals?<br><br>", "<b>Username: gearmom</b><br><br>@gigichuck Has Dartmouth come back with a better financial offer yet?<br><br>", "<b>Username: gearmom</b><br><br>@privatebanker She just turned 16. She is not turning 17 soon. A misunderstanding of expressions.<br><br>", "<b>Username: privatebanker</b><br><br>Reinforces my thought.  I am sorry. Dartmouth<br>Wow to have such options at 16.<br>We should change this thread to “good school for future Madame President”.<br><br>", "<b>Username: MYOS1634</b><br><br>Amherst is cold too, indeed.<br>But Greek life IS a difference, as well as the curriculum (open at Amherst and gen Ed/distribution requirements at Dartmouth).<br>Both are excellent for CS and equally connected to the industry but professors may be in different areas of research.<br>@KeepItFair : are skiing lessons, skis, and snowsuits available for free? (I assume the shuttle and access passes are free to Dartmouth students).<br><br>", "<b>Username: gearmom</b><br><br>@gigichuck I just wanted to say that though it seems like a long time when you are young, maybe you should be leaving grad school on the table. 4 years at an elite college, OPT then elite grad school, OPT, would be an incredibly strong position and opportunity. Especially if you want to have a start up, you would make so many wonderful connections including financial ones to fund your dreams. I think that investors would be more inclined to stand behind you with valuable experience and grad school.<br>O’k so if you go to Dartmouth (or even Amherst), when you go to a party be careful of what you drink. Don’t put a drink down and then drink again from it. Someone could slip something into it.<br>For winter sports, consider cross country skiing as an affordable-ish option. You could get used skis.<br>@privatebanker Yes, incredible options. I said to her it is a choice between diamonds and pearls.<br><br>", "<b>Username: MYOS1634</b><br><br>@privatebanker : how does that reinforce your choice ? Genuinely curious. At 16,17,18, I wouldn’t pick Dartmouth (that being said, I’ve never gotten drunk in my life and never felt I missed anything).<br><br>", "<b>Username: OHMomof2</b><br><br>I haven’t seen op say she wants to ski but if so it is free at Amherst through the outdoor club. Gear and all.<br><br>", "<b>Username: gigichuck</b><br><br>@gearmom No not yet. And it’s almost May 1 yikes. Okay grad school is back on the table, on a tiny little corner close to the edge <br><br>", "<b>Username: gearmom</b><br><br>@gigichuck When you are older, you will miss this time in college. You could just send your transcript to Harvard and Princeton. Just for kicks  They might beg you to attend. Leave it on the tiny corner of the table.<br><br>", "<b>Username: ThankYouforHelp</b><br><br>I would choose Amherst.  But both choices would serve her well.<br><br>", "<b>Username: Hapworth</b><br><br>Amherst<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>Please do note that the chair of the Board of Trustees [at Dartmouth] is an African-American woman, as is the newly appointed vice president of alumni relations.<br>\"\"<br><br>And, that is a perfect example of what I mean. I mean, it is entirely possible that, as an international, the OP will be immune to the subtleties of American race relations (I’m reminded of the SNL skit where the king of Wakanda visits “Black Jeopardy”) and what a remark like that says about the state of play at Dartmouth. And at age 16 going on 17, it’s perfectly possible she may find all of this squabbling between Americans rather amusing and nothing to do with her. But, four years is an awfully long time to bet that stuff like that won’t get old.<br><br>", "<b>Username: TTdd16</b><br><br>@circuitrider, if you’re attempting to generalize about race relations at Dartmouth based on a couple of alums you know who had bad experiences, then I think you’re out of line. You’re saying there aren’t any Amherst alums of color who refuse to donate because of bad experiences? I mean, that’s absurd. The stereotypes on this thread are also ridiculous. There are plenty of students at Dartmouth who choose not to drink at all and who have full, happy social lives. I don’t think the drinking situation is much different from most other colleges.<br>As for winter sports, the Dartmouth Outing Club would certainly help students with gear—there would be little to no cost to the joys of cross-country skiing on the golf course at night. And the wonders of the first snowfall or walking around Occom Pond on a sunny Sunday are perfectly free.<br>The OP has two amazing choices, and I’m sure she’ll do well wherever she decides. She really needs current students from both colleges to weigh in on the specifics she asked about. In the meantime, I wish CC posters without direct knowledge of a college would refrain from  perpetuating false stereotypes.<br><br>", "<b>Username: privatebanker</b><br><br>Hi @MYOS1634    I think at 16 you would need the larger student population to find a group. Also as p 14 my experience is that being a lord jeff would be a tougher social environment.  And academics more intense. The ivy experience can be a bit looser. Also if I were playing to an international market after school I would choose d<br>But that’s just my two cents. But it wouldn’t take much to move me to the other side I spent 4 years in Amherst myself a few decades ago. And loved it<br><br>", "<b>Username: gearmom</b><br><br>I actually don’t think @gigichuck is going to have a hard time finding a group at uni. She comes across as charming, intelligent, optimistic and brave. She won’t have trouble.<br>I’m a little sorry I brought up 15 going on 16 which simply meant that you were going to have a birthday soon. But since everyone keeps using it, go check out “16 going on 17” on YouTube from the Sound of Music.<br>But I am not at all worried about @gigichuck socially.<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>I don’t think the drinking situation is much different from most other colleges.<br>\"\"<br><br>On the contrary, officially, it is kind of different:<br>http://www.latimes.com/nation/nationnow/la-na-nn-dartmouth-cultural-reforms-20150129-story.html<br><br>\"\"<br>You’re saying there aren’t any Amherst alums of color who refuse to donate because of bad experiences?<br>\"\"<br><br>My major beef with Amherst is that it has so much money that student culture has taken a back seat to simply having the administration “solve” every problem. But, at least black students there don’t have a persistent, well-funded, anti-affirmative action student presence to contend with:<br>http://www.dartreview.com/the-problems-of-affirmative-action/<br><br>", "<b>Username: OHMomof2</b><br><br><br>\"\"<br>@privatebanker  being a lord jeff<br>\"\"<br><br>Mammoth, actually. https://www.amherst.edu/amherst-story/amherst-pride/mascot<br><br>", "<b>Username: TTdd16</b><br><br>@circuitrider, yep, you’re right. The administration took action to curb dangerous drinking at Dartmouth–and I think the experiment is still too young to know how successful it’s been. My understanding is that the reaction has been very mixed on campus. But you’re seriously deriding an effort to do something about the issue of excessive underage drinking, something that exists on just about every campus in America?<br>As for the Review, it offers a hard-right perspective that’s always represented a fraction of the student body and is held in contempt by the majority. That’s been the case since it first formed in the early 80s, and certainly Dartmouth’s student population has become decidedly more liberal since then. The D takes much more traditionally liberal positions. I happen to think publications with alternative viewpoints–across the political spectrum–are a good thing, but I object to the times that the Review has crossed the line over the years.<br>Once again, unless current students of color want to weigh in on the merits of Dartmouth vs Amherst, there’s little point of continuing this back and forth. And frankly, it’s not particularly germane to what the OP asked. Are there any current CS students or recent grads who can add to the discussion?<br><br>", "<b>Username: privatebanker</b><br><br>@OHMomof2   Old habits die hard. Mammoths now    Think tufts  and elephants. <br><br>", "<b>Username: CottonTales</b><br><br>@TTdd16, only current students of color can weigh in on issues at the schools? Most students have interactions with a very diverse community of students and their opinions are  insightful as well. My kid is an Amherst grad of color,and I have shared very positive things via PM with  @gigichuck.<br><br>", "<b>Username: OHMomof2</b><br><br>@privatebanker I hear you. I loved the Lord Jeff- Mammoth selection and transition process though, D was there through it. Very democratic, current students and alumni got a vote, the list of finalists came from a student generated list. For a year they knew LJ was out but the new one wasn’t in, there were even humorous cups and shirts printed for that, with a big “?” <br><br>", "<b>Username: TTdd16</b><br><br>“The OP has two amazing choices, and I’m sure she’ll do well wherever she decides. She really needs current students from both colleges to weigh in on the specifics she asked about.”<br>@CottonTales, I wasn’t the one who brought up this issue. Another poster, without any direct connection to Dartmouth, did. But if @gigichuck has concerns about the environment for persons of color at Dartmouth, perhaps they’d be the best ones to reach out to her to share their experiences (as your kid did about Amherst.) And of course hearing from other current students about the specific issues in her original post would be helpful.<br><br>", "<b>Username: Scipio</b><br><br>Computer Science is indeed very strong at Dartmouth.  The computer language BASIC as well as the first computer time-sharing system were invented there by two Dartmouth professors,  One of the professors, John Kemeny, later went on to become the president of Dartmouth College.  And the college carries on this strong tradition of CS to this day.<br>https://en.wikipedia.org/wiki/Dartmouth_BASIC<br><br>", "<b>Username: circuitrider</b><br><br>^Current students are preferable, of course. But, let’s face it, if we depended on them entirely, this thread would have died on the vine a long time ago. Nor would it be an issue if every post were full of high praises. Posters with glancing references to friends, or to colleagues they’ve met from the colleges in question or to trips they’ve made in passing the campuses, only get knocked when they say something negative. ~O)<br><br>", "<b>Username: MYOS1634</b><br><br>The ‘experiment’ to curb hard liquor and hazing started 4-5 years ago - there should be data. Anyone has a link?<br><br>", "<b>Username: TTdd16</b><br><br>Three years ago, March 2015, is when the Moving Forward program launched, but some portions are still being implemented, so it’s still a relatively new program. Here’s one report  from August 2017, but much more data is readily available. https://news.dartmouth.edu/news/2017/08/increase-calls-alcohol-related-help-good-news<br><br>", "<b>Username: gigichuck</b><br><br>Thank you all so much. I committed to Dartmouth today<br><br>", "<b>Username: Hapworth</b><br><br>^Wrong choice, but congrats!  Just kidding!!!   Welcome to the Ivy League, kiddo!<br><br>", "<b>Username: TTdd16</b><br><br>Thrilled for you (great choice–there was no wrong one!) Welcome to the Dartmouth family!<br><br>", "<b>Username: gearmom</b><br><br>@gigichuck Did they give you a better financial package yet. Still press for that!!!<br>You are going to do really well at uni.<br><br>", "<b>Username: gigichuck</b><br><br>@gearmom Yes they did. Parent contribution is now $2750, less than Amherst. Thank you <br><br>", "<b>Username: gearmom</b><br><br>@gigichuck That is awesome news!!! You will find your groups of friends. I’ll PM you later about safety. Where will you fly into?<br><br>", "<b>Username: gigichuck</b><br><br>@gearmom I haven’t started making travel plans yet.<br><br>", "<b>Username: MYOS1634</b><br><br>Congratulations!<br>Now we’re all going to PM you advice on safety <br>There’ll be an international orientation before the regular one so email international admissions to ask them the starting date of international orientation and whether they’ll send shuttles to airports, which ones.<br><br>", "<b>Username: Tigerle</b><br><br>Congratulations! I hope you will get a chance to learn to ski, it’s what makes the cold snowy winters all worthwhile.<br><br>"]}