{"title": "hamilton vs wesleyan s ga tech please help", "comments": ["<b>Username: Waitwhatss</b><br><br>So I have gotten into 3 schools I really like. But am not sure which to choose. I am interested in going in a stem field especially BIomedical engineering. But I also want to get Med school after college.<br>For GA tech I get Zed Miller but I would still have to pay 21k.<br>For Hamilton and Wesleyan, I have to pay less than 7k.<br>Most importantly I want a school that is small but is not gossipy or spreads rumors.<br>I really want a school where I can easily get a job or get into Med school. I am also very worried about grade deflation. What should I choose?<br>I know this is a lot of info, I am just really confused right now.<br><br>", "<b>Username: Waitwhatss</b><br><br>Also, I don’t want to go to a school that is extremely conservative or way too liberal.<br><br>", "<b>Username: PurpleTitan</b><br><br>Hamilton or Wesleyan, easily.<br><br>", "<b>Username: Waitwhatss</b><br><br>Thanks for the input, but are they good schools for engineering?<br><br>", "<b>Username: pupscotch</b><br><br>Neither Wesleyan nor Hamilton has anywhere near the kind of resources that Georgia Tech can provide for engineering, but if you want to be Pre-Med, Georgia Tech probably isn’t the best option. Are you sure that’s the major you’d like?<br><br>", "<b>Username: jym626</b><br><br>You have listed everything you don’t want. What do you want?  And if you are a GA resident and got the Zell, congrats. But remember, you have to keep the grades to keep the Zell.<br>Your small LACs aren’t going to give you engineering, but they are great schools and very very affordable with those FA#s!<br><br>", "<b>Username: Waitwhatss</b><br><br>@pupscotch<br>Thanks for the response!<br>Honestly, I want a major that can still offer me many high-paying jobs even if I don’t get into any med schools.<br>What majors from Hamilton? Wesleyan would you recommend?<br><br>", "<b>Username: Waitwhatss</b><br><br>Which is better for employers Hamilton or Wesleyan?<br><br>", "<b>Username: merc81</b><br><br>I agree that your choice of college will depend on how sure you are with respect to your intended major. Though Hamilton and Wesleyan would be excellent choices for pre-med studies, and even pre-engineering (essentially physics and math), they do not offer direct engineering programs.<br><br>", "<b>Username: Waitwhatss</b><br><br>@jym626 I really want a school that can provide me with a major that allows me to get a well-paying job<br>Med school would be a great next step but I am still to young to be sure if I want to take that route<br><br>", "<b>Username: Waitwhatss</b><br><br>Also, I am not sure the 21k I have to pay for GA tech is after Zell Miller because they didn’t mention anything about but I know for a fact I qualify.<br>I just know Ga tech will cost me a lot- and Wesleyan and Hamilton are affordable<br><br>", "<b>Username: Waitwhatss</b><br><br>@merc81 Do you recommend a Hamilton or Wesleyan?<br><br>", "<b>Username: jym626</b><br><br>Wait til you have your FA offers<br><br>", "<b>Username: Waitwhatss</b><br><br>@merc81 Thank for the help btw <br><br>", "<b>Username: Waitwhatss</b><br><br>@jym626 I did get all my Fa offers and Ga tech said I need to pay over 25k but didn’t mention anything about Zell Miller<br>I tried calling them multiple times to appeal my FA but no one ever picks up<br><br>", "<b>Username: pupscotch</b><br><br>Hamilton has a lot of inroads in finance, if you’re interested in that. I don’t know much about Wesleyan.<br><br>", "<b>Username: Waitwhatss</b><br><br>Will it be hard to find a job in the stem-field if I end up going to Hamilton/ Wesleyan?<br>Thank again everyone for the response!!!<br><br>", "<b>Username: merc81</b><br><br>@Waitwhatss:<br>For either Hamilton or Wesleyan (both great schools!) to be a top choice, you should enter with a strong interest in pursuing a range of arts and sciences fields through your elective choices (e.g., classics, religious studies, government, literature, history, geosciences, astronomy, sociology . . . or really any similarly diverse array of courses that might appeal to you). With respect to major choices that might be appropriate, you might consider computer science, math, physics, economics, or a combination from this group. In terms of post-graduate earnings potential, early career salaries can be found through U.S. News. Hamilton appears highest among the NESCAC LACs in this area. But, as stated, be sure their curriculum appeals to you based on your sincere academic interests.<br><br>", "<b>Username: Waitwhatss</b><br><br>@merc81  thanks for the help!<br>I am really interested in the stem fields and hope that either Hamilton or Wesleyan would be good choices for that.<br>The thing that bothers me is that Ga tech graduates earn a lot more than the other colleges so I hope I am not going to regret not going there.<br><br>", "<b>Username: Waitwhatss</b><br><br>@merc81 do you think appealing for more FA at GA tech will work?<br>My parents really like that school and it closer to home than the other schools.<br><br>", "<b>Username: merc81</b><br><br>If you have gotten this far, then you know that Hamilton’s flexible curriculum would allow you to take take nearly all of your courses in STEM fields such as math, physics and computer science. Moreover, Hamilton might be stronger in a field such as math (a core liberal art) when compared to even a STEM-focused school such as GIT. However, you might already sense whether you are the Georgia Tech type (either positively or negatively), and, if so, this should make your decision simpler.<br><br>", "<b>Username: merc81</b><br><br>And<br>GIT and Hamilton both have their tech aspects, appearing here among “The 10 Most Wired Colleges”:<br>https://m.huffpost.com/us/entry/4546120<br><br>", "<b>Username: jym626</b><br><br>Most everyone wants to make a lot of money, @Waitwhatss. Most people don’t go to a strong 4 year college with the goal of becoming a Starbucks barista upon graduation. That said, you won’t likely start your first job as president of a company. IMO, don’t major in”what will make you a lot of money”,  study what YOU want, what will make you thrive in college, do well and be interesting to employers. Even if you decided to  do Teach for America for a year or so after college, you may choose to go to grad school, a professional school, or move on to a job where your experience will help get a foot in the door. Enjoy college. Don’t think of it as a trade school.<br><br>", "<b>Username: circuitrider</b><br><br>@Waitwhatss - First, take a deep breath. Your interest and affinity for STEM subjects puts you miles ahead of the average liberal arts and science graduate. Be careful taking various “return on investment” (ROI) calculi too literally. Hamilton may have the highest. BUT, Wesleyan also has among the highest percentage of seniors going into the visual and performing arts within NESCAC (10.6%) - notoriously risky careers - right after graduation while Hamilton has among the lowest (4.5%) So, obviously, that’s going to make a difference.<br>Can you code? You can refine your computing skills at just about any of the top LACs; they are amply represented at places like Google.<br><br>", "<b>Username: millie210</b><br><br>What made you apply to Wesleyan and Hamilton in the first place? What was the appeal of these schools?<br><br>", "<b>Username: mamom</b><br><br>Have you visited any of these schools? How did you like them?  I agree with the others, do not spend a lot of time worrying about ROI.  You are a smart kid and will do well where ever you land.<br><br>", "<b>Username: Waitwhatss</b><br><br>I will visit all of them soon, my parents and I just could not afford to before<br>Thank you so much for the feedback! <br><br>", "<b>Username: Waitwhatss</b><br><br>Ga tech is actually 12-18k after Zell Miller<br><br>", "<b>Username: scubadive</b><br><br>Are you a Georgia Resident?  Zell pays all tuition, but many students lose Zell over time. Fees are about $1000 a semester. Parking is $750 a year and off campus housing is running $1000 a month or more.  If you want to go to med school, GT can be a GPA killer diminishing your chances.<br><br>", "<b>Username: privatebanker</b><br><br>If you are worried about grade deflation and getting into med school. Plus the extra costs. Cross off Georgia tech. Great school but attracts some of the best stem minds in the country.<br>Too liberal.  Not sure  what too liberal means. That’s personal and the line isn’t clearly defined. In the words of my liberal d17 after the Wesleyan tour day. She thought it had an activist vibe that didn’t appeal to her.  But to each his own. I never went there.<br>Hamilton based on my direct observations and dear friends current legacies at Hamilton it maybe just what you are looking for. Smart kids. Good profs but perhaps a bit ore mainstream than the other two.<br>Just y two cents. And Wesleyan grads and parents please don’t shoot the messenger. It’s a top top school and I know all about lin manual and my idol Bill Belichick<br><br>", "<b>Username: 2000dancer</b><br><br>Wesleyan has a super strong alum net. Also 3+2 with caltech columbia and dartmouth so you can still do engineering.<br><br>", "<b>Username: Sunny66</b><br><br>@Waitwhatss The problem is – of the three schools being considered – the best two schools for med school (Hamilton and Wesleyan) are the opposite of the best option for engineering (GA Tech). I would not consider a 3+2 program as a realistic option. Very few students end up doing them, which requires switching colleges after your junior year. I think the focus should be whether you really want to start out as pre-med or in engineering. GA Tech likely is a GPA killer for med school, especially if you are in engineering. But if you want to be an engineer, GA Tech is amazing. If you start out at Hamilton or Wesleyan and decide not to do pre-med, you could get a masters in engineering (with an extra year or two of school elsewhere), though that is sub-optimal compared to just going to GA Tech. Tough decision. If you can visit all of them, that would probably knock one or two of them out.<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>Wesleyan has a super strong alum net. Also 3+2 with caltech columbia and dartmouth so you can still do engineering.<br>\"\"<br><br>You can also minor in Integrated Design, Engineering and Applied Sciences (IDEAS) at Wesleyan which is as good a way as any of getting into an ABET approved masters program -  something the OP quite possibly would want to do even if they went to GT.  And, especially, if they decide not to pursue medicine:<br>http://www.wesleyan.edu/ideas/<br><br>", "<b>Username: Waitwhatss</b><br><br>@2000dancer thanks for your advice<br>the problem now is that my fin aid for Weslyan will decrease a lot since my parents income increased a lot recently<br><br>", "<b>Username: Waitwhatss</b><br><br>Yeah I am really afrad of losing Zell Miler<br>do you know how hard it is to maintain Zell Miller?<br>I really don’t know anyone who goes to Ga tech and is willing to discuss with me<br>Thank for the help<br><br>", "<b>Username: Waitwhatss</b><br><br>@privatebanker I am still not sure where to go<br>And I am worried since the deadline is coming up<br>I am between Weslyean and Ga tech<br><br>", "<b>Username: Waitwhatss</b><br><br>@scubadive Yeah I am really afrad of losing Zell Miler<br>do you know how hard it is to maintain Zell Miller?<br>I really don’t know anyone who goes to Ga tech and is willing to discuss with me<br>Thank for the help<br><br>", "<b>Username: Waitwhatss</b><br><br>@circuitrider Hey do you know the median salery for Weslyan student in only stem majors<br>I was looking for it but could not find it<br>Thanks for the help btw really appreciate it!!!<br><br>", "<b>Username: Waitwhatss</b><br><br>@Sunny66<br>That’s the proiblem I am not sure what I want to do<br>I feel like med school is kind of a long shot and don’t want to risk it<br>Due to family circumstance it’s very important I can priovide for them<br>Thanks for you advice really apreacite you taking the time <br><br>", "<b>Username: prezbucky</b><br><br>Regardless of your major, at Hamilton and Wesleyan you will have a more personalized, intimate learning experience: smaller classes, greater access to professors, more academic and advising support.<br>If you were 100% set on Engineering, I would say that GA Tech is worth the extra money. Since you are not, it is not.<br>Another way to make money is in Business/Finance, and I’m sure both Hamilton and Wesleyan, as prestigious as they are in the northeast, have inroads to jobs in those fields.<br>And the savings will help you in whatever you do.<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>@circuitrider Hey do you know the median salery for Weslyan student in only stem majors<br>\"\"<br><br>No, and I agree with you: I wish all of these Return On Investment (ROI) surveys would break their results out by major; it would make comparing apples to apples much simpler. Suffice it to say that a STEM major is going to have pretty much the same opportunities and drawbacks at any of the top 100 colleges or universities; grades and standardized tests are how you will  distinguish yourself from the pack - not the college’s pedigree.<br>If you major in Bio or Chem you are probably going to have to go on to graduate school of some sort to make a decent living. Computer Science is still a very hot major and you can find a job as a programmer right out of the box. The same is true for Engineering except that a B.S degree by itself hits a salary wall about six years after graduation (at which point, a lot of Humanities and Social Science majors start catching up) and you will want to pursue at least a Masters.<br>IMO, Physics and Math are still the sweet spot as far as intellectual exploration and practical applications are concerned. Physics and Math majors have been known to land on Wall Street in various capacities.<br><br>", "<b>Username: mamaedefamilia</b><br><br>@waitwhass   Some questions:<br>Are there any other schools that you are still considering?  I think you are having trouble deciding because none of these three ticks all of your boxes.  I will add it’s not necessary to tick all of the boxes, nor does a college have to be “perfect” for you to have a good experience and meet your goals.<br>Are you interested in biomedical engineering primarily for the career prospects or would a science major available at a LAC suit you just as well?<br>If you are set on engineering, I would pick GA Tech as few people enrolled at LACs actually do 3+2 programs<br>@Chembiodad 's twin daughters are pursuing STEM disciplines at Hamilton.  Maybe he will weigh in here and/or you can check out the Hamilton forum on CC for more information.<br>Wesleyan skews very left politically - if you want to avoid political extremes, you might want to investigate that angle a bit further.<br>It looks like the cost gap has narrowed among your options.  Do you know what your costs are likely to be with your parents’ new salaries?  Did you run the NPCs with the new amount?<br>These are three excellent but different choices.  Good luck with your decision!<br><br>", "<b>Username: iambrutus</b><br><br>I am also deciding between Georgia Tech and Wesleyan<br><br>", "<b>Username: Waitwhatss</b><br><br>I just don’t wanna make a mistake.<br>Enineering is a very stable job rn and I need something that will let me provide for them.<br>Also Ga tech’s final estimate is like 11k but I am still considering both places!<br>Thanks!!! for the help<br><br>", "<b>Username: Waitwhatss</b><br><br>@prezbucky I just don’t wanna make a mistake.<br>Enineering is a very stable job rn and I need something that will let me provide for them.<br>Also Ga tech’s final estimate is like 11k but I am still considering both places!<br>Thanks!!! for the help<br>(sorry meant to tag you)<br><br>", "<b>Username: Waitwhatss</b><br><br>@iambrutus<br>That’s so cool!!<br>Which one are you leaning towards?<br>Are you considering other schools too?<br><br>", "<b>Username: Waitwhatss</b><br><br>@mamaedefamilia The price of both LACs will rise a lot<br>Ga tech will remain the same since I got merrit awards<br>Thanks btw for the input!<br>Also do you know how hard it is to maintain Zell Miller at tech?<br><br>", "<b>Username: mamaedefamilia</b><br><br>@Waitwhatss<br>https://www.gafutures.org/hope-state-aid-programs/hope-zell-miller-scholarships/zell-miller-scholarship/maintaining-eligibility-for-the-zell-miller-scholarship/<br>Here are the guidelines.  You need a 3.3 GPA at the end of your Spring semester to renew for the following year.  I have no idea how difficult that might be at GA Tech, probably depends on your course of study.<br><br>", "<b>Username: threeofakind</b><br><br>@waitwhatss, my daughter is in the same exact situation as you. She very interested in the STEM field but is considering med school. She is accepted into the BIOMED program at GT. The other school she is considering is UVA. She is still undecided and super stressed<br><br>", "<b>Username: iambrutus</b><br><br>@Waitwhatss I am only deciding between GT and Wesleyan now. I am interested in studying physics. Wesleyan seems to give more individual attention, but GT seems better overall for math/science.<br><br>", "<b>Username: privatebanker</b><br><br>It should come down to fit at these levels. Wes is a bit quirky but could be perfect for you. Gtech will be s more traditional experience with d1 sports and really hard classes.<br>For my d. We simply removed wes because of the longish walk from freshman dorms down the hill to the dining halls. She thought it would be cold and dark during the winter in the am for breakfast and at night for dinner. It was as small a detail as that for her. You could have the same fit concern with gtech.  I don’t know anything about the campus or student life other the. Football<br><br>", "<b>Username: TheGreyKing</b><br><br>If you really want engineering, GATech is your better choice, unless you are okay with a 3-2 type of program. Otherwise, top small liberal arts colleges like Wesleyan provide a really wonderful educational experience for undergraduates, with small classes, lots of opportunities to interact and work closely with professors, and a tight community.<br>But you already have narrowed your decision to two fantastic options using all your criteria. For your final choice, don’t “overthink” the decision. Just pick whichever one feels best to you, commit, and do not look back! If unsure, imagine giving up one school, then imagine giving up the other. Which is harder to say goodbye to? Go there!<br><br>", "<b>Username: jym626</b><br><br>few people actually do a 3-2 and it’s more expensive.<br><br>", "<b>Username: circuitrider</b><br><br>^Yes, it’s more expensive, but, in the long run he’s going to need more than a bachelor’s degree, if he expects to be promoted by an engineering firm. The OP can keep his career options open for a little while longer while he majors in physics and minors in applied sciences at Wes.<br><br>", "<b>Username: akin67</b><br><br>My son is currently a Hamilton / Dartmouth student. He is in the 3-2 engineering program and  loves it. Unlike the typical 3-2 where you leave the liberal arts college at the end of the 3rd year, for the Dartmouth plan the student studies at their LAC for freshman and sophomore year, then move on to Dartmouth for their junior year, when most of their friends are studying abroad. For their senior year they go back to their LAC, graduate with their friends and get their BA degree, and return back to Dartmouth for a 5th year and get their BE degree in an engineering discipline.<br>What is nice about this program is that the student gets an excellent STEM education at the LAC with very small class sizes where they get to really know their professors and do research as an undergraduate. At Thayer (Dartmouth’s Engineering School) you get a very project oriented engineering education with a strong entrepreneurial focus. Dartmouth is on a quarter system so many professors have their own engineering / tech companies they are running, bringing current real-world challenges to class.  Also, there is a certain camaraderie amongst all the 3-2 students from the various LAC’s.<br>Typically if you maintain a 3.5 or better at your LAC and take Calc I, II, III, Physics I, II, Chem, and CS, you get into Dartmouth. If I am not mistaken they get about 100 applicants a year, with about 40 or so getting accepted into the program each year.<br>There is no question that the 3-2 plan will require an extra year of education and the costs that go with that. However, that additional year provides you the ability to take the extensive math and science prereqs for an engineering degree, but also affords you the ability to take more humanities and social science courses. The part of the education you get at a LAC will be more discussion based (as opposed to a lecture based model), enabling you to become a more effective communicator and develop critical thinking skills. This is an investment that will make you a more marketable candidate with employers.<br><br>", "<b>Username: jym626</b><br><br>Some have said that getting an advanced degree in engineering can narrow rather than widen, job prospects due to the increased specialization. And there are many opportunities outside engineering firms for engineers.  Not having an advanced degree is not going to hold back strong engineer employees.<br><br>", "<b>Username: circuitrider</b><br><br><br>\"\"<br>And there are many opportunities outside engineering firms for engineers.<br>\"\"<br><br>Yes, and for about the same salary as a computer programmer.<br><br>", "<b>Username: Trixy34</b><br><br>@akin67 - Thank you so much for sharing your experience with the 3+2 program.  I don’t mean to hijack the conversation, but may I ask, if you know, what the financial aid situation is like when a student does the 3-2 program?  Is the tuition and financial aid decision made at the engineering school, or is it Hamilton rates and financial aid for the whole 5 years?  I ask because I believe my son would be eligible for much more aid at one of the schools in the program, but I would like to see him get the writing/communications enrichment that Hamilton offers.  Unfortunately, though, I think Hamilton is going to be unaffordable for us - definitely would be at 5 years.<br><br>", "<b>Username: akin67</b><br><br>@Trixy34 For the first 4 years it will be the FA from the LAC. The first year of Dartmouth gets treated as a study abroad year. In Hamilton’s case, the cost of attending Dartmouth was about $3K more, so we were responsible for the additional $3K. In the 5th year of the program the student becomes a Dartmouth student where they are then subject to Dartmouth FA. Just want to point out that the curriculum at Hamilton is definitely challenging and will prepare your son well to take on the challenges at Dartmouth, perhaps better than some of the other schools. My son was able to get waived out of two courses and ended up taking more advanced alternatives at Dartmouth. I don’t know the reason for this but it seems, at least for now, that more students pursue this program from Colby, Skidmore and Vassar than from Hamilton. Best of luck to your son.<br><br>", "<b>Username: gointhruaphase</b><br><br>@Waitwhatss,<br>These are three good schools, but IMHO good schools do not train for high paying jobs.  They train your brain.  The risk of going to a school that trains for a job is that the skills you learn will become obsolete in ten years.<br>Also no school is going to get you a job, let alone a high paying job.  That is up to you.  While there are certain majors that tend to pay more after graduation, the simple fact that you graduate in that major doesn’t mean you will get a high paying job.<br>I know it is difficult, but look at salary and compensation over the long run, not for the year after you graduate.  Try to figure out what you like to do.   Chances are you will make much more money over your career in a field that you love than in a relatively high paying field that you don’t care for.<br>This probably doesn’t help choose a school.   Once you have determined the financial aid angle, how about choosing the school you like the best.<br><br>"]}