{"title": "need help selecting emory vs carleton vs bowdoin vs davidson fa is a factor", "comments": ["<b>Username: stevestar888</b><br><br>Alright, I’ve been browsing this forum long enough, and now I’d like some input. These are my options right now (the $ on the right is cost of attendance).<br>Amherst accepted    $45,590.00<br>Tufts   accepted    $28,542.00<br>Carleton    accepted    $21,997.00<br>Bowdoin accepted    $21,850.00<br>Emory   accepted    $19,004.00 (Also got into their Oxford side campus)<br>Davidson    accepted    $14,701.00<br>Also waitlisted @ UPenn, Vandy, WashU, Rice, Swarth, Brown, Duke, Brown, Olin (Really liked OLIN!!!)<br>For some context, my family would comfortable paying around $20,000 a year - any more would cut into my parent’s retirement which I really don’t want to do. I would like to study Computer Science but I also like History - want to do double major at the moment.<br>So my feasible options are Carleton, Davidson, Bowdoin, and Emory. Amherst and Tufts are too expensive, but I’m appealing Amherst right now.<br>I know that Carleton’s sciences is stronger than Bowdoin, but I also know that Bowdoin has many alumni connections at tech companies. I went on Bowdoin’s flyout in the fall and I really liked the campus and the people. I was going to ED but my family was scared about finances. I also went on Davidson’s fly out, but I didn’t like the D1 athletics / bigger presence of greek life very much. However, it is a really nice LAC and it’s cheaper too. But maybe they are front loading? Didn’t get a chance to visit Carleton but I heard it’s midwest friendly which I’m a fan of.<br>So two big questions.<br><br>thoughts on which college I should choose?<br><br><br>do you think these LACs will give me a generous package freshman year only to give less the next few years? And my family's income will go about a decent amount up next year so any way to lock the package in?<br><br><br>", "<b>Username: frozencustard</b><br><br>What are your interests?  You mention science and technology.<br>If you were going to ED at Bowdoin and really enjoyed it and the money came in at a good spot, then you can’t go wrong with that and it’s a great school.  I would have defaulted to Emory for strength in sciences (they won’t reduce your aid), but nothing in your original post indicates that you visited Emory or Oxford or know that it would be a fit for you.  You seem intrigued by Carleton.  Any way you could get out there for a visit?<br><br>", "<b>Username: alooknac</b><br><br>When comparing FinAid, you need to separate out need based aid from merit. Need based aid, anywhere, is going to change with changes in income.<br>Merit is usually renewable. Call the school to verify. Find out what GPA you need in order to keep a merit scholarship. Just because you had good grades in HS, don’t assume maintaining a 3.5 at a high-ranked college will be a slam dunk. A requirement for 3.0 or 3.2 would be a better option.<br>If you study abroad, will the scholarship follow?<br>You can ask the school if all the aid is good for 4 years. Ask if it will increase if(when) tuition increases.<br>That’s a great package from Davidson, and if you like it “well enough,” it would be a good choice. There’s a lot to be said for not being strapped financially, having money for travel costs, etc. I believe you will find that Davidson’s retention and graduation rates are less than ideal. While I don’t think you will become a statistic, it does have an effect on other students when 20% of the student body doesn’t come back sophomore year.<br>Carleton and Bowdoin are in another league altogether, and if you get good answers about your FinAid and your family is OK with the financial stretch, I recommend going with one of them. I think you will find very high retention and graduation rates as well as education of the highest caliber.<br><br>", "<b>Username: nehiker</b><br><br>I’m going to suggest that you seriously consider Tufts taking into account that it is strong for Computer Science (it has a School of Engineering) while I believe that the others are not that strong.  I know it is over the $20K, but for an extra $8K it seems like the best option for you.  Your parents would need to come up with an extra $40K or so which is not a big bite from a retirement nest egg. Does you COA include your student loans?<br><br>", "<b>Username: ScooterDee</b><br><br>Consider how you feel about winter and snow. Bowdoin winters are long, snowy and cold while Tufts, Amherst and Carleton will be about the same. Emory and Davidson have a much different climate.<br><br>", "<b>Username: barrons</b><br><br>Davidson has great and tough academics and nicer weather. Friend had daughters go there and Vandy and said Davidson was much tougher school.<br><br>", "<b>Username: stevestar888</b><br><br>@frozencustard<br>I’d like to study CS & History<br>I think in this month my family will try to make some visits. If I had to choose between visiting Carleton and Emory/Oxford, what should I choose?<br><br>", "<b>Username: stevestar888</b><br><br>@alooknac<br>Mmm good points about GPA, study aboard, and tutition increase. I’ll follow up with those schools.<br>Emory gave me all merit aid. all other schools give all need aid.<br>I just checked the USNWR data for Davidson’s retention rate and it said 95%. Did Davidson have an anomaly last year?<br><br>", "<b>Username: intparent</b><br><br>Ask Carleton if they will help cover your expenses to fly there for accepted student days.<br><br>", "<b>Username: stevestar888</b><br><br>@nehiker<br>When I flew out to Tufts, I really liked the campus but it didn’t feel like a typical LAC. I do know their CS / Eng is super strong, though, so I’m sure I’d fit in.<br>But I’m not sure if 40k is worth it. The COA could go up for all I know so I’d like to play conservative if possible<br><br>", "<b>Username: MA2012</b><br><br>If you got accepted at Emory I would choose that over Oxford campus unless you were drawn to the 2 year program and smaller campus for some reason. It is a larger research university compared to the rest of the schools on your list that are LACs. You can take some classes at Georgia Tech while at Emory.<br>Have you visited other schools on your list?<br><br>", "<b>Username: Publisher</b><br><br>Emory because it is all merit aid & you can take classes at Georgia Tech.<br><br>", "<b>Username: srlilly</b><br><br>@alooknac  Just curious about your source for Davidson’s retention rate.  According to its common data set, the student retention rate is 95%. Am I missing something?<br><br>", "<b>Username: stevestar888</b><br><br>@ScooterDee<br>I lived in Sioux Falls, SD for a good number of years so I don’t mind the snow and cold.  It might change the social dynamic though… any idea about that?<br><br>", "<b>Username: rosered55</b><br><br>My younger daughter graduated from Carleton a few years ago.  She and her friends, including some who majored in comp sci, got good jobs after graduation.  Minnesota’s economy is good, and Carleton is close to the Twin Cities, where there are many job possibilities.  My daughter’s financial aid decreased as our family income increased, but I expected that; we had high need and the school was very generous overall.<br><br>", "<b>Username: stevestar888</b><br><br>@intparent<br>$250 refund! decent I think right!?<br><br>", "<b>Username: happy1</b><br><br>Sounds to me that Bowdoin was always your top choice and it came in at a do-able cost.  I’d go with that and never look back.<br><br>", "<b>Username: Muad_dib</b><br><br>Interesting that the colleges in your top list all “meet 100% of need”, yet you get wildly different COAs. I’m especially surprised by Amherst, which is supposed to be great with financial aid.<br>All great choices.<br><br>", "<b>Username: stevestar888</b><br><br>@MA2012<br>In the fall I visited bowdoin, davidson, and tufts.<br>The Emory merit aid is attractive. so is the thing with Georgia Tech hmm… would a 3.2 gpa be hard to maintain?<br><br>", "<b>Username: stevestar888</b><br><br>@Muad_dib<br>Yea I wasn’t too flattered by Amherst’s offer! eek! I sent an appeal to them but they said we need to see your parent’s 2017 taxes…<br>It might be because my parents have a business. colleges may interpret the income from that source in different ways.<br><br>", "<b>Username: prezbucky</b><br><br>This is a juicy choice. I think these are relative peers. Davidson’s academics are not as well known as the other three, but somehow they hang around the top 10 of USNews, so they must be doing several things right.<br>Here are my impressions of each school. Some of this will be “Captain Obvious” stuff, but even rhetorical info can help inform your idea of how well a school fits you:<br>Carleton<br><br>Lots of work. Quite the intellectual vibe.<br>Cold winters – at least as cold as Bowdoin and probably colder.<br>45 minutes or so from the Twin Cities<br>Probably the top LAC, in terms of academic strength, in the Midwest.<br><br>Bowdoin<br><br>Old school prestige.<br>Very good academics and support.<br>Maine playground surroundings.<br>Flat campus.<br><br>Emory<br><br>The lone U in this quartet – more course and major options, but larger classes.<br>Much warner winters, and hotter/more humid summers, than the MN and ME schools.<br>Atlanta offers a lot to do.<br>Also strong academics.<br><br>Davidson<br><br>Rural(ish), but like Carleton, an easy drive away from a city.<br>Also warmer than MN and ME<br>Happy vibe<br>Unlike the other three, has some D1 sports programs<br>Said to have strong academics, but not yet the academic rep of the other three. (but that ranking will help in that regard)<br><br>If you are serious about CS, I would scout these schools’ course catalogs to see what they offer. If it’s History, they’re all going to be solid.<br><br>", "<b>Username: frozencustard</b><br><br>@stevestar888 Do you have a choice between Emory College and Oxford College?  The Oxford thing is not for everyone.  You go to a school for two years at a remote college 40 miles out and then move to the Emory College campus for your junior year.  If Emory College, that would be my choice and it’s a very good experience going to school in a different region.<br><br>", "<b>Username: stevestar888</b><br><br>@prezbucky<br>Nice summary! If i had to try conclusions, I’d say about the same.<br>I’ll start taking a look at those catalogs. that’s a really good idea! thank you!<br><br>", "<b>Username: stevestar888</b><br><br>@frozencustard<br>I do have the choice. Although I like the smaller classes/liberal arts-y feel, you’re about it not being for everyone. not sure how i’d feel changing schools after 2 years.<br>Hopefully I can decide if I make a visit!<br><br>", "<b>Username: prezbucky</b><br><br>If you did Oxford for two years you’d get the LAC experience and then finish up at the U (Emory), for a sort of hybrid education. Moving might be a pain in the rear, but you’ll likely move at least once during your four years anyway. (albeit not 40 miles or however far it is from Ox to Em)<br><br>", "<b>Username: alooknac</b><br><br>My apologies on Davidson. I was working from memory and very much in error. I still consider Bowdoin and Carleton slightly higher caliber but completely take back my comment about “in another league altogether.”<br><br>", "<b>Username: stevestar888</b><br><br>@prezbucky<br>you’re right… ox + em would be a mishmash of the best of both worlds but I still think I’d miss the traditional LAC experience of Carleton / Bowdoin / Davidson<br>idk! it’s a confusing time<br><br>", "<b>Username: prezbucky</b><br><br>Well the more you read, the clearer it should become. You can take heart in the fact that you really can’t make a wrong choice – they’re all really good schools with plenty going for them.<br>If you feel you’ve made the right choice, chances are it will become the right choice. Such is the importance of positivity in life.<br><br>", "<b>Username: stevestar888</b><br><br>@prezbucky<br>Man those are great words that every senior needs to hear right about now!<br>Thank you!!<br><br>", "<b>Username: frozencustard</b><br><br>@stevestar888 Your visit to Emory will be a deciding factor here.  Despite an Atlanta address, Emory is suburban and pretty insulated and enclosed and a community to itself.  You will see when you get there.  If you still aren’t feeling it, then you will know it soon and decide among your three LAC choices.  I agree that you really can’t go wrong here, but that still doesn’t make this any easier.<br><br>", "<b>Username: ColdinMinny</b><br><br>You are blessed with some wonderful options.<br>I can add to this discussion that Carleton has a terrific CS program, absolutely top drawer for a LAC.<br>The bottom line is that you are going to get an excellent undergraduate education at all 4.  So where do you want to live the next 4 years, and what do you like to do outside of class?  Maine v. Minnesota v. Atlanta v. NC all offer much different environments, climates and opportunities for fun and recreation.<br>If you loved Bowdoin, and are satisfied with the academics in your areas of interest, send in your acceptance and go ahead and enjoy you last free summer in your life!<br><br>", "<b>Username: momcinco</b><br><br>Great options here!  Please be sure to let us know your final thoughts.<br>You are also on a lot of waitlists, my goodness.  That might even add to the twists and turns of your story!  Not probable, but possible.<br><br>", "<b>Username: stevestar888</b><br><br>@frozencustard<br>you’re right. the “feel/fit” factor is the biggest thing at play now, and a visit can best help determine that!<br><br>", "<b>Username: domarge</b><br><br>I am a Bowdoin graduate (it’s been a long time, but I keep fairly up to date; just had a reunion, and everyone was saying “how did I ever get in here”?).  Every school you list is fabulous, and you’re lucky to have so many choices.  But Bowdoin is special in its alumni dedication.  It inspires tremendous giving (that’s how I was able to go there–my family was poor) and loyalty.  It has a terrific endowment.  I perceive (there is no doubt bias here) that the students are a tad more down-to-earth than at Amherst.  The food is amazing, and so are the dorms.  You can go abroad if things start feeling small.  You will be taught by full professors (as at several of your other choices). The weather is…Maine.  You have to be able to like or ignore cold weather.  I don’t love winter weather, but it’s part of life in the Northeast.  The seacoast feeling is lovely, and Brunswick is a pretty and friendly town. Portland is close, Boston not too far.  I guarantee Minnesota is harsher, weather-wise.  I have visited Emory.  It is quite dissimilar than the LACs you mention.  It’s a university, with all that affords–more people, courses, bureaucracy, choices…but I suspect if you do well at any of these schools, grad acceptances would be forthcoming.  You need to decide if the southern, northern, or midwestern vibes are strong enough to sway you.  Go U Bears!<br><br>", "<b>Username: warblersrule</b><br><br><br><br><br> domarge:<br>\"\"<br>But Bowdoin is special in its alumni dedication. It inspires tremendous giving (that’s how I was able to go there–my family was poor) and loyalty.<br>\"\"<br><br>I’d add that LACs in general excel at inspiring alumni loyalty. 9 of the top 10 schools for alumni giving are LACs, including all three of OP’s LAC options. The average alumni giving rates for 2013-14 and 2014-15:<br>63% Princeton<br>58.6% Thomas Aquinas<br>55.8% Williams<br>55.7% Bowdoin<br>52% Davidson<br>51.7% Wellesley<br>50.9% Middlebury<br>49.8% Carleton<br>48.9% Washington & Lee<br>47.9% Amherst<br>https://www.usnews.com/education/best-colleges/the-short-list-college/articles/2016-10-18/10-universities-where-the-most-alumni-donate<br><br>", "<b>Username: J2H239</b><br><br>@stevestar888, congrats on your outstanding achievements. In consideration of your biggest concern of need- and/or merit-based financial aids (FA) in attending college, you probably go to Emory due to the merit based money. Need based FA will be throughly reevaluated by college you attend every year. It seems that you will very likely get less and less FA in your sophomore and beyond due to the substantial increased incomes of your family as stated by your Mom in another discussion. Good luck!<br><br>", "<b>Username: J2H239</b><br><br>@stevestar888, just went through your old posts. Indeed, Amherst has already sensed the signficant increased incomes of your family in 2017. This is probably why Amherst asked your parents 2017 tax return, which is not necessary/mandatory for 2018-2019, but is definitely for 2019-2020.<br><br>", "<b>Username: stevestar888</b><br><br>Alright, thank you everyone for adding in to the conversation.<br>I’ll be visiting Carleton and Emory later this month so I’ll have had visited every single place!<br><br>", "<b>Username: stevestar888</b><br><br>Alright. From<br>A- Amherst<br>B- Bowdoin<br>C- Carleton<br>D- Davidson<br>E- Emory<br>(I’m a true test taker!)<br>I am Bowdoin College class of 2022. Many thanks to everyone. The decision was hard (I had the information on Davidson’s website ready but just couldn’t press the submit button) but I hope it all works out.<br><br>", "<b>Username: AlmostThere2018</b><br><br>Thanks for letting us know.  You had a lot of great choices – you trusted your gut, and I’m sure you’ll do great at Bowdoin!!!  <br>[That said, since my D. is #Davidson2022 I have to end with a small Go Cats!  <br><br>", "<b>Username: privatebanker</b><br><br>Buy a lot of winter clothes and enjoy your time there!<br><br>", "<b>Username: frozencustard</b><br><br>@stevestar888 You went about this the right way.  You decided the best school for you based on visits and determined the best fit.  Too many are concerned with the best program when all are close and it won’t matter that much either way.  All of your choices can or would get you to the same place at the end of the day and that is all based on how well you do wherever you go.  Again, congratulations.<br><br>"]}