{"title": "northwestern vs rice", "comments": ["<b>Username: college1114</b><br><br>Hi, I’m trying to decide between NU and Rice. Chicago I think is better than Houston, but Rice weather is better than NU. I like that everyone at Rice is in a residential college system and that it’s smaller, but I like that NU has better school spirit and seems like a better environment. I’m most likely going on a premed track, and from my research they seem pretty even in academics. Any thoughts on which school would be better?<br><br>", "<b>Username: prezbucky</b><br><br>I think Northwestern is a little bit stronger academically overall – very strong in STEM, social sciences and the humanities. Rice is known for its strength in STEM but I’m not sure it’s quite as strong as Northwestern elsewhere. That said, I’m sure Rice is adequate in the non-STEM areas. Assuming you plan on majoring in a STEM field, small differences in quality elsewhere might affect your electives but your major studies will be top-notch.<br>Is there a notable difference in cost? It sounds like you like them about equally.<br><br>", "<b>Username: college1114</b><br><br>There’s not much of a cost difference, which just makes this decision harder haha. I do want to have the whole college experience of parties, athletic games, good friends, and a nice environment in addition to strong academics. I’m not sure which would be better for the overall college experience. I feel like I’d have more opportunities at NU being near Chicago, but the Texas Medical Center is also right across from Rice. It really is pretty even between the two for me, and I’m hoping to get some comments to help sway me a little. Also, I know rankings mean nothing, but based on Niche, Rice seems to have an edge on NU for student life, professors, etc. but NU seems<br><br>", "<b>Username: college1114</b><br><br>NU seems more well known (sorry my post got cut off)<br><br>", "<b>Username: juillet</b><br><br>I don’t think being near Chicago will give you more opportunities than being in Houston. Houston is a major city; it’s the fourth largest city in the United States (right after Chicago, actually!) and health, medicine, and biomedical research are  big drivers of Houston’s economy. I’d say your opportunities are roughly equal, at least in any sense that would matter to an undergrad. Rice does a lot of research and is located right next to the Texas Medical Center - but there are lots of other industries in case you change your mind.<br>I’ve only been briefly in both cities but it’s been my experience that moving around Chicago without a car is far easier than getting around Houston without one.<br>If you want something closer to the stereotypical “traditional” college experience - parties, big sports games, school spirit in spades - Northwestern is probably more likely to provide that, at least superficially. But in actuality, the “college experience” varies a lot from school to school and even from person to person. There are definitely people at Big 10 schools who haven’t attended a single sports game and don’t care a whit about sports. And college students everywhere like to party and make good friends, so you can find that at Rice, if you want!<br><br>", "<b>Username: Publisher</b><br><br>If cost is equal, then this is a personal decision. Go with your heart as both are very prestigious schools with brilliant, accomplished and, most importantly, hardworking, ambitious students. Congratulations !<br><br>", "<b>Username: SatchelSF</b><br><br>Houston &gt; Chicago, and this will only grow over the next 30 years.  Rice is also in the nicest part of Houston proper.<br>As for prestige, I think it depends on who (and where) you ask.  There is no question that while both schools’ reputations have increased dramatically over the last 30 years, I’d say that Rice’s has improved more on a relative basis, especially in the South and West of the country.<br>Congrats - you really can’t go wrong with either, but I think I’d lean Rice for most fields of interest.<br><br>", "<b>Username: Publisher</b><br><br>Interesting post by Satchel. I couldn’t disagree more. I have never, and would never, rank Houston above Chicago for anything beyond oil production and uncomfortable humidity.<br>But, even so, it is a personal decision.<br><br>", "<b>Username: Houston1021</b><br><br>Can you visit both schools for admitted student events before you decide? Both have gorgeous campuses. NW is on the lake while Rice is in the museum district of Houston. Rice will have nicer (not brutally cold) weather in the winter/spring, but NW will have nicer (not brutally hot and humid) weather in the summer/fall. NW has Greek life while Rice does not. Rice has the residential college system. Both have division 1 sports. NW has good spectator sports atmosphere while the Rice students mostly ignore the sports teams. Both are terrific schools.There are plenty of parties at both schools.  You can’t go wrong with either choice.<br><br>", "<b>Username: StanfordGSB00</b><br><br>@college1114 - both are great schools. But, the unfortunate truth is that Rice’s great reputation in Texas doesn’t travel to the to the coasts well. In NYC (arguably, the world’s capital), you will often get a blank stare when you tell someone you went to Rice. And yes, this is even among a lot of educated people. As one of my good friends went there, I have great respect for the school and its students / alumni but the reality is that it is considered more of a regional school in the NE and on the West Coast. The reasons for the less than expected footprint is its lack of well known grad programs (Law, Medical, Business, etc) and its smaller class size that was historically 50%+ Texan. This means there are very few Rice alumni on the coasts. Rice is unquestionably a great school but Northwestern is on another level in terms of reputation, name recognition and general prestige. You have a ton of Northwestern alumni in New York, LA, SF, Chicago, etc. If you can endure a Chicago winter, then I think Northwestern should be the clear winner here. Also, Northwestern has significantly more geographical diversity - it has more students from California, New York, NJ, Texas and Florida in one class year than is the total size of Rice. And that combined with its Big 10 sports, very large endowment, top grad programs (Kellogg, Feinberg, Law School) and successful alumni across industries (Colbert, CEO of IBM, etc.) make it more of a well known name. Northwestern is the ‘safer’ decision here given its more established reputation across disciplines.<br><br>", "<b>Username: Boothie007</b><br><br>Northwestern<br><br>", "<b>Username: robotrainbow</b><br><br>I beg to differ that northwestern is better known on the east coast then Rice. Northwestern is a mid west school. I went to Penn. I applied to Washington university. Knew of u of Chicago and Notre Dom but even when my kids applied didn’t really know anything about northwestern. Being from New Jersey I knew North Eastern, always got them confused. Rice I was always vaguely aware of because of its connection to NASA and to Kennedy and to science in general. I know that’s just me but I am not that unique. I just went through two rounds of college for my kids neither had northwestern anywhere on their radar and I don’t think anyone from their high school applied and HS sent multiple kids to the ivies every year. A good friend of my daughter got a full ride at NorthEastern and other kids applied there.Anyway I think Northwestern is even more known mainly in its region then Rice.<br><br>", "<b>Username: Publisher</b><br><br>I assure you that Northwestern University is very well known & very well respected on both coasts by major employers.<br>Confusing Northwestern with Northeastern speaks for itself.<br><br>", "<b>Username: StanfordGSB00</b><br><br>I can assure you that the opinion of @robotrainbow is not reflective of reality. If you look at her post history, her child enrolled at Rice – so some obvious bias there. And confusing NE with NU is analogous to confusing Penn State with Penn, which doesn’t happen among educated people. Look at the top NYC private prep schools / New England private prep schools / CA private prep schools like Harvard Westlake where these students largely can choose wherever they want to go and Northwestern will be in the top 10-15 most represented schools. Rice will not be found. Also, look at the top 10-15 feeder schools to the top MBA programs, and you’ll see Northwestern there. Look at Columbia, HBS, Wharton, Stanford, etc. Rice - no where to be found. Also, look at the incoming Investment Banking analyst classes in NY at the top banks - Northwestern will have a few analysts. Rice may have some students at the Houston offices but usually not in NY. Rice is a great school. But, it’s reputation just isn’t that strong on the coats. And considering that Northwestern is more selective / has higher test scores than Rice and AND has more students from NY and NJ in its freshman class than Rice’s entire freshman class (including Texas), I would beg to differ that Rice has a stronger reputation. Not even close.<br>Look at Dalton (one of very top private prep schools in NYC) -<br>https://www.dalton.org/page/programs/high-school/college-counseling<br>Look at Harvard MBA top MBA feeder colleges -<br>https://poetsandquants.com/2011/08/15/top-feeder-colleges-to-harvard-business-school/<br><br>", "<b>Username: WildestDream</b><br><br>Won’t make a difference for medical school admissions. I think Rice and NU are very similar for undergrad…with the exception NU follows a quarter system. NU is also part of the Big 10 if this interests you.<br><br>", "<b>Username: Kevin308</b><br><br>I find it interesting that the arguments for Northwestern are based around NBA and banking when the kid wants to do premed.   The are both very prestigious  school A two of the beat in the country anyone who says otherwise isn’t being honest with you.   I would Visit both and decide that way don’t let people’s  bias influence your decision<br><br>", "<b>Username: osuprof</b><br><br>A website called college transitions has compiled list of top feeders (defined by percentage of undergraduate class enrolling) to the top 14 MBA programs, top 14 law schools, and top 10 medical schools.  NU features in the feeders for top 14  business and law programs, Rice does not.  Rice features in the list of top medical school feeders, NU does not!<br>For what it is worth … the data is compiled from linked pages and probably isn’t complete. Moreover, the data could indicate self-selection above anything else (more NU students are inclined towards business and law, or for other options, whereas more Rice students are inclined towards medicine).<br><br>", "<b>Username: theloniusmonk</b><br><br>“I would Visit both and decide that way don’t let people’s bias influence your decision”<br>Well the OP asked for opinions which would mean our biases, otherwise he would have just visited and not posted this question.  Anyway, I concur that for pre-med they’re about the same, but for other programs NW is better. This would matter if the OP switched majors or wanted to add a minor an unrelated field, say economics or international relations.  In that case, NW probably has more well-regarded programs.<br><br>", "<b>Username: Idaho_Father</b><br><br>@college1114 : 2 great schools; what a fantastic position to be in!  These are 2 of my HS jr daughter’s favorites. Have you gotten feedback on the relative ease of doing research as an undergrad at both? NU is more than twice as big enrollment wise, so assume you’d have more competition for research work–but would be good to check and confirm.<br>Average class size at Rice is notably smaller than NU, so seems like that’s something to weigh.  Some other things to check on would be the number of students declaring pre-med at each school, who your advisor(s) would be and their background/experience.  Re’ the latter, if you were able to talk to each school’s advisor and ask some open-ended questions, that could be really helpful–beyond their relative success as a “feeder” into med school.<br>Congratulations on gaining admission to both of these schools; what a compliment to your hard work and preparation!<br><br>", "<b>Username: coolguy40</b><br><br>Do you have a way to pay for them?  If you’re planning to do medical school, some of your med school loans will likely be from private lenders and too much undergraduate debt could jeopardize your ability to finance your schooling.<br><br>", "<b>Username: am61517</b><br><br>Two terrific universities which are reputationally relatively similar! Go where you feel the fit is best.<br><br>", "<b>Username: lionking973</b><br><br>For premed rice seems like a no brainer. A lax and collaborative environment with grade inflation and a 90 plus percent acceptance rate into med schools. Northwestern is great but for premed rice seems so much better.<br><br>", "<b>Username: Mastadon</b><br><br>@stanfordgsb00 -<br><br>\"\"<br>And confusing NE with NU is analogous to confusing Penn State with Penn, which doesn’t happen among educated people.<br>\"\"<br><br>And not realizing that the notion of “feeder colleges” is logically flawed shouldn’t happen among educated people - but unfortunately it does…<br><br>", "<b>Username: robotrainbow</b><br><br>https://talk.collegeconfidential.com/profile/StanfordGSB00. Actually I am a graduate of Penn. Don’t know if that makes me educated or not. Sometimes I wonder. With a philosophy degree none the less. Maybe I am just paying back all the Penn Penn state I’ve run into.<br>Northwestern is a great school by all account, just I knew nothing of it when I applied to college and my daughter knew nothing about it when she applied and even though her high school has students in all the ivies I know of none that applied to northwestern or to have ever mentioned it.<br>I am not claiming that northwestern is not a great school, as i said I know little of it. I just maintain that Rice is not a more regional and less nationally known school then northwestern.<br>Northwestern is a larger school so it would be quite plausible that it has a larger alumni network. Both are great schools. Hopefully the original poster will find one to be a better fit. Climate, size, location hopefully will help.<br><br>", "<b>Username: Sunny66</b><br><br>I think Northwestern is more well-known since it (1) has been an elite university for a longer period of time, and (2) has bigger-time sports. Having said that, grad schools and well-educated people likely would hold both schools in similar regard. And I think the prestige gap between the two is small and is closing. I personally would prefer Rice due to smaller size and lack of Greek life. As a lesser factor, I also would prefer the whether at Rice during most of the school year (though not the summer). For pre-med, I have heard Rice is outstanding.<br><br>", "<b>Username: ferpmerp</b><br><br>Rice has a much lower global ranking than northwestern which means in a broader frame of comparison the undergrad/grad at rice is probably not as prestigious. You will have an advantage applying to Texas med schools from rice tho.<br>Both schools have really high med school success rate, but that’s skewed by the fact that a large amount of people who enter as premed do not stick with premed, meaning that the population represented by these proportions is already the hardest working portion of the students there, making such statistics less predictive of your own success than they may seem.<br>The point is, I think that you should value flexibility over the minor differences in prestige or outcome stats. Being a premed now doesn’t mean you’ll be a premed in a year or two and backup majors are essential. The quarter system at northwestern offers you more opportunities to explore your interests and take more classes, allowing you to double major or or get a minor in one of the many areas of study offered at NU.<br><br>", "<b>Username: CU123</b><br><br>Toss up.  Which city do you like better, albeit NU is well north of Chicago in Evanston.  Rice is definitely in Houston.<br><br>", "<b>Username: CupCakeMuffins</b><br><br>Their selectivity, ranking and academics are at pretty much same level. You can’t go wrong with either. NU’s tuition is slightly higher but its better known. NU’s undergrad population is 8,500, while Rice has less than 3,800 undergrads so it depends if you prefer close knit community or a bigger one. Rice is warm and NU is cold so depends upon your personal preference. Do you want to wear shorts in December or jacket in April? NU has great sports scene. Rice has residential colleges. NU has graduate schools, Rice is across the street from tons of places to do internships. Did you get merit or aid at either college? That may make one a better value than other.<br><br>", "<b>Username: college1114</b><br><br>@CupCakeMuffins it’s cheaper for me to go to Northwestern actually which is surprising<br><br>", "<b>Username: privatebanker</b><br><br>Northwestern less expensive is rare combination.  Run with it.<br><br>", "<b>Username: Boothie007</b><br><br>Northwestern no-brainer<br><br>", "<b>Username: CupCakeMuffins</b><br><br>@college1114 Awesome!! You can decide without a care for money. Good for you. Is it merit or financial aid?<br><br>", "<b>Username: CupCakeMuffins</b><br><br>My kid’s GC sent something you may want to read. “Rice is the only university in the world that combines the best aspects of a small, intimate liberal arts college like Amherst or Williams with those of a major research university like Harvard or Stanford. Dartmouth College is much bigger than Rice, yet puts out only a tiny fraction of the research that Rice does. Princeton University has fewer National Merit Scholars than Rice (even in absolute numbers), yet is overrun with nearly 2000 more students overall. Because Rice is so small but the faculty conducts such large amounts of research and development, undergraduate research is available to a greater percentage of students at Rice than at any other major university. Rice University has a higher endowment-per-student than any schools save HYPS.”<br><br>", "<b>Username: ThankYouforHelp</b><br><br>@CupCakeMuffins I think Princeton, UChicago, and Yale also provide the best aspects of an LAC and a research university.  But Rice is great.<br>Also, your facts on endowment are not correct.  The next schools after HYPS in endowment per student are Amherst, Williams, Pomona, Swarthmore and MIT.  Rice is 13th overall.<br><br>", "<b>Username: CupCakeMuffins</b><br><br>I stand corrected. Thanks @ThankYouforHelp<br><br>", "<b>Username: Publisher</b><br><br>These are both outstanding universities. Please visit both before deciding.<br><br>", "<b>Username: privatebanker</b><br><br>Not much time left to visit<br><br>", "<b>Username: SREE33</b><br><br>Just go with your gut! I think you can succeed anywhere, and both schools have good premed opportunities. Northwestern might have better sports if thats your gig.<br>Rice does have the reputation of “Happiest Students” which is crucial for your success! (I would have gone to Rice of NU if only I didn’t get rejected lol)<br>Rice also may have more inflation than NU, which can benefit you for premed. And if you want to go to Texas for med school (if your parents move or you get residency there) it is really cheap.<br>Anyways, it is great to have such good options, and both schools have marginal differences. Hopefully you visited but if you didn’t just try to choose by:<br>cost, weather, location (since the academics are pretty much the same), semester vs quarter, residential colleges vs frats, etc…<br>Good luck!!!<br><br>", "<b>Username: IWannaHelp</b><br><br>Another vote for going with your gut! Both are outstanding schools for undergraduates. It won’t make much difference for med school admission. If it’s true that Rice has more grade inflation, it may be better to be a premed there.<br>@robotrainbow<br>I understand that NU is not known to you and it’s easy to generalize based on your own experience. However, people with experience with law schools (T-14 law schools), business schools (consistently top-5), economics programs (consistently top-10 with 4.9 out of 5.0 in PA score), performing arts or journalism would likely know Northwestern. That’s covering a lot of people already even at the undergrad level since econ is usually the most popular major. You mentioned science with Rice; NU actually outranks Rice in most science disciplines and has one of the best chemistry departments in the world. Like it or not, reputation is closely related to graduate programs; when two schools are of the same type (mid-sized private research in this case), the one with better graduate programs by a good margin is going to have more national reputation. There are exceptions such as being an Ivy or an elite Catholic but neither applies to Rice.<br><br>", "<b>Username: Faulkner1897</b><br><br>I don’t know much about Northwestern (other than its high level reputation), as I have never visited and neither of my kids applied. I know quite a bit about Rice; I am an alum and my daughter was accepted into the Rice Class of 2022 and will be attending.<br>Here is some info on Rice, if you want to assess whether it is a fit:<br><br>research university with a distinctive commitment to undergraduate education; about 50% STEM, 50% humanities/social sciences<br>just under 4000 undergraduates<br>happily nerdy student body<br>very community focused, and many systems in place that support students and tight knit community - residential college system in particular<br>diversity is part of the Rice experience and mission; Rice seeks students who come from many different backgrounds and students who are comfortable with people from all different backgrounds<br>collaborative, supportive environment<br>A philosophy that “we are all in this together”; Rice is known for its “culture of care”. This is so important to Rice because Rice wants its students to continue care strongly about other people as they go into the world<br>Rice students and graduates are committed to making the world a better place<br><br>As mentioned in this thread, the location across from the Texas Medical Center is ideal for pre-meds. Undergraduate research is big at Rice. I just read an article about the three 2018 Goldwater Scholars at Rice this year. Lots of incredible things going on at Rice!<br>Another thing going on at Rice that many don’t know about is the focus on leadership skills for undergraduates. The Doerr Institute for New Leaders is available to any undergraduate who wants to develop their leadership skills. Take a look at the video: https://doerr.rice.edu<br>Good luck to you as you make your decision!<br><br>", "<b>Username: prezbucky</b><br><br>OP, please let us know which you chose.<br>Did you go with Evanston/Chicago and the overall academic machine that is Northwestern, or Houston and the smaller feel of Rice?<br>We spend days and weeks in these threads and half the time the OP doesn’t give us the result of our toil. It sometimes keeps me up at night, wondering. <br><br>", "<b>Username: Hapworth</b><br><br>About @robotrainbow not knowing about NU, despite being a Penn alum and also having gone through the college search with his daughter.<br>It’s possible.  I find it surprising, but I’ve seen other posts on these boards where people out east know Northeastern but not NU, or people who confuse the two.<br>Yes, most educated people know NU.  Also, a lot of people–educated or otherwise–know NU because of its affiliation  with the Big Ten.  There are a lot of college football fans.  There are a lot of NFL fans who may not care about the college game but sort of know that NU is a Big Ten school, Stanford is a Pac-12 school, Vandy is an SEC school, Duke is an ACC school (though Duke, of course, is much more known for its prowess in basketball).<br>I’m willing to bet dollars to doughnuts that @robotrainbow is not a football fan.  That’s not a knock.  Just a relatively safe deduction.<br><br>", "<b>Username: college1114</b><br><br>@prezbucky thank you everyone for your help and opinions! I know I would’ve been happy going to either of the schools, but chose NU over Rice because I fell in love with NU’s campus when I visited (even though it was snowing) and I think my premed experience won’t be any easier or harder at either of the schools. It pains me to turn down Rice, but I’m happy with the decision I’ve made!<br><br>", "<b>Username: Hapworth</b><br><br>Congrats!  Go Cats!<br><br>", "<b>Username: SREE33</b><br><br>Congrats and good luck!<br><br>", "<b>Username: sanjanagupta1</b><br><br>NU all the way… never judge ur college decision based on weather lol and NU has a better name and is better academically and is a “true” college town meaning it will have several opportunities + it has great sports, great city near it, great food and the campus is gorgeous<br><br>"]}