{"title": "nd mendoza vs ut austin mccombs vs uva", "comments": ["<b>Username: Winruss</b><br><br>My son is admitted in those three schools majoring in Business. We still unclear which one that fit to him. UVA and UT Austin are popular in my country, but Mc Intyre need 2 years to be admitted (uncertain). I dont know how is mc combs.<br>He is international student who want to work as Consultant such as Mc Kinsey, BCG, Bain in Chicago or NYC.  Anyone that can give insights? Thank you<br><br>", "<b>Username: PurpleTitan</b><br><br>No honors at McCombs, right?<br>If American, I would choose Mendoza. McIntire is too uncertain.<br><br>", "<b>Username: Winruss</b><br><br>What about UT Austin in term of opportunity to work as consultant in Big firm?<br><br>", "<b>Username: PurpleTitan</b><br><br>There would be a pecking order in terms of opportunities at UT-Austin:<br>BHP<br>Then regular McComb + maybe engineering/CS<br>Then other UT-Austin<br>And UT-Austin in general would be only a semi-target for MBB like ND. But at ND, Mendoza would be at the top of the pecking order.<br>If an International, you should look to work outside the US, anyway, even if MBB.<br>Outside the US, McComb and UVa/McIntire probably have stronger networks, but McIntire is competitive admissions.<br>McIntire would be the best if you can get in.<br><br>", "<b>Username: PurpleTitan</b><br><br>FYI, here are MBB targets:<br>https://talk.collegeconfidential.com/college-search-selection/1206919-which-schools-are-targets-at-the-top-3-consulting-firms-bain-bcg-mckinsey.html<br>https://www.wallstreetoasis.com/forums/mbb-the-target-school-advantage<br>In the US, MBB recruits more at the MBA level than from undergrad, so your son may want to aim for a good job out of undergrad first, then get in to a M7 (or at least top 15) MBA program and try for MBB then.<br><br>", "<b>Username: MYOS1634</b><br><br>I’d go with Mendoza. It’s guaranteed and it’s a top school with lots of opportunities. At McCombs the regular student comes after the BHP students and McIntyre is too risky.<br><br>", "<b>Username: Winruss</b><br><br>Thank you so much guys for the reply.<br>I have one more question, my son got a ‘wait list’ from NYU Stern but the decision will be on Aug 1st, is It worth to risk?<br>And how big is the chance to get admitted from the waitin list of NYU?<br>Is NYU Stern targeted by MBB?<br>Thanks before<br><br>", "<b>Username: PurpleTitan</b><br><br>Stern is more targeted for IB/finance.  For MBB straight out of undergrad, probably about as good as the rest (so not great). Risk of what?  You should accept an offer elsewhere before 8/1.<br><br>", "<b>Username: Winruss</b><br><br>Is it a crazy idea to study in Notre Dame for the first two years and transfer to McIntire for the other two years?<br><br>", "<b>Username: PurpleTitan</b><br><br>He can try to transfer in.  But he may not want to leave ND after 2 years.  ND has a very strong alumni network (in the US) and community.<br><br>", "<b>Username: MYOS1634</b><br><br>I doubt he’ll want to transfer from Mendoza (which is as strong as McIntyre in the us)<br>. He needs to deposit somewhere by may 1st and then can accept any wait-list. Odds of getting off the wait-list are very low.<br><br>", "<b>Username: Winruss</b><br><br>Thank you for the detailed replied guys, really appreciate it, and happy Easter!<br><br>", "<b>Username: Publisher</b><br><br>Because your son wants to study business, his only real options are Notre Dame & Texas. Then it becomes a personal choice as they offer significantly different campus cultures.<br>For the top three consulting firms, probably need 3 years work experience & then an MBA from a very top ranked MBA school (think M-7 or in that range).<br><br>", "<b>Username: Winruss</b><br><br>Thank you for the insight Publisher, and may I know why Virginia isn’t suitable for business?<br><br>", "<b>Username: Publisher</b><br><br>Only because your son is not a “direct admit” to the business major at Virginia.<br><br>", "<b>Username: Winruss</b><br><br>you mean Mc Intyre School of Commerce that will be admitted in Junior level?<br><br>", "<b>Username: MYOS1634</b><br><br>The issue is that it’s not \"will’ but “may”. It’s a lot of risk when you have two Business choices, one nationally known (Mendoza) and one excellent (McCombs, althought BHP has the upper hand over McCombs regular).<br><br>", "<b>Username: Winruss</b><br><br>Thanks MYOS1634. When I search in Linkdnt, it seems Mc combs has more in MBB compares to Uva and Mendoza.<br><br>", "<b>Username: MYOS1634</b><br><br>Remove the BHP graduates and compare again.<br>Also, make a student:MBB position ratio (take size into account - a per capita comprison matters also)<br><br>", "<b>Username: 678mom</b><br><br>Just wanted to share that DD is a graduating 4th year from UVA McIntire and in just her immediate friend group 1 has an offer from Bain, 1 has an offer from McKinsey and 3 have offers from Deloitte - so it is very possible to secure top consulting jobs without an MBA or 3 years experience. McIntire has been a fantastic experience for her, and I think UVA has a very unique program that truly prepares its graduates for professional work experience. It is extremely competitive to be admitted, so your son will need to be very focused on grades, extracurricular involvement, etc. the first two years. But it is very much worth it if admitted. Interestingly, my youngest son is choosing between Michigan and UT for computer engineering and we were very impressed with UT when we visited - McCoombs would be an excellent choice if you were concerned about having to apply to McIntire. Notre Dame might have more opportunities in the Chicago area if that is where he ultimately wants to work. All the best to your son - he has some wonderful choices!<br><br>", "<b>Username: Winruss</b><br><br>Thank you so much 678Mom for ur insightful input.<br>One more question pls.<br>Considering the tuition and living cost, ND is 25% more expensive than UT and 8% than Uva.<br>Should you are in my position as parent of international student, which school are you going to take? (although in the end we will follow what our son would like to take) thanks again!<br><br>", "<b>Username: Publisher</b><br><br>Sorry that I missed your last question. @MYOS1634 answered it in a clear & concise manner in post #16 above.<br>Without direct entry into a business school of a university, especially a highly competitive university such as the University of Virginia, it is too risky to compete for admission two years down the road when one has two direct admissions to outstanding business schools at major universities in hand. Accordingly, your real choices are between Notre Dame’s Mendoza & the University of Texas’ McCombs business schools.<br><br>", "<b>Username: PurpleTitan</b><br><br>@Publisher:  Actually, direct admission to one outstanding b-school in hand (Mendoza).<br><br>", "<b>Username: Publisher</b><br><br>If there is only one direct admission, then the choice is clear.<br><br>", "<b>Username: Winruss</b><br><br>@PurpleTitan what if the money become the factor here? As mendoza is 25% more expensive than Austin?<br><br>", "<b>Username: PurpleTitan</b><br><br>@Winruss, then you have to make a decision.<br><br>", "<b>Username: Winruss</b><br><br>@PurpleTitan if you were me?<br><br>", "<b>Username: PurpleTitan</b><br><br>I don’t know what country you are from. (I’m not you)<br>If it was me, depending on the country, I may seek to get a much cheaper undergrad degree elsewhere and try to pursue a M7 MBA degree.<br><br>", "<b>Username: rickle1</b><br><br>In recent yrs, MBB has made a focused push to recruit more at the UG level. If you go to their individual websites and look at on campus recruiting, you’ll see they have a significant team to handle UVA UG and MBA. They do hire UGs EVERY yr. They have a specific slot in their heirarchy for UGs (Business Analyst) which is basically similar to the intro Analyst role within the IB world. Lot of grunt work as you learn the business, network within the firm, etc. Great first job out of UG.<br>The bigger issue is selective. At least as difficult as getting in to a top school. Thousands of top school top performers vying for hundreds of spots. It’s basically being in the top 10% of the top 1% of students (not just measured by grades, fit is a big part of it!)<br><br>", "<b>Username: Winruss</b><br><br>Thanks @rickle1<br><br>", "<b>Username: Winruss</b><br><br>Whats the chance admitted in Mcintyre when enter Junior? More than 50%?<br><br>", "<b>Username: rickle1</b><br><br>^^^ I think it’s 50 - 60%. Some self select out because they don’t care for the prereqs like Accounting. You can check with the school for specifics.<br><br>", "<b>Username: Winruss</b><br><br>Thanks @rickle1<br><br>", "<b>Username: MYOS1634</b><br><br>@rickle1 : IS that 50-60% of those who apply or 50-60% of those who start as freshmen?<br><br>", "<b>Username: PurpleTitan</b><br><br>@MYOS1634, well, there is no “pre-business” at UVa so no one knows how many wanted McIntire as freshmen.<br>Here are the UVa admissions stats: https://www.commerce.virginia.edu/undergrad/application-process-uva<br>And McIntire for transfers (where they openly say they are biased towards VA CC applicants):<br>https://www.commerce.virginia.edu/undergrad/application-process-transfer<br><br>", "<b>Username: rickle1</b><br><br>^^^ I believe it’s for those that apply. I recently saw a number that suggested a 65% admit rate.<br><br>", "<b>Username: rickle1</b><br><br>Get good grades, get involved in clubs and you’ll have no problem.<br><br>", "<b>Username: Winruss</b><br><br>Now my son narrow it down to UT Austin and Notredame. Any input for this?<br><br>", "<b>Username: privatebanker</b><br><br>ND is money is not an issue. Based on m But depending on your colture and religious preferences it could be UT which will be a bit more diverse. Brother in law is a Nd grad and found it good for him as a quiet kid. Buddy at work son last year chose uva over Nd because he thought it was all very homogeneous   And they flew him out as a very recruited student small sample size.  But it’s all I have.<br><br>", "<b>Username: Winruss</b><br><br>@privatebanker hi there, sorry but I didn’t understand what you meant by ‘very recruited student small sample size’, do you mind clarifying it? And so how is uva compared wit ND? Thank you <br><br>", "<b>Username: Winruss</b><br><br>@678mom my son has narrow it down to UT Austin and Notredame. Any input for this?<br><br>", "<b>Username: Winruss</b><br><br>Thank you so much @678Mom for ur insightful input.<br>One more question pls.<br>Considering the tuition and living cost, ND is 25% more expensive than UT and 8% than Uva.<br>Should you are in my position as parent of international student, which school are you going to take? (although in the end we will follow what our son would like to take) thanks again!<br><br>", "<b>Username: privatebanker</b><br><br>@Winruss   Sorry he was a Wendy’s all American scholar winner etc. UVA Jefferson scholar finalist and highly sought after academic student   He was saying no to ND and they asked if they could fly him out for a separate visit<br>I can only tell you he chose UVA although he didn’t win the Jefferson. He thought ND was a special place and kids really smart but a bit homogeneous.  He has loved uva and will be honored by living on the Lawn for senior year.<br>As I said brother in law who is successful attorney loved ND and it’s network has served him well. He is very proud to be a ND grad<br>Bottom line is you can be super successful anywhere and these top schools offer unlimited opportunity.  Comparisons are interesting but not really super indicative<br><br>", "<b>Username: Winruss</b><br><br>thank you so much for ur valuable information @privatebanker really appreciate it.<br>btw do u have any insight for UT Austin? tku again<br><br>", "<b>Username: Winruss</b><br><br>after long consideration…my son commit to UVA. thanks for your advice<br><br>"]}