{"title": "umich vs duke engineering", "comments": ["<b>Username: Humblest</b><br><br>I’m interested in pursuing an engineering undergrad, but I would like to move into management later. I would not like to work as an engineer for the rest of my life, but seeking an engineering degree (most likely an electrical or mechanical) interests me due to the flexibility of the major later in my career, from what I’ve heard. For a minor, I am planning on philosophy, although I would also enjoy studying psychology and economics.<br>I am currently deciding between Duke or Umich, and as I see it, both have advantages and disadvantages. I will list them below but feel free to correct me, as many of you will likely have more experience than me on the subject.<br>(The cost of attendance will be very similar for both, and I am out of state for Umich)<br><br>Duke:<br><br>[QUOTE=\"\"]<br>Pros:<br><br>“Prestige”<br>Higher overall rank<br>Strong alumni network<br>More selective<br>Greater endowment per student<br>Breadth in engineering education (into humanities)<br>Better weather<br><br>Cons:<br><br>Lower engineering rank<br><br>[/QUOTE]<br><br><br>UMich:<br><br>[QUOTE=\"\"]<br>Pros:<br><br>Higher engineering rank<br>Large alumni network<br>Depth in engineering education<br><br>Cons:<br><br>Lower overall rank<br>Less selective<br>Worse weather<br><br>[/QUOTE]<br><br><br>I can see myself at both of these schools, but at the moment, given the mentioned pros, Duke seems to be the better fit for me. My main doubt in making this decision (aside from the factors I may be accidentally overlooking) is whether the pros (which appear to be manifold) offered by Duke are worth it in return for the considerably worse engineering ranking. I have heard that the education and opportunities (internship, clubs, research, job placement, grad school) are equally available and valuable at Duke as they are at UMich. However, from my visits to both schools, and after talking to several people, I had a sense that UMich had the edge in this regard when it comes to engineering, especially considering its much larger student body, engineering department, and results at competitions.<br>I ask for your two cents in how I should go about this choice considering my interests (mentioned at the top) and the opportunities available at both of these great schools. If I have overlooked some important aspect, feel free to mention it.<br>Thank you.<br><br>", "<b>Username: prezbucky</b><br><br>What is your cost to attend each?<br><br>", "<b>Username: Humblest</b><br><br>Full cost for both.<br><br>", "<b>Username: eyemgh</b><br><br>Overall prestige of an institution makes no difference in engineering. It’s all about the quality of the engineering program. Most of the “pros” for Duke will have very little impact. Do you have a lower priced option?<br><br>", "<b>Username: Eeyore123</b><br><br>Are you accepted or applying? It is hard to tell at this time of the year. If you are applying, understand that it may be harder to get into UM as an OSS engineering major than Duke.<br><br>", "<b>Username: Humblest</b><br><br>@eyemgh Georgia Tech would be the lower priced option, but I have currently ruled it out because of its lack of strong majors aside from engineering (which is nonetheless excellent).<br>@Eeyore123 Accepted.<br><br>", "<b>Username: Eeyore123</b><br><br>If GT is significantly cheaper, I would go there. An engineering degree from GT + cash in pocket ( or less debt) dominates your other two choices. I believe that you are overweighting the non engineering academics. If you move into management, you will likely be going to get a MBA.<br><br>", "<b>Username: Alexandre</b><br><br>Humblest, Duke is not more prestigious than Michigan…where it matters anyway. If you apply to graduate school, or for a job, the Duke name is not going to trump the Michigan name. Both are very highly regarded by graduate school adcoms and employers.<br>Also, for OOS applicants, Michigan is not less selective than Duke.<br>That being said, you said that Duke is a better fit for you. As such, that is where you should go.<br>Or you could do as Eeyore suggests, save money and go to GT. That’s a good option too.<br><br>", "<b>Username: Humblest</b><br><br>@Eeyore123 Since engineering is more a means than an end to me, the lack of breadth at GT, at least in comparison to the other choices, led to me ruling it out. I thank you for the input nonetheless, I have extensively considered and researched all of my options until narrowing them down to these two, so there are other factors that I took into account.<br>@Alexandre Thank you for your feedback as well. As far as selectivity is concerned, I use the statistic as a point of reference for the students I would be surrounded by in each environment, which may be IS or OOS, and belonging to a variety of majors. While all of these universities are filled with high-caliber individuals, I believe the highest percentage of such would be found at more selective schools.<br><br>", "<b>Username: Alexandre</b><br><br>“Thank you for your feedback as well. As far as selectivity is concerned, I use the statistic as a point of reference for the students I would be surrounded by in each environment, which may be IS or OOS, and belonging to a variety of majors. While all of these universities are filled with high-caliber individuals, I believe the highest percentage of such would be found at more selective schools.”<br>That is what I thought too, until I found myself struggling to keep up with those “lower stat” in-state students. Just because in-state students have lower test scores than OOS students does not mean they are any less academically inclined. Most in-state applicants/students at Michigan do not spend nearly as much time preparing for those standardized tests as OOS applicants/students. The paradigm is completely different. In-state students, for the most part, do not look beyond the University of Michigan. It is their end game. They know that as long as are among the top students in their respective high school classes, they have a good shot of getting into Michigan. As such, they hardly prepare for the ACT/SAT. If you do end up at Michigan, I would caution you against underestimating your classmates. They may have slightly lower test scores, but they did not invest as much time preparing for those tests. In the case of Michigan, having a slightly lower standardized test score average does not mean its student body is of a lower calibre.<br><br>", "<b>Username: eyemgh</b><br><br>You’re in for a rude awakening if you feel like engineering will be any less than challenging…anywhere. There’s simply nothing you’ve experienced in HS that will fully prepare you for the next level. The pace is higher and the concepts build. Basically the hardest thing you’ve taken to date, probably Calc II or Calc based Physics will be the floor of your difficulty scale. The mettle of the very brightest are tested by engineering. I can also tell you this, you won’t get fewer job opportunities or make less money if you choose Georgia Tech. The money that you pay to go anywhere else will be for the experience, but won’t have a financial return.<br><br>", "<b>Username: Alexandre</b><br><br>Most of your pros are not based on accurate information.<br><br>Duke is not more prestigious than Michigan...not amongst educated people, graduate school admissions committees or employers anyway<br>Duke is only ranked higher than Michigan if the methodology/data reporting and collection is flawed. The two universities are peers and should be ranked roughly the same<br>Duke's alumni network is not stronger than Michigan's<br>Duke has a lower acceptance rate, but the quality of the student bodies is similar<br>Duke's endowment per student is higher, but when you factor state funding and economies of scale, the two schools have roughly similar wealth<br>I do not see why you would haver a broader engineering education at Duke. Many engineering students at Michigan take loads of classes in LSA. Many even double major.<br>The weather in North Carolina is definitely milder. To most, that is a plus, but many surprisingly enjoy a nice cold winter. ;)<br><br>At any rate, go with your gut. If you are feeling Duke, go for it. You cannot go wrong with Duke.<br><br>", "<b>Username: yikesyikesyikes</b><br><br>@Alexandre<br>I think the student bodies are both high quality and there is significant overlap, but there is evidence to suggest Duke’s student body has a significantly higher number of the highest achievers:<br>ACT score ranges are almost identical (still slightly favor Duke, with at least a quarter of Duke’s class securing a 35 or more on the ACT), but this is not the best statistical metric because there are so few discrete data “buckets” to fall into.<br>Looking into the SAT score ranges exposes the big difference:<br>Michigan:1350-1530<br>Duke: 1440-1570, 1490-1570  Arts&Sciences, Engineering<br>Additional Statistics Focusing specifically on Engineering:<br>Median ACT for UMich Engineering: 33<br>ACT 25%-75% Duke Engineering: 33-35<br>For the ACT, Michigan’s average student falls in the 25% of Duke’s student pool.<br>Median SAT for UMich Engineering is 1410, while Duke’s range for Engineering is 1490-1570, their 25%ile is above Michigan’s median.<br>Of course, standardized test scores are not everything, but with large sample sizes with aggregated data, they are pretty decent predictors of “student quality”.  The data suggests that Duke’s incoming engineering class has a significantly higher number of the highest achievers.  However, Michigan still bests Duke for actual rankings in engineering (which are admittedly research driven, but undergrad students are increasingly involved in research).<br>I agree both schools have similar reputations in the professional and academic world, but I also think the average Duke incoming undergraduate  is of “higher quality” than the average Michigan incoming undergraduate.  It is up the OP to decide how much this matters to him/her/appropriate gender pronoun.<br>Both schools will offer about the same level of professional and academic opportunities (both are heavily respected by graduate schools, both have are heavily recruited, and both have very strong and loyal alumni networks).  There is no clear choice here in terms of opportunities, except Duke being a good few ranks better with Biomedical Engineering (which makes a difference since undergraduate BMEs get the short end of the stick when it comes to professional opportunities right out of undergrad) and Michigan significantly besting Duke with autonomous systems/robotics research (it is a niche field that is very lucrative and hard to get significant undergrad exposure to unless your school is really into it, which Michigan is).  The OP should really choose based on fit (where he/she/appropriate gender pronoun would be happiest).<br>Sources:<br>http://admissions.duke.edu/images/uploads/process/DukeClass2021Profile.pdf<br>https://admissions.umich.edu/apply/freshmen-applicants/student-profile<br>https://www.engin.umich.edu/about/facts/<br><br>", "<b>Username: rjkofnovi</b><br><br>Both schools will offer about the same level of professional and academic opportunities (both are heavily respected by graduate schools, both have are heavily recruited, and both have very strong and loyal alumni networks). There is no clear choice here in terms of opportunities, except Duke being significantly better with BME (which makes a difference since undergraduate BMEs get the short end of the stick when it comes to professional opportunities right out of undergrad) and Michigan significantly besting Duke with autonomous systems/robotics research (it is a niche field that is very lucrative and hard to get undergrad exposure unless your school is really into it, which Michigan is).”<br>If Duke is “significantly better” than Michigan in BME,  than Michigan is significantly better than Duke in every other comparable engineering major.<br><br>", "<b>Username: yikesyikesyikes</b><br><br>@rjkofnovi<br>I agree - ranking just does not make nearly as much of a difference in other engineering fields.  For most engineering disciplines, any school in the top 10ish will be recruited comparably for jobs in their field right out of undergrad.  BMEs feel the difference, however.  Some of my best friends are BMEs (I know people at Johns Hopkins [#2 BME], Michigan [#9 BME], and Rutgers [#? BME]), and they and can attest to that.<br><br>", "<b>Username: Knowsstuff</b><br><br>@Humblest my sons path is similar. Engineering leading to business management. He is taking industrial engineering since its more business focus with a business minor. He and 3 friends started a tech club and won 2 grants one for $5,000 and 1for $10,000. He is coming back next week for a week capstone https://lsa.umich.edu/bli/bli-fellows/capstone-experience11<br>They already won https://www.optimizemi.org/#turn-ideas-into-impact.<br>All of this has lead to a university of Michigan alumni reaching out to them to be part of this fast growing sector. He was put on an advisory panel for one of the largest seed companies in the start up world. Again through Michigan alumni.<br>He is just ending his freshman year.<br>Someone said it Nicely. At Michigan you can be whatever you want to be.<br>Good Luck.<br><br>", "<b>Username: Humblest</b><br><br>@Alexandre My pros and cons are based on both objective and subjective information I have gathered thus far. They may not be accurate, and that is one of the reasons why I come here to request advice. Nevertheless, considering that everything you write places UMich and Duke together, or gives the edge to UMich, makes me skeptical of the accuracy of such information.<br>For instance:<br>“4. Duke has a lower acceptance rate, but the quality of the student bodies is similar”<br>Is there any evidence, other than personal experience, for such claim given that it is used to refute a number?<br>It’s important to note that I do speak from the ignorance of a high school senior, and I understand that when I ask for people’s two cents, subjective perspectives are bound to surface, and I welcome these as much as I do objective ones.<br><br>@yikesyikesyikes Thank you for the analysis of the statistical representation of standardized testing (I am a male by the way). I have tried to convince myself to major in BME, but (although this completely subjective to change) I have not been able to, I am definitely more inclined into the electrical and mechanical side of engineering (even though I have no experience with either). Both of which are much better ranked at UMich than Duke. Still unsure as to the importance of ranking<br><br>@Knowsstuff Congratulations! Always great to hear personal experiences with each university. It’s the type of thing that numbers may fail to encompass. Given that he is yet to complete a full year at the university and is already working with large companies and making connections is exactly the type of thing I am looking for in college.<br><br>", "<b>Username: Knowsstuff</b><br><br>@Humblest… Alumni started reaching out to them the second they were a registered group is very real. Even y-combinator reached out through another alumni. He is on their student advisory board. Look up what they do. They are a 50 billion dollar company that started, reddit, Uber, airbnb, drop box, stripe etc etc.<br>Again, if you want things to happen then they will. Michigan is willing to give the resources. There are also ann arbor meet ups on various topics. These are student and company based and small groups.<br>They were shocked their wasn’t this type of tech group so they just started their own. University was 100% behind them and professors willing and excited to help. The old “make it and they will come” philosophy… Lol.<br><br>", "<b>Username: eyemgh</b><br><br>You should post this on the engineering forum and don’t leave out that you were accepted to Georgia Tech and that it is quite a bit cheaper. You will get the perspective of engineers who have and do hire, not simply the perspective of people defending their pet institutions.<br>https://talk.collegeconfidential.com/engineering-majors/<br><br>", "<b>Username: Humblest</b><br><br>@eyemgh As much as I would like to, I don’t think I am allowed to create repetitive posts.<br>Also, I have been accepted to other excellent universities that after plenty of research, visits, and talking with people, I have ruled for a variety of motives.<br>Aside from Duke, UMich, and GTech, I have also been accepted to Northwestern, Johns Hopkins, Carnegie Mellon, UT Austin, UIUC, UF, and UCF. As great as these may be, which they are (reason why I applied to them), they are not right for me for a reason or another.<br>I have mentioned specifically Duke and UMich, because I am especially interested in these two, and I think that in order to have a more productive discussion, comparing these two schools head to head is the optimal approach, given that I have 1 week to make the decision.<br>Thanks for the suggestion nonetheless.<br><br>", "<b>Username: theloniusmonk</b><br><br>In silicon valley where I know a lot of hiring managers, Michigan has a significant advantage over Duke, but to be fair that includes hiring Comp Sci majors where UM has a better reputation and alumni network than Duke.  I have hired more on the product mgmt/marketing side, not core engineering or software development, and the hiring managers/recruiters for engineering would prioritize Michigan, GT, Duke of the three you’re considering.<br><br>", "<b>Username: Humblest</b><br><br>@theloniusmonk Initially, when I received my letter of admission from Duke, I barely considered it as an option. But after some research, this post my the user @TopTier, which seems to have gained much respect in this community, made me consider Duke a lot more seriously.<br>From what you have said, it seems you have experience on the topic. So, if you have the time to read his post, quoted from: https://talk.collegeconfidential.com/duke-university/1761319-pratt-school-of-engineering.html I would love to hear your opinion (as well as anyone else’s) on this idea of investing on  mid/late career rather than the early one when choosing a college.<br><br>\"\"<br>To begin – and this is critical – the three universities/engineering schools you cite are unquestionably outstanding; you cannot go wrong – and you should ecstatically proud – to attend Michigan, CMU, or Duke!<br>I have considerable Duke insight, but far less with the U of M or Carnegie Mellon; therefore, what I will soon relate concerning Duke may – or may not – be applicable to the others. I simply cannot authoritative confirm that it applies to Michigan or Carnegie Mellon.<br>You have read innumerable posts on CC that focus on post-Bachelor’s INITIAL career placement and the perceived benefits of university quality/stature. This really is inapplicable to someone like you, who will attend Duke, Michigan, or CMU. Yes, you’ll obviously have to find an entry-level position (presumably in a highly sought-after enterprise). However, with an undergraduate engineering degree from any of these three institutions (and presuming decent academic performance) I can assure you that will not be a problem.<br>Because you will be a graduate from one of these highly reputed universities, you can afford to look forward a decade of more – your major challenges will not be at the entry-level, but rather at the entry/mid SUPERVISORY/LEADERSHIP level. Let me explain why:<br><br>Most major/large engineering and program management organizations (I based this on 40+ years experince in this business, 20+ with Lockheed Martin) soon (in about 5 years, +/- a couple) informally “earmark” fast-track employees.<br>They are quickly identified and placed in the most critical projects, offered subsidized to pursue advanced education (frequently MBAs), and sent to corporate/enterprise internal “charm schools.”<br>While alumni from any reputable school are identified and selected, a hugely disproportionate share come from the first-tier educational institutions (especially considering how small the aggregate numbers of graduates from these “elite” schools actually are).<br>A degree from Duke (CMU and Michigan, perhaps . . . I just don’t know with certainty) is a very significant plus in quickly clearing this crucial initial hurdle, one that essentially guarantees you’ll move quickly upward (critically, no firm will pay MANY thousands of dollars to “groom” a youngster – postgraduate school, internal training, special job assignments – and then deny their own, costly selection by failing to promote that individual).<br><br>Once an individual is established in mid/upper-manaagement, the university’s OVERALL reputation is FAR more critical than the stature of the engineering, or business, or public policy, etc. school, per se. Many most-senior public and private officials/leaders – even in engineering and programmatic enterprises – do NOT have technical backgrounds (many are MBAs or JDs), and they could not tell you if, for example, Ohio State’s engineering school (or any subdivisions therein) is good, average or poor. HOWEVER, they certainly will know – and signifiantly appreciate – Duke is a superior university (again, I do not doubt they would feel that U of M and CMU are, too, I simply cannot substantiate this).<br>Allied with the foregoing, it’s noteworthy that MANY young Pratt graduates opt for major – and quite lucrative – non-engineering opportunities in iBanking, consulting, business, and so forth. I believe this is noteworthy because the job marketplace views Pratt alumni so highly that they are not initially limited to “pure engineering” positions. That’s a substantial advantage . . . and it is also very instructive. How true this is with just-graduated CMU and U of M BSEs, I do not know; but I suspect that “telling” data would be readily available from the schools’ placement offices.<br>I’ll close with one caveat: my post is focused on large public and private enterprises, not on smaller ones. Obviously, due to the stupendous capital (and other) resource requirements necessary to complete large engineering programs with success, many young BSEs will enter such organizations (however, some will also go to small, often entrepreneurial enterprises).<br>\"\"<br><br><br>", "<b>Username: eyemgh</b><br><br>You can indeed post this question in the engineering forum, and if you want valid opinions of practicing and hiring engineers, you absolutely should.<br><br>", "<b>Username: JenniferClint</b><br><br>I firmly believe that the university matters much more than the major at the undergraduate level. It is also worth noting that several elite private schools have engineering programs that are ranked poorly because they are relatively small. The rankings don’t always measure the quality of research output. They often look at the quantity.<br>You can bet your bottom dollar that I’d go to Harvard’s SEAS over Georgia Tech or Michigan even though those programs are ranked far higher. If you want to get a sense of the quality of some of Duke’s engineering professors, you should check out these links:<br>http://www.dukechronicle.com/article/2018/04/duke-professor-adrian-bejan-wins-prestigious-benjamin-franklin-medal<br>https://stories.duke.edu/beyond-materials-from-invisibility-cloaks-to-satellite-communications<br>http://pratt.duke.edu/about/news/new-faculty-vahid-tarokh<br>Also, be extremely skeptical of people who make blanket assertions without citing their sources.<br>http://www.businessinsider.com/the-best-colleges-for-software-developers-2014-10<br>Duke at 8. Michigan at 9.<br>https://techcrunch.com/2018/03/11/where-did-venture-capitalists-go-to-college/<br>32 VC investment partners with Duke undergrad degrees. 26 from Michigan (a school that is 5 times larger).<br><br>", "<b>Username: eyemgh</b><br><br>I seriously doubt any hiring engineer would choose Harvard over Georgia Tech or Michigan for an engineering job if that was the only thing that differentiated the candidates. VC, sure, but VC isn’t engineering, it’s business. Ditto investment banking. Having a technical background can help in those fields, but the work is COMPLETELY different. You can find any amount of self affirming data you want, if that’s what you want, or you can simply ask the people who do the hiring. They hang out in the engineering forum.<br>We might be able to summon some up if you don’t want to move your post… @boneh3ad, @nordicdad, @ClassicRockerDad, @HPuck35, @cosmicfish, @ucbalumnus, @colorado_mom, @MaineLonghorn, @Gator88NE<br>Good luck. You have lots of great options.<br><br>", "<b>Username: sbballer</b><br><br>I’m surprised you’re not considering UT Austin… .great engineering… and Austin is kewl.<br><br>", "<b>Username: sbballer</b><br><br>“It is also worth noting that several elite private schools have engineering programs that are ranked poorly because they are relatively small. The rankings don’t always measure the quality of research output. They often look at the quantity.”<br>Caltech is small and is ranked very very highly… no rankings are not based on size. that’s false.<br><br>", "<b>Username: Humblest</b><br><br>@eyemgh It is worth noting, as I have said previously in my original post, that I plan for engineering to be more a means than an end in my career, with business being the “end” (of course, there is no certainty in that, and a lot of it will depend on the opportunities that appear). And thanks for “summoning” some of the engineering people; although I don’t plan for engineering to be an end, it will certainly be crucial in the foundation for my career, if that is the route I choose.<br><br>@JenniferClint Thank you for the specific articles (and citing the sources); I especially enjoy seeing how individuals in the faculty are performing currently. It is also nice to see statistics around venture capitalists, which are very relevant in regards to what I plan to do in the future (college and career).<br>Nevertheless, I often find that when researching universities of this caliber it can be easy to look for specific rankings that favor one university over the other and vice-versa. They both edge each other out in different aspects, and it becomes a matter of personal preference in what one is looking for in the college (which can be hard to know as a high school senior). I had not seen those statistics yet, and they definitely bring something else to the table for consideration.<br><br>@sbballer Regarding UT Austin, I would just refer to post #19. You can be sure I gave it a fair and extensive consideration. As far as the engineering rankings, I have found that they largely depend on who creates the list.<br>For instance, at least in my eyes, the ARWU seems to be more objective in this regard, while the USN rankings appear to be more subjective in their methodology. Both present their own value in a sense.<br>Links for the methodology of each engineering ranking:<br>ARWU: http://www.shanghairanking.com/ARWU-FIELD-Methodology-2016.html<br>USN: https://www.usnews.com/education/best-colleges/articles/undergraduate-engineering-programs-methodology<br><br>", "<b>Username: collegemom3717</b><br><br><br>\"\"<br>critically, no firm will pay MANY thousands of dollars to “groom” a youngster – postgraduate school, internal training, special job assignments – and then deny their own, costly selection by failing to promote that individual<br>\"\"<br><br><br>\"\"<br>Once an individual is established in mid/upper-management, the university’s OVERALL reputation is FAR more critical<br>\"\"<br><br>These 2 quotes are simply wrong.<br>There is plenty of info out there about people who do MBAs, paid for at huge expense by their firms, who end up leaving in frustration b/c they are not promoted and/or their new skills are not utilized by their company. It is why more than a few large companies now have internal, company-specific talent development programs- so that they don’t pay for a qualification that can easily walk out the door. Similarly, people returning from international assignments often find it hard to fit back in, and use their new skillsets and perspectives, leading to a lot of attrition there as well- not to mention the ones who are (gently or not) encouraged out the door b/c there is no longer a good place for them.<br>Further, once you are “established in mid/upper-management”, the name of your undergrad institution is simply not a big deal- and it is certainly not “critical”.  What will matter much, much more is your experience and (if you have one) your grad degree.<br>My bona fides for these opinions: BA/MBA/PhD; taught both business & engineering at the university level; experience working for Fortune 500 companies; consultant at one of the big 4 consulting firms.<br><br>", "<b>Username: Gator88NE</b><br><br>Rankings are based on surveys…take them with a grain of salt. No one really knows much about more than 1 or 2 school’s undergraduate programs.<br>Obviously, elite privates have advantages over public universities, must have to do with resources (student to faculty ratios, etc.).<br>However, if you’re looking to which gives you an advantage to moving from an engineer, to a senior engineer, to an engineer manager to a technical director and up, there really is no advantage between a Duke and a Michigan degree.<br>Engineering is a meritocracy. Senior managers and directors will want to promote the best engineers. Most of these engineering managers/directors came from public universities, so they are not biased against them. What’s important (in your first year) is talent, work ethic, and social skills. After a few years, experience then also becomes important (an engineering manager is expected to develop their team). If you exhibit these qualities, you will be placed on the leadership track.<br>Of course, graduates from elite schools, are more likely to exhibit these qualities, that’s how they got into those schools in the first place! However, it’s not the school that got them selected for a leadership track, it’s their performance on the job.<br>Now, if you want to earn a BS in engineering, but then jump into consulting, law school, etc, that’s a different conversation.<br><br>", "<b>Username: Gator88NE</b><br><br>On engineers getting into management positions. Typically it’s the engineer=engineer manager=engineer directer=VP, etc route. Of course, it’s possible to jump ship and switch from engineering, into sales/marketing/project management/etc and then to a director/executive position in those areas. You don’t have to stay in engineering your whole career, the qualities that made you a good engineer, often translates into other fields, and it’s not uncommon for engineers to make those type of career changes.<br><br>", "<b>Username: sushiritto</b><br><br>Most Important Rankings:<br>Michigan #21<br>Duke #61<br>https://247sports.com/Season/2018-Football/CompositeTeamRankings<br>;)) (a little levity)<br><br>", "<b>Username: momofsenior1</b><br><br>Not sure if this is an option, but does either school have a 5 year bs/mba program?     My husband did that at Cornell back in the day.<br><br>", "<b>Username: eyemgh</b><br><br>@momofsenior1, most council against that now days. It shows a job candidate isn’t interested in ultimately being an engineer, and thus is an impediment to getting a first job. No company of note will put an inexperienced engineer in a managerial position, no matter how prestigious the MBA. A blended 5 year technical BS/MS on the other hand is quite valuable. No more so than any other MS, but it gets the candidate there quicker.<br><br>", "<b>Username: Knowsstuff</b><br><br>@eyemgh good information for my son… Thx.<br><br>", "<b>Username: Nocreativity1</b><br><br>Continued attempt at levity…<br>Michigan 28,983 undergrads on 3,207 acres. Translates to .11 acre per student.  Duke 6,449 undergrads on 8,600 acres or 1.33 acres per student.<br>Now on a serious note all preseason college basketball surveys have Duke #1-3.  Only time Michigan appears in top 25  is when followed by the word State.<br><br>", "<b>Username: Knowsstuff</b><br><br>Someone mentioned about Duke being better for engineering then Georgia Tech. Thanks for the laugh of the day.  <br>Saying that… They both will provide jobs for the students.<br>Almost like saying Georgia Tech is better then Duke in basketball… I mean they both play basketball, right?  ;<br><br>", "<b>Username: sbballer</b><br><br>these engineering threads are funny… most of the posters are probably lib arts majors or come from lib arts schools and apply their world view on engineering programs<br>doesn’t work that way:)<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>Continued attempt at levity…<br>Michigan 28,983 undergrads on 3,207 acres. Translates to .11 acre per student. Duke 6,449 undergrads on 8,600 acres or 1.33 acres per student.<br>Now on a serious note all preseason college basketball surveys have Duke #1-3. Only time Michigan appears in top 25 is when followed by the word State.<br>\"\"<br><br><br>As my friend who's a Penn State alum said to me just yesterday, who cares about \"those (basketball, hockey) sports.\"  =)) <br>When was the last time Duke got a 110,000 people at a football and/or basketball game?<br>Who made the Final Four and lost to Villanova, clearly the best team in college basketball? And yes, I know all about the best high school recruiting class in history, but Kentucky's is pretty darn close too. And Villanova will be back. <br><br>Disclaimer: I’m not an alum of either school, just a sports fan, trying to lighten up another rankings thread.  <br>My apologies to the OP.<br><br>", "<b>Username: momofsenior1</b><br><br>My husband was definitely not interested in being an engineer.   He majored in industrial engineering for his BS and had a manufacturing concentration for his MBA.   He’s always wanted to work in a manufacturing environment and it has served him well for his career.    Interesting that isn’t a positive any more.   Times do change!<br><br>", "<b>Username: Knowsstuff</b><br><br>@momofsenior1… I hope that is not true. My freshman son is on your husbands path. But there does seem to be a lot of minors for engineering these days. He plans on minoring in business or some other business related thing.<br><br>", "<b>Username: momofsenior1</b><br><br>@Knowsstuff   It completely worked out for my husband’s career and hopefully it will for your son as well!   I was responding to post #33.<br><br>", "<b>Username: privatebanker</b><br><br>I surmised from the post that it’s not a great way to get a great engineering job out of school.  I think the path you described would be excellent for management training or technical sales. Etc.<br><br>", "<b>Username: eyemgh</b><br><br>@momofsenior1, IE is the exception, because they are really systems level engineers in the first place. The OP didn’t mention IE though so I didn’t place a caveat.<br><br>", "<b>Username: Humblest</b><br><br>@collegemom3717 Thank you. Always great hearing from someone with experience in the field. Aside from those two quotes, would you agree with @TopTier’s advice based on your career?<br><br>@Gator88NE Thanks. I think that the social skills you mentioned are one of my strengths, particularly when compared to the average STEM-focused student. I would like to study in an environment where I can keep improving this facet as well as others that would make me more well-rounded, and possibly (hopefully) more desirable for higher positions at a company. From my experience so far (which is very little) it seems that Duke has the edge in this area.<br><br>@sushiritto A little levity is nice, but aside from the fact that these are both schools that value sports enough to spur great school spirit in the student body, allowing for great memories, sport’s rankings are not a big deal for me. I would rather continue the discussion from my original post and the quote by @TopTier on post #21.<br><br>@momofsenior1 I am not so sure as to the value of an MBA these days (and although I would like to hear some input on this, I don’t want this thread to get even more sidetracked), and I know little on the subject at this point. For sure, something to consider, since I plan on eventually moving into the business arena after undergrad.<br><br>@eyemgh I did not mention industrial engineering, but it is a field I have considered. Not really sure on the demand for this major compared to something like electrical or mechanical, but if you have an interesting remark to make on the subject, I would love to hear it.<br><br>", "<b>Username: theloniusmonk</b><br><br>“Once an individual is established in mid/upper-manaagement, the university’s OVERALL reputation is FAR more critical than the stature of the engineering, or business, or public policy, etc. school, per se.”<br>This is the opposite of what actually happens, as you get in to mid/upper management the undergraduate university matters less, at least in technology firms.  Nobody gets promoted in high tech over someone else because of the undergrad college, it’s the other things that people have mentioned - meeting product deadlines, leadership, managing change.  And even it it were determined a little by reputation, in silicon valley UM has a better reputation anyway.<br><br>", "<b>Username: theloniusmonk</b><br><br>\"http://www.businessinsider.com/the-best-colleges-for-software-developers-2014-10<br>Duke at 8. Michigan at 9.\"<br>This survey also has Stanford at 9.   Any ranking that has Stanford at 9 goes into the online recycle bin.<br><br>", "<b>Username: eyemgh</b><br><br>We might as well put articles about architecture and pre-med up there too. They are as closely related to ME as software engineering and venture capital.<br><br>", "<b>Username: eyemgh</b><br><br>Here’s a more recent Business Insider list, if that resonates. It’s 2017, and top school represented in Silicon Valley. Duke is not on the list, and several schools you’ve eliminated are ahead of Michigan.<br>Hiring does tend to be regional though. That’s why there’s the high representation of CA publics.<br>Also note this does not qualify what job, so it will be a conglomerate of SEs, CSs, and various engineers.<br>http://www.businessinsider.com/top-colleges-for-working-in-silicon-valley-2017-5<br><br>", "<b>Username: USCWolverine</b><br><br>Very much enjoying this thread–particularly the funny sports-related side notes!  Now I’m going to say something absolutely profound to the OP.  So amazing, many posters may need to hide their eyes:<br>OP is going to do extremely well, no matter which world class university is chosen.  As cost is evidently not a concern (an extremely fortunate position to be in that does not apply to most students), I’m going to recommend OP go with the best fit, and also, Go Blue!<br><br>", "<b>Username: momofsenior1</b><br><br>http://www.industrialinside.com/is-ie-worth-majoring-in/. Some food for thought about IE.<br><br>", "<b>Username: theloniusmonk</b><br><br>“We might as well put articles about architecture and pre-med up there too. They are as closely related to ME as software engineering and venture capital.”<br>The OP mentioned EE as well and software engineering would have some relevance there.<br><br>", "<b>Username: eyemgh</b><br><br>@theloniusmonk, I checked to make sure I didn’t miss it (I’ve been know to :D), but you’re the only one who has mentioned software in the thread. The OP specifically mentioned EE and ME.<br><br>", "<b>Username: Alexandre</b><br><br>“Nevertheless, considering that everything you write places UMich and Duke together, or gives the edge to UMich, makes me skeptical of the accuracy of such information.”<br>Humblest, I do not give Michigan the edge over Duke in any way except in engineering, where Michigan is in fact better (with the exception of BME, where Duke is better than Michigan). Both universities are very well rounded, but Michigan just happens to be more well-rounded academically (top undergraduate programs in Architecture, Business, Music, Nursing etc…). In Duke’s favor, it is indeed more selective, and its endowment per student is larger. In all cases, the relative advantage that these universities have over each other are negligible. They are both equally exceptional.<br>“4. Duke has a lower acceptance rate, but the quality of the student bodies is similar”<br>Is there any evidence, other than personal experience, for such claim given that it is used to refute a number?\"<br>Sadly, no. I can only speak from experience. In-state students at Michigan have lower tests scores than OOS students, but in the classroom, they perform just as well. The in-state students I knew, and I confess to have only know a few dozen, never prepared for standardized tests. This was strange to me because like most OOS students, I worked hard on my SAT preparation. That is why I said that there is a fundamental difference in paradigm to consider when comparing test scores at public universities and private universities. As it is, I am not sure if anybody can differentiate between a student body that graduated from high school with a 3.9 unweighted GPA and an average SAT/ACT of 1410/31.5 and a student body that graduated from high school with a 3.9 unweighted GPA having taken similar classes, and an average SAT/ACT of 1480/33. But when you factor in the effort, or lack thereof, that in-state students at top public universities put into their standardized test preparation, the gap in test scores is likely even smaller.<br><br>", "<b>Username: FoxRulz</b><br><br>A students performance in their high school is a far better indicator of success than their SAT/ACT scores.  I could have taken the SAT 4 more times and I likely would have gotten it over the 1500 mark vs. my 1470, it was a matter of answering 2 more questions right!!  So I am one student who will bring down Michigan’s average over a Duke.  But, I have a 3.9 weighted GPA in the most rigorous courses at an “elite” private school in the northeast.<br>I have friends who got into Duke, Northwestern,Vanderbilt with higher test scores, but easier classes but some of those same friends were rejected from Michigan.  I think just maybe Michigan looks a bit deeper into what kind of student they accept.  Their Common Data Set puts Rigor and School performance above test scores.<br>Go to Michigan, it truly has more to offer overall and for those who are so driven by rankings it IS ranked better for Engineering.<br><br>", "<b>Username: JenniferClint</b><br><br>^ Are you able to find any data showing that the class rank of students who matriculate at Michigan is higher than the class rank of students who matriculate at Duke? What are you basing this on?<br><br>", "<b>Username: Alexandre</b><br><br>JenniferClint, who said anything about class rank? Michigan stopped publishing class ranks because it is disingenuous to do so since a very large chunk of incoming freshmen attend high schools that do not rank.<br><br>", "<b>Username: FoxRulz</b><br><br>this is all so crazy!! Everyone is “splitting hairs” about students at Duke vs Michigan!!  Seriously!! Please quantify for me in the scheme of life, why Duke will be better or even Michigan will be better!  I think this is my last post, because if anyone thinks they are “better” aka superior attending one over the other they are wrong. As my dad would say we all bleed the same blood and we all meet our maker in the end so make your time mean something.<br><br>", "<b>Username: Nocreativity1</b><br><br>Avg GPA U Mich 3.82 Avg ACT 29-32 acceptance rate 29%<br>Avg GPA Duke  4.17 Avg ACT  31-34 acceptance rate 8%<br>Duke ranked top 10 in USNews, WSJ, Forbes, USA Today and selectivity. Regular decision 6.3% acceptance rate.  Clearly defined peer group of U Chicago, Brown, Columbia and Penn. based on statistics of matriculating class<br>Michigan doesn’t appear in the top 20 Or match Up as a peer.  Wash U or Emory as Peers.  Great school but not Duke.<br>The Duke name cariës more cache in the finance space buy a Wide margin.  I base  this on thirty years of experience.  Duke kids are nethodically recruited by NY IB shops and benefit from the depth and breath of there alumni network.<br>Michigan has not been a target of any of the three major banks i have worked For.  Occasionaly a resumé would Pass my desk but limited if any true support.<br>Rather than spliting hairs as you say Lets be honest and direct.  Duke has a far superior reputation in Finance then Michigan. Michigan is largely perceived as a safe school For talenten and smart kids givin its both large and public with managable addmissions rates.  Duke is viewed as far more selectieve with a 6.3% RD acceptanten rate.  1,900 valadictorions applied To Duke and 29% were accepted.  Stated differently i am sure there is a ven diagram that would show overlap between the two schools studen bodies but those out Side of the shared space at Duke would be far superior accademically then those out of the shared space from Michigan.<br>Saying things like i could have taken the ACT and grotten a Higher score or anecdotely pointing out studentes who got  rejected at Mich (potential yield Protection) but into Duke or the suggestion that michigan Somehow looks harder at applications all simply wrong ang pure speculation in the hope of Boeing persuasive.<br>Every number produced suggesties Duke has a prestige advantage.<br>US. News ranks Duke # 11 in counselors rank Vs Mich at #22 and over all Duk #9 Vs Michigan #28<br>Duke has a better reputation, is harder to get into and is more heavily recruited from.  Saying otherwise is purely an attempt to minimize a well defined hierarchical difference.<br><br>", "<b>Username: sushiritto</b><br><br>First, isn’t this thread about engineering, not finance?<br>Second, in regards to finance, Michigan is #4 here: https://www.usnews.com/best-colleges/rankings/business-finance<br>Duke isn’t in the top 12. And the Ross Business school is #3. Not sure where Duke is rated for business schools.<br>But I’m not an alum, but hopefully @Alexandre will chime in with better info than I can provide.<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>Avg GPA U Mich 3.82 Avg ACT 29-32 acceptance rate 29%<br>\"\"<br><br>Per U of Michigan 2017-2018 CDS:<br>Average GPA = 3.85<br>Mid 50% ACT = 30-33<br>Also, Michigan is a state school and it’s OOS population for freshman is 46% versus Duke at 88%. BTW, I couldn’t find Duke’s average GPA in their CDS. The boxes where the info would normally be is empty.<br><br>", "<b>Username: sushiritto</b><br><br>Oops forgot one other thing.<br>Duke’s acceptance rate for the Class of 2022 is 8.3%.<br>Michigan hasn’t released their acceptance rate for the Class of 2022, but for the Class of 2021 it was 26.5%. Not 29%. Now, if you assume applications increased to 65,000-70,000, from 60,000 last year, then the acceptance rate will drop to roughly 23-24%. Assuming the same number of acceptances as last year of course, but I’ve heard that Michigan was planning on a smaller freshman class.<br><br>", "<b>Username: Alexandre</b><br><br>“Avg GPA U Mich 3.82 Avg ACT 29-32 acceptance rate 29%<br>Avg GPA Duke 4.17 Avg ACT 31-34 acceptance rate 8%”<br>Weighted GPA for Duke, unweighted GPA for Michigan. The highest GPA on Michigan’s scale is 4.0. And Michigan’s current acceptance rate roughy 20% and plummeting), not 29%. Also, the mid 50% ACT range for the latest class was 31-35 for Duke and 30-33 for Michigan.<br>\"Duke ranked top 10 in USNews, WSJ, Forbes, USA Today and selectivity. Regular decision 6.3% acceptance rate. Clearly defined peer group of U Chicago, Brown, Columbia and Penn. based on statistics of matriculating class<br>Michigan doesn’t appear in the top 20 Or match Up as a peer. Wash U or Emory as Peers. Great school but not Duke.\"<br>Those rankings are based on flawed data presented by private universities, including Duke. Duke lists its student to faculty ratio as 6:1. It is in fact 11:1 Those are the types of exaggerations that give private universities the edge in the rankings. If public universities played the same game (sadly, they cannot since their data is audited by the state), they too would be ranked much higher.<br>But among the educated, Michigan and Duke are peers. That is certainly the opinion of academe, which generally assigns identical undergraduate education ratings to Michigan and Duke. Also, the OP is interested in Engineering, and in Engineering, it is Michigan that is usually ranked higher than Duke.<br>“US. News ranks Duke # 11 in counselors rank Vs Mich at #22 and over all Duk #9 Vs Michigan #28”<br>You mention high school counselors  but not university presidents and provosts. Why is that?   According to university presidents and provosts, Michigan and Duke are tied at #13. This actually supports my point above, that Michigan and Duke are considered peer institutions among the highly educated.<br>\"The Duke name cariës more cache in the finance space buy a Wide margin. I base this on thirty years of experience. Duke kids are nethodically recruited by NY IB shops and benefit from the depth and breath of there alumni network.<br>Michigan has not been a target of any of the three major banks i have worked For. Occasionaly a resumé would Pass my desk but limited if any true support.\"<br>The OP has not indicated an interest in Wall Street. As an engineer, I assume he is more concerned with Silicon Valley and tech industry jobs. If that is the case, Duke does not present an advantage over Michigan, and I certainly don’t see why the opinion of Investment Banks should be a factor in the OP’s decision.<br>That being said, I am surprised that Michigan was not a target at any of the major banks that you have worked for. JP Morgan, Goldman Sachs and Morgan Stanley hired 35 undergraduate students from Ross alone last year. They also took 40 interns from Ross. Other major IBanks like BoA, Blackstone, Barclays, Citi, Credit Suisse, Deutsche, Lazard, Paribas, UBS etc…all hired Ross students as well. IBanks also recruit graduates from the CoE (Goldman Sachs hired 16 CoE graduates last year alone) and LSA, but obviously focus most of their attention on Ross. Clearly, Ross is a target, whether you care to admit it or not.<br>https://michiganross.umich.edu/sites/default/files/uploads/2016_employment_report.pdf   (pages 9 and 41)<br>“Duke has a better reputation, is harder to get into and is more heavily recruited from.”<br>Duke is harder to get into, but it does not have a better reputation where it matters, and it is not more heavily recruited.<br>“Saying otherwise is purely an attempt to minimize a well defined hierarchical difference.”<br>I am speechless.<br><br>", "<b>Username: Nocreativity1</b><br><br>We can go back and forth but the practical reality is the vast majority of students accepted at both schools choose Duke unless driven to U Michigan be a financial imperative.  The same could be said for students decision criteria in choosing Princeton over Duke.<br>While wishful to think otherwise there does exist a pecking order driven by supply and demand.  In this case consumers (students) choose Duke by a vast majority.  Again both great schools but “speechless” when being told Duke is more sought after or desirable then U Michigan… I believe willfull blindness is the correct term.<br><br>", "<b>Username: patatty</b><br><br>OP - did you do an engineering tour at Michigan?  When I took my son there, he had to practically scrape his jaw off off of the floor. The facilities there are so impressive.  I have not toured the engineering facilities at Duke, but I can’t imagine that they can compare to Michigan’s, especially in ME.  My son was ready to dive right in during the tour of the project team facility.  I know that you said you are using engineering as a means to an end, but since you will be doing it for 4 years, you should consider what kinds of opportunities there are for exploration during your UG years. You might actually like engineering and want to actually do it for a while.<br><br>", "<b>Username: Knowsstuff</b><br><br>http://www.shanghairanking.com/ARWU2017.html<br>Does this report make Michigan one blip better then Duke? The sad fact (with everyone’s facts) is the op was asking about engineering. I am sure he /she is running for cover or left this thread so everyone can compare that their bike is shiner then yours… I wish this thread would end but Feel compelled to state the obvious, Duke is a small Elite Private school that can take the cream of the crop applicants. I don’t think they are taking lower Stat kids like public schools do in general. For engineering their program is very limited. I didn’t even know they had a program but just went on their website. But if I wanted one of the programs they offered I am sure it’s excellent. It’s Duke… They don’t have bad programs.<br>As stated in my previous posts the opportunities at Michigan are ENDLESS. To the Op, Please pm me if you want more information. My son is going into engineering to get into finance /business management. He really likes the way engineering is taught and makes you think at a different level. Again as stated, he is going back to Michigan tomorrow to do a week long leadership Capstone for their $10,000 grant. They will work with mentors also over the summer to come up with a business plan going forward. It's the first time they took a freshman group and Michigan is paying for an airbnb for the 3 of them for the week to be there....... This is how Michigan supports their students endeavors!<br>For those spitting out facts please read my two previous remarks in this thread. This is just one example of reality at Michigan that doesn’t show up in the useless stats that are being stated. If you have the initiative and drive you will be successful at either institution.<br><br>", "<b>Username: Alexandre</b><br><br>“We can go back and forth but the practical reality is the vast majority of students accepted at both schools choose Duke unless driven to U Michigan be a financial imperative. The same could be said for students decision criteria in choosing Princeton over Duke.”<br>Princeton is superior to Duke, Duke is not superior to Michigan.<br>“While wishful to think otherwise there does exist a pecking order driven by supply and demand. In this case consumers (students) choose Duke by a vast majority. Again both great schools but “speechless” when being told Duke is more sought after or desirable then U Michigan… I believe willfull blindness is the correct term.”<br>There is no doubt that high school kids prefer Duke to Michigan. That is not in question. Like I said, with private universities exaggerating the benefits of attendance, such as halving their student to faculty ratios to improve their ranking, it is no wonder that impressionable high schoolers prefer Duke. Employers and academe (aka, graduate school admissions), on the other hand, are not impressionable. To them, Duke and Michigan are peer institutions.<br><br>", "<b>Username: privatebanker</b><br><br>The fact most kids may choose Duke is because of their parents, perceived status elevation versus peers and myths about quality of education versus a world clsss school like Michigan. It’s awfully good marketing to keep the checks coming. And it I think it also a bit of defending ones school, their kids or spouses school or validating choices made in life<br>Duke offers a phenomenal experience. Cameron indoor is once in a lifetime great. Tenting  to get tickets for unc game is a great tradition. My nephew did the whole month this year. Alumni network is fantastic and rep is first tier.  But um and Ross offer many of the same things and at a price point for many that makes it a clear winner. Pragmatism and real life sacrifices are bandied about in CC with careless abandon. Caveat emptor.<br><br>", "<b>Username: Knowsstuff</b><br><br>@Alexandre I agree with the basis of what you are saying. I think a lot of this is regional. As great as Duke is I really don’t think a lot of Midwestern kids would prefer Duke over x great Midwestern school for engineering. Maybe for other disciplines but not engineering. My kid went to the number school in our state that feeds Northwestern, University of Chicago and of course Illinois/Champaign. Duke might have a few applications with acceptances but again not for engineering. I am sure more East coast /west are applying to Duke.<br><br>", "<b>Username: Nocreativity1</b><br><br>So Alexandre and Private banker you acknowledge that the vast majority of kids prefer Duke, you just think they are wrong. We all say fit matters, let the kid decide, etc until it becomes an inconvenient result.<br>Kind of seems like you have drawn the conclusion you want and won’t let the overriding and most relevant fact enter into your consideration.   The kids (the consumer of the good being sold) prefers Duke.<br>I will leave it at that…<br><br>", "<b>Username: privatebanker</b><br><br>Point taken.<br>I guess I would like to be part of the group that thinks independently of group think and for myself. Not every consumer decision or sales numbers reflect good, pragmatic  decision making.  But I’ve exhausted the point.<br>Cheers!<br><br>", "<b>Username: Nocreativity1</b><br><br>Private banker would you agree that if students prefer Duke then ultimately Duke would have the higher performing student body?  If so isn’t it informed thought to attend the school with the stronger students.<br>Pejorative passive aggressive comments aside. Assuming you are in finance you know independent thought is only of value if the market ultimately arrives at your point of view.  Otherwise you may in fact own and undervalued asset forever never realizing the imbedded value your “independent thought” recognized.<br>In terms of college you can go to a college you think is better but if you are surrounded by students who went there as a second choice and or the reputation is inferior aren’t you doing yourself a disservice?<br>Cheers!<br><br>", "<b>Username: privatebanker</b><br><br>Also leaving it at that means leaving at that. And no one was passive aggressive. I am not aggressive or passive. Pretty straightforward actually.  And your comment telling us that we’ve drawn the conclusion we want is what - friendly and inclusive?<br><br>", "<b>Username: Nocreativity1</b><br><br>When you speculate that students propensity to choose to attend Duke is driven by “parents validating their decisions” and use terms such as buyer beware… yes you are drawing the conclusion you want.  There is no factual source for that conclusion just your desired comment.<br>Friendly and inclusive on my part no, but based on fact yes.  In fact you agreed students prefer Duke.<br><br>", "<b>Username: theloniusmonk</b><br><br>“In terms of college you can go to a college you think is better but if you are surrounded by students who went there as a second choice and or the reputation is inferior aren’t you doing yourself a disservice?”<br>For engineering a lot of people at Duke are there because they couldn’t get into their first choice, namely Stanford, MIT, CMU, Princeton, Cornell, Harvey Mudd, even public universities like Berkeley, Georgia Tech and Michigan.<br>And because Duke uses ED, it’s yield is artificially higher than colleges that use EA like Michigan.  Duke’s RD yield is 37%, Michigan’s is 31%, meaning the colleges are a lot closer in selectivity.<br><br>", "<b>Username: Nocreativity1</b><br><br>So the anecdotal evidence of UM fans saying the majority of kids choose Duke is false.  The universally observed rankings are wrong.  The acceptance rates that are published are wrong.  The average GPA and Test scores published are wrong.  Lastly I suspect the weather channel is wrong when they suggest NC weather is nicer than Michigan.<br>Got it.  Duke is everyone’s second or third choice while U Michigan is universally better and top pick  in spite of all evidence to the contrary.<br><br>", "<b>Username: privatebanker</b><br><br>Cmon you can’t be that thin skinned. No one is saying that and you know it. For a particular major  for a particular situation any school can make sense. And it’s not always their second choice. How many times does anyone need to hear Duke is great to feel validated. It’s great. It’s elite it’s superb it’s fantastic. It’s a lot of kids dream school   I agree with you. There’s no issue. it’s just not everyone’s dream school all the time and for every situation.<br><br>", "<b>Username: Nocreativity1</b><br><br>“How many times”…,<br>Just once thanks.<br><br>", "<b>Username: privatebanker</b><br><br>From my first post. So that’s  obviously not accurate<br>“Duke offers a phenomenal experience. Cameron indoor is once in a lifetime great. Tenting to get tickets for unc game is a great tradition. My nephew did the whole month this year. Alumni network is fantastic and rep is first tier”<br><br>", "<b>Username: privatebanker</b><br><br>Sorry pressed before it was complete.<br>Two -greats<br>One - phenomenal<br>One-  “Once is a lifetime”<br>One - fantastic<br>One - first tier<br>That’s Six accolades in 4 sentences. A lot more than “once”. Just want to be clear for OP as the debate is meaningless. Duke is in fact great.<br>Cheers and have good day.<br><br>", "<b>Username: FoxRulz</b><br><br>@Nocreativity1 If you believe in the National rankings why is it not important for a student to pay attention to the underlying rankings of what they want to study??<br>Michigan is ranked #4 Engineering!!  https://www.usnews.com/best-graduate-schools/top-engineering-schools/eng-rankings<br>And Finance also #4!!  https://www.usnews.com/best-colleges/rankings/business-finance<br>Why should a student ignore this exactly?? IF the question is Engineering between the 2 schools isn’t it clear??  And since you entered Finance I think it is very clear as well.<br><br>", "<b>Username: Nocreativity1</b><br><br>Private Banker disingenuous at best. On three threads you have placed Duke behind U Michigan , Berkley and Wash U.  Not to mention the post you sight goes to great lengths to suggest Duke positive reputation is misplaced and a function of patents misplaced loyalty to Duke.<br>Fox Ruiz on your first point agreed I don’t claim any engineering knowledge. Ny comments were general reputation.  On your second point Duke doesn’t have a finance degree. Their economics and finance department however is ranked number one.<br><br>", "<b>Username: privatebanker</b><br><br>Not disingenuous just an actual factual quote. And if you don’t think people come on here with biases and decision creep. We just disagree. And in those three cases it was advice and opinion. Nothing more and nothing less.<br><br>", "<b>Username: Nocreativity1</b><br><br>https://www.collegefactual.com/majors/social-sciences/economics/rankings/top-ranked/<br>Here you go…<br><br>", "<b>Username: Nocreativity1</b><br><br>Privatebanker thanks for calling it what is is.  Yours is a biased view not the independent thinker you referenced yourself as earlier. A truly independent thinker doesn’t allow biases to form their opinions.<br>Finally we can agree on something.<br>Cheers<br><br>", "<b>Username: privatebanker</b><br><br>Now. That’s not nice. If I think duke is great but not the be all end all that doesn’t make me biased. It’s called discerning.  My favorite nephew goes to Duke. I have no student there or Michigan and no student of mine has applied to either.  I have no mean boss from duke or was I ever jilted by a women from either. I’m open to debate but you’ve gotten a bit too personal and would suggest you move on. I will. My thoughts are generic. There are terms of service here and this has lasted one post too long.<br><br>", "<b>Username: Nocreativity1</b><br><br>Sorry bias was your word and no offense intended. I was wrong you aren’t being thin skinned (as you suggested I was).<br><br>", "<b>Username: theloniusmonk</b><br><br>“Cmon you can’t be that thin skinned.”<br>I think this is a UM grad posing as a Duke grad to make Duke look bad, the rants, grammatical and spelling mistakes, not understanding the arguments, changing the discussion…the post you sight, ny comments, is is, patents misplaced loyalty, Berkley<br><br>", "<b>Username: Nocreativity1</b><br><br>You caught me this is Christian Leattner<br><br>", "<b>Username: FoxRulz</b><br><br>@Nocreativity1  Global Economics and business Michigan is #12 in the world, which is still above Duke on a Global basis.  As a student and knowing the importance of a global outlook, this is impressive!!<br>https://www.usnews.com/education/best-global-universities/economics-business?page=2<br><br>", "<b>Username: Nocreativity1</b><br><br>And yes I know it’s Laettner<br><br>", "<b>Username: privatebanker</b><br><br>@NoCreativity   That’s a good one!<br><br>", "<b>Username: moooop</b><br><br>@Humblest  If you have read this whole discussion, and your name is not ironic, you have probably realized you don’t belong at either Duke or Michigan. Enjoy your years at Georgia Tech!<br><br>", "<b>Username: Alexandre</b><br><br>/\\ Hehe! Mic drop.<br><br>", "<b>Username: JenniferClint</b><br><br>I love how people are posting rankings for undergraduate business programs to claim that Michigan is better. Duke doesn’t have an undergraduate business school.<br>Also, anyone who thinks that the difference in the quality of students at Princeton and Duke is greater than the difference between Duke and Michigan is misinformed. The numbers don’t lie.<br>Can’t wait for @Alexandre to come up with some inane excuse about how Michigan students don’t care about standardized test scores. Give it a rest. No one takes an exam (specially one as consequential as the SAT) with the intention of performing poorly.<br><br>", "<b>Username: JenniferClint</b><br><br>@theloniusmonk Do you have any evidence to back up the claim that students at Pratt were rejected from schools like Michigan? Are you even vaguely familiar with the quality of Pratt’s student body?<br>http://admissions.duke.edu/images/uploads/process/DukeClass2021Profile.pdf<br>Also, yield =/= selectivity. Do you really think that most of the students who got into Michigan are choosing between Michigan and Ivy Plus schools?<br>https://www.nytimes.com/interactive/2014/09/04/upshot/college-picks.html#s=1474<br>^ 78% of students admitted to Duke and Michigan choose Duke. Michigan also loses to Brown, MIT, Harvard, Stanford, Penn, Yale, Princeton, Vanderbilt, Chicago, Cornell, WUSTL, Berkeley, Northwestern, USC, Hopkins, CMU, Georgetown, and Notre Dame. It ties with UCLA and UNC.<br>I’m ok with school pride but let’s not pretend like Michigan is Yale. It’s a moderately selective state school in the midwest that has some great graduate/professional programs and is very respectable at the undergraduate level. Let’s not get carried away here.<br><br>"]}