{"title": "university of alabama vs fordham university national merit finalist", "comments": ["<b>Username: grant1509</b><br><br>Hey everyone! So I’m trying to decide where I should go to college and, like everyone else, I’ve got until May 1st to choose. My two choices I’ve narrowed it down to are Fordham (full tuition) and Alabama (full ride+), but I can’t decide where I want to go. Because of my AP credits and likelihood of redshirting to play baseball, I’m also taking into account getting an MBA or JD from one of these schools. Anyways, here is my list of pros and cons for each school. Maybe you all could help me decide which one I should choose!<br>Pros of Fordham:<br><br>In NYC<br>Internship opportunities<br>School in London to study abroad<br>Will be able to play baseball there<br>Smaller class sizes<br>Considered a better school overall academically<br>I actually like the idea of the core classes<br>Campus is beautiful<br>5 year BA/MBA program or 6 year BA/JD program (plus they take AP’s)<br>Bar scene and NYC run social life<br>Cool Manresa/Honors programs I can take part in<br><br>Cons of Fordham:<br><br>Sports are not a focus<br>No Greek life<br>Limited parties (especially big ones)<br>Core curriculum does take a while<br>$15k a year for room/board<br>NYC is expensive<br>Law school and MBA is expensive, so it’d be nice to not have to spend $60k in undergrad<br>Cold winters (minor drawback, I like the cold but it makes playing sports harder)<br><br>Pros of Alabama:<br><br>Treated like a king because of NMF<br>Completely full ride plus a $3500 stipend each year<br>Greek life<br>Focus on sports (tradition, especially football)<br>Baseball would be big time (SEC)<br>College town (cool atomosphere)<br>No pressure to rush because of scholarships<br>Could spend five years and still be covered by the scholarship (even for grad school)<br>Honors college (although I know at some schools people think it’s just extra classes… I don’t think so but I’m not sure)<br><br>Cons of Alabama:<br><br>Considered a slightly lesser school academically<br>Larger class sizes<br>Worried that there are many people who could potentially distract me, pull me down<br>Could get boring not being in a huge city (although Birmingham is close)<br>Not a huge fan of stereotypical southern culture, but I recognize that Alabama is probably more diverse than I’m giving them credit for<br>I’m worried about job prospects<br>Fewer internships compared to Fordham<br>Might be harder to get a job somewhere else, whereas in NYC it might be easier to network<br>Will be harder to play baseball, and there will be an even larger time commitment (I still think it will be worth it)<br>Not sure if academic culture is the same as it is at Fordham<br>Worried about the value of an MBA from here (law school is supposed to be pretty good)<br><br>So there you have it! That’s my semi-definitive list of my pros and cons for each school, and I’d love to hear what you all think. They’re two completely different schools, and each one satisfies part of what I want from a college experience. Still, the key things that it really comes down to are: Academics, Social Life, Cost, and Value of the Degree. Based on that general criteria and my list, which school do you think I should choose? Any help is appreciated. Thanks!<br><br>", "<b>Username: prezbucky</b><br><br>So really, if we boil these down to main fit categories:<br><br>Academic fit: Fordham<br>Social fit: Alabama <br>Sports fit: Tie?<br>Cost: Alabama <br>Environmental fit: Tie?<br>Jobs/internships: Fordham <br><br>Which environment do you prefer: weather, campus, city surroundings?<br>And if you had to choose, would you rather be a baseball player at Fordham or a baseball (and football/basketball…) fan at Alabama?<br>And can your family afford to pay for Fordham without taking on much debt?<br><br>", "<b>Username: Tinymom</b><br><br>I think the biggest thing to consider is your parents’ financial position. Do they have $60K set aside for your college or would that be a struggle for them? Do they have other children to educate or is it just you?<br>And how do you see yourself in 10 years? You are obviously very bright. Do you want to be a big-city lawyer? If so, Fordham gives you a foothold in NYC. Or do you want a more laidback life with lots of fun? Alabama probably only gives you entrance into … Alabama, but that might be just fine with you. Very different schools! Good luck!<br><br>", "<b>Username: grant1509</b><br><br>@prezbucky I think you’re right on the money with that breakdown. That helps me see the big picture more clearly. And to answer your second question: I’m not quite sure. On the one hand, I recognize that part of the Alabama experience (especially things like tailgating, frat parties, etc.) is something I might not ever be able to do again in my life. That part appeals to me because I don’t ever want to feel like I missed out on something when I’m older. The same could be said for playing baseball though, because I know many people in their 40’s just wishing they could play one more game. I think if I choose Alabama I’m really going to have to commit to baseball; that way I’ll have no regrets.<br>@Tinymom this goes with what @prezbucky had mentioned as well. We do have the ability to pay $60k, but if I go to grad school then it changes everything (and as of now I’m likely to go). The amazing thing about Alabama is that I could graduate in 5 years with an MBA and have spent no money. That is unreal to think about! Whereas at Fordham, 5 years would cost around $100k (because the 5th year would be the cost of graduate school).<br>Especially if I’m hoping to go to law school, I’d rather be able to save my parents some money and possibly do some cool things with it instead (travel, study abroad, etc.). So to answer your question, yes we have the money to pay for Fordham thanks to their generous scholarship, but I do not want my parents (or myself) to face the financial burden of grad school after spending a decent amount on undergrad.<br>Also, I just talked to my dad about this decision, and one thing we decided was that I don’t have to sacrifice the big-city life just because I don’t go to school in one for undergrad. If I do well enough at Alabama and crush my LSAT, then I could very well go to a top law school on the east coast (maybe even end up at Fordham haha) and still find myself working in a big city. On the other hand, I can’t do the opposite. I can’t go to Fordham and then try to party with a fraternity and play big time baseball at 22 in Alabama!<br>So wow, I’m definitely leaning toward Alabama now; this is pretty unprecedented for me, because for the longest time I was super concerned with college rankings and status. Now I’ve realized that fit is even more important for a decision that is really contingent on your happiness rather than what some website says is better. And with my path I want to be on in life, my undergrad ranking could end up being the least important thing I’ve ever worried about!<br>Still, do I have a right to be concerned with University of Alabama academics? Will I be challenged? Will I be bored? That’s my one big fear… other than that I’m pretty much sold, even though I’ll have to think on it for a lot longer. Thank you both!<br><br>", "<b>Username: zannah</b><br><br>If you live in or near NYC, you need to try somewhere else and decide what kind of place you want to live. At Alabama, you have a free ride to a very good education. School reputation is interesting and Jesuits are terrific, but the differences in education are not as different as you and others might think. You can fly to London probably through Atlanta because of the volume of national and international flights. Alabama is within driving distance to Florida, coastal Georgia, Nashville and Smokey Mountains…There is lots to see and do in the South and some clear cultural, political and religious differences too. There are opportunities for internships in the South. An education in the South is not second class unless you don’t apply yourself academically or spend too much time socializing. Football in the South is competitive and fun.<br>Finally, I can’t imagine asking my parents to spend $60000 tuition. What are you willing to let parents and siblings give up because of your tuition? Finally, a free ride is a luxury that allows you to travel, study, invest in your education, and sort out your adult life. There is serenity and satisfaction earning an education without worrying about money. Try the South. It is an opprtunity, not a prison sentence.<br><br>", "<b>Username: grant1509</b><br><br>@zannah you’re exactly right. I didn’t mean to come off that way; I’ve actually lived in Kentucky for a few years in the past and I really enjoyed it. I think it’s something I will enjoy again in college.<br>I was just worried about how it would mainly impact the education/career part of my experience, but from what you’ve said it doesn’t seem like a huge deal. As for the money part, the more I think about it, the more I realize how much money $60,000 really is… especially when compared side by side to $00000!!!<br>I think I’m going to end up at Alabama…<br>I’m not 100% sure yet but I’m getting close to deciding; thank you.<br><br>", "<b>Username: Chardo</b><br><br>If grad school is in your plans, save the money and enjoy the Alabama experience.  The future networking opportunities will come from your grad school.<br><br>", "<b>Username: naviance</b><br><br>It seems like you prefer Alabama.<br><br>", "<b>Username: Publisher</b><br><br>Between full pay at Fordham & full ride plus at Alabama, you can afford to try Alabama for a year–not so with expensive Fordham.<br>P.S. You might want to call Bama & check to see whether or not they have a football team.<br><br>", "<b>Username: gearmom</b><br><br>@grant509  You will probably have many more fellow NMF scholars at Alabama. The academics will be challenging.<br>And @Publisher is right. They might have a football team. Not sure. <br><br>", "<b>Username: Chardo</b><br><br><br>\"\"<br>P.S. You might want to call Bama & check to see whether or not they have a football team.<br>\"\"<br><br>I heard they’re out of town right now.  Checking out some white house, I think.<br><br>", "<b>Username: grant1509</b><br><br>@Chardo I think you’re right. Thank you!<br>@naviance I think so too.<br>@Publisher football is one of the main reasons I’m actually drawn to the school! I love the idea of living in a college town for a portion of my life, and you can’t really beat Alabama football.<br>@gearmom ok awesome! Thank you! The honors college and hundreds of NMF are very encouraging.<br><br>", "<b>Username: STF4717</b><br><br>Don’t undersell the academics at Alabama.  Might be more challenging than you think…and you’re going to be surrounded by kids like you, who are chasing the merit money.  Smart kids, engaged kids!<br>I lived in NYC for a long time, and then moved to Alabama.  It was a rough transition, but I wasn’t on a college campus.  There are TONS of out-of-state students at Alabama these days.<br>The $60K is the winning argument, however.  That is a lot of money to be saving…and sets you up nicely for grad school.<br>My vote is for ROLL TIDE!<br><br>", "<b>Username: mommdc</b><br><br>I think as far as the academics go, the 75th percentile at Fordham is about a 680-690 for math and English.<br>So 75% of students will be lower than that.<br>While the 75% percentile is a bit lower for the whole UA student body, the honors and the NMF students that you will be taking classes with will have higher stats than that.<br>You now need a 1480 plus SAT for the Presidential scholarship I think.<br>In NY housing on or off campus will be very pricey.<br>Take the money at UA and take advantage of all the opportunities it awards you.<br>The money your parents save can be used for law school.<br><br>", "<b>Username: grant1509</b><br><br>@STF4717 wow! I’m sure that was a huge change, but it’s nice to know it can be done. Luckily I’ve lived in almost every part of the US up to this point so I know what I’m getting myself into, but I think you’re right that being in college will help make the transition even easier! I also think you’re right about the smart kids… especially with the honors college experience.<br>@mommdc I was actually surprised to see the top 25% of Alabama students have a 31 or higher on the ACT. I’m sure a lot of those students are in the honors college too so I think you’re right in saying that group will be overall “smarter” than the general student at Fordham (at least based on test scores).<br>I agree with both of you that the $60k would be better used toward graduate school. That’s more than a year of law school paid for right there!<br><br>", "<b>Username: Eeyore123</b><br><br>How many AP credits will you have? If you are thinking law school, If you can finish your undergraduate degree in three years, you could be 2/3 of the way through law school under scholarship. Also, don’t forget about the other $18k BAMA gives you for stipend, books, and research/international study.<br><br>", "<b>Username: grant1509</b><br><br>@Eeyore123 I just checked and I would have 34 credit hours completed!!<br><br>", "<b>Username: WildestDream</b><br><br>I would NOT pick either one based on the possibility of getting a MBA from these schools later on. Why limit your grad school to just these two? MBA programs from these two aren’t that that spectacular anyway so you should expand your options.<br><br>", "<b>Username: Publisher</b><br><br>@WildestDream: OP is thinking about the MBA from Alabama because he has a 4 year full ride scholarship, yet plans to finish his BA/BS in three years due to AP credits = my understanding.<br><br>", "<b>Username: grant1509</b><br><br>@WildestDream @Publisher it’s not that I’m limiting myself necessarily; it’s more that if I can do it for free, then why wouldn’t I? Alabama is also 5 years full ride for tuition so I could potentially get my MBA for free and then go somewhere more prestigious for law school (although Alabama’s law school is actually pretty great). So maybe I do law school at Alabama and then get my MBA somewhere else… I’m not entirely sure just yet!<br>Ultimately I think I want to end up on the east coast so that’s why I’m thinking grad school will be my end game. Lots of options and MBA or JD from these schools is just one of them. I do think you’re right though that I should expand my horizons when it comes to grad school, but I don’t want to throw away free money/degrees!!<br><br>", "<b>Username: AlbionGirl</b><br><br>I don’t think you’ll have a problem with being challenged academically, and a majority of students come from outside Alabama so you won’t be alone.<br><br>\"\"<br>Enrollment at The University of Alabama reached a record high of 38,563 for fall 2017, up more than 2 percent from last year’s record class of 37,665. More than 40 percent of UA’s 7,407-member freshman class scored 30 or higher on the ACT, and 38 percent were in the top 10 percent of their high school graduating class. The entering class in 2017 carries an average high school grade-point average of 3.72, with 34 percent having a high school GPA of 4.0 or higher.<br>41% come from Alabama<br>56% come from elsewhere in the United States<br>3% are international students from 82 countries<br>56% are women<br>44% are men<br>\"\"<br><br>UA grads are definitely accepted into prestigious law schools.  Here’s some examples.<br>Harvard<br>http://hls.harvard.edu/dept/jdadmissions/apply-to-harvard-law-school/undergraduate-colleges/<br>University of Virginia (one UA grad I know got a great scholarship to attend)<br>https://content.law.virginia.edu/admissions/class-2018-profile<br>Vanderbilt*<br>http://law.vanderbilt.edu/prospective-students/classof2018colleges.php<br><br>", "<b>Username: prezbucky</b><br><br>Of greater concern than the test scores of fellow students, when figuring out the quality of an education, are the following:<br><br>Faculty quality<br>Class sizes<br>Access to professors<br>Curricular setup<br>Available majors and classes<br>Academic support<br><br>In other words, it’s much more important to be able to hear and interact with a top-quality professor in a wide range of majors and classes set up to maximize breadth while also allowing you to “master” your major… and get help when you need it. Those are the things that, imo, comprise the bulk of a quality academic environment. Smart and engaged comrades help, but it’s more about what the school offers., IMO.<br><br>", "<b>Username: AlbionGirl</b><br><br>@prezbucky<br>I agree with this and think that OP will find a quality education in either school.  My comment regarding fellow students was in response to his original post.<br><br>\"\"<br>Worried that there are many people who could potentially distract me, pull me down<br>\"\"<br><br><br>", "<b>Username: grant1509</b><br><br>@prezbucky great points! I think that having the honors college helps by limiting class sizes and offering more engaged and possibly better professors. Also, from what I can tell, Alabama is pretty good in regards to the other factors you mentioned, especially when it comes to my potential majors! Thank you!<br><br>", "<b>Username: DiotimaDM</b><br><br>It’s sounding like Bama to me, especially with grad school on the table.<br><br>", "<b>Username: prezbucky</b><br><br>@AlbionGirl<br>Yeah – if you’re around distracted people in class, or have teammates who are less than enthusiastic in a team assignment, that can suck. Of course, those issues have more to do with discipline and motivation than knowledge.<br>I think discussion settings are where large differences in scholastic ability might come out. Another place is in the grading curve. (Though in that case, the kid with lower stats can work hard and achieve strong grades too. Dedication can make up some of that ability gap. But in discussions, sometimes you have to change on the fly, and the difference in ability can become apparent.)<br><br>", "<b>Username: prezbucky</b><br><br>Apologies for the double-post:<br>If you do go to Alabama, be careful that you don’t let the social and sports side of the experience come before your studies. This is not high school. Work hard first, and if your classes/grades are in good shape, then you can play hard.<br>Sometimes you’ll have to say no to a party, especially if UA celebrates “TGIT” like UW (-Madison) does. After a while I learned not to schedule Friday morning classes or labs, but sometimes it just can’t be helped, and you don’t ever want to be hung-over in class.<br><br>", "<b>Username: grant1509</b><br><br>@DiotimaDM I agree!<br><br>", "<b>Username: grant1509</b><br><br>@prezbucky ha! I think being hungover in class is probably something you do once and then immediately regret, then hopefully you never do it again (I personally wouldn’t know and hope I don’t have to find out). Also, I know a couple kids at Alabama and they have dutifully informed me that TGIT is a very real phenomenon, so I’ll do my best to be smart about it!<br>Finally, I just want to say that I appreciate you being mature and understanding about my desire to actually have some fun in college, which will in some way or another involve big sports games, alcohol, parties, or all of the above. I’ve seen some other threads where kids have talked about partying in college and then all of the sudden a bunch of anon parents start to question the kid’s integrity, wondering if he’s “really serious about school” and things like that.<br>I view it all as a part of the college experience. I think it’s actually the time to make some silly mistakes too before it REALLY counts. That way I can them all out of my system before I go into the real world <br><br>", "<b>Username: 5678abc</b><br><br>Wait, when you say full tuition for Fordham, do you mean you are getting a full tuition scholarship and are only responsible for room & board, etc?  Or do you mean that you would be paying full tuition and full room board expenses etc? (because if it’s the latter, it’s more than $60k per year)<br>And when you say it would be $100k, do you mean over the course of your entire education at Fordham?<br>Just curious as my younger son plays baseball, did Fordham offer any baseball scholarship money?  And at Alabama do you have an offer or would you be trying to get a walk on spot?<br>Good luck! Sounds like both options are good ones, even if they are different.<br><br>", "<b>Username: grant1509</b><br><br>@5678abc oh wow! I wish I had made it clearer. I received a full tuition scholarship from Fordham! So I’d be on the hook for just room and board for all four years, but it’s around $15k-20k because it’s located in NYC. So after four years (because of some outside scholarships), I would be spending about $60k for Fordham as compared to $0 at Alabama.<br>Fordham did not offer me baseball money but I would have a spot on the team. I would not have a spot on the team at Alabama so I would have to try and walk on. It’s tough to figure out which one to choose!<br><br>", "<b>Username: 2more2go</b><br><br>Don’t make your decision based on the MBA possibility.   If you do go for it right after undergrad, your MBA from a not top-rated school with zero work experience will not be worth much.  If you are serious about getting an MBA, you’d be better off working for a couple of years and then applying to higher rated programs.  Your employer may even pick up some of the costs.<br><br>", "<b>Username: grant1509</b><br><br>@2more2go but essentially free law school is a good reason to choose Alabama right? I mean only having to pay for one year of law school from a top 25 school seems like a no brainer to me.<br><br>", "<b>Username: my2caligirls</b><br><br>^^ agree with this - if you are leaning towards law school I think Bama with 2 years of grad school paid is too good to pass up.<br><br>", "<b>Username: grant1509</b><br><br>@my2caligirls my thoughts exactly. Grad/law school is where people seem to take on the most debt and I wouldn’t have any! That’s the way I see it now<br><br>", "<b>Username: WildestDream</b><br><br>Alabama Law is not necessarily a good reason to choose Alabama Undergrad. Only go to Alabama law if you have modest goals (think small law firm, PD/DA) and want to practice law in Alabama or the neighboring region because that’s where the vast majority of UA Law grads end up.<br>Better Law School&gt;&gt;&gt;&gt;&gt;&gt;&gt;1 year of free law school<br><br>", "<b>Username: 5678abc</b><br><br>Wildest dream brings up a good point .  Do you see yourself living in the south or northeast after graduation?  Not that you can’t move anywhere, but career services and alumni network will tend to be more strongly connected with compAnies in their area.<br><br>", "<b>Username: grant1509</b><br><br>@WildestDream @5678abc fair point, although it will actually be two years of free law school, with the possibility of a third if they extend my scholarship (which can be requested from the school).<br>While I do recognize many alumni stay in the neighboring region (and over half stay in Alabama), I think that’s because most of them are already from the south. There are still many grads who go elsewhere, even if it’s a much smaller number. The nice thing is that over 22% of grads get into big law or receive a federal clerkship; while this number isn’t huge, it means that if I’m in the top 10% of my class then I will have many different appealing options.<br>Also, I’m not 100% deadset on being a lawyer; I do recognize the value of law school even without directly going to law. What I might do is go get my MBA from a top school in the northeast after a few years of working and then I’ll be able to network there if that’s where I want to end up. My point is that I think I will have options, especially with zero debt. And even though I understand that Alabama might be more concentrated, it’s a bonafide top 25 school and I don’t think I’d be limited if I go there and do well.<br><br>", "<b>Username: 5678abc</b><br><br>It sounds to me that you have done a great job of analyzing the pros and cons of both schools.   And both options sound great.  What is your gut telling you at this stage?  Seems like maybe it’s leaning towards Alabama.  Does Alabama also have club baseball?  If so, if you weren’t able to walk on the baseball team you could still play quality ball. ( without as big a time commitment as D1 baseball which could leave more time for study abroad and internships etc)<br><br>", "<b>Username: grant1509</b><br><br>@5678abc I’m definitely leaning toward Alabama… the one thing is still baseball, but I’ve kinda thought about it like this: if I am going to play college sports, if I’m going to sacrifice countless hours and let it take a toll on my body, I want to do it at the highest level possible. SEC baseball seems like the best option to do that! It will be a grind, and I might not even make it (it’s actually likely I won’t), but if it’s really worth it then I’ll be able to tell. Worst case scenario if I find out I want to continue baseball and can’t play at Alabama, then I could transfer to another school. I obviously don’t want to do that, but I think it’s something I’ll be able to figure out if I truly can’t live without baseball. I guess my point is that Alabama doesn’t limit me, and I really like that about it!<br><br>", "<b>Username: evergreen5</b><br><br><br>\"\"<br>essentially free law school is a good reason to choose Alabama right? I mean only having to pay for one year of law school from a top 25 school seems like a no brainer to me.<br>\"\"<br><br>Choose Alabama for the undergrad value, which includes saving money for grad school.  Do not choose it for the law school value.  You can make the law school choice at a much later date, after you have a better idea of your future geography and likely apply to some T14s as well.  (Do not underestimate how much more difficult it is to get a BigLaw interview, let alone a job, at a firm outside the region as an Alabama law student than it would be as a T14 law student.  The difference in ranking between, say, a #10 and #27 is much larger than it may seem and is not analogous to undergrad ranking systems, where such a difference would be slight.)<br><br>", "<b>Username: itsgettingreal17</b><br><br>Not everyone wants or belongs at a T14. More importantly, why does everyone on CC assumes a student wants Big Law.  Geez!<br><br>", "<b>Username: Cookies510</b><br><br>@itsgettingreal17 so true… its a grind and there is high turnover.  I’m at Big Law with an ancillary group so slightly less of a grind but so many lawyers don’t enjoy the environment and move on.<br><br>", "<b>Username: Chardo</b><br><br>True, not everyone belongs at a T14 or wants Big Law.  But there’s no denying that T14 affords options not available to most grads of other law schools, or at least makes them far more accessible.  I’m not a big proponent of rankings vs. success when it comes to undergrad, but law school is different.  Case in point, and I know it’s just anecdotal, but my brother graduated T14, decent but unspectacular grades, probably top half, with nothing special as far as law review or other credentials.  He stopped taking interviews after the first 9 firms, including several Big’s.  His wife went to a mid tier law school, similar resume.  She got interviews only with smaller regional firms.  The more prestigious firms will only look at the very top students from schools like hers.<br>Now even if you don’t necessarily desire Big Law, starting out there opens all kinds of doors.  Many move on to smaller firms, clerk for judges, and other things enabled by having those connections and that line on the resume.<br><br>", "<b>Username: grant1509</b><br><br>@evergreen5 that’s very fair. Because I’m not entirely sure of my future prospects, you’re right to say that I shouldn’t be making those type of decisions now. I’m really just trying to make sure I take full advantage of the five year scholarship… maybe I could get a masters in something else… possibly economics! Or political science! So many options.<br>@itsgettingreal17 @Cookies510 you are both correct that big law may not be right for me. While I like the hustle, I’m not sure if it’s something that I want to do long term. When I’m no longer young and full of energy I’m not sure I’d appreciate it as much… then again, I can’t be sure as I only have Internet forums and other people’s experiences to go off of. I guess I’ll be able to find out for myself in a few years <br><br>", "<b>Username: grant1509</b><br><br>@Chardo that makes sense, and I’ve heard similar things from nearly everyone else: higher ranked law school = more opportunities. I’m sure I will apply to some T14 schools after finishing undergrad to see if I can get in and to see if the money is worth it. Just have to crush my LSAT! Best case scenario would be to get a 3.8 with a 170 (which may sound unreasonable but I’m asking you to trust me: with months of prep and my drive, I think it is doable).<br>That way I could get into some of those T14 schools and maybe even get a scholarship from some of the lower-end ones, although that might be a long shot. I guess I just ultimately want to have as many options as possible, and doing well on the LSAT makes that a reality for me. That’s where I have to start!<br><br>", "<b>Username: Chardo</b><br><br>@grant1509 I would expect nothing less than 3.8 from someone with your credentials.  With plus-minus grades at UA, an A+ being worth 4.33, the top students like you that gets lots of those have an easy time being at or near 4.0.  Every year there are hundreds of President’s List 4.0 grads.<br>The 170 LSAT is not as easy, but not unreasonable.  My brother actually had no intention of law school.  He was getting his MBA, and working at a test prep place to make some money.  He was teaching an LSAT review course.  Decided that if he’s teaching the course, he should take the test for the experience.  He got 175.  Then he said I guess I have to go to law school.<br><br>", "<b>Username: grant1509</b><br><br>@Chardo that’s awesome that it worked out that way for your brother! Maybe I can luck into something like that.<br>And thank you for the vote of confidence. I know that if I work hard I can maintain a really high GPA, although I had no idea about the weighting of UA’s grades. An A+ being a 4.33 is really nice. Now I just have to go out there and perform! Hopefully in three years I’ve got some really good law school choices (if that’s the route I pursue). I’ve also been looking into a Masters in Economics and a Masters in Political Science from UA… both are only one year and it might be nice to have before law school, especially if I realize I’m not going to UA! It would guarantee that I take full advantage of the scholarship while not limiting my law options. Win-win!<br><br>", "<b>Username: grant1509</b><br><br>Hey everyone! Yesterday I went to an awards ceremony and was offered a $40,000 scholarship (10k for 4 years) from an organization in my state!! The gratitude I’m feeling at the moment is beyond words… it’s a true life-changing opportunity. As far as I’m aware, the scholarship can be used for any educational expenses as long as it’s billed by the school. What I’m wondering is how that works with the full ride from UA?<br>I’d use part of the $10k for a meal plan, and then other parts for technology/supplies/fees (if I can), but what about the money that’s left over? Would the University of Alabama just give it to me, kind of like an extra stipend? That would be incredible if they would, but if not then I don’t want to just throw away the money. Maybe I could ask the foundation to put it toward my graduate school if I need it? What do you think?<br><br>", "<b>Username: DiotimaDM</b><br><br>@mom2collegekids ^^^  OP has significant outside scholarship. How does stacking work at Bama?<br><br>", "<b>Username: privatebanker</b><br><br>Goodness gracious. Grant, I like your idea of and mba and law degree to help you have a wide array of options in the business world. M and A work or law. Inside gc or just a traditional commercial banker or executive with a law degree is very impressive. All kinds of industries would value that combo. Who knows if you want to be an associate at Skaden. Nothing wrong with that but maybe won’t be your path.<br>Don’t plan your whole life right now. Go to a school where you will do the best academically. The extracurriculars are icing on the cake not the main ingredients.<br>I would personally go to Fordham and play ball. But that’s me.<br><br>", "<b>Username: grant1509</b><br><br>@privatebanker it’s funny to me because I’ve only just turned 17 (I skipped a grade) and I feel the need to plan my entire life in the matter of a couple weeks. It’s ridiculous, I know, but how can I not when the biggest decision of my life to this point is coming at a time where I can’t even vote yet? I’m not crazy, right? The whole concept of having teenagers make a life-altering choice based on what they read on internet forums and hear from Uncle Joe is completely ludicrous in my opinion.<br>It’s for that reason that I overanalyze it; I perpetually hedge my bets with the hopes that this one decision does not end up being the one that ruins the rest of my life, or throws away my years of hard work, or at the very least limits me in what I want to do. I just want to be sure I’m making the right choice, and simulating possible outcomes hundreds of times in my head, self-determining the probability that my college choice ends up going the way I want it to, and then posting rambling comments on this forum is my way of managing it all. Maybe not the best idea, but it can’t be the worst either.<br>As for a JD plus MBA, thank for your confirming the notion that it is a smart career choice. The key for me is doing it with as little debt as possible, so that’s why I’m leaning toward Alabama. This new scholarship ($40k) could change things, but I’m still not sure. Thank you.<br><br>", "<b>Username: privatebanker</b><br><br>Good luck. Neither school choice will lock in your fate one way or the other. When you graduate from either you will be back on here telling kids just like you how great it was.  and forever flying into bama to see the big game wearing the red and white.<br><br>", "<b>Username: 4Gulls</b><br><br>If you haven’t seen this article from Chicago Tribune, you might find it interesting.<br>http://www.chicagotribune.com/news/ct-met-illinois-students-brain-drain-20180405-story.html<br>Lots of OOS kids at Alabama.<br>That said, I’d seriously consider Fordham - especially with the latest financial award you received.   A lot of kids live off-campus after freshman or sophomore year, which can reduce cost of housing.  The study abroad program is great.  Honors College comes with lots of other perks, too.  Plus baseball!  Have you visited both campuses and gone to accepted students days?  What did you think of other kids you met?<br>You sound like you’ll excel no matter which school you pick.  Post your decision May 1st!<br><br>", "<b>Username: Longhaul</b><br><br>OP, Bama will permit you to use the 10k/yr towards college charged expenses and then payout to you the difference which you can use towards books, etc.<br>Just research how that money is taxed.  Anything towards room and board is taxed as income.   I believe it kicks in after 2500.  And, it used to be taxed at PARENTS tax rate.  Not sure with new 2018 tax code.   Definitely something to look into.<br>Congratulations!<br><br>", "<b>Username: grant1509</b><br><br>@4Gulls great article! I’ve seen so many people mention how often Alabama gets mentioned on CC (some who are less than pleased), yet to me it seems deserved. When you are a public, flagship university and are giving away almost $150 million in merit aid, I think that deserves some recognition!<br>As for Fordham, it truly is amazing. I’d be able to study at their satellite campus in London if I wanted, I’d play baseball for sure, and the honors college is actually one of the big reasons why I want to go, although I haven’t been accepted into it yet which is unfortunate. I think only ~30 kids get in and I guess I wasn’t selected <br>I was not able to visit on admitted student days because of baseball and family conflicts, but I’ve been to Fordham’s campus recently. While I haven’t been able to visit the University of Alabama, I’m pretty well aware of what I’m getting into. I’ve talked to 5+ recent alum, called their offices ~10 times with various questions, and contacted a few underclass students there already. As a whole, they were pretty unbiased (except for admissions of course) seeing as they all had different experiences. Because of this, I think I have a good idea of what I’d be getting into.<br>I love the culture at both schools, but what really separates the two for me is the school spirit and pride. Fordham has it, but it’s different because many students are essentially living in NYC and going to school at Fordham. I’m not just talking about commuting; it’s even their motto: “Fordham is my school, New York City is my campus”. So while that is awesome, it loses some points for traditional college feel (sports, tailgating, parties, dorm culture, etc). Alabama on the other hand is a true college town and has all of that in spades.<br>I think what’s really appealing for me is the fact that the Fordham experience doesn’t have to be limited to this moment in my life, whereas Alabama does in a sense. After graduating from Alabama undergraduate, I will be 20 years old, so I can still go to Fordham or some other NYC or Boston school and enjoy that city lifestyle and ultimately end up there if I want. If I go to Fordham, I don’t think there’s a very high chance I’d end up in the south, and I think it’s at least worth it to experience it sometime in my life.<br><br>", "<b>Username: grant1509</b><br><br>@Longhaul that would be incredible! So I would pay ~$4k for a meal plan and then maybe $1k for any other miscellaneous charges, meaning I would be able to pocket about $5000. Then after it’s all taxed I’m sure that might be cut in half (assuming a ~25% tax rate of the $10k), but pair that with the $3500 stipend I’d already be receiving and I would have around $6000 to spend… as a college student! Wow…<br>At Fordham, my current cost of attendance in total would be $15k-$20k/year (including various expenses associated with being a college student and living in NYC). The $10k scholarship helps immensely and makes it $5k-$10k/year, but that’s still $20,000-$40,000 over the course of four years that my parents would be funding, compared to the $20,000+ I would be earning over five years at Alabama.<br>So Fordham is still something to consider due to the quality of the education and the location, but I think that Alabama sets me up for life in an almost impermeable way. Wow, this is tough!<br><br>", "<b>Username: twoinanddone</b><br><br>Do you think you could make the baseball team at Alabama?  I don’t know how good you are, but there are just going to be some teams that are out of reach.  My daughter could have gone to a D1 school and made the team but not ANY D1 school.  She could play at Fordham but not at Florida (Alabama doesn’t have her sport) or Maryland.  UMass?  Maybe.<br>I ask this because Alabama may be a different experience with sports than you are planning.  I’d pick Fordham if you can afford it.<br>Also, is there a chance for you to get a baseball scholarship after the first year?  A friend went to Fordham on a small swimming scholarship and by her senior year it was full tuition.<br><br>", "<b>Username: grant1509</b><br><br>@twoinanddone you raise some great questions, and I’ve thought about them long and hard for the past two weeks. Like I’ve mentioned before, I skipped a grade, so I’m not physically mature yet. I’m sitting upper 80’s with my fastball and three solid offspeed pitches, which puts me in solid D1 territory pitching-wise. Most Alabama recruits are around 90-91 freshman year (and almost all are bigger than me), but all of them are a year or two older than me as well. Personally, I know I have more left in the tank, I know I’m going to grow more and get stronger, and I know that I will work my butt off to get what I want.<br>I’ve talked to a couple ex-college coaches (one was a mid-major D1 head coach for 20 years, the other coaches a JuCo that has won a national championship) and I asked them to give me their honest opinion, no holding back. Both said that I could go to Fordham and play… possibly play a lot, even as a freshman. They said that there would be no guarantees at Alabama, that I’d have to work harder than everyone else, and that I would have to redshirt freshman year without a doubt.<br>Both said that because of my academic scholarship, I’m a free player, and that gives the coach incentive to work with me at least for the first year and see how things go. Still, because I’m not an athletic scholarship guy, that also allows the coach to cut ties that much easier.<br>After my redshirt year, and especially after my sophomore fall, I’d have a pretty clear indication of whether or not it’s going to work out. For me, that’s a risk I’m willing to take to play baseball at the highest level because it’s something I truly love. But both coaches also recognized that baseball isn’t my end goal in life, and both mentioned that I may give it all I’ve got for two years, it might not work out, and then maybe I’m okay with that because I know I gave it my all. Or maybe I do that and then end up transferring if I realize that baseball is that important to me.<br>Also, Alabama is in the SEC so that makes it a top-50 type school, but it’s also in the bottom half of the SEC. I’m not taking anything away from the school’s baseball program; I’m simply saying that it’s different than schools like Vandy or Mississippi St, at least for baseball. Alabama will have plenty of guys drafted, but it’s not like those schools where nearly every guy is a draft-worthy prospect. I think that fact, coupled with the NCAA regulations that limit scholarships to 27 out of 35 players on a D1 baseball team, give me the long shot that I need to make the team.<br><br>", "<b>Username: DiotimaDM</b><br><br>Please call Bama to ask about stacking. It would be unusual for a school to let you stack scholarships in excess of full COA. Maybe Bama does, but it’s worth a call to be certain, especially if you’ll be basing an important decision on the answer.<br>If they won’t stack it you can talk to the scholarship provider. Maybe they will let you save it for study abroad or grad school.<br><br>", "<b>Username: grant1509</b><br><br>@DiotimaDM good call on having me check with them. They said that the outside scholarship will go into my school account, and then any money not used in my account will be refunded to me! That’s huge! Even though it’s taxed, I will have well over $20,000 given to me over four years, along with my fifth year still being free in regards to tuition. I’m not sure how I can turn this down?<br>I’m thinking three years of undergrad at UA for sure, then I could get a Masters in public administration or criminal justice over the next two years (I know they’re completely different). After that, I can go to a different law school if I want, or I can just go to Alabama law school if that’s what I decide is best! I’ve seen many articles about kids with above a 165 LSAT getting full rides to some good law schools. I think that’s more than doable for me. So many options, and no debt! I feel extremely lucky right now.<br><br>", "<b>Username: DiotimaDM</b><br><br>Awesome, congratulations!<br><br>"]}