{"title": "duke vs berkeley", "comments": ["<b>Username: physicsgod981</b><br><br>Hi there,<br>I am a high school senior (Asian American male) from the Bay Area in California looking for insights and perspectives on the tough decision of where I should attend this fall. I have gotten into many schools (UC Berkeley, UCLA, USC, Duke, Rice, Vanderbilt, etc.), but I have narrowed my choice down to Berkeley and Duke. At Berkeley, I got in for EECS, and at Duke, mechanical engineering, although it is likely that I will switch into ECE/CS (also thinking of minoring in business). I am not 100% sure I want to go down the CS path, but I think it is the most likely area I will pursue, and I have always pictured myself coming back to the Bay Area for graduate school (Berkeley or Stanford) and then to work for a top startup or tech company. However, I have not ruled out other paths like medical school or going into business.<br>For the last two weeks, I have come up with the pros and cons of both schools, and right now, I am leaning toward Duke, but I would greatly appreciate any additional insight. I will be visiting both schools next week. Also, money is not an issue and my parents will have no problems paying the tuition for either school. Here’s how I see both schools.<br>Duke pros:<br><br>Private school (more attention, access to professors who invest more into their undergraduates, easier to gain research opportunities, smaller classes, alumni connections, etc.)<br>Tight-knit community, very supportive, and lots of school spirit (I have played basketball all my life, so going to Duke basketball games is very appealing to me)<br>Research Triangle (not comparable to Silicon Valley, but there’s a fair share of startups and definitely an entrepreneurship culture)<br>Students overall more intellectual, student body more diverse<br>Very flexible education (can add majors/minors/certificates, mix and match easily), also a more comprehensive liberal arts curriculum<br><br>Duke cons:<br><br>Its engineering (CS/ECE) program is not very strong or well-known. Not many high achieving faculty. This is the biggest concern.<br>Unsure of prospects for graduate school/job placement in tech companies (similar to the point above)<br>Social hierarchy/clique nature of the student body<br>Far from home<br><br>Berkeley pros:<br><br>EECS is incredible, top 4 CS program in the nation.<br>Location is prime (Silicon Valley), next to many startups and tech companies<br>Tons of faculty, all of which are very accomplished and doing cutting-edge work<br>Heavy recruiting, getting into graduate school/job at a top company will be very attainable<br>Close to home (about an hour drive)<br><br>Berkeley cons:<br><br>Public school (little support or guidance, large class sizes, “you are on your own” kind of feeling, professors more focused on research than teaching (often graduate students or TAs will teach))<br>Very competitive (not sure about cutthroat though), and the EECS curriculum is very tough<br>Education not as flexible, will be heavily focused on engineering courses and less on liberal arts<br>Not very diverse, high percentage of Asians, and generally, the student population is not as intellectual<br>Surrounding area is sketchy<br>Community not very strong or supportive, little school spirit<br><br>Overall, Berkeley clearly has the stronger engineering program, and I am confident going to Berkeley would lead me down a pretty certain path for a successful future. However, I also feel like I would like to have a new life experience (Berkeley is super close to home and its student culture is extremely similar to that of my high school) and develop as a person. I definitely see myself enjoying life significantly more at Duke given its student life and community, and I don’t necessarily see its engineering program as a complete nightmare either (please correct me if I’m wrong). As a self-motivated and hard working person, I am confident that I will use Duke’s resources to the fullest and put myself in a good position for graduate school or a job in the Silicon Valley (again, though, I am not sure how much an engineering education at Duke would limit me). Duke also offers great flexibility, and as a top private institution, will give me alternatives if I decide later on that CS is not for me. On the other hand, if I go to Berkeley, it seems very likely that I will be studying pretty much all the time, and while I am not one to shy away from a challenge, I simply don’t think this may be worth it in the long run, as only having a great deal of technical knowledge won’t necessarily get you far in your career. I believe college (undergraduate) is a time to grow as a person, develop some new experiences and life skills, and gain a general education more than anything.<br>This post is getting quite long, so I think I will stop here. If anyone can give me any valuable advice on where I should attend this fall, that would be great. Thank you for the help!<br><br>", "<b>Username: menloparkmom</b><br><br>If Duke is more expensive then go to UCB.<br>Your parents will thank you for saving them big $$  AND you will have more access to jobs in Calif when you graduate.<br>to me its a no brainer.<br><br>", "<b>Username: Massmomm</b><br><br>At Duke, you may have an easier time getting into interesting courses that aren’t in your major, which would lead to a well-rounded education. You’re absolutely right about the importance of a general education. I’m speaking as a strong supporter of a liberal arts education, though, and not everyone shares my view.<br>Cal is notably stronger in the field you want to study, so if you are certain CS is it for you, it may be better to go there. Even full pay parents love a bargain, and will thank you for saving them money!<br><br>", "<b>Username: preppedparent</b><br><br>Daughter graduating from Cal next month. full disclosure. To me, Cal is a no brainer.<br><br>", "<b>Username: LoveTheBard</b><br><br>How do finances play into this? Unless money is not a consideration or Duke gives you enough assistance to bring it to Berkeley’s level, this should certainly figure into your equation.<br>The other things you need to consider is how certain you want to pursue engineering/CS and how much you want the type of college experience that a school like Duke can provide. They are both great schools, but if you are looking for that quintessential college experience (school spirit, sports, Greek life) and want a strong liberal arts curriculum, Duke is probably a better choice.<br><br>", "<b>Username: privatebanker</b><br><br>You also have to live there and enjoy the people around you. Your education also includes the experiences and people you meet outside of the classroom and labs. Consider the climates of both schools into your equation as well. It’s more of a multi variate regression analaysis than 1 plus 1 equals 2. It’s not a slam dunk  in my estimation.<br><br>", "<b>Username: ParentOfTwo99</b><br><br>My daughter was admitted to UC Berkeley and Duke.  She chose Duke and is currently a freshman.  She is definitely not an engineer type, more of a liberal arts student (although may consider Law or MBA down the road).  It was an easy decision for her.<br>Duke doesn’t have a business undergraduate major/minor.  So keep that in mind.  They do have an MMS certificate (you can research that).<br>If you want to pursue CS and work in Silicon Valley, I’d say go to Berkeley without a doubt.  As you know, Berkeley is known for its CS program.  Duke’s engineering programs are quite rigorous though.  It will be a challenging program.  [Did you know the Duke’s Biomedical Engineering program is a top 4 program in the nation?]  The Duke brand name will be good if you decide on medicine or business grad school.  Duke pre-med students have a high success rate at getting into medical school (something like 90% of students).<br>My daughter loves Duke.  She attended most basketball games this year.  Did tenting for the UNC game.  Great school spirit.  She did get tired of taking the bus to/from East/West campus.  She already has a dorm assignment for Sophomore year.  Close to West Union.  Most of her Fall, 2018 classes start at noon.  She is a night owl, so she’s in heaven.<br>Duke has a lot of Asian students, but more diversity than Berkeley.  There is a social hierarchy on campus - but this is over-blown and only becomes an issue if you let it bother you.  My daughter joined a sorority but only attends certain events - mainly ones that don’t involve alcohol.  She isn’t a party animal.  She joined a few organizations that she really likes and plans to continue with them next school year.<br>Good luck with your decision!<br><br>", "<b>Username: JenniferClint</b><br><br>Duke’s engineering department is small but the faculty is top class.<br>Posting some links that may be of interest:<br>http://www.businessinsider.com/the-best-colleges-for-software-developers-2014-10<br>https://trinity.duke.edu/initiatives/quantitative-initiative<br>https://news.crunchbase.com/news/venture-capitalists-go-college/<br>To put things in perspective, 56 VC investment partners did their undergrad at Berkeley while 32 went to Duke. Since Berkeley is roughly 5 times the size of Duke (and its student body is less academically diverse), Duke appears to be outperforming Berkeley handily on a per capita basis. This is just one metric but the point is that overall output should not be conflated with quality.<br><br>", "<b>Username: nollagam</b><br><br>It looks like many of the things you’ve heard about Berkeley are simply, myths.<br>The EECS at Berkeley is NOT cutthroat. Far from it. EECS students are used to do team-working. It’s a highly collaborative environment where everyone is helping each other out.<br>The College of Engineering students rarely complain, if at all they do, about the lack of resources dedicated to undergrad students. It’s also not true advising is lacking. You’ll get plenty of it there.<br>And, Berkeley being less diverse than Duke? Really? That’s new to me. I’ve been to many top-ranked schools and I have yet to see a school with a more diverse student body than Berkeley’s.<br>I have no idea how Duke takes care of its students. But Berkeley COE environment is top-class.<br><br>\"\"<br>and generally, the student population is not as intellectual.<br>\"\"<br><br>This is another myth. Can you show us any data to support this? Only 8% get into the College of Engineering, less than 8% in the College of Chemistry. And, less than 6% get onto EECS. I would love to see any data that would show Duke’s student body is more intellectual than Berkeley College of Engineering student body.<br><br>", "<b>Username: preppedparent</b><br><br>&lt;&lt;- Students overall more intellectual&gt;&gt;  ???<br>I don’t see how Duke is more intellectual, if anything I think its more a party school. The brightest and best kids are at Berkeley. My daughter (graduating senior) used to always say one of the best parts of being at Berkeley were the students because they challenge each other to raise their game. She says everyone deserves to be there because they are all brilliant.<br><br>", "<b>Username: UpMagic</b><br><br><br>\"\"<br>Not very diverse, high percentage of Asians, and generally, the student population is not as intellectual<br>\"\"<br><br>Are you serious?<br><br>", "<b>Username: sdhotmama</b><br><br>‘The student population is not as intellectual”<br>Based on what? Reddit?<br><br>", "<b>Username: makennacompton</b><br><br>Duke = “party school” is about as credible as Berkeley = “all Asian”  Neither is.<br><br>", "<b>Username: Nocreativity1</b><br><br>USNews      Duke 9   UCB 21<br>USA Today  Duke 4  UCB 52<br>Forbes         Duke 8   UCB 29<br>WSJ            Duke 5   UCB 40<br>Best Coll.     Duke 7    UCB not in top 25<br>Published rankings don’t indicate where a student will thrive they do however provide an indication of reputation, brand familiarity and popular perception all of which contribute to eventual career opportunities.<br>Duke in this regard clearly has an advantage.<br><br>", "<b>Username: sdhotmama</b><br><br>But if you focus on engineering proram as OP seems to, Berkeley consistently ranks higher than Duke. For example, US News ranks Berkeley #3. So I don’t think you can use ranking to say one student body is more intellectual than the other.<br><br>", "<b>Username: Nocreativity1</b><br><br>I didn’t suggest either student body has an intellectual edge.  I am saying that in the real world most people focus on the broader and household name rankings. In every one Duke has an indisputable and substantial edge.<br>I can observe that the disparity between a Duke and UCB engineering degree is much narrower then the broad difference by which Duke surpassses UCB in name recognition, brand respect etc based on the aforementioned rankings.  Consequently, the 17/18 year old OP should be confident that the post college adult doesn’t want to pursue a career outside of engineering.  Again both great schools but Duke clearly is a safer long term option in my opinion.<br><br>", "<b>Username: physicsgod981</b><br><br>I apologize if the Berkeley “less intellectual” comment came off that way. I just meant to say that Berkeley’s acceptance rate is much higher and that there is a larger spectrum of applicants they admit.<br><br>", "<b>Username: ucbalumnus</b><br><br>The Duke “party school” reputation may come from 30% of men and 40% of women joining fraternities and sororities.<br><br>", "<b>Username: Pentaprism</b><br><br><br>\"\"<br>I just meant to say that Berkeley’s acceptance rate is much higher and that there is a larger spectrum of applicants they admit.<br>\"\"<br><br>Is the “acceptance rate” you’re using for the whole university, or for CoE at UCB?<br>About 6 years ago, my D (now a CS PhD student at UCB) got accepted to Duke and to EECS Berkeley, she (and we her parents) didn’t think twice about choosing which school.<br>Are you more into EE or more into CS? If CS, take a look at what Simons Institute has to offer.<br><br>", "<b>Username: JenniferClint</b><br><br>“I don’t see how Duke is more intellectual, if anything I think its more a party school. The brightest and best kids are at Berkeley. My daughter (graduating senior) used to always say one of the best parts of being at Berkeley were the students because they challenge each other to raise their game. She says everyone deserves to be there because they are all brilliant.”<br>You can’t compare a giant state school to an elite private university. The best students at Berkeley are on par with the best students anywhere but there is much more variability at the bottom of the class. This is the price state schools pay for ensuring access to a great education. Berkeley’s mission is very different from Duke’s mission.<br>Also, Duke has almost twice as many Rhodes scholars as Berkeley (despite being a fraction of the size). Not bad for a “party school”.<br>http://www.rhodesscholar.org/assets/uploads/2018%20RS_Number%20of%20Winners%20by%20Institution.pdf<br><br>", "<b>Username: UCBUSCalum</b><br><br>Make sure you check out the surrounding areas around Duke University.  A colleague of mine was a UC Berkeley grad about 25+ years ago and was in the PhD program at Duke.  He never felt comfortable with the surrounding areas.  He said at that time, there were quite a few hillbillies around the Duke campus area and felt uneasy. Eventually, he dropped out of the PhD program.  But that was 25+ years ago and maybe things have changed since then.<br><br>", "<b>Username: Nocreativity1</b><br><br>I was just there on a tour.  Immediate surroundings were great.  Amazing food on 9th street near east campus and known as a culinary incubator.  Lots of creative chefs taking advantage of the research triangle.  The city of Durham also had some great food ranging from tapas to oven gourmet pizza.  Also home to the Durham Bulls.<br>The good news is with 6,000 kids on 8,000 plus acres of campus there is plenty of room for Duke students to spread out.  By comparison UCB has 29,000 undergrads on 1,232 acres.<br>Lastly I was in Oakland 25 years ago and felt very unsafe.  Has it changed and how did the riots several months ago effect the students experience.  Just asking.<br><br>", "<b>Username: ucbalumnus</b><br><br>Crime generally was much higher in the US 25 years ago (close to the peak of the crime wave*) than it is now.<br>*That was probably caused by leaded gasoline and which we are still paying for (criminals in expensive prison, etc.).<br><br>", "<b>Username: JenniferClint</b><br><br>“there were quite a few hillbillies around the Duke campus area and felt uneasy.”<br>Must we resort to nonsensical scare tactics?<br><br>", "<b>Username: nollagam</b><br><br>@NoCreativity : No offense, but it’s clear that you were nitpicking ranking league tables. How about showing you league tables where Berkeley did not only outrank Duke, but smashed Duke to the ground:<br>US News & World Report Best Global Universities 2017:<br>https://www.usnews.com/education/best-global-universities/rankings?int=a27a09<br>Berkeley - #4<br>Duke - #21<br>Academic Ranking Of World Universities 2017: http://www.shanghairanking.com/ARWU2017.html<br>Berkeley - #5<br>Duke - #26<br>Times World University Rankings 2017: https://www.timeshighereducation.com/world-university-rankings/2017/reputation-ranking#!/page/0/length/25/sort_by/rank/sort_order/asc/cols/stats<br>Berkeley - #6<br>Duke - #28<br>Center For World University Rankings 2017: http://cwur.org/2017.php<br>Berkeley - #7<br>Duke - #29<br>You mentioned school prestige. For me Berkeley is MORE prestigious than Duke. And, I think there are way many, many more people who would agree with me. There’s even a ranking exclusively devoted to school prestige or school brand name: https://www.timeshighereducation.com/world-university-rankings/2017/reputation-ranking#!/page/0/length/25/sort_by/rank/sort_order/asc/cols/stats<br>Berkeley - #7<br>Duke - #28<br>And, again, we’re talking about Berkeley EECS versus Duke mechanical engineering on here where Berkeley is regarded a solid top school for engineering while Duke isn’t even in the radar in this field. And if you’re talking about grads breaking into banking, here’s another data where Berkeley, again, outranked Duke.<br>The top 50 universities for getting a front office investment banking job. https://news.efinancialcareers.com/uk-en/199099/top-50-universities-getting-front-office-investment-banking-job<br>Berkeley - #9<br>Duke - #24<br><br>", "<b>Username: nollagam</b><br><br>@JenniferClint : Duke is a good school. It’s engineering program is decent. A Duke engineering degree will open doors for you. But Berkeley is in a whole different league. Berkeley competes only with two other great schools in this regard – Stanford and MIT. Duke, sad to say, just isn’t in their league yet. So, let’s not try to confuse people on here and letting them believe Duke engineering degree carries much more clout and prestige than a Berkeley engineering degree. It is a complete reverse.<br><br>", "<b>Username: Nocreativity1</b><br><br>Ad hominem attack aside I just cited the 5 rankings I see most frequently referenced.  I accept the ones you point out to be a fair counterpoint.<br>In terms of your Wall Street comment I have to disagree based on personal experience.  I am a 30 year veteran banker and while there are several very successful UCB alumni I have crossed paths with Duke is represented to a far greater degree.  Duke is a target school for every major USIB I am not aware of UCB being a target of any major.<br><br>", "<b>Username: nollagam</b><br><br>@Nocreativity1 : Can you name a “major” company/firm/financial institution that doesn’t target UC Berkeley?<br><br>", "<b>Username: nollagam</b><br><br>@Nocreativity1 : The reason why I asked is because all MAJOR surveys (which can be actually verified online) contradict your claims. But then again, you said it was only your personal experience.<br>Anyways, the ff links may help you get aware about how Berkeley isn’t inferior to Duke with regards to placing grads to banking/financial institutions:<br>Schools That Help Get The Job You Really Want<br>https://poetsandquantsforundergrads.com/2017/12/05/b-schools-help-get-job-really-want/<br><br>UPenn Wharton<br>UC Berkeley Haas<br><br>The top universities for working at Goldman Sachs in the U.S.<br>https://news.efinancialcareers.com/uk-en/240377/the-best-universities-for-getting-a-job-at-goldman-sachs-in-the-u-s-europe-and-asia-within-ma-trading-risk-and-ops<br>1. Columbia<br>13. UC Berkeley<br><br>Duke<br><br><br>", "<b>Username: Nocreativity1</b><br><br>http://www.businessinsider.com/investment-banking-recruiting-report-biggest-takeaways-2018-2<br>Also I am a senior executive at a bulge bracket IB and have worked at two others.  In all cases we did have UCB alumni on staff but it was never a target recruiting School for the IB analyst training programs. That is my experience.<br>I no nothing about CS but without question Duke is preferred on Wall Street.<br><br>", "<b>Username: Nocreativity1</b><br><br>For full disclosure the exception to that comment is Blackstone which does heavily recruit at UCB.  Great firm run largely by former DLJ alumni where I was a partner.<br><br>", "<b>Username: makennacompton</b><br><br>Yes, and Harvard only began engineering about 10 years ago.  Yet, would  you rather have Harvard or Berkeley behind your name for the next 50 years of your career?  Case closed.  Duke is the better name.<br><br>", "<b>Username: nollagam</b><br><br>@Nocreativity1 : My point was – you’re not going to put yourself in a disadvantage position if you go to Berkeley instead of Duke, if you want to break into banking, or the financial industry, in general.<br>Now, the OP didn’t say he’s interested in banking. In fact, he clearly stated that he applied to, and got accepted onto, the engineering programs at both schools. Meaning to say, he’s interested in acquiring an engineering degree. If later he decides to head to banking/finance, both schools can serve him that well, as records have shown it. But, what if he decides to stick to the engineering field, or become a startup founder or wants to work in SV? Will attending Duke be better of for him in any of those regard? I don’t think so. In fact, I would politely argue that he will be putting himself in a disadvantage position given that that industry highly favors Cali schools, and Berkeley isn’t only a highly favored school in SV, but is also positioned in the heart of the Bay Area, the center of where the action in the tech industry is.<br><br>", "<b>Username: UCBUSCalum</b><br><br>@JenniferClint those words were not meant as scare tactics.  They were the exact term used and quoted from a former UC Berkeley graduate in the PhD program at Duke.  That is why I said to visit the Duke campus and the outlining areas.  My former colleague who made the comment is not even a minority or person of color.<br>In passing, I might ask another guy about the Duke area.  He is on my floor and has a Duke MBA within the past 8 years.<br><br>", "<b>Username: JenniferClint</b><br><br>@nollagam Duke doesn’t have an undergraduate business school… (the P&Q ranking is only looking at undergraduate business schools)<br>The investment banking ranking you posted has Harvard at 15. Let that sink in. Also, Duke was 24 and Berkeley was 9. You weren’t referencing the latest data.<br>I’d also like to point out that this appears to be self reported data from a website called “efinancialcareers”. You can’t compare that to rankings from the WSJ and the NY Times which clearly show that Duke graduates fair better.<br>As far as Goldman Sachs is concerned, your own link (“efinancialcareers” again) has Duke at 17 and Berkeley at 20.<br><br>", "<b>Username: JenniferClint</b><br><br>The global league tables have schools like Minnesota, BU, Iowa and UC Davis above schools like Dartmouth, Brown, Vanderbilt, and Georgetown. Anybody who makes a decision based on those rankings will probably live to regret it.<br><br>", "<b>Username: JenniferClint</b><br><br>@UCBUSCalum Durham is predominantly African American and overwhelming liberal. Your friend is clearly misinformed.<br><br>", "<b>Username: preppedparent</b><br><br>&lt;also, duke=\"\" has=\"\" almost=\"\" twice=\"\" as=\"\" many=\"\" rhodes=\"\" scholars=\"\" berkeley=\"\" (despite=\"\" being=\"\" a=\"\" fraction=\"\" of=\"\" the=\"\" size).=\"\" not=\"\" bad=\"\" for=\"\" “party=”\" school\".=\"\"&gt;&gt;&lt;/also,&gt;<br>Berkeley has faired better on a world class ranking stage. No one outside of East Coast has ever heard of Duke except maybe for basketball. And UCB has many more Nobel Laureates. Rhodes vs. Nobel Laureates, I think Berkeley wins.<br><br>", "<b>Username: nollagam</b><br><br><br>\"\"<br>Yes, and Harvard only began engineering about 10 years ago. Yet, would you rather have Harvard or Berkeley behind your name for the next 50 years of your career? Case closed. Duke is the better name.<br>\"\"<br><br>But Duke is NOT Harvard. I’m sorry; but you are only deluding yourself if you’re thinking Duke = Harvard.<br>For school prestige and brand name recognition, Berkeley is much more closer to Harvard than Duke is to Harvard. Perhaps some students may be choosing private schools over Berkeley because they prefer the system – how almost everything is being handed out to them rather than them making an effort to get those same things. But that doesn’t have any bearing to school prestige, particularly in this case, and specially for engineering. The data I showed are full-proofs and true testaments to my arguments.<br>Duke may be able to offer a more caring environment with the kind of personal attention it gives to its students, but it doesn’t mean it’s automatically more prestigious. If we have to go by that logic, then it would appear all the LACs are more prestigious than Duke. But I don’t think there’s any LAC out there I can honestly consider to be more prestigious than Duke. So, that logic fails.<br>For many, many aspiring engineers, yes, they would rather have Berkeley (than Duke) behind their names. As a matter of fact, for those people, Duke is almost non-existent on their radar.<br><br>", "<b>Username: JenniferClint</b><br><br>The Rhodes is an award that is (arguably) more relevant to undergraduates.<br>We’ve already established that global rankings can be pretty misleading. Refer to previous posts about Iowa, BU, and Minnesota being ranked over Dartmouth, Brown and Vanderbilt.<br>Berkeley is not in the same class as elite private universities when it comes to the overall quality of the student body. That is just a fact (look at the standardized test scores). I’m not trying to say that the best students are Berkeley are not excellent. The quality is just less uniform.<br>Also, as the UC system is becoming very reliant on international students who pay significantly more than in-state students. Many of these internationals are viewed as sources of funding. They do not necessarily have the credentials to be admitted to a school like Berkeley.<br>Duke is need-blind for all its applicants. That makes a tremendous difference.<br><br>", "<b>Username: preppedparent</b><br><br>&lt;&lt;we’ve already=\"\" established=\"\" that=\"\" global=\"\" rankings=\"\" are=\"\" worthless=\"\" for=\"\" making=\"\" decisions=\"\" at=\"\" the=\"\" undergraduate=\"\" level.=\"\"&gt;&gt;&lt;/we’ve&gt;<br>It’s not a debating society.  I don’t know who “we” are. But I haven’t decided that and I have a student at Berkeley who chose UCB over Duke. I’m just trying to help the OP.<br><br>", "<b>Username: sbballer</b><br><br>the top engineering schools in the country are MIT, Stanford, Berkeley, Caltech, Carnegie Mellon.<br>duke, harvard are not peer schools in engineering.<br>that being said… engineers imo don’t care whether you came from a vanity school… all they care about is your github code so for the poster don’t worry about engineering rep.<br><br>", "<b>Username: JenniferClint</b><br><br>@preppedparent So you would attend the University of Iowa over Dartmouth? Good to know.<br>Your student is in the minority (68:32 in favor of Duke).<br>http://www.parchment.com/c/college/tools/college-cross-admit-comparison.php?compare=University+of+California%2C+Berkeley&with=Duke+University<br>81% of students admitted to both schools choose Duke according to this article in the NY Times.<br>https://www.nytimes.com/interactive/2014/09/04/upshot/college-picks.html?mtrref=www.google.com#s=6<br><br>", "<b>Username: preppedparent</b><br><br>My student could see the potential in UCB. She got a Regents as an OOS student so got 4 year guaranteed housing, and priority registration. She wanted to attend UCB’s business school, and got in. Haas is ranked second by USNWR tied with MIT and only second to Wharton. She wanted to be near Silicon Valley for internships in entrepreneurship which she did, and she wanted to be on the West Coast and near San Francisco. Iowa and Dartmouth have nothing to do with it. But yeh, we’re proud she’s a golden bear, and not afraid to say it. Choose UCB. Lots of opportunities. Couldn’t find a finer UNDERGRAD experience.<br><br>", "<b>Username: nollagam</b><br><br>@JenniferClint : That is why I didn’t like (and agree with) how Noncreativity1 presented a ranking where there’s only about a dozen or so schools which separate Berkeley from Duke. We could be nitpicking league tables just to win in an argument, when in fact, there is very little that separates between them, unlike in engineering where Berkeley is considered part of the “holy trinity”, standing alongside MIT and Stanford. And, for the record, I did not present those rankings to tell anyone on here that Berkeley is superior to Duke for banking/finance, but to disprove anyone who claims Berkeley would be a terrible training ground and feeder school to banking/finance.<br>I agree Duke is a fantastic school, as a whole. In the same way that I agree Yale, for instance, is an amazing school, in general. But those schools have weaknesses and engineering happens to be the worst of them. Coincidentally, engineering happens to be Berkeley’s one of its strongest departments, and Berkeley – its name – is highly reputable, not only in America but throughout the whole universe. Duke, though good as a whole, doesn’t enjoy such grandiose reputation as Berkeley’s, specially in the tech universe. In fact, for many, many serious and highly dedicated, extremely talented engineering aspirants, Duke is not on their radar.<br>If we’re talking about WS, I agree Duke has more presence there. But we’re not talking about WS, are we?<br><br>", "<b>Username: nollagam</b><br><br><br>\"\"<br>The Rhodes is an award that is (arguably) more relevant to undergraduates.<br>\"\"<br><br>@JenniferClint : I think you needed to know that most, if not all, engineering students at Cal are not as gaga as Duke students are about winning Rhodes. What they care more about is how to become the next Elon Musk or how to become a successful startup founder, if not to work for those giant tech companies in the Bay Area and make six-figure salary (excluding bonus) as just entrants. That doesn’t make Berkeley engineering inferior to Duke simply because the school doesn’t have the same culture as Duke’s. And, btw, what is Oxford engineering compared to Berkeley’s!<br><br>", "<b>Username: JenniferClint</b><br><br>@preppedparent It was probably worth mentioning that she is a Regents scholar. That definitely changes the equation.<br><br>", "<b>Username: nollagam</b><br><br><br>\"\"<br>Berkeley is not in the same class as elite private universities when it comes to the overall quality of the student body. That is just a fact (look at the standardized test scores)<br>\"\"<br><br>This is pure ignorance. I’m sorry that I had to say that.<br>Here’s why.<br>Berkeley weighs HS GPAs more than it does standardized test scores, while Duke does the reverse. One can take SATs twice and submit the highest scores – we call that, super-scoring. Duke is notoriously known to have been employing that tactic.<br>Now, if you can show me any data that says Duke has a higher SAT score than Berkeley College of Engineering, I will concede.<br><br>", "<b>Username: JenniferClint</b><br><br>1). Duke as a university tends to care very little about standardized test scores (look at Duke med, Fuqua, etc.) so claiming that Duke is “notorious” for doing that tells me that you are misinformed. Also, it would be prudent to refrain from making assertions that you cannot back up.<br>2). Standardized test scores are probably more informative than GPAs because they are STANDARDIZED.<br>3). Do you really think that Duke’s GPA range is lower than Berkeley’s? Seems highly improbable but I can’t find data on Duke’s GPA range.<br><br>", "<b>Username: nollagam</b><br><br><br>\"\"<br>the UC system is becoming very reliant on international students who pay significantly more than in-state students. Many of these internationals are viewed as sources of funding. They do not necessarily have the credentials to be admitted to a school like Berkeley.<br>\"\"<br><br>This is another pure ignorance. Please do your research.<br>Admit Rate<br>19.7% - CA Resident<br>22.1% - OOS<br>8.8% - International<br>Avg. GPA Admit<br>3.91    - CA Resident<br>3.92    - OOS<br>3.93 - International<br>Avg. SAT Admit<br>1334    - CA Resident<br>1449    - OOS<br>1455 - International<br>https://admissions.berkeley.edu/student-profile<br><br>", "<b>Username: JenniferClint</b><br><br>The funding cuts are very real.<br>http://www.latimes.com/local/education/higher-ed/la-me-uc-global-rankings-20180228-story.html<br>“UC faculty leaders said the results confirm their fears that the university’s excellence would decline without greater state investment. The state share of costs per student dropped from $14,690 in 1996 to $7,160 in 2017, according to UC data. The university has made up some of the difference by hiking tuition and increasing the number of out-of-state students, who pay more, but both efforts have sparked opposition.”<br>http://www.dailycal.org/2015/11/23/to-fund-enrollment-boost-uc-will-phase-out-out-of-state-financial-aid/<br>Along with the elimination of financial aid for incoming out-of-state students, the university is increasing nonresident tuition by 8 percent in the next year and projecting to enroll an additional 1,200 nonresident undergraduates.<br>Out-of-state students make up a significant portion of students on the university’s flagship campus — roughly 35 percent of UC Berkeley’s incoming students were nonresidents in 2014.<br>Abril raised concerns about the effects of cutting out-of-state financial aid on campus diversity.<br>“You’ll be creating a pipeline for that percentage of students to be entirely socioeconomically homogeneous,” he said. “You’ll lose most of the students who would ever consider coming here who are low income and out of state.”<br>http://www.dailycal.org/2018/02/02/cautious-optimism-campus-budget-update-reveals-progress-deficit-dearth-state-funding/<br><br>", "<b>Username: sbballer</b><br><br>Berkeley has been having funding cuts for 30 years… and have heard this argument before over the past 3 decades… … yet Berkeley had the 4th most nobels of any university in the world since 2000.<br><br>", "<b>Username: JenniferClint</b><br><br>2010-2018:<br>Berkeley: 2011: Perlmutter (Physics) + 2013: Schekman (Physiology or Medicine)<br>Duke: 2012: Lefkowitz (Chemistry) + 2015: Modrich (Chemistry)<br>^ Regular rank faculty members who received their Nobels while they were at the university in question. Pretty evenly matched in the recent past.<br>https://www.nobelprize.org/nobel_prizes/lists/universities.html<br><br>", "<b>Username: privatebanker</b><br><br>The top students at both schools, Nobel laureates and Rhodes scholars are equally brilliant but unique in their areas of expertise. This is like arguing over what’s a better movie The Godfather or  Shape of  Water. Who’s better the 2016 Patriots or the 1987 49ers maybe a better example  It’s not an intellectual exercise but is loaded with emotion and subjective analysis.<br>Berkeley is elite and especially in STEM. But it’s big it’s public, in California, urban and it’s a known also for its political activism. Fact<br>Duke is also elite. Well known in everything but engineering and CS. Private, traditional college town and campus feel and known for a more preppy and sporty overall vibe. Fact<br>Two great choices. But choices they are. Either will lead to unlimited opportunity and a lifetime of pride. Fact<br>OP. Good luck. You can always flip a coin. And more than once if you don’t like the results <br><br>", "<b>Username: JenniferClint</b><br><br>Both great schools. Nothing remains to be said. Good luck to the OP!<br><br>", "<b>Username: warblersrule</b><br><br>^<br>Indeed. This thread has run its course.<br><br>"]}