{"title": "ut austin vs iu kelley vs smu", "comments": ["<b>Username: maplefall</b><br><br>D got admitted into economics in UT Austin. No scholarship.<br>Direct admission to IU Kelley with $6000 scholarship per year.<br>Admitted to pre-business in SMU with $25000 scholarship per year.<br>The cost difference ranges from 5000-10000, which may be ignored since she is an international, meaning hard to get financial aid. We really appreciate what she has got.<br>Still waiting for results from UCI, GWU, William & Mary. But do not hold much hope any more.<br>We cannot visit any campus since we are out of US. Which school is best for her? Any suggestion is cordially appreciated.<br><br>", "<b>Username: citymama9</b><br><br>Do you think your daughter would be happier at a smaller school with smaller classes? If so, then SMU would be best. Would your daughter prefer 4 seasons or is she okay with hot weather? If she wants to see snow in the winter and and falls and springs that aren’t too hot than she would like IU. What kind of environment is important to her? IU is in a great college town that’s not too small or too big. SMU and UT Austin are in major cities. If she seeks more diversity in terms of race and socioeconomics then she might find more of that at UT and IU.<br><br>", "<b>Username: maplefall</b><br><br>@citymama9  Thank you for your suggestion.<br>D seems prefer to live in urban areas. We think UT is the best, academically speaking. Kelley is perfect except for the quite lower comprehensive ranking. The weather in Bloomington is nice (we live in a similar area) while it’s really hot in TX as we heard. We are a little bit worried about SMU’s academic rigor (Kelley as well). We love SMU for it’s a private school with much lower student to faculty ratio and excellent location, not to mention the generous scholarship.<br>So, it’s really hard for us to make a final decision.<br><br>", "<b>Username: PurpleTitan</b><br><br>What does she want to do/study? What goals?<br>Since she’s International, she’ll likely have to go back home, right?<br>BTW, often times, it’s the strength of the school in the major that matters.<br>You should know that rankings rank by their methodology, which may or may not be relevant to you. What exactly about the rigor about you worried about?<br>In the US, faculty don’t go off of something like the USNews or any overall rankings. The quality of the faculty at b-schools like Kelley and WashU Olin would be about the same, in fact.<br><br>", "<b>Username: sundial2</b><br><br>My son also was admitted to those 3 business schools and we’ve visited each campus twice. UT Austin is urban with a VERY diverse student body. It appeared to me to be way more diverse than IU or SMU. From what I’ve gathered, the business school ranks much higher than SMU and slightly higher than IU. However, it’s a very big campus and most of the kids are from Texas who attend. SMU is a beautiful campus in downtown Dallas, but it definitely had the feel of being more “campus-like” to me than UT. I’ve heard it is more preppy with an upper middle class/ “wealthier” status attached to it, but I didn’t see a ton of that. IU has a beautiful college campus and the Kelley school is phenomenal as well. I’ve heard employers love to hire Kelley kids. I believe most of the IU kids get jobs in Chicago or Midwest area.<br>You mentioned a concern about rigor at SMU and Kelley. Did you mean that the programs might be TOO rigorous? Just wondering what you have heard or read about that.<br><br>", "<b>Username: MYOS1634</b><br><br>@maplefall: try to have your daughter define what she means by “city”. In the US, it’s not necessarily “easily walkable”, not necessarily “animated at all times”, not necessarily “excellent train/bus system/ public transportation”, however it does mean high rises, parks, lots of restaurants, businesses, etc. Depending on where you’re from, you may want to explore that more explicitely. NYC or Boston are very different from Dallas, Austin, or Bloomington. Each has advantages and disadvantages.<br>Note: ask whether dorms have A/C.<br>Has she been admitted to Honors at any of those?<br><br>", "<b>Username: jamesk2014</b><br><br>really depends on what she is looking for with the feel.  I will say right now I compete directly with mcCombs kids and a few plan 2 kids from UT Austin.  If she is not in the business school at UT I don’t think it is worth it.  Between Kelley and Cox that is more of a best fit question.  The entirety of SMU undergrad is the size of Kelley, so that is more just a question of what she is interested in class sie, whether, etc.  Many of the kids I go to school with were in at ut mccombs, and chose SMU.  They were not plan 2 or mccombs honors though - those are on another level. Great opportunities for sure wherever she may go.<br><br>", "<b>Username: maplefall</b><br><br>Thank you all for your inputs.<br>@PurpleTitan UT has the strongest academics in business among the 3 schools. According to USNWR, the undergraduate business program in McCombs ranks #5, while Kelley #11 and SMU #45. The admissions selection (esp. for OOS and int’l) is much stricter at UT too.<br>@sundial2 As far as I know, the curricula at UT are more challenging than IU and SMU. This is due to: 1) quality of enrolled students (e.g. SAT score difference), 2) requirements by faculty. It will be more difficult to get a GPA 3.8 or higher in UT than in the other two schools. My point is that she might learn more from a rigorous program and its opportunities offered. Responding to your question, I am concerned that the programs in Cox and Kelley might be LESS rigorous.<br>@MYOS1634 In terms of location, actually Bloomington, Austin or Dallas is pretty fine for her. But Austin and Dallas have a good advantage for internships or jobs due to the booming economy in TX. She was admitted into Mount Holyoke with some grants too, but she has crossed it off. Probably she thought MHC is too rural and mono sex. Btw, she didn’t apply for any Honors.<br>@jamesk2014 As her parent, I know the value of private education, smaller class size, easier access to faculty and more resources, etc. If she ends up at UT, she will work hard to transfer into McCombs or keep in the major of economics and then enter into a master’s program in business. Do you think this is doable?<br>Rank matters! At least many employers or parents in our country attach much important on prestige of a school. UT is most prestigious among the three. Kelley sounds great but the IUB comprehensive ranking is bad. Interestingly, an IUB application officer visited D’s school for recruiting last winter; just a couple of students joined the activity while a few parents including myself showed up. These kids just regard it as a safety. SMU sounds more like a religious school though I know it has been mundane.<br><br>", "<b>Username: maplefall</b><br><br>Another question: Do you think it is an advantage or disadvantage for a student studying with his/her acquainted people from the same region (e.g. from same county or even same high school) in college? It seems to me many US parents prefer to send their kids studying in a college of their own state. Is it only financially good? To me, I would choose a school with less acquainted people, like UT with only about 5% internationals. International students are more willing to interact within their own nationals. This phenomenon prevents them from understanding multi-culture and even improving their English quickly.<br><br>", "<b>Username: ucbalumnus</b><br><br>In the US, staying in state to attend a public university is often financially advantageous. Also, some parents and some students prefer to stay close.<br><br>", "<b>Username: jamesk2014</b><br><br>Mccombs transfer i do not know enough about, have to imagine it is somewhat difficult or they would have admitted off the bat. And yes rank does matter - to an extent - I agree smu generally lags about 10-15 spots (has always been top 25 in business week) back of Mccombs.  That being said SMU has great recruiting and for post graduate like the other two, so I wouldn’t discount it.  Whatever best fit will be most important.<br><br>", "<b>Username: PurpleTitan</b><br><br>I’ll defer to you about your expertise about relative prestige in your country.<br>In the US, business people know what the tiers are and generally ignore the rankings (where schools move around all the time). I’d say Kelley and McComb are roughly the same tier. McComb may be a little higher. But she hasn’t been admitted to McComb.<br><br>", "<b>Username: MYOS1634</b><br><br>She’s not in McCombs so you can’t compare McCombs to the others. Assume she’ll get a degree in Economics. Another issue is that she didn’t make or apply for honors at UT which puts her at a disadvantage. (The order of priority for opportunities, contacts, etc, would be BHP or Plan II -&gt;McCombs-&gt;Economics with Honors-&gt;Economics).<br>Does she want economics or Business? Economics can be more flexible and can allow her to add some electives to personalize her profile. She may be able to add a Business certificate to it, develop expertise in US culture (through classes in American studies, African American studies, Hispanic studies)nifbshe plans to work for a TNC that does business with the US.<br>UT will also be much more diverse (ethnically and socio economically) than SMU. SMU business offers excellent contacts, networking, internships, etc. It is also rather homogeneous. So if your concern is internships and living in a big city, SMU would have the edge.<br>If you want diversity, UT has the edge.<br>In terms of political vibe, SMU is conservative and UT is liberal.<br><br>", "<b>Username: maplefall</b><br><br>@ jamesk2014 @MYOS1634 It’s hard to transfer into McCombs. The average GPA last year is 3.9 for successful transfer, which I think is really difficult. But, on the other hand, D may study economics and then major in accounting or finance for graduate, as some friends suggest. How do you think?<br>SMU has a nice campus and generous scholarship, and easier to major in business. D may immerse herself in a close-knit community, keeping connections with her peers and teachers. Yet, it’s heard that there are so many wealthy kids on campus. This may be not good for study.<br><br>", "<b>Username: maplefall</b><br><br>@PurpleTitan I agree with you that Kelley is a highly-ranked, prestigious business school. The big confusion to me and many others is that the overall ranking of IU Bloomington is much lower than Kelley.<br><br>", "<b>Username: PurpleTitan</b><br><br>@maplefall: That one is easy to explain: Look at the criteria by how rankings rank.<br>Look at how well Dartmouth ranks in any international ranking, for instance.<br>Or look at how well UIUC and UW-Seattle rank in USNews. Yet those are top schools for CS and engineering.<br>Look at how well A&M and Purdue rank in USNews. Yet those are top schools for engineering.<br>BTW, if she will get a grad degree, pick a cheaper undergrad.<br><br>", "<b>Username: PurpleTitan</b><br><br>I have better examples: Missouri, Cincinnati, Oklahoma, and UIC are all ranked below IU by USNews.<br>Yet Mizzou is one of the top 3 journalism schools in the country. Cincy has one of the top design schools (and musical theatre programs) in the country. OU has one of the top meteorology programs in the country. UIC Nursing is highly respected. In each of those fields, those schools are considered powerhouses. For instance, design people could care less about Cincy’s USNews ranking. They care more about the fact that Cincy design grads are top-notch.<br>BTW, the USNews rankings can be gamed. I would not rely on them.<br>I personally prefer my tiers based off of alumni achievements:<br>https://talk.collegeconfidential.com/college-search-selection/1893105-ivy-equivalents-ranking-based-on-alumni-outcomes-take-2-1-p1.html<br>Those can not be gamed.<br><br>", "<b>Username: maplefall</b><br><br>@PurpleTitan  You are correct. There are just so many great colleges in USA. I wish our people may regard rankings more rationally.<br><br>", "<b>Username: PurpleTitan</b><br><br>Do well in undergrad cheaply and go to a brand name grad program.<br>That is my recommendation if you do not have a limitless amount of money.<br><br>", "<b>Username: doschicos</b><br><br>You mentioned on another thread that your daughter was accepted at Mount Holyoke and crossed it off her list. What were her reasons?<br><br>", "<b>Username: azmomof3</b><br><br>Yes, SMU has wealthy students but there are still many students that are on merit scholarships and/or financial aid.  My daughter has mentioned some crazy money stories but that doesn’t have much, if any, impact on study habits.  She’s also mentioned lots of stories of bargain shopping, kids with campus jobs, “free” stuff, and the normal spending habits of students on a budget.  If they go out on the weekends, etc. she is not spending a lot of money and there are plenty of opportunities on campus for entertainment that require no money.<br><br>", "<b>Username: maplefall</b><br><br>Cost is an important factor for school choice. We even feel lucky that she was denied by her ED school (notoriously expensive private school). It seems to us IU, UT Austin or SMU (w/ scholarship) would be our best choice.<br>Thank you again for your suggestion. We’ll take it into consideration seriously.<br><br>", "<b>Username: maplefall</b><br><br>@doschicos D was admitted into MHC with an FA package (including grant, loan and work). She thought it’s too rural. As a girl school, there might be few chances to interact with boys? (I guess). What can I do for her?<br><br>", "<b>Username: PurpleTitan</b><br><br>BTW, a smaller school (like SMU) may offer advantages when it comes to asking for prof recommendations for grad school.<br>She’ll have to be more of a go-getter at IU and UT-Austin.<br><br>", "<b>Username: doschicos</b><br><br>@maplefall You and your daughter might know this already but Mount Holyoke is part of a 5 college consortium with Smith, Amherst, Hampshire, and the very large UMass Amherst campus. So, there will be some males who will take classes at MH and she could take classes on coed campuses. The town/small city of Amherst isn’t too far away as is Northampton and both are cool places with amenities for students.<br>https://www.fivecolleges.edu/consortium<br><br>", "<b>Username: maplefall</b><br><br>@azmomof3 Pleased to know your daughter is studying in SMU. Which grade is she in? What major? How does she like the school? I personally like SMU very much.<br>Sorry for so many questions. I do hope my D will consider it seriously. Thank you so much.<br><br>", "<b>Username: maplefall</b><br><br>@doschicos Thank you for sharing the info and link. Hopefully daughter will think it twice.<br><br>", "<b>Username: maplefall</b><br><br>@PurpleTitan Your ranking is a great attempt. It’s a new approach to assess a school based on alumni achievements. I am an education professional and would agree with @Sue22 that you’d carefully frame your methodology: What factors to be addressed? How many schools to be assessed? What is your reliable data source? (Why Forbes?) How do you define your terms (e.g. “elite professional school”)? Do you think graduation rate and salary should be included in the factors of your metrics?<br>ARWU uses objective data (number of articles in “Science” and “Nature”), just for your inference.<br>You have done a great and interesting job. But it’s hard to make a ranking accepted universally.<br><br>", "<b>Username: azmomof3</b><br><br>@maplefall - my daughter is a freshman.  She had some good choices, like your daughter, and I didn’t think SMU was going to make the top 3.  After final visits to the other choices - and none of them feeling quite right - she made a trip to SMU by herself for an admitted student weekend.  Within the first few hours, she knew she had found her place.  She works hard at her studies (she is an engineering major) but has had the time and opportunity to be involved with a few campus organizations.  Because she has been involved and met lots of different people, she has had a very good experience so far.  Sounds like your daughter has some great options.  Obviously there were more highly ranked options for engineering schools but we weren’t entirely sure she would enjoy engineering and hoped she would choose a school with lots of other options if she decided to change majors.  Rankings are important, I guess, but we didn’t really care all that much.  Factors like travel distance (she’s 1000 miles away but a short, relatively inexpensive direct flight), job / internship opportunities in large city (Dallas), active campus ministry (we are Catholic), affordability with merit scholarships, and a small, supportive engineering program played into her decision more than any ranking.<br><br>", "<b>Username: PurpleTitan</b><br><br>ARWU is completely research-based (so would only tell you about faculty research prowess in mostly STEM and some social sciences). Williams wouldn’t even be ranked and Dartmouth is ranked extremely lowly by ARWU, for instance. A school like IU who’s strengths are in business, music, and dance (and doesn’t even offer engineering) would not do well in that ranking. But how much does a heavily STEM-based research ranking tell you about Kelley undergrad?<br>I used the Forbes subrankings because they have a ranking of “American Leaders”, per capita student awards, and per capita PhDs. I can’t find those alumni achievement rankings elsewhere.<br>Graduation rate mostly tells you how strong (and wealthy) entering students are. Salary is heavily influenced by major (and the mix of majors differs a lot; IU doesn’t have engineering; RPI and GTech offer almost no majors outside of STEM).<br>The elite professional school ranking is from a WSJ Feeder ranking from years back. I’ll try to find it.<br><br>", "<b>Username: PurpleTitan</b><br><br>This ranking is similar:<br>http://beyondcollegerankings.com/?page_id=170<br><br>", "<b>Username: PurpleTitan</b><br><br>OK, here is the WSJ ranking:<br>http://collegematchus.com/ranking-the-colleges-top-colleges-that-feed-alumni-into-grad-school-programs/<br>The top professional schools are listed here:<br>http://leiterlawschool.typepad.com/leiter/2007/08/wall-street-jou.html<br>Definitely an East-Coast bias (possibly because Stanford wasn’t willing to share data?)<br>I know that in business, the top MBA programs are the M7 (Stanford, HBS, Wharton, Chicago Booth, MIT Sloan, Columbia, Northwestern Kellogg) while for law, YHS-CCN are the top 6.<br>Of those 13, the breakdown between East Coast, Midwest, and West Coast is 8-3-2.<br><br>", "<b>Username: PurpleTitan</b><br><br>But the WSJ ranking and numbers aren’t much different from this ranking/numbers assembled by Poets&Quants for feeders in to top MBA programs:<br>https://talk.collegeconfidential.com/discussion/comment/16227829/#Comment_16227829<br><br>", "<b>Username: citymama9</b><br><br>@azmomof3 What’s it like being from out of state? Is there any clickiness amongst the students from TX? A large percentage are from TX, right? Was it easy for your daughter to make friends? Anything else you can say about the social life would be great. Hope my questions help the OP too:)<br><br>", "<b>Username: azmomof3</b><br><br>@citymama9 - According to the SMU website:<br>“More than half of undergraduates come from outside Texas. With students from all 50 states and the District of Columbia, the leading home states (after Texas) for first-year students are, in descending order, California, Florida, Connecticut, and Georgia.”<br>Plus, TX is so huge - the distance between El Paso and Houston is equivalent to a few states in the northeast.  I know at our state schools, many kids head off to them and room with friends from their high school - that really doesn’t happen much at SMU because there aren’t (from what I can tell) many kids from the same high school, even if they are from Dallas or TX.  My daughter has mentioned friends and acquaintances from many other places - and she does have some friends from Dallas but they don’t seem to go home very often.  Of course, a few of them know each other from different activities, etc. but it sounds like if they are together they are very inclusive of anyone else and fold them into the group.  I actually attended SMU in the 90’s and I found this to be pretty much my experience too.  Two girls on my dorm floor were from the same high school and were roommates but we all hung out as a big group - and we were from about 6 different states.<br>As for other social life stuff - I think everyone can find their “people”… it might take some time and getting involved helps too.  As you probably know, the greek rush week occurs at the start of the spring semester (they come back a few days early).  I think that shakes things up quite a bit as some kids join a sorority or fraternity and others don’t.  The first few days after all that happens can be hard on some but I think just about anyone would tell you that it all works out, everyone moves on with their lives, and just because some are in different houses - or not in one at all, they can all still be friends - their availability to each other just might be a bit changed up.  So, that presents some challenges but also might open up some new opportunities for relationships too.<br>There are areas off campus that aren’t too far of an uber ride and I know they head there sometimes - Lower Greenville Ave. and Deep Ellum have clubs - some where underage kids can get in for dancing, etc.  There are nice areas for shopping, hanging out, etc. and getting some good food not too far off campus as well.  There is an on-campus burger/fry joint called Mac’s Place that is included in the dining plan and I know there are late night gathering / study sessions there.  Program Council has on-campus movie nights with (free) food trucks or food from local restaurants that bring in crowds.  There are sports, intra-mural sports, plays, concerts, speakers, etc.  Also, the residential commons housing system is set up so that each dorm throws a themed party that all other dorms are invited to.  One dorm did a big Halloween party, one does a Mardi Gras theme, etc. etc.<br><br>", "<b>Username: citymama9</b><br><br>@azmomof3 Thanks so much for your thorough response. It was very helpful.<br><br>", "<b>Username: jamesk2014</b><br><br>to clarify the out of state worries - the most recent data on the entering class was 62% out of state. 8% international and 30% Texas.  That Texas stat is for people from Houston, austin, san antonio, el paso, etc.  Texas is huge these folks may go home once or twice in a semester (think thanksgiving, birthdays for parents, special one off items), but it is a truly residential college experience.<br><br>", "<b>Username: maplefall</b><br><br>@PurpleTitan It’s quite understandable that why rankings are east-coast biased. Yet I always feel there are so many quality and unique higher education institutions in US. Many people in my country were not familiar with LACs but now tend to send their kids to them.<br>@azmomof3 @jamesk2014 Thank you for sharing detailed info and data, very useful. It will be great if a campus is inclusive even if students like to connect more with their acquaintances, which is natural to me.<br><br>", "<b>Username: maplefall</b><br><br>Time to summarize D’s admission results. Applied for 14 schools totally.<br>Denied: WFU (ED1), NYU (ED2), UW (Seattle), Wisconsin-Madison, Occidental College, W&M<br>Waitlisted: BU<br>Accepted: UT Austin (Economics), UC Irvine (major undeclared), SMU (pre-business) with $25k scholarship, IU Kelley with $6k scholarship, OSU (pre-business), MHC with FA package nearly $18k.<br>No results yet: GWU (probably not attending even if admitted)<br>D got admitted into UC Irvine this weekend. Thought it’s a great school too. Compared with UT, is it more worth to attend?<br>UT Austin is D’s first choice. Is this a good choice? Can anyone tell us how the study is on UT campus? Say, how hard to earn a GPA 3.8? How is the relationship among students? Do students look happy living there? We appreciate any of your inputs. Thanks.<br><br>", "<b>Username: MYOS1634</b><br><br>It’s very very very hard to get a 3.8 GPA at UT. It requires intelligence, hard work, stress, and a lot of luck. A 3.8 is very rare and should NEVER be counted on. A very smart, very diligent student could ‘count’ on a 3.6. A very optimistic, very smart, very diligent, student would see a 3.7 as within the realm of possibility. Above that and it’s hubris.<br>Keep in mind she’s doing UT economics and should be at ease with that major. If not, she shouldn’t attend UT.<br>Her best choices are IU Kelley direct admission which guarantees a business major and tOSU pre business since almost all students are pre-majors and a business major is guaranteed if she meets some grade parameters.<br>MHC is probably the best undergraduate environment but it’s very different from the others.<br><br>", "<b>Username: PurpleTitan</b><br><br>What are her goals?<br>And yes, someone who isn’t genius level (or at least blows through HS with ease and is already getting a 4.0 taking a bunch of college classes) shouldn’t count on a 3.8 GPA at any good/decent uni (or better).<br><br>"]}