{"title": "umass amherst vs purdue v vs ut auss uwisconsin madisontin which one should i chose", "comments": ["<b>Username: pat07ek</b><br><br>I’m an international student from India. Major - computer science<br>I am accepted or expecting a yes from the following colleges:<br>UMass Amherst- Accepted with 14k chancellor’s award  per year(Now - 160k for 4 years)<br>Purdue - Expecting a yes (190k approx for 4 years)<br>U wisconsin madison - Accepted ( 220k for 4 years approx)<br>UT Austin - Expecting a yes ( 210k for 4 years approx)<br>Finances do matter for me in making my decision.<br>Are UT Austin or U Wisconsin madison worth the extra money compared to UMass Amherst?<br><br>", "<b>Username: ljberkow</b><br><br>“worth the extra money” is a relative term.  If you are very wealthy and money is no issue, then Texas and Wisconsin might be worth it.  If not, the differences among those programs won’t have any major impact on you.  UMASS has three great majors: Business, Computer Science, and Nursing.<br><br>", "<b>Username: ucbalumnus</b><br><br>The other questions you should be asking are, at each school:<br>a.  Do you have direct admission to the CS major?<br>b.  If not, what are the criteria (e.g. GPA at the university) to be admitted to the CS major?<br><br>", "<b>Username: pat07ek</b><br><br>I have direct admission into CS program of Umass<br>And at wisconsin i just have to take one course in the first semester to get cs<br>If i get accepted to ut austin I’ll most likely get cs(Some of my friends told me)<br>@ucbalumnus<br>I’m not rich and money does come into play in my decision. @ljberkow<br><br>", "<b>Username: MYOS1634</b><br><br>CS at UMass is excellent and if you have direct admission to the CS program then it’s a no brainer. <br><br>", "<b>Username: pat07ek</b><br><br>how is umass compared to uwisconsin and ut austin?(keeping the cost factor aside) @MYOS1634 @ucbalumnus @ljberkow<br><br>", "<b>Username: MYOS1634</b><br><br>UMass CS v. U Wisconsin cs are equal.<br>After that, we’re talking about two cool towns in cold climates.<br>UT is Texas so hot and humid, fun city.<br><br>", "<b>Username: pat07ek</b><br><br>according to you which is the best univ out of all the ones which i mentioned to go to?(keeping the cost factor aside) @MYOS1634<br><br>", "<b>Username: MYOS1634</b><br><br>They’re all the same, the main difference is cold (MA, WI) v. hot&humid (TX), basically. All three are liberal, all three are in cool towns/cities, all three have lots of things to do, all three have good relations with industry…<br>Did you get into the Honors College at any of the three?<br><br>", "<b>Username: pat07ek</b><br><br>Nope @MYOS1634<br><br>", "<b>Username: mommyrocks</b><br><br>I will point out one more factor to consider, which is the size of the city. UT Austin is in the heart of Austin, a major city of over two million people, while the other choices are located in much smaller cities. There is a major airport located in Austin as well, to simplify travel there and back home. You would have tons of opportunities for possible internships locally or a variety of activities, and you would have access to all kinds of resources that big cities have. UT Austin Computer Science program is a top 10 program based in the Gates-Dell Complex that opened in 2013 (see https://news.utexas.edu/2013/03/06/for-wed-gates-computer-science-complex-and-dell-hall-begin-new-era-of-computing-education-and-research). UT also has the Texas Advanced Computing Center (TACC) which is one of the best supercomputing centers in the country. If you could afford UT and were sure of getting into the CS program, that is probably the best option on your list. But finances often do dictate choices, and that is okay too, so it would be perfectly fine to choose U Mass for that reason. My daughter got into Cornell, but she chose another university that offered her big scholarships because finances were an issue. We all have to make decisions that fit the reality of our situation. For U Mass, you would be flying in and out of Boston likely, and get to know that city in addition to Amherst. In the summers you could do internships anywhere in the country or world, so you won’t be entirely limited by your location of study. If finances are the main consideration at this point, then you already have your answer of where to go.<br><br>", "<b>Username: pat07ek</b><br><br>Thanks a lot @mommyrocks<br><br>", "<b>Username: NEPatsGirl</b><br><br>UMass is well regarded for the CS program.  It is in a five college consortium so you can take classes elsewhere if you choose although I think its usually the LAC students that go to the University for classes unavailable to them in the smaller schools.  UT Austin is an additional $50,000.  You have to ask yourself, all other things being equal is being in a hot climate vs. cold climate desirable?  Is easier access to the airport a selling point? And probably most importantly, are you sure you’ll get into the CS program at UT Austin?<br><br>", "<b>Username: pat07ek</b><br><br>The climate in texas would be ideal for me as I live in India. Where as it would take some time for me to adjust to the climate in mass or wisconsin.<br>I’ll most likely get cs if i get accepted to ut austin.<br>And getting cs at wisconsin is easy.<br>Some of my friends here in India are like it is worth the money to attend either ut austin or uw madison coz of better alumni and better peer group. How far is it true? And is it actually worth 50k?<br>And overall ut austin and uw madison are ranked way better than umass amherst.<br>@NEPatsGirl<br><br>", "<b>Username: twobugs</b><br><br>UMass is your least expensive option, and money is a factor for you.  CS at UMass is highly regarded, and aside from CS there is a great deal to like about the university.  UMass offers the option to take classes at four other colleges as well as your own.    Decisions are hard, but UMass is a great choice.<br><br>", "<b>Username: MYOS1634</b><br><br>UMass should be a no brainer, seriously.<br><br>", "<b>Username: DadTwoGirls</b><br><br>“CS at UMass is excellent”<br>“UMass should be a no brainer, seriously.”<br>Exactly. We hire a LOT of CS majors from UMass Amherst. The CS program there is indeed excellent. Get yourself a good winter coat and a good pair of boots (both will be available locally) and you will do very well there. It is also in a location that at least to me is very attractive.<br>Congratulations on your acceptances and best wishes!<br><br>", "<b>Username: aoeuidhtns</b><br><br>Amherst for sure – beautiful town, gave you the most money, and pretty good program of the 4 schools.<br><br>", "<b>Username: maroon79</b><br><br>UT weather is not hot and humid.  Hot early in the fall semester and maybe late int eh Spring.  Never really humid.<br>UT CS department is very highly ranked, and Austin is really becoming a hot spot for hi-tech jobs (the number of moving vans heading east from California to Austin each year is pretty amazing).<br>it all depends on the money<br><br>", "<b>Username: barrons</b><br><br>Austin. Warmer winters and great town with serious tech infrastructure. Low taxes. Never have to leave.<br><br>", "<b>Username: pat07ek</b><br><br>How is purdue compared to rest of the colleges?<br>Note: Finances do matter but my dad is willing to pay the extra money if he finds it worth it. So, if uw madison or ut austin are worth it he would pay the extra money. Are there any big advantages of attending these schools compared to purdue or umass?<br>Can somebody tell me how is purdue compared to the colleges mentioned for cs?<br><br>", "<b>Username: tk21769</b><br><br>There are over 2000 4-year accredited colleges and universities in the USA.<br>Nobody here is likely to be very familiar with CS programs at all 4 of these schools.<br>All of them do seem to have decent, respected CS programs. So if you don’t have your own criteria to decide (such as close family/friends living in one area, or a loathing of cold weather), just go with the lowest net cost … then adapt.<br>Or, you could go with a ranking like this one:<br>https://www.usnews.com/best-graduate-schools/top-science-schools/computer-science-rankings/page+2<br>This is a graduate program ranking and in my opinion isn’t a good basis for choosing among ~peer undergraduate programs. But, if you need some justification for spending more to attend Texas than one of the other schools, well then, you could point to that (then hope that the best CS professor at UT doesn’t retire or move to UMass next year).<br><br>", "<b>Username: ilikefootball36</b><br><br>do you know how Umass Sports Management program is?<br><br>", "<b>Username: SwimmingDad</b><br><br>I’m only going to talk to UMass (I work for a startup in the Boston area).  CS grads from Amherst have no problem getting jobs in Boston, which has one of the largest tech scenes in the US (measured by VC) after Silicon Valley and (sigh) now NYC.  Austin has a tech scene but it is much, much smaller.  (Which could be good or bad.)  Honestly, if finances matter it does seem to be a no brainer.<br><br>", "<b>Username: barrons</b><br><br>Boston–bad weather, expensive, crazy taxes, lacks fun laid back vibe of Austin. https://www.cnbc.com/2016/08/11/austin-is-top-place-for-startups-in-america-not-silicon-valley.html<br><br>", "<b>Username: changemaker44</b><br><br>Go to UMass. Save your money, and enjoy a quality education at one of the top CS schools in the U.S.<br><br>", "<b>Username: prezbucky</b><br><br>In terms of overall academic rep, UT, UW and Purdue have the edge over UMass. This might not matter if you stay in CS, but if you changed your mind it might. That said, if you wanted to take an English course at Amherst or Sociology at Smith, you could do that as a UMass student. I think that’s pretty cool. That is the one real advantage UMass has over the other three. (aside from cost…)<br>UT, UW and Purdue are all big-time sports schools, especially UW and UT.<br>Are you sure UW would cost $220k? Last I checked, UW costs about $45k all-in for OOS students… which would come to $180k over four years. Are you factoring in a lot of travel and spending money?<br>(or have UW’s OOS fees gone up $10k per annum?)<br><br>", "<b>Username: gearmom</b><br><br>@pat07ek What field of CS are you interested in? UMass Amherst is well regarded for IR. UMass is a no brainer. Excellent college town, great food, top program. Boston’s tech corridor could have good internship possibilities. There is certainly a good size population from India. No way I’d pay more for UW. I don’t even think UT is worth 50 k more unless you are rich. Boston is a super fun city.<br><br>", "<b>Username: pat07ek</b><br><br>@prezbucky<br>UW Madison coa is around 53k.<br>https://financialaid.wisc.edu/cost-of-attendance/<br><br>", "<b>Username: pat07ek</b><br><br>First choice : Artificial intelligence<br>Second choice : Software engineering<br>I’ll decide between these two when I start my college!<br>@gearmom<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Current UW tuition is just under $37k, and room and board is around $11k. The rest of the UW budget estimate includes books, travel and misc. — we always found those estimates to be much larger than actual experience, though for an international student, travel costs will be a substantial expense whether it involves flights to Boston, Austin or WI. For getting to UW, easiest would be fly into O’hare and take Van Galder coach bus to Madison, a 2 hour ride, with regular departures every day.<br><br>", "<b>Username: pat07ek</b><br><br>Does the tuition increase every year(from the first year)? @Midwestmomofboys<br><br>", "<b>Username: SwimmingDad</b><br><br>Yes, tuition goes up each year.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Yes, UW tuition increases annually  in our experience, it was about $1000-2000 a year for OOS.<br>Is the OP clear on what the merit at UMass Amherst covers in terms of fees?  I recall hearing that U Mass tuition is low, but there are steep program and academic fees – OP will want to make sure they are comparing apples to apples when looking at costs at different schools, and that the UMass merit covers not just tuition but also relevant program fees.<br><br>", "<b>Username: MYOS1634</b><br><br>It’s a lump sumn deducted from direct costs each semester.<br><br>", "<b>Username: gearmom</b><br><br>@pat07ek I would remove UW from the table being more expensive and a peer of UMass. Your only question is UT worth 50k more than UMass. I would have a tough time justifying that. Graduate from UMass and then move on to grad school. https://www.cics.umass.edu/ugrad-education/artificial-intelligence<br><br>", "<b>Username: pat07ek</b><br><br>What about the other universities? Does their tuition increase?<br>@SwimmingDad  @Midwestmomofboys<br><br>", "<b>Username: pat07ek</b><br><br>I heard that purdue’s tuition is fixed since 2012.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Purdue froze its tuition in 2013, and has announced the freeze will remain in place for another year through '18-19 school year.  I would guess that will not last beyond next year, but who knows.<br><br>", "<b>Username: MYOS1634</b><br><br>Where would the 50k come from? Do your parents have that amount or would they have to borrow?<br><br>", "<b>Username: lvvcsf</b><br><br>Purdue has not raised it’s prices for tuition/room and board since 2012. What has seemed to have happened is that their Presidential and Trustees Scholarships are not as generous as they were then. As it is only about 10% of their incoming class get a merit based scholarship. In general I think all of the schools mentioned are peers. They differ in their location but not in the value of the degree. Unless one of them significantly fits you better than the others I would consider cost the determining factor.<br><br>", "<b>Username: pat07ek</b><br><br>I think my dad would have to borrow! @MYOS1634<br><br>", "<b>Username: pat07ek</b><br><br>And what about UMass? Does it increase the tuition every year?<br><br>", "<b>Username: MYOS1634</b><br><br>If your dad would have to borrow then choose the least expensive option.<br><br>", "<b>Username: pat07ek</b><br><br>Yeah! Even I feel UMass is the best option. @MYOS1634<br>Just want to know if UMass increases its tuition.<br><br>", "<b>Username: mysmom</b><br><br>My d was accepted to UW, UMass, and Purdue for engineering.   UW was her dream school.  She had an opportunity to meet with one of the engineering professors and his lab and was sold.  Sadly, UW did not offer any money.  In the end, she chose Purdue.  They did provide some merit money and she really wanted to spread her wings (we’re in state for UMass). My husband encouraged her to choose Purdue, even though it was more expensive, because of their reputation.  She’s a senior now, has had great internships, and has a job lined up after she graduates.  It’s a rigorous curriculum.  Our older d graduated from Cornell in engineering.  Compared to Cornell, Purdue requires more electives to be in engineering.  Purdue also has a large international population.  I hope they provide you with a competitive offer.  Best of luck on your decision!<br><br>", "<b>Username: BrianBoiler</b><br><br>What do you want to do after your undergrad?  If you want to go into the workforce any of the above will get you on your feet, UT, UW, PU may have a better/larger network and other than in New England all are more recognizable to recruiters.  My son is a Soph at UMD.  If you don’t like being taught by TAs, even in 300 level classes, you might go to UMASS.<br>If you are at all interested in going on to a PhD, I’d look at the place where you can get involved in Research as early as possible in your Undergrad, if possible in the fields you mentioned.<br>I’m obviously bias’d towards Purdue.  I’ve 2 degrees from there and have two nieces that currently attend and have been in touch with them since Mitch Daniels became President and have friends who are faculty there.  Mitch’s plan is to cut fat, increase fundraising and not just blindly raise tuition because everyone else does it and the market doesn’t care (i.e. they will pay it).  I’d be surprised if it raises anytime soon.<br><br>", "<b>Username: pat07ek</b><br><br>How much is she paying at Purdue? @mysmom<br>And yeah I feel Wisconsin is expensive considering the fact that the mentioned colleges are almost equal for CS.<br>Apart from reputation what made your decision to chose Purdue over UMass.  Reputation does matter but I just want to know if there is anything else better at Purdue.And Purdue is not very costly. I just want to know if there is anything else better at Purdue compared to UMass.<br><br>", "<b>Username: pat07ek</b><br><br>I am planning to do Masters and then move into the workforce. @BrianBoiler<br><br>", "<b>Username: SwimmingDad</b><br><br>UMass definitely raises tuition each year.  The number he is citing is in range of the UMass Cost of Attending so it does include fees.<br><br>", "<b>Username: pat07ek</b><br><br>My cousin said that at Purdue u pay the same tuition every year. He said that even if it increases it will affect the coming freshman but not the rest. He isn’t sure about it though. Do they have such policy? How far is it true? @mysmom @BrianBoiler<br><br>", "<b>Username: Midwestmomofboys</b><br><br>We live in Indiana, and only know that Purdue announced the freeze in 2013, and has announced it will continue an additional year, through '18-19.  There is nothing that I can find that says that any tuition increases, if implemented after next year, would only apply to future, not current students.  If tuition were to increase for '19-20, there does not seem to be anything requiring Purdue to apply the increase only to new students, not current students.<br>Also, with all CS/Engineering programs, read the fine print to see what additional program fees are charged.  Purdue charges CS and Engineering students an additional $2050 fee per year. Tuition for international students is $30,800, plus the $2,050 for CS, plus room and board. Travel to Purdue would involve flying to Indiananapolis.<br><br>", "<b>Username: pat07ek</b><br><br>Thanks for the clarification! @Midwestmomofboys<br>Yeah I know that there is an additional fee for cs and engineering and for international students.<br><br>", "<b>Username: BrianBoiler</b><br><br>I’m not sure a Masters in CS really means anything.  I believe if you want graduate work, you just go on straight to the PhD.  That was my son’s intention and why he chose UMD.  However, he now has realized that he doesn’t live and breathe CS 24/7 and would like to work to live and is now thinking he’ll go straight to the workforce.  Just something to consider what PhD in a subject really means.<br>I believe the policy at Purdue is as stated, that your tuition is frozen the year you start.  It would be worth looking into, I believe my brother (niece’s Dad) told me that was the case when I asked if he was worried about the tuition going up after the first year.<br><br>", "<b>Username: pat07ek</b><br><br>Are you sure about that policy? @BrianBoiler<br><br>", "<b>Username: BrianBoiler</b><br><br>not 100%, that is why I said it is worth looking into.  I didn’t read it.  I’m sure my brother told me.  :^)<br><br>", "<b>Username: BrianBoiler</b><br><br>Also, the weird thing about policies, they can be changed.  But, I don’t think they would after you’ve started.<br><br>", "<b>Username: pat07ek</b><br><br>Thanks @BrianBoiler ! I’ll confirm it with Purdue by sending an email to them.<br><br>", "<b>Username: mysmom</b><br><br>@pat07ek  Sent you a pm.<br><br>", "<b>Username: gearmom</b><br><br>@pat07ek You will have many internship opportunities at UMass. There is a large alumni network from UMass throughout the Boston Tech Corridor which is a top area for CS employment. UMass has a great reputation for CS in Mass/Boston and a large international pop. I would not pay more money and certainly any increase in fees for UMass will not be astronomical. Maybe 1 to 2 k over your time there.<br>@PengsPhils Any incite?<br><br>", "<b>Username: gearmom</b><br><br>Post #41 Your family would have to take 50K of debt for you to go to a school other than UMass? This is really a foolish idea to go anywhere else. Certainly not worth your family taking that debt. Go to UMass which is a top school for CS. Enjoy Amherst and enjoy Boston. You’ll have plenty of other grad school options if you wish.<br><br>", "<b>Username: MYOS1634</b><br><br>^ I agree!<br><br>", "<b>Username: lvvcsf</b><br><br>“I’m obviously bias’d towards Purdue. I’ve 2 degrees from there and have two nieces that currently attend and have been in touch with them since Mitch Daniels became President and have friends who are faculty there. Mitch’s plan is to cut fat, increase fundraising and not just blindly raise tuition because everyone else does it and the market doesn’t care (i.e. they will pay it). I’d be surprised if it raises anytime soon.”<br>My D will be graduating with a degree in ChemE from Purdue University in May. She had a job lined up in September. Purdue is a school that offers a lot of opportunities but they will not hand feed them to you. They let you know they are there but you have to go out and get them. My D has done a 5 term coop which definitely helped defray the cost of her education and 4 semesters of research. I have nothing but praise for Purdue and have been impressed by it’s President Mitch Daniels for holding down costs while increasing the size of the university.<br>Having said that, I know many friends of my D that have come from other less well known schools and have done equally well. I think if you work hard, have the aptitude, and seek out the opportunities the universities have to offer you can be successful anywhere. Purdue is perhaps more STEM centric than the other schools you are looking at. Indiana has two flagships and Indiana University is where many of the non stem majors are considered stronger. Good luck.<br><br>", "<b>Username: MYOS1634</b><br><br>Also, it sounds like OP’s father would have to get in debt to afford Purdue and in CS UMass is better recognized. (Purdue has the upper-hand for Engineering).<br><br>", "<b>Username: gearmom</b><br><br>^Yes UMass is highly regarded in CS. Why would OP’s family take on 50k ADDITIONAL debt for a school that is not better in CS? @Ivvcsf CS is a very performance based field. Any slight benefit of name won’t make a difference anyway. Why put a family into great debt. That is just crazy.<br><br>", "<b>Username: BrianBoiler</b><br><br>According to this link, I see UT, PU, and UW all mentioned before (didn’t even see) UMass.  Before you take CC word on it, do a little research.  I’ve my bias, and they have theirs.<br>https://www.topuniversities.com/university-rankings/university-subject-rankings/2017/computer-science-information-systems<br>Also, these rankings tend to look at Grad Schools, not Undergrad.  But, you would think that a strong Grad Program would help the Undergrad, especially if one is interested in going onto Grad in the long run.<br>I also suspect someone will find another ranking that does show UMASS, I just grabbed the first on the Google list and didn’t go any further.<br><br>", "<b>Username: MYOS1634</b><br><br>^ not a legit ranking for us colleges.<br>All in all, what matters to grad students (research output) isn’t what matters to undergrads (class size, lab and professor access, support services, variety of course choices, depth of advanced classes).<br>People who speak about UMass CS know what they’re talking about - it’s very highly regarded in the industry and certainly not worth dropping for 50k extra, through debt.<br><br>", "<b>Username: PengsPhils</b><br><br>All of these schools are in the same tier for CS. Choose based on your preferences beyond academics in addition to financials.<br><br>", "<b>Username: gearmom</b><br><br>^ This is the answer then. I trust @PengsPhils opinion.<br>What about grad school for CS, @PengsPhils ? Worth it?<br><br>", "<b>Username: PengsPhils</b><br><br>There is no difference really that would be worth considering in this decision. Sounds like UMass is the best option, as @MYOS1634 pointed out on the first page <br><br>", "<b>Username: gearmom</b><br><br>@PengsPhils Yes but OP is also hoping to go to grad school for CS and someone said grad school wasn’t worth it for CS. Your opinion on the value of grad school for CS?<br><br>", "<b>Username: PengsPhils</b><br><br>I’d also agree, not worth it for most. If OP goes into AI, it could be, but is very unneeded for a software engineering job.<br><br>", "<b>Username: pat07ek</b><br><br>@BrianBoiler UW Madison is after UMass in the link you sent!<br>According to that link it is:<br>UT Austin<br>Purdue<br>UMass<br>UW Madison<br><br>", "<b>Username: pat07ek</b><br><br>And Purdue would be around 10k more than UMass(considering UMass increases its tuition by 2k every year and Purdue doesn’t )<br>@MYOS1634 @BrianBoiler @gearmom<br><br>", "<b>Username: theloniusmonk</b><br><br>Purdue is the best school for cs and engineering in this list.  And the point a poster made about switching majors is very good, in that case UT Austin would be my recommendation as it has strong programs engineering, science, humanities etc…  I’d also reconsider getting a masters and possibly take the money you were going to use for that and see if you can make Purdue or UT work.  Both have strong reputations, nationally and internationally in CS.<br><br>", "<b>Username: gearmom</b><br><br>@pat07ek Are you saying that Purdue is 10k per year more than UMass? What is your cost per year for Purdue? You had estimated 190k for four years or 47.5 K per year is that accurate? Over four years with the usual 3.6% (about 1.6-1.7K) increase from UMass (which I think will slow down) the difference between the schools (assuming Purdue stays the same) would be 30K total if your difference starting is 10 per year. So for four years, worst case scenario, UMass adds ~10 K to the current price COA. For undergraduate student in the US, the total max amount of debt recommended is 27K. There is no way I would recommend 30 K (or 20K) more debt for a school that is a PEER of UMass for CS. The US is not so sensitive to tiny ranking differences. No one cares if you are #24 versus #25. Now if the difference starts at 10k TOTAL over four years then you could choose either school since the total costs (ASSUMING Purdue freezes COA and assuming UMass rise 3.6%) are the same. BUT if your total cost difference between UMass and Purdue means 30K (or even 20K) more debt would be a complete waste of money for your family IMHO.<br>@PengsPhils Is correct that these colleges are the same tier. Put down the ranking charts if you are going to be burdening your family with 20 to 30 to 50 k more debt for nothing.<br><br>", "<b>Username: gearmom</b><br><br>@theloniusmonk Is Purdue worth 20-30K more debt to this family?<br><br>", "<b>Username: gearmom</b><br><br>@prezbucky How much additional debt would you recommend OP’s family taking for one of the schools other than UMass. 20k, 30k or 50k? This could be in addition to the debt they take on to pay for the UMass baseline.<br>We have done the ROI analysis based on salaries published in IEEE. There will be no significant financial benefit to this. UMass grads work along side MIT grads, RPI grads everyday in Boston and no one cares about the school. It is what you can do that matters.<br><br>", "<b>Username: prezbucky</b><br><br>I was talking about academic reputation. Wisconsin, Texas and Purdue have better all-around academics than UMass. ROI is a poor measure for judging a school’s worth due to issues like major choice and jobs (STEM and business tend to earn more, so schools with heavy majors in those areas will tend to report higher grad salaries – this is due in large part to student choice), as well as regional differences in standard of living (the same job offers different salaries in different places). That is why i think the Forbes ranking is not worth the paper and pixels. Quality of education and experience should be the top variables.<br>The job a kid has largely relates to the choice and drive of the student, not the quality of the school (when comparing peers at least).<br>If the OP sticks with CS, UMass is a fine choice. If he changes his mind, he’s probably better off at one of the other three, which offer more top-notch programs.<br>Cost is another consideration – UMass is probably good enough to avoid paying a lot more for anywhere but maybe HYPSM and their ilk… though even then it’s questionable.<br><br>", "<b>Username: gearmom</b><br><br>@prezbucky The ROI we looked at from IEEE was self reporting salaries of CS professionals from various schools. Any salary bump due to school name was gone by the ten year mark.<br>This student needs to know whether or not he should burden his family with an additional 20, 30, 50K of debt. That is the bottom line. It will make no difference IMHO for CS to go to one of these schools other than UMass. Who knows how much total debt and hardship this family will take on to send this student to school here. Is it worth the extra debt to go to the other schools? This is money the family does not have.<br>If OP switches majors from CS to engineering after the first or second year then OP will very likely be looking an additional year or two of school. That would be an expensive switch.<br><br>", "<b>Username: prezbucky</b><br><br>Right - cost is an important variable. No, UW/UT/PU are probably not worth tens of thousands (of dollars) more, if the OP sticks with CS. (and probably even if he doesn’t)<br>And being able to take (especially) Humanities and SS courses at the other Five Colleges members is a sweetener, as I’ve said. You could use Smith and Amherst (et al.) for many of the distribution requirements and UMass for the major and have one heck of a high-class degree. (assuming kids can take a bunch of classes at the other schools…)<br><br>", "<b>Username: theloniusmonk</b><br><br>All of these schools are in the same tier for CS. Choose based on your preferences beyond academics in addition to financials\".<br>Is there any evidence on this, most rankings on CS will have Austin, Purdue, Wisconsin ahead of UMass Amherst.  Here’s Niche’s:<br>UT Austin - 25<br>Wisconsin - 43<br>Purdue - 47<br>UMass Amhest - 89<br>While I think rankings should only be used in a general sense, Niche seems reasonable.  In silicon valley just to balance the posts on NY and Boston placement, Purdue has the strongest reputation among the four in CS and Engineering.  They would not be considered to all be in the same tier.<br><br>", "<b>Username: gearmom</b><br><br>^@PengsPhils<br>After following @PengsPhils posts for some time, he truly seems like one of the most knowledgeable contributors for CS being immersed in CS educational world. I’m sure he is not basing his opinion on Niche. Additionally @MYOS1634 (and @prezbucky) are some of the top college advisors here.<br><br>", "<b>Username: Greymeer</b><br><br>ROI ranks usually do not correct for cost of living. 100k in the Bay Area is nothing, 80k in Arkansas is a lot. So looking at gross salary is a poor way to compare schools. Most of the higher ranking schools are in the northeast where it is expensive to live thus the higher salaries.<br><br>", "<b>Username: gearmom</b><br><br>@Greymeer We were looking at ROI within New England which was the target location of the student and therefore relevant. Clearly Arkansas will be different than Cali but for a person targeting the Boston Tech corridor actually seeing no benefit after the ten year mark based on school was relevant since you could see salary AND location.<br><br>", "<b>Username: theloniusmonk</b><br><br>“After following @PengsPhils posts for some time, he truly seems like one of the most knowledgeable contributors for CS being immersed in CS educational world. I’m sure he is not basing his opinion on Niche. Additionally @MYOS1634 (and @prezbucky) are some of the top college advisors here.”<br>I’m not basing my ranking on niche, just giving it as general guideline.  My ranking would have Purdue ahead of the other three based on the alumni I’ve worked with in silicon valley and the hiring practices of SV companies which actively recruit at Purdue and more than the other three.<br>Let’s take Purdue out of the equation, would you advise someone to pick UMass Amherst over MIT even if the latter was say 40K more over the four years?<br><br>", "<b>Username: gearmom</b><br><br>@theloniusmonk MIT is top tier. That is worth a discussion because you are actually getting into the tippy top tier for CS.<br>We don’t know if the baseline of 160k is affordable. They could be taking out 60k or more of debt for that. Adding an additional 30k of debt could be a significant burden. It would be to most American families. I would only consider pushing a family into that much debt for a LIFE CHANGING career choice which Purdue would certainly not be IMHO versus UMass for CS. An ambitious UMass student with a great portfolio who has taken advantage of internship opportunities and the five college consortium of Amherst and Smith will have a top quality and competitive resume.<br><br>", "<b>Username: gearmom</b><br><br>@theloniusmonk Also keep in mind that most UMass grads probably head to the Boston Tech corridor or NY (New Englanders tend to stay put) so it is of no surprise the SV does not head to UMass.<br><br>", "<b>Username: PengsPhils</b><br><br>Re CS strength, if I had to order them Purdue would be #4 of these four. For engineering, different story. @theloniusmonk is your experience specifically in CS and software or in engineering and more hardware bent areas? That I think would make an obvious difference in your opinion of Purdue.<br>Their CS is not the same top-tier their engineering is. The other three schools listed are explicitly known for their research in CS and recruited accordingly, though there is a fine argument to be made about the effect on undergraduates of said research. Still, Purdue is far from a frontrunner ahead of the other schools listed. I don’t see any reasonable ordering that would justify any sort of significant price difference.<br>Anecodtally against your experience, I have worked on both coasts and encountered grads and interns from every school in this thread except for Purdue. I’m very software bent and work at companies also emphasizing that as the OP seems to be. If OP is considering majoring in engineering, Purdue is indeed the best choice, and that should be considered. Still, it’s hard to justify a price difference when all four will still offer solid engineering programs and equal to better CS.<br>In terms of pure research, check out the research output for CS for the schools. This is one data point but shows that there is really not a significant difference.<br>UWis: 11<br>UT-Austin: 16<br>Purdue: 19<br>UMass: 21<br>http://csrankings.org/#/fromyear/2007/toyear/2017/index?all<br>I’d trust Niche absolutely zero for academic rankings. Putting all of these colleges as low as they do is a red flag. Understanding and ranking CS colleges is hard for many reasons, and research should not be the gold standard, but it’s a start.<br>Looking at their methodolgy:<br>Overall Niche Grade - 25.0%<br>Computer Science Student SAT/ACT Scores - 20.0%<br>Percent Majoring in Computer Science - 15.0%<br>Computer Science Program Demand - 7.5%<br>Computer Science Student Surveys - 7.5%<br>Percent of U.S. Computer Science Graduates - 7.5%<br>Computer Science Program Demand Within School - 5.0%<br>Computer Science Research Expenditures per Student - 5.0%<br>Comparison of SAT/ACT scores of students majoring in Computer Science - 5.0%<br>Computer Science Research Expenditures - 2.5%<br>So over a third is Niche surveys, almost a quarter based on test scores of students (self-reported on Niche), and another about a third is based on simply the relative size of the program compared to the school and other CS programs. To round it out, the research funding also can be tangential at best to program quality, especially again with federally funded programs with long track records at the state schools above.<br>Research funding versus actual contributions to the field is a big difference. Niche captures little to nothing of value for CS. Not saying they really have the ability to do much given the available data, but they shouldn’t be considered with any authority.<br><br>", "<b>Username: pat07ek</b><br><br>@gearmom the COA of Purdue would be 10-15k more for four years (assuming UMass increases 2k per year and Purdue doesn’t ). And as per Purdue’s website their total coa for international students is $46194.<br><br>", "<b>Username: theloniusmonk</b><br><br>My experience is both sotware and hardware.<br>US News global rankings for CS are similar:<br>Austin - 2<br>Wisconsin - 34<br>Purdue- 60<br>UMass Amherst - 167<br><br>", "<b>Username: gearmom</b><br><br>@pat07ek 2k per year would be high increase estimate. Your total estimated additional cost should be 10k over four years or 170k for four years. You should find out in March if Purdue is freezing tuition. With freezing, you are at $184,776 for Purdue. If you are getting 36k in scholarships over for years for UMass, your total cost with a 3.6% increase is ~$170,840. You have about a 14k difference. What GPA do you need for the UMass scholarship? Which school do you prefer?<br><br>", "<b>Username: PengsPhils</b><br><br>Apologies for the triple post, the first two were held due to the methodology link, and I was told to repost without via a mod. If someone could delete those, that’d be great.<br>Different experiences I guess, but the point being, I don’t think Purdue is in any way a standout, and if anything trends towards the bottom half, if one is forced to order them. But the same student should have equal opportunity and success at all four schools. I’d choose based on things beyond that like cost and fit for that reason.<br><br>", "<b>Username: gearmom</b><br><br>@theloniusmonk O’k see that.Surprising that Austin is ahead of MIT and Stanford on this. And UIUC is only 46 and U Wash is only 56. Not sure why U Wis is ahead of UIUC???<br><br>", "<b>Username: theloniusmonk</b><br><br>“I don’t think Purdue is in any way a standout”<br>It’s not a standout agree, but UMass is not at the level of the other three in CS and most rankings will show that.  If cost were the same, I’d recommend UT Austin.  In silicon valley Purdue would’t standout either but it has the best reputation of the four.<br><br>", "<b>Username: MYOS1634</b><br><br>I guess it all depends on region then, because on the East Coast (New England and MidAtlantic) UMAss CS would be considered wayyy better than Purdue CS (but the opposite for Engineering).<br>This however doesn’t really matter much, or only insofar as OP as an international student will need to go on to a Master’s degree to access an OPT and I don’t think s/he’ll be hindered by a degree from any of these universities.<br><br>", "<b>Username: Postmodern</b><br><br>I have hired CS grads for nearly 25 years.  Do you know what kind of company you will wish to work for after graduation?<br>Ask the career office at all places who comes there to recruit – and maybe even call the HR departments of your dream job and ask where they recruit from.<br>For example, a friend of mine’s son chose a college over less expensive options because his dream job company (Pixar) recruited heavily there.<br>If you don’t want a specific kind of job and will just be happy coding, then any choice will suit you fine, and paying extra for prestige will have a negligible effect, if any.  Good coders always get good jobs and great coders get fought over like the last slice of pizza.<br>Since none are in-state, the 4 year differences are not huge so I also recommend going where you’ll be happiest.  If it were me, I freaking love Austin and Amherst is an amazing college town…<br><br>", "<b>Username: DadTwoGirls</b><br><br>“UMass is not at the level of the other three in CS and most rankings will show that.”<br>I frankly don’t care about the rankings. Rankings are somewhat arbitrary and can be based on a lot of things that don’t affect the ability of someone to get a job or do their job well. I care about the people who I have worked with. I have worked with a LOT of CS grads from UMass Amherst and most of them are excellent. Also, we hire tons of them (literally, since a ton of software engineers is about 10 or 15 people – fewer if they are large).<br>Recently I had to find an expert on a particular subject, where I was lucky that the company that I consult to has three top experts. I called one and asked and he said “you have to talk to either X or Y” (naming the other two experts). Of these other two top experts, one is an MIT graduate and the other is a UMass Amherst graduate. No one cares where these top experts went to school. People care about what they know (which is a lot in this particular case).<br>Any of the schools that are listed in the original post for this thread are very good for CS.<br><br>", "<b>Username: PengsPhils</b><br><br><br>\"\"<br>It’s not a standout agree, but UMass is not at the level of the other three in CS and most rankings will show that.<br>\"\"<br><br>That’s where I disagree. I think the rankings you are citing don’t really capture the industry reputation of UMass (on both coasts) for CS. My experience matches with @MYOS1634, even on the west coast.<br><br>", "<b>Username: theloniusmonk</b><br><br>UMass Amherst does not appear in the top-10 or even top-25 of schools that silicon valley companies recruit.  I’ve not run across any UMass grads here but of course that doesn’t mean that there aren’t some out here.  I’ve run across alumni from the other schools in various roles and positions and know what out-of-state schools companies recruit from.  They would be - MIT, CMU, Michigan, Ga Tech, Purdue, Illinois, UNC, Washington, Cornell, Penn.<br>Ok let’s say for the sake of discussion, UMass Amherst is better than Purdue, Texas-Austin, Wisconsin in CS.  Where would you put it wrt to the schools above along with Stanford, Cal Tech, Berkeley?   If you think it’s better than UT-Austin, you have to think it’s top-15 or 20 and better than Duke, JHU, Dartmouth, Vanderbilt, UCLA, Washington etc…<br>And what schools would be worth the extra 40K in CS?  Any?  UMass is that good that you say no to Stanford and MIT and CMU because it’s 40K more expensive?<br><br>", "<b>Username: gearmom</b><br><br>@theloniusmonk For goodness sakes, UMass has two local markets, Boston and NY, who snap up CS graduates from UMass. Doesn’t this seem logical. Perhaps Silicon Valley is OP’s target but I’ve read that opportunities for internationals from in India are quite good on the East Coast, and we certainly know plenty. I don’t know OP’s career goal. And perhaps it is regional but UMass is highly regarded on the East Coast.<br><br>", "<b>Username: theloniusmonk</b><br><br>That’s not what was said:<br>“I think the rankings you are citing don’t really capture the industry reputation of UMass (on both coasts) for CS. My experience matches with @MYOS1634, even on the west coast.”<br>Few schools have a good reputation on both coasts and nationally which is what’s being implied.  If UMass Amherst is that good, it cannot be regional and would have to be a top-15 or 20 school in CS and in the conversation as one of the best CS in the country.    Is it a good regional school for people that want to be in the northeast or is it Berkeley?<br>You have been good at criticizing my opinions on this and I’ve been clear where I put the schools.  I’m asking where your rank UMass Amherst among the top-20.<br><br>", "<b>Username: gearmom</b><br><br>^you have to tag people @theloniusmonk  if you want to talk to people. Very confusing.<br><br>", "<b>Username: theloniusmonk</b><br><br>apologies, so @gearmom, @MYOS1634, @PengsPhils   where would you rank the UMass Amherst CS program nationally.<br><br>", "<b>Username: Eeyore123</b><br><br>The funny thing about this thread is that the OP is an international student. They may not even be allowed to work in the US. I glanced at the OPs threads they never even expressed a desire to stay and work in the US.<br><br>", "<b>Username: gearmom</b><br><br>@theloniusmonk Based on everything I’ve seen, I’d put UMass at around #25 +/- 3 for US schools. In the same band as Rutgers, Purdue, UWis. That range. But as @MYOS1634 points out OP needs grad school for the OPT route so this is a moot point in some ways because his last school will be the most meaningful. Too bad OP, could not come here and tour because I think s/he would get a great idea of fit upon visiting.<br><br>", "<b>Username: DadTwoGirls</b><br><br>“And what schools would be worth the extra 40K in CS?”<br>With regard to Stanford or MIT, you have to ask yourself: Do you want to do it?<br>At some level attending a school such as Stanford or MIT is an opportunity that is only likely to come along once every few lifetimes, if at all. If I really wanted to do it, and if I was in a field (such as CS) where a well paying job after graduation was very highly likely, and the opportunity came along and it would only cost $40k, I would be inclined to pay the extra 40k. This is not because I would necessarily expect to get the 40k back, it is because this is an opportunity that just doesn’t come along very often.<br>Also, all of the schools mentioned in this thread are very good schools that will get a person where they want to go (assuming that being a professional software engineer is the goal). Any of these might be worth $40k more than some other lesser schools that we haven’t mentioned in this thread.<br><br>", "<b>Username: gearmom</b><br><br>@DadTwoGirls The great part of this dilemma is that OP has wonderful options.<br><br>", "<b>Username: barrons</b><br><br>nm<br><br>", "<b>Username: gearmom</b><br><br>@barrons While that was grad school rankings, I think it gave a flavor of the quality of the schools in question.<br><br>", "<b>Username: laxdaddy</b><br><br>If climate isn’t a concern for you, UMass is the clear choice for CS.  Also consider you will be close to Boston and high tech/biotech is going to be local for you.<br><br>", "<b>Username: PengsPhils</b><br><br>@theloniusmonk I would put them at 15-20.<br>I would UT around 10ish, UWis around 15-20, and Purdue around 30-40. I haven’t claimed anything about CMU/MIT/UIUC not being worth 40K. My only claims are that the schools in this thread are of a similar tier for CS, and Purdue would be the lowest if we had to order them, but by such a slim margin it’s meaningless.<br><br>\"\"<br>Few schools have a good reputation on both coasts and nationally which is what’s being implied.<br>\"\"<br><br>Within the industry? I think quite a few do. The following would be candidates for good CS reputation on both coasts:<br>CMU<br>MIT<br>Stanford<br>UCB<br>UIUC<br>Michigan<br>Washington<br>USC<br>Cornell<br>UT Austin<br>Wisconsin<br>UMD CP<br>UCLA<br>UMass Amherst<br>Brown<br>Rice<br>Georgia Tech<br>Penn<br>UMass is towards the bottom of those, and I’m sure I’m forgetting a few, but all of those have stellar reputations in my experience.<br><br>\"\"<br>Duke, JHU, Dartmouth, Vanderbilt,<br>\"\"<br><br>I think UMass Amherst beats these four by a tier. Again, just for CS.<br>ASU is on that 25 list you reference as well. I would not count them as a top CS reputation school. It’s a combination of proximity and volume. I suspect Purdue benefits from its engineering reputation.<br><br>", "<b>Username: theloniusmonk</b><br><br>Where’s the reputation of UMass Amherst in the west coast?  Is that from alumni starting businesses or leading product development teams out here?  ASU - the reason they do well is not because of proximity or volume though that might have helped in the beginning.  SV companies stick with colleges where the alumni do well.  If ASU alumni were not contributing, companies would stop recruiting.   I think Harvey Mudd, Cal Tech, UNC-CH, Harvard, Princeton, Chicago have stronger CS programs but ok we’ll have to disagree on that.<br>Would you know the acceptance rate for UMass Amhest CS program, in and out of state?  If you’re putting it with UCLA and Georgia Tech, it should be highly selective, like 15%, 1500/34 stats for out of staters.<br><br>", "<b>Username: PengsPhils</b><br><br><br>\"\"<br>Where’s the reputation of UMass Amherst in the west coast?<br>\"\"<br><br>From the masses of papers in CS research areas that are used all over the valley. Their strength in AI/ML in particular, which SV can’t get enough of. They are #12 in peer ranking for graduate CS according to US News in that specialty, ahead of many schools mentioned in the past few posts.<br>https://www.usnews.com/best-graduate-schools/top-science-schools/artificial-intelligence-rankings<br>I’d agree with Mudd and Harvard having better reputations. Princeton and Chicago are close. Still, we’re talking what, a few extra schools? This isn’t the gap you’re trying to claim between those in the thread. These would also bump down Purdue in my mental book. Again, that list was just off the top of my head and may not be complete.<br><br>\"\"<br>ASU - the reason they do well is not because of proximity or volume though that might have helped in the beginning. SV companies stick with colleges where the alumni do well.<br>\"\"<br><br>I’d argue you’d find this at most schools regardless of reputation. CS undergrad educations are relatively consistent among competent programs. There are a few programs that have select reputations for their teaching methods and results, but not many. Most big research schools don’t have any special sauce approach. I bet Silicon Valley could find the same results from ASU as they could at UCF - they simply don’t go there because it’s farther and they don’t have any incentive to take a risk.<br><br>\"\"<br>Would you know the acceptance rate for UMass Amherst CS program, in and out of state? If you’re putting it with UCLA and Georgia Tech, it should be highly selective, like 15%, 1500/34 stats for out of staters.<br>\"\"<br><br>I believe it is around there, though I can’t find the specific statistic for undergrads. It’s 14% for graduate level according to the link below. That’s much lower than many other schools on that reputation list I mentioned for graduate programs, though admittedly their grad program is more well known due to their incredible research prowess.<br>https://www.petersons.com/graduate-schools/university-of-massachusetts-amherst-college-of-natural-sciences-and-mathematics-department-of-computer-science-000_10015980.aspx<br>Here’s another example of their research reputation, which again, is about the only think rankings are really using here.<br>https://forum.thegradcafe.com/topic/89201-aiml-phd-rankreputation-umass-amherst-vs-university-of-maryland-college-park/<br>Again, check csrankings.org to filter by that research area, which isn’t some random collection of methodology but is strictly focused on research output.<br><br>We’re just talking in circles here at this point. Our personal anecdota don’t match up, so it goes. The OP is not benefitting from any of this, and I’m far from the only one here advocating for UMass’s strength in CS at the undergrad level. Your personal experience is not inherently reflective of all reality, neither is mine.<br><br>", "<b>Username: pat07ek</b><br><br>@theloniusmonk please compare UMass to the colleges in the list and not the ones out of this list. I haven’t applied to colleges like ivies or other really selective colleges for that matter. The four colleges which I mentioned are the ones I applied to or expecting a yes . So, they are the only options I have.<br>Give me your opinion on the four colleges which I mentioned.<br><br>", "<b>Username: ljberkow</b><br><br>@pat07ek Unfortunately, some have corrupted your thread and you have been inundated with information that you didn’t request and don’t need.  The real truth is that there is a lot of nitpicking going on here and some defense of turf.  All of your choices are good and nobody knows your financial situation as much as you do.  You will learn nothing new by hanging out on this thread, but let this inane discussion go on for days and ignore it.<br><br>", "<b>Username: pat07ek</b><br><br>Yeah! Even I feel like it @ljberkow<br><br>", "<b>Username: theloniusmonk</b><br><br>“@theloniusmonk please compare UMass to the colleges in the list and not the ones out of this list. I haven’t applied to colleges like ivies or other really selective colleges for that matter. The four colleges which I mentioned are the ones I applied to or expecting a yes . So, they are the only options I have.<br>Give me your opinion on the four colleges which I mentioned.”<br>Apologies for diverting the thread away from your op.  Of the four, I’d choose UT-Austin for not only CS but other programs as well if you want to switch majors or minor in something non-CS. Of the four it has the best programs in management, economics, if you wanted to minor in something like that.   It’s also the most diverse campus of the four if that’s important to you and the best alumni network nationally.  And it has a pretty strong sports scene, again if that’s important.  I’d choose Purdue second for the reasons discussed, followed by Wisconsin, then UMass-Amherst.  All are in great college towns though Purdue is more isolated.  For an international student from India, you’d be most at home at Texas or Purdue.<br><br>", "<b>Username: theloniusmonk</b><br><br>“I bet Silicon Valley could find the same results from ASU as they could at UCF - they simply don’t go there because it’s farther and they don’t have any incentive to take a risk.”<br>They’d go to Antarctica if it gave them a competitive advantage in talent.  They take risks all the time, these are not stodgy old companies.<br><br>", "<b>Username: gearmom</b><br><br>@theloniusmonk I have no idea why you would seem to suggest that an international student would not be at home at Wisconsin or Mass. I am not a Wisconsin expert but Massachusetts as a state goes out of it’s way to be welcoming to internationals. It certainly isn’t any different at the Amherst campus and there are a good number of internationals from India working in Mass. Have you ever personally been to that campus and spoke with CS staff? We have and DH was very impressed with both and spent quite a bit of time reviewing and interviewing the many UMass grads that he works with at his international company in the tech corridor. This conversation really seems to have jumped the shark. I think Purdue is a great school and have suggested it to many kids here especially for engineering. I also think Austin is a great school if money were no object. But I almost think it is irresponsible to push Austin which would mean 50k more additional debt for this family when OP is going to go to grad school and despite your low opinion, UMass is regarded by many as a top school with a quality CS program. Amherst is one of the top college towns in America. And the five college consortium that UMass has offers an elite opportunity to study at some of the very best LACs in the country. @pat07ek<br><br>", "<b>Username: SwimmingDad</b><br><br>@pat07ek Good luck.  I agree this thread has diverted from your needs.  The clear answer is there isn’t a clear answer.  You are blessed with four wonderful choices.  I wish you all the best!<br>Now back to my popcorn while I watch a few adults with too much time on their hands fight online.  When it slows down I will turn this into an iPhone vs. android fight.   <br><br>", "<b>Username: theloniusmonk</b><br><br>“But I almost think it is irresponsible to push Austin which would mean 50k more additional debt for this family when OP is going to go to grad school and despite your low opinion, UMass is regarded by many as a top school with a quality CS program. Amherst is one of the top college towns in America. And the five college consortium that UMass has offers an elite opportunity to study at some of the very best LACs in the country.”<br>I’m not pushing any college just answering the question the OP asked.  Saying all four colleges are great may be accurate but it’s not an useful answer and it doesn’t help the OP.  Austin has good weather, diverse campus and strong programs across the board in addition to an excellent CS program.  I can’t answer the debt question as that’s for the OP and family to decide.  Boston is diverse, but we’re not comparing the cities, we’re comparing the campuses.<br><br>"]}