{"title": "ivy league full price vs uofm in state tuition", "comments": ["<b>Username: payubisoft1</b><br><br>Hi everyone! I have to make the decision between paying for Columbia full price or going to University of Michigan on in state tuition for my undergrad. I plan on studying computer science. I will most likely want to go to grad school. If I go to Columbia, my entire undergrad is payed for but I’d have to pay for part of my grad school myself. If I go to Umich, my undergrad and grad is paid for and I’d have money left over. I prefer Columbia but I’m not sure it’s worth the additional $180,000. Which would you choose in my situation?<br><br>", "<b>Username: hannuhylu</b><br><br>100% unequivocally totally not even close to worth it!!<br>Univ of Mich all day everyday and I wouldn’t lose 1 wink of sleep, in fact, I would sleep soundly knowing I made a AWESOME DECISION!!<br><br>", "<b>Username: moooop</b><br><br>Michigan. No brainer.<br><br>", "<b>Username: fivesages</b><br><br>If you’re 100% set on going into CS, definitely UofM. But, if you’re open to exploring other avenues, I would probably consider Columbia.<br><br>", "<b>Username: TooOld4School</b><br><br>That is like asking:<br>Do you want the Shelby Mustang for $20K, or the Camaro for $60K?<br>The only thing you get at Columbia over Michigan is NYC. Half of Long Island goes to school at Michigan anyway so you can have a bit of that too.<br>Even the Columbia graduate parents we know send their kids to Michigan.<br><br>", "<b>Username: isthisboreal</b><br><br>Go to umich. it’s on par with many of the top universities (uc berkeley, etc) so academically you’ll be more than fine there. unless you REALLLLLY want Columbia because you love the school, but even then, it’s not worth the money (especially for undergrad). umich is one of the top schools for engineering and CS, people would kill to go there for in-state tuition. Go there.<br><br>", "<b>Username: aoeuidhtns</b><br><br>What kind of grad school are you looking at?<br>If you’re paying sticker price, then UofM would make more sense if you’re considering the technical skills you’ll learn as a CS major. Also, do you want to stay in Michigan long-term? If so, Mich places more of their graduates instate than Columbia would.<br>Columbia, however, will give you better OCR opportunities in San Fran/NYC and an, arguably, stronger lifelong network. Also, agreed with @fivesages that Columbia gives you alternate paths if your career plans change–consulting, banking, etc.<br><br>", "<b>Username: suzyQ7</b><br><br>How do you have decisions already?<br><br>", "<b>Username: Alexandre</b><br><br>Columbia and Michigan are peer institutions. Similar calibre professors, similar classroom experience and resources, virtually identical opportunities, equally potent alumni network etc… If cost of attendance is the same, I would say go for fit, but if one is cheaper than the other, then the cheaper option makes better sense, unless money is no object, in which case I would again recommend fit.<br>Just as an aside, last year, out of roughly 480 CS Michigan undergraduate students who graduated, more than 150 joined companies the four most desirable IT firms: Apple, Google, Microsoft and Amazon.<br><br>", "<b>Username: CU123</b><br><br>Columbia and Michigan are not peer universities. Michigan and UVA and other top publics are.<br><br>", "<b>Username: Much2learn</b><br><br>Michigan will be easier than Columbia, but that is not necessarily a bad thing. It depends on you.<br><br>", "<b>Username: CU123</b><br><br>Still would choose UMich over Columbia for price and your particular major.<br><br>", "<b>Username: prezbucky</b><br><br>Michigan for undergrad, Columbia for grad (if you’re still into it…).<br><br>", "<b>Username: tk21769</b><br><br>Michigan.<br>For some students, Columbia may be worth some price premium. Not $180K, though.<br><br>", "<b>Username: jrm815</b><br><br>In CS, you don’t get as much of a boost in salary coming out with an MS versus BS that you might in other disciplines.  Unless you really want to go for a PhD, going full time to grad school for an MS doesn’t really pay unless you are an International looking for visa status.  Many companies will hire you with your BS and subsidize you going part time for an MS while you work.  So the school comparison (for this major) should be done on the basis of the undergrad degree.<br>In this case, cost-wise Michigan is the clear winner. When it comes to fit, the schools have very different vibes to them and being in NYC might have extra appeal.<br><br>", "<b>Username: Alexandre</b><br><br>CU123, I agree that to ultra competitive high school students and parents, Columbia and Michigan are not peers. But that does not mean that Columbia and Michigan are not peers.  As far as academe and the corporate world are concerned, Columbia and Michigan are indeed peers. Just because Michigan is public and Columbia is private does not mean the two universities cannot be peer institutions. They operate very similar academic programs, have roughly equal resources, funding and budgets when adjusted for size, and run similar research complexes. Columbia would not have hired Michigan’s president if the two universities were not peers.<br><br>", "<b>Username: i012575</b><br><br>Really ? And that too for CS? UMich all the way! Use the money for a top tier MBA education (around $220k in today’s dollars) if that is the path you would like to follow.<br><br>", "<b>Username: Defensor</b><br><br>“Columbia and Michigan are not peer universities.”<br>You’re right. In both undergrad and grad computer science, Michigan is ranked HIGHER than Columbia - and major corporate recruiters are well aware of that fact.<br>Since the OP’s interest is computer science, and Michigan is ranked higher and would cost tens of thousands of dollars LESS to attend - Michigan is the absolute no-brainer best choice.<br><br>", "<b>Username: northwesty</b><br><br>Columbia and UMich are two great schools with great reputations.  But they are very different schools that will provide you a very different college experience.  UMich draws 100k for a football game; Columbia 1k.  Very apples to oranges.<br>UMich at in-state prices is an outstanding cost/value proposition, especially for engineering.  But your parents are willing/able to pay for either.  So the cost is the same to you.  That’s a very fortunate spot to be in.<br>Life is short.  Go where your heart tells you to go.  If Columbia is the experience you really really want, then go to Columbia.<br>Don’t get overly hung up about rankings.  Columbia comp sci is quite good (ranked about the same as UMich at the grad school level).  Neither UMich or Columbia is at the MIT level for comp sci.  You can bloom if planted in either place.<br>You haven’t told us enough about what you mean by “grad school” so we have no way of evaluating whether there’s value in conserving cash for that.  Grad school typically costs little.  Professional school (totally different ballgame) is very expensive.  If you are talking about non-professional grad school, conserving the college fund by going to UMich most likely means that the money would get used for something other than your post-grad education – like a college fund for your siblings or your kids or a house down payment.<br>If you are talking about getting an MBA when you say “grad school”, then I’d say save the money and go to a place like Columbia for B school.<br><br>", "<b>Username: moooop</b><br><br>Coastal bias is rearing it’s ugly head here. It will take forever to convince some people that there can be anything valuable in flyover country. Decades ago basketball legend Red Auerbach used to say that “Some people think anything west of the Hudson is camping out.”  Seems nothing has changed.<br><br>", "<b>Username: simba9</b><br><br>Kind of like arguing whether one should buy an Infiniti or a Lexus.<br>For CS, I’d put Michigan and Columbia into the same tier, and say they have similar reputations. I’d go to Michigan for undergrad, no question, just because of the financial savings.<br><br>", "<b>Username: nw2this</b><br><br>For CS, I think UMich is better, but if you prefer Columbia, go there. Where is your UMich grad school funding coming from and why would you lose it by going elsewhere for undergrad?<br><br>", "<b>Username: CU123</b><br><br>You missing the point, there not peers as overall universities.  You can always point out areas of concentration that are strengths, after all, the University of Colorado is ranked #1 in the WORLD in molecular physics (because the professor that teaches it is a Nobel laureate in the field).  That doesn’t make CU the #1 Uni in the world.  The undergraduate experience will be quite different for an undergrad at Columbia then at UMich.  The cohort at Columbia will ALL be top notch.  Columbia has a breadth of quality across many disciplines, not just a few.  Seriously if you wanted to do just CS, do a boot camp and you’ll probably learn more about programming that is useful to the field than 4 years at Columbia or UMich, or course, what you’ll lack is an education, and Columbia will get you a better overall education by a good margin.  We won’t go into class sizes, state legislature dictating tuition etc., and lack of funding for publics, so IMO they are not peers.  The top privates are simply in a different class.<br><br>", "<b>Username: moooop</b><br><br>No, you’re missing the point. I’ve seen across-the-board rankings, & it was something like 1. Harvard 2. Toronto  and Michigan was real close after that. Michigan is not a one-trick pony, nor [condescendingly] good for a public (sneer) school. It’s one of the top universities in the world, PERIOD.<br><br>", "<b>Username: rjkofnovi</b><br><br>CU123:<br>You obviously are clueless about Michigan.<br><br>", "<b>Username: CU123</b><br><br>Hmmmm I see USNWR as UMich #27 and Columbia #5  I guess that makes them peers…only behind UCB, UVA and UCLA for top publics.<br><br>", "<b>Username: moooop</b><br><br>Oh, I’m sorry. If it’s in NYC it MUST be the best, right?<br><br>", "<b>Username: CU123</b><br><br>I like UMich alumni, they are passionate about there alma mater.  Again I don’t care about location its about the issues that public schools have to deal with that privates don’t.  Like I said earlier, for this OP, UMich is the right choice.<br><br>", "<b>Username: rjkofnovi</b><br><br>CU123:<br>it certainly is not Colorado.  For you to cite USNWR rankings as if they were the gospel, just shows you how truly clueless you are.<br><br>", "<b>Username: CU123</b><br><br>Not gospel, but I do feel that the methodology they use is fairly well thought out as opposed to others.<br><br>", "<b>Username: Much2learn</b><br><br>@alexandre “Columbia would not have hired Michigan’s president if the two universities were not peers.”<br>Which is why Harvard President Drew Faust is a Penn Phd. and Penn President Amy Gutmann is a Harvard Phd.  <br><br>", "<b>Username: CU123</b><br><br>Yes Lee Bollinger is such an outsider having been the provost at Dartmouth and graduating from Columbia Law.<br><br>", "<b>Username: SincererLove</b><br><br>D picked Vandy with full tuition scholarship compared to full pay MIT, and $15k annual merit at U Chicago. She is CS/premed. We were willing to pay, but she decided to go where she can have a higher undergraduate GPA, better ROI, and where she can be happiest, etc. She never looked back. For CS, I don’t think it matters where you graduate when you are interviewing, as long as you demonstrate the competency, skills, etc.<br>Michigan is way better college for CS than Vandy!! Sorry about my humble brag <br><br>", "<b>Username: CU123</b><br><br>I like it, she had the choice between three very fine, private universities.<br><br>", "<b>Username: moooop</b><br><br>By the way, I’m not a UM alumnus, though my uncle the Fields Medal winner got both his degrees there.<br><br>", "<b>Username: CU123</b><br><br>That’s great! =D&gt;<br><br>", "<b>Username: nw2this</b><br><br>US News ranks them almost the same for CS.<br>https://www.usnews.com/best-graduate-schools/top-science-schools/computer-science-rankings<br><br>", "<b>Username: CU123</b><br><br>I think I addressed this already.<br><br>", "<b>Username: simba9</b><br><br><br>\"\"<br>Seriously if you wanted to do just CS, do a boot camp and you’ll probably learn more about programming that is useful to the field than 4 years at Columbia or UMich<br>\"\"<br><br>I hope that wasn’t a serious statement, because anyone who actually believes that has no business advising someone on where to go for a CS degree. I agree that overall Columbia tops Michigan, but not for CS.<br><br>", "<b>Username: Much2learn</b><br><br>Consider this: https://www.payscale.com/college-salary-report/best-schools-by-majors/computer-science?page=32<br>Lists Columbia at 7th highest paid CS grads. Michigan comes in at number 88.<br><br>", "<b>Username: simba9</b><br><br>Columbia grads are more likely to be working in New York City, where salaries are high, than in the lower-paying Midwest.<br><br>", "<b>Username: Alexandre</b><br><br>Much2learn, salary surveys are never accurate. For one, they seldom adjust for cost of living. As you can see from the link you provided, most of the universities at the top are concentrated in California and the East Coast, where the cost of living is significantly higher than the cost of living in the Midwest and the South.<br>Besides, the figures are suspect to begin with. For example, the average starting salary for CS majors at Michigan is close to $100k, so I am not sure how it is possible  for the “early career pay” to be $75k. Like I said above, last year, roughly one third of Michigan’s CS majors landed jobs with Google, Apple, Microsoft and Amazon. That’s tangible evidence of the program’s status as one of the better CS departments in the country. Columbia will likely have similar placement success, but at a fraction of the cost, the OP is probably better off foregoing Columbia and sticking to his in-state option.<br><br>", "<b>Username: Alexandre</b><br><br>moooop, your uncle is Stephen Smale? That’s really cool!<br><br>", "<b>Username: Zinhead</b><br><br>You can see Michigan’s placement here:<br>http://career.engin.umich.edu/wp-content/uploads/sites/30/2016/03/annualreport1415.pdf<br>Average CS starting salary was $91,000 with top salary of $160,000.<br><br>", "<b>Username: SwimmingDad</b><br><br>If you think you will be happy at Michigan (and it is a great school to be happy at) go for Michigan.  Both are terrific schools that will, for the most part, open up the same doors (especially for a CS major).<br>And congrats on being able to make an amazing choice!<br><br>", "<b>Username: Much2learn</b><br><br>“For one, they seldom adjust for cost of living. As you can see from the link you provided, most of the universities at the top are concentrated in California and the East Coast, where the cost of living is significantly higher than the cost of living in the Midwest and the South.”<br>The problem with that is that the top tech jobs are in SF, Seattle, and NYC. Students competing for top jobs are not going to the midwest and south.<br>I believe the Michigan places 1/3 at those 4 firms. There is nowhere you can’t reach from Michigan. I just think that Columbia students are probably placed at higher rates in top positions, and also may be likely to be recruited for other options. Finally, all job at Apple, for example, are not the same. A lot of the people working at the Apple store were CS majors. If the student was imagining being a SWE or a PM, that is a lot different. CS salaries seem to be very sensitive to technical skills and I think Columbia pushes students harder to learn more, and starts with stronger students who probably had more CS experience to start.<br>Additionally, it is likely that Columbia students are more likely to have internships and job opportunities at companies right in NYC, where Google owns an entire building, Bloomberg hires many, IBM, Palantir, Jane Street etc.<br>There are also certain positions where a Columbia student would seem to have an advantage of getting included as a candidate. I was talking to a current CS candidate who had a second round tech interview in NYC last week. The person said that there were 6 candidates being interviewed that day, and they were from MIT, Penn, Princeton, Berkeley, and Duke. That has a strong appearance of being a position where the name of the school matters. I do think a Michigan grad can get into that group, but I suspect it would be easier for a Columbia grad. They are both strong brands, but the Columbia brand is very strong in NYC.<br>I am not saying that Columbia is a clear choice, I just think that it depends on where the student wants to end up. If they want to be in the midwest, I would lean toward Michigan. If they want to be on the east coast, I would lean toward Columbia. If they want to be in Seattle or SF, I think it depends on what the student values.<br><br>", "<b>Username: Alexandre</b><br><br>“I believe the Michigan places 1/3 at those 4 firms. There is nowhere you can’t reach from Michigan. I just think that Columbia students are probably placed at higher rates in top positions, and also may be likely to be recruited for other options.”<br>I don’t see why that would be the case since Michigan and Columbia are considered peer institutions by the firms recruiting their graduates.<br>“Additionally, it is likely that Columbia students are more likely to have internships and job opportunities at companies right in NYC, where Google owns an entire building, Bloomberg hires many, IBM, Palantir, Jane Street etc.”<br>I don’t think finding great internships is a challenge for Michigan students. When you have thousands of gifted undergraduate students, companies come to you.<br>“The person said that there were 6 candidates being interviewed that day, and they were from MIT, Penn, Princeton, Berkeley, and Duke. That has a strong appearance of being a position where the name of the school matters. I do think a Michigan grad can get into that group, but I suspect it would be easier for a Columbia grad. They are both strong brands, but the Columbia brand is very strong in NYC.”<br>This is so random it is not even worth discussing. But yes, in NYC, Columbia’s brand exceeds that of Michigan. Then again, it exceeds that of virtually every university in the world save perhaps Harvard, and even that is debatable. But the OP has not indicated that his goal is to live in NYC. In other parts of the country, Columbia’s corporate reputation does not exceed that of Michigan.<br>When it comes to graduate school or professional placement, Columbia offers no advantage over Michigan. Like I said earlier, when choosing between Michigan and Columbia, one need not concern himself with the quality of those universities since they are roughly equal. If cost is a concern, and one is cheaper than the other, then the cheaper option is the way to go. If cost is not a concern, going for fit is the way to go.<br><br>", "<b>Username: CU123</b><br><br>I don’t see why that would be the case since Michigan and Columbia are considered peer institutions by the firms recruiting their graduates.<br>@Alexandre  these are opinions not facts. UMich is not even he best public US university out there UCB is widely recognized as the best public.<br><br>", "<b>Username: rjkofnovi</b><br><br>^^^^Columbia isn’t considered the best private school either.  What is your point?  Your views are based on your perceptions as well.  You don’t think than any public school is worthy of being considered a peer of Columbia.  That is your misfortune.<br><br>", "<b>Username: gearmom</b><br><br>@CU123 This is for CS. UIUC is better than Columbia for CS. But for an expert opinion. @PengsPhils<br><br>", "<b>Username: CU123</b><br><br>Thanks for making clear my opinion @rjkofnovi.  Yes I do not believe that the top public universities are peers of the top private universities in the area of undergraduate studies.  It is different in graduate studies where public universities operate much more like private universities albeit still at a slight disadvantage.  You only have to look at the historical slide of public universities compared to private universities (in undergraduate studies) to see it.  BTW I’m not disparaging UMich by itself, I am disparaging all public unis and its not their fault.  It is the fault of the state legislatures by putting these unis in impossible situations by limiting there ability to raise in state tuition, and then cutting their funding.  This inevitably leads to ever increasing enrollments and class sizes without the appropriate increase in professors and resources which leads  to publics falling further behind privates as the privates simply don’t have these constraints.  So in the end, I am advocating for more support for public universities or simply letting them become private (which will never happen for state flagships).<br><br>", "<b>Username: CaliDad2020</b><br><br>I wish for once a debate on here would center over specifics to a kid’s insterests rather than who will be more impressed by what alma mater at the old folks home…<br>Columbia: Morningside, Core, subway, high cost of living but probably cheapest an adult will ever live in NYC<br>UMich: Ann Arbor, excellent engineering tradition and alumni network, football, north campus, driverless buses<br>I don’t know enough about teachers, programs etc. but either will be awesome.<br><br>", "<b>Username: CU123</b><br><br>@gearmom   Ref post #11 where I recommend to the OP to go to UMich over Columbia for CS.<br><br>", "<b>Username: gearmom</b><br><br>^O’k Don’t know how this conversation has gotten sidetracked.<br>But it’s always great to have @PengsPhils 's opinion anyway.<br><br>", "<b>Username: Alexandre</b><br><br>“these are opinions not facts. UMich is not even he best public US university out there UCB is widely recognized as the best public.”<br>Your logic is flawed. I never claimed that Michigan is the best public university, and I would agree that that honor goes to Cal. Michigan is a close second, along with UCLA and UVa. But so what if Michigan is not considered the best public university in the nation? Columbia is not even recognized as one of the top 5 private universities. That distinction goes to Harvard, MIT, Princeton, Stanford and Yale.<br>You are again insinuating that private universities are better than public universities, which is a prejudiced and elitist point of view.<br>And I am not stating opinion when I say that Columbia and Michigan are peer institutions. Our opinions hardly matter. I am stating fact. All legitimate academic reputation ratings published by academe that I have seen suggest that Columbia and Michigan are peer institutions. All industry placement reports I have seen also suggest that Michigan and Columbia are equally respected. If you have evidence to the contrary, feel free to share.<br><br>", "<b>Username: Much2learn</b><br><br>@alexandre “When it comes to graduate school or professional placement, Columbia offers no advantage over Michigan.”<br>I am not sure what you are basing that on.<br>U of M receives limited state money and has to take most of its undergrads from the state of Michigan. Making matters worse, the State of Michigan’s public education is in a death spiral which is making qualified in-state candidates scarce (see link below).<br>Historically, U of M’s advantages are their strong alumni base, its large endowment, and sports. However, sports seems to be sliding with the football team losing 12 out of the last 13 games to Ohio State and 8 out of the last 10 games to Michigan State.<br>Given their situation, I don’t see how they can improve their undergrad situation significantly unless the State allows them to go private, which I think is unlikely.<br>http://www.freep.com/story/news/education/2016/05/18/michigan-students-sliding-toward-bottom/84535876/<br><br>", "<b>Username: Alexandre</b><br><br>“You only have to look at the historical slide of public universities compared to private universities (in undergraduate studies) to see it.”<br>Actually CU, the slide has a lot more to do with data reporting and a terribly flawed methodology than with actual drop in quality. Private universities are making up numbers to help their rankings while public universities cannot because their data are audited for accuracy. Columbia claims to have a 6:1 student to faculty ratio. LOL!    Someone must have forgotten to include the 6,500 thousand graduate students enrolled at Fu and the Graduate School of Arts and Sciences. in that calculation. That Fu. There are 190 professors. If you just include the 1,600 undergraduate students in the student to faculty ratio calculation, you get a very respectable 8:1 ratio. Now add the 3,100 graduate students enrolled at Fu to the equation, which Columbia conveniently omits, and the ratio swells to 25:1. Columbia also conveniently omits 3,300 graduate students enrolled in the Graduate School of Arts and Sciences. Overall, Columbia’s student to faculty is well over 12:1, and yet it reports a 6:1 ratio.<br>Those rankings consider faculty salaries in their rankings. Columbia professors (as well as professors in most urban universities) obviously earn significantly more than Michigan professors (and professors in most college towns and rural areas) since the cost of living in NYC far exceeds the cost of living in Ann Arbor. I am not sure how that is a fair comparison.<br>There are many more inconsistencies and methodology flaws that benefit private universities and hurt public universities. That does not make private universities better than public universities.<br>“BTW I’m not disparaging UMich by itself, I am disparaging all public unis and its not their fault. It is the fault of the state legislatures by putting these unis in impossible situations by limiting there ability to raise in state tuition, and then cutting their funding.”<br>Michigan’s financial status is not  common for a public university. Michigan’s endowment stands at $9.6 billion, 8th largest in the nation. With 50% of its undergraduate students coming from OOS, most of which pay full tuition, Michigan has a very healthy tuition income stream.<br>“This inevitably leads to ever increasing enrollments and class sizes without the appropriate increase in professors and resources which leads to publics falling further behind privates as the privates simply don’t have these constraints.”<br>Private universities do not have financial constraints? With the exception of Princeton, Harvard, Yale and Stanford, I would say most private universities have financial constraints. Columbia’s financial position is no better than Michigan’s.<br><br>", "<b>Username: rjkofnovi</b><br><br>“Historically, U of M’s advantages are their strong alumni base, its large endowment, and sports.”<br>Gee, nothing academically at all?  Like I said before, clueless…<br><br>", "<b>Username: rjkofnovi</b><br><br>“You only have to look at the historical slide of public universities compared to private universities (in undergraduate studies) to see it.”<br>You mean the biased USNWR rankings that cater to elitist coasties and their private or bust delusions?  Probably the only people who actually pay to see the site.<br><br>", "<b>Username: CU123</b><br><br>Conspiracy theories abound when your college is under siege, however the reasons for the slide have not changed and will not change in the near future.  This is fact, not opinion, state colleges are woefully underfunded by states and not allowed to raise in-state tuition, so they increase the student body size.  Doesn’t matter what any ranking says, this is a deteriorating situation.<br>@Alexandre do you deny this?<br><br>", "<b>Username: rjkofnovi</b><br><br>“Conspiracy theories abound when your college is under siege, however the reasons for the slide have not changed and will not change in the near future”<br>UCLA just moved up to 21 at USNWR.   So much for your “slide” theory of public universities…<br><br>", "<b>Username: Alexandre</b><br><br>“I am not sure what you are basing that on.”<br>I am basing it on the fact that according to academe, Columbia and Michigan are considered peer institutions. Over 200 Michigan undergrads are admitted into Michigan’s top ranked graduate professional programs annually, and many more are admitted into other top graduate programs around the nation. When it comes to professional placement, there are plenty of reports that show that Michigan is very well recruited. Columbia does not publish placement data, but Penn does. Last year, 36 Michigan engineering/CS graduates were hired by Google, compared to 19 Penn engineering/CS graduates. Another 33 Michigan engineering and CS graduates were hired by Apple compared to just 3 Penn engineering/CS graduates. 41 Michigan engineering/CS majors were hired by Microsoft, compared to 10 Penn engineering/CS graduates. 49 Michigan engineering/CS majors were hired by Amazon, compared to 6 Penn engineering/CS majors. In total, 149 Michigan engineering/CS graduates were hired by those four Tech giants, compared to 38 Penn engineering/CS graduates. I am not sure what more proof you want that Michigan does just as well as schools like Columbia and Penn when it comes to placement.<br>But like I said, there are several sources that seem to think that Michigan holds its own, at least with tech firms are concerned:<br>http://www.businessinsider.com/schools-with-the-most-alumni-at-google-2015-10<br>https://qz.com/967985/silicon-valley-companies-like-apple-aapl-hires-the-most-alumni-of-these-10-universities-and-none-of-them-are-in-the-ivy-league/<br>https://poetsandquantsforundergrads.com/2017/04/27/top-feeder-schools-silicon-valley/<br>“U of M receives limited state money and has to take most of its undergrads from the state of Michigan. Making matters worse, the State of Michigan’s public education is in a death spiral which is making qualified in-state candidates scarce (see link below).”<br>First of all, the University of Michigan no longer takes most of its undergraduate students from the state of Michigan. Last Freshman class was roughly 50% OOS. Secondly, while many public high schools in Michigan are not doing well, the ones that feed into Michigan are doing just fine. Second, Michigan receives $300 million from the state annually. While that is by no means enough on its own, when you combined it with its considerable endowment and the money Michigan generates from tuition thanks to its large OOS student body, the University is perfectly fine.<br>“Historically, U of M’s advantages are their strong alumni base, its large endowment, and sports. However, sports seems to be sliding with the football team losing 12 out of the last 13 games to Ohio State and 8 out of the last 10 games to Michigan State.”<br>What does football have to do with anything? Michigan is, first and foremost, one of the most intellectually supercharged communities in the country. Both Ann Arbor (which has the highest percentage of college education residents than any city in the US) and the University have an incredibly vibrant intellectual feel. Michigan is known for that. Michigan is also known for its very well rounded academic excellence. In fact, it is arguably the most well rounded academic institution in the country. Michigan is ranked among the top 15 in virtually every single field of study, and among the top 10 in most, including Business, Law and Medicine, as well as most traditional disciplines, such as English, History and Mathematics. In Anthropology, the Classics, Engineering, Philosophy, Political Science, Psychology and Sociology, Michigan is among the top 5 nationally. Michigan is also known as a medical center, and its hospital is considered one of the top 10 in the nation. So to suggest that Michigan is mostly known for football is a crude statement. That may be true of the uneducated masses, but then again, in those circles, most universities are not even recognized. But if you are insinuating that’s Michigan’s alumni are only loyal to the University if the football program is winning, you are mistaken. Michigan raised more from its alumni this year than it ever has. Michigan alumni are loyal to the university regardless of its football record.<br>But putting its record vs OSU and MSU aside, which is difficult considering how lopsided it has been, Michigan football is still doing well. It had back to back 10-3 seasons in 2015 and 2016, finishing #11 in the nation in 2015 and #10 in 2016. In 2015, two of Michigan’s three losses were by 7 points or less, and they beat Florida 41-7 at the Citrus Bow. In 2016, Michigan lost 13-14 at Iowa, 27-30 in double overtime at OSU and 32-33 against Florida State at the Orange Bowl. 9 of Michigan’s 10 wins in 2016 were by 9 points or more This year was supposed to be a rebuilding year, with 11 players drafted by the NFL last year. Still, the team is 4-1 (including a 33-17 win against Florida) and ranked #17 in the nation. Its four wins were all by a 16 point margin or better. While Michigan is struggling on offense this year, the Defense is ranked #1 in the nation. Another 10-3, top 10 season is certainly possible. Michigan also recruited back to back top 10 classes. I would say the future of Michigan football is looking good.<br>“Given their situation, I don’t see how they can improve their undergrad situation significantly unless the State allows them to go private, which I think is unlikely.”<br>Michigan’s situation is good. The University is in very high demand as is evidenced by the annual increase in its applicant pool and 45% yield rate despite not enjoying the benefits of Early Decision admissions. Its endowment is one of the largest and growing by a healthy margin. The alumni are very loyal. Ann Arbor is a very nice college town.<br><br>", "<b>Username: Alexandre</b><br><br>\"This is fact, not opinion, state colleges are woefully underfunded by states and not allowed to raise in-state tuition, so they increase the student body size. Doesn’t matter what any ranking says, this is a deteriorating situation.<br>Alexandre, do you deny this?\"<br>CU123, many state universities are hurting, just as many private universities are hurting. But we are not discussing public universities on this thread. This thread is about Michigan. Michigan is not hurting. Financially, Michigan is doing very well. The University’s endowment has at the fastest pace of any university in the nation between 1990 and today. In 1989, Michigan’s endowment was not even among the top 30 in the nation. Today, it is the 8th largest. In 2009, in the midst of the financial meltdown, Michigan spent $100 million to buy Pfizer’s global research HQ campus, made up of some 25 buildings and over 2 million square feet of lab space. Naturally, all universities save HYPS can use more money, and Michigan is no exception, but Michigan is very well off…as well off as Columbia.<br>To address your question, yes, I deny this. According to its CDS, Michigan’s student body in programs that enroll both undergraduate and graduate students has indeed increased from 33,481 in 2007 to 38,076 in 2016. But the size of its instructional faculty in programs that enroll both undergraduate and graduate students has also increased from 2,063 in 2007 to 2,583 in 2016. The student to faculty ratio has remained steady at 15:1. So yes, I deny it, and I have the facts to prove it.<br>http://obp.umich.edu/wp-content/uploads/pubdata/cds/cds_2007-2008_umaa.pdf  (Section I2)<br>http://obp.umich.edu/wp-content/uploads/pubdata/cds/cds_2016-2017_umaa.pdf (Section I2)<br>But tell me again, how do you justify Columbia’s shameless claim that it has a 6:1 student to faculty ratio when it omits 6,500 graduate students from its calculation? Oh, that’s right, Columbia does not publish a CDS report. In fact, it is the only Ivy League institution that doesn’t. But one thing is clear, Columbia is omitting 6,500 graduate students from its student to faculty ratio and that puts into serious question its ethical practices, as well a the integrity of the data it publishes. Columbia’s actual student to faculty ratio would likely double if it were being honest, and its ratio would be 12:1 rather than 6:1. But that would mean a drop in the rankings, so obviously, Columbia and its private peers have little incentive to be honest. And what of the very flawed rankings methodology? Do you deny that private universities are gaming the rankings and that the methodology is seriously flawed?<br><br>", "<b>Username: CU123</b><br><br>Except Michigan has ~ 45,000 students of which 28000 are undergrads, compared to 31000 at Columbia of which 6000 are undergrads.  This isn’t even close, I simply not convincing you af anything even though the facts bear it out.  There is no comparison at the undergrad level.<br><br>", "<b>Username: PengsPhils</b><br><br>U of M and Columbia are both relatively strong in CS, but most would say Michigan is better for it ever so slightly. Columbia is best in specialized theory areas at a graduate level, so for undergrad, that would make me lean more Michigan for a typical CS student.<br>This thread has gotten way too sidetracked. Michigan is the obvious choice when it’s so economically superior and arguably better in the subject being studied as a major. Michigan may not have all the qualities of an ivy, but in no way do those make up a difference of 100K or more.<br><br>", "<b>Username: Alexandre</b><br><br>“Except Michigan has ~ 45,000 students of which 28000 are undergrads, compared to 31000 at Columbia of which 6000 are undergrads. This isn’t even close, I simply not convincing you af anything even though the facts bear it out. There is no comparison at the undergrad level.”<br>The 6,000 undergraduate students (I am fairly certain it is closer to 8,000 when you include General Studies) still have to share the faculty and resources with those 23,000 graduate students. At any university, undergraduate students do not exist in a vacuum. I don’t see how there’s any difference CU123. Columbia has limited resources, and 31,000 students to look after. Your facts are not convincing at all. A university’s endowment is shared by all of its students, graduate and undergraduate, not just by the undergraduate students. Same with a university’s faculty.<br>If anything, I have provided more facts. Where are the placement figures for Columbia that show that Columbia places more graduates in Silicon Valley? I have shown how many Michigan graduates are placed in major tech firms, and I even provided comparative data from Penn. Sadly, Columbia does not publish such data. Where are the peer ratings that prove that Columbia is a far superior university to Michigan? According to the US News Peer Assessment score, Columbia’s rating hovers between 4.6 and 4.7, while Michigan’s hovers between 4.4 and 4.5. That makes them peers in the eyes of university presidents, deans of undergraduate colleges and provosts. And how do you prove that Columbia has a 6:1 student to faculty ratio when Fu has a 25:1 ratio and the 4,500 College students share their faculty with 3,500 Graduate School of the Arts and Sciences? Those are the facts I want addressed…and they are facts.<br>I am still waiting for the evidence to support your claim that Columbia is a vastly superior university to Michigan to the extent that it is insulting to you that one would even suggest that they are peer institutions.<br><br>", "<b>Username: sevmom</b><br><br>Thread title- “Ivy League full price vs. UofM instate tuition”.  For probably 95% + of the population, this is  probably a no brainer.  This is not Michigan instate  vs. need based  aid at Columbia that brings the cost down to at or near instate costs. These are both great schools .  The major tech firms recruit at both .  With a CS degree , you may not even need a graduate degree. But, if you decide that you want or need one, you might be glad to have the funds available to pay for it. If your parents are made of money though , there are no siblings to consider,  it’s a non issue. Go where you prefer. Good luck with the decision.<br><br>", "<b>Username: simba9</b><br><br><br>\"\"<br>However, sports seems to be sliding with the football team losing 12 out of the last 13 games to Ohio State and 8 out of the last 10 games to Michigan State.<br>\"\"<br><br>Ouch. Low blow.<br><br>", "<b>Username: Rintu</b><br><br>I have seen both the universities from very close quarters. The family has strong connection with both CU and Michigan. Children attended thses schools, though not CS, and are doing well. We often have similar discussions at home now that the fourth generation is entering the colleges. I will write what all of you know, but are debating based on personal preferences and bias.<br><br>In terms of placement, Michigan is pretty good. CU is equally good,could be better in programs offered in liberal science and arts.<br>The top tech companies, are not so concerned about the Ivy Tag, and will recruit the best irrespective of the brand. Just not Michigan or Berkeley, even UIUC, Georgia Tech, UT Austin are very favourite grounds of the top tech companies.<br>Many of the lead recruiters are not from Ivy League and have firsthand experience of students coming from public or non-ivy private universities.<br>It is true many parents would like to see their children attending Ivy league or top private universities over top public universities. It is based on the value that we attach to a brand that fits into overall public perception.<br>Good students excel any way and the decision of the schools they attend is also based on the cost of attendance and other preferences, be it place, sports, music, culture. My grand nephew preferred Northwestern over Columbia because he felt the Evanston campus will provide him with better college experience that the CU campus. Very personal and I don't think, we can say whether he was right or wrong.<br>Lots of statistics are being dished out. In my opinion, these things are not the core reasons for choosing the place for undergraduate education. <br><br><br>", "<b>Username: gearmom</b><br><br>@payubisoft1 Please check out the on topic Post #65 from @PengsPhils<br><br>", "<b>Username: sevmom</b><br><br>The OP hasn’t even been back since the day the thread was started. How do you make a decision in October between two schools before decisions are even  out?<br><br>", "<b>Username: CaliDad2020</b><br><br>@cu123 @Alexandre<br>Guess no one else remembers the 70s when Columbia almost closed due to student revolution, lack of interest (and danger of “Harlem…”! Lol…) Times change. And they will change again. And some more after that.<br>Go where you feel you’ll most at home (or, if you’re not sure, go to UMich - {and for sure don’t listen to the chicken littles around here, UMich is not going anywhere, certainly not in 4 years… It’s a lot of money if you don’t love Columbia/NYC, even if you just save it for your parent’s retirment.) Or as if you can use the extra money to go abroad, or do something cool.<br><br>", "<b>Username: CaliDad2020</b><br><br>@sevmom  This thread forgot about the OP (if they really existed) long ago anyway!<br><br>", "<b>Username: CaliDad2020</b><br><br>btw @CU123 @Alexandre<br>Thought this might interest, since we seem well off the rails.<br>https://www.usnews.com/education/best-colleges/articles/2017-09-28/us-news-data-explore-admissions-trends-at-the-top-public-colleges<br><br>", "<b>Username: theloniusmonk</b><br><br>As someone who’s hired and knows a lot of hiring managers in Silicon valley across companies, Michigan is regarded higher out here than Columbia, like a lot higher.  I haven’t even run across a Columbia undergrad here and at my stints in NY and Seattle, even taking into account the size of the schools.  Now the co-founder of Google and one of the co-founders of Sun having gone to UM undergrad helps with this or course.  The top five schools in terms or prestige out here for CS/engr are Stanford, MIT, Berkeley, CMU, Michigan.<br><br>", "<b>Username: CaliDad2020</b><br><br>@theloniusmonk post is why we really need to wean aspiring college students off “chasing rankings” - different schools are good for different things (and different types of kids.) especially when they are among the top 20 or 30 research institutions in the world.<br>With curriculum on-line for most school programs and things like “rate my professor” and tons other social media, kids that have a good idea of what they want to study can often plot out 50% or more of the courses they are going to take, even going so far as IDing some of the profs they’d like to study with, or alternatively IDing the profs they want to avoid (One of my kids, for instance, was really insterested in a fairly specific minor where 50% of the required courses are taught by the same prof. I made them email a bunch of current students to make sure the teacher was someone they wanted to spend 6 courses with.)<br><br>", "<b>Username: TooOld4School</b><br><br>The $180K that the OP would save by going to Michigan will fund a startup. There is no better way to learn CS.<br><br>", "<b>Username: Much2learn</b><br><br>@theloniusmonk “The top five schools in terms or prestige out here for CS/engr are Stanford, MIT, Berkeley, CMU, Michigan.”<br>What I don’t understand is that if Michigan students are being placed so well in SF, NYC and Seattle, why they report lower average salaries? It is true that Columbia does not produce detailed salary data, but Penn and Cornell do, as does Michigan, but I would assume Columbia is similar to Penn and Cornell.<br>Others have said it is cost of living that causes Michigan salaries to be lower, but that does not make sense to me because CS majors at top schools all seem to be moving to the same cities. I have no doubt that the best Michigan students can compete with anyone and can command salaries in the $110k - $150k range. However, I suspect that the average and below average Michigan students may not be so competitive and that may bring their average down. To me it appears that there is just not enough information to tell why the Michigan average is lower. Maybe you have some insight?<br>University of Pennsylvania<br>https://www.vpul.upenn.edu/careerservices/files/2016_Senior_Survey.pdf<br>Cornell University<br>https://www.cs.cornell.edu/undergrad/cscareers/placementreport<br>University of Michigan<br>http://career.engin.umich.edu/wp-content/uploads/sites/30/2017/02/annualreport1516.pdf<br><br>", "<b>Username: PengsPhils</b><br><br><br>\"\"<br>I would assume Columbia is similar to Penn and Cornell.<br>\"\"<br><br>I don’t think that’s a fair assumption. Cornell and Penn have much better CS reputation in my experience, and Penn benefits from overrepresentation in the financial sector, even within tech.<br>I think calling Michigan a top 5 school for CS is a reach, but I think it’s safely a top 15 CS school. I don’t think you can say the same about Columbia.<br>The 5th in CS reputation is hotly debated on CC - I don’t think going down this road accomplishes anything.<br><br>", "<b>Username: Alexandre</b><br><br>“I have no doubt that the best Michigan students can compete with anyone and can command salaries in the $110k - $150k range. However, I suspect that the average and below average Michigan students may not be so competitive and that may bring their average down.”<br>Much2learn, the range of Michigan students enrolled in the CoE is similar to the students enrolled at Cornell or Penn. There is no difference in the quality of the students. There may have been a slight difference in quality in the 90s and 00s, but the gap has closed entirely in recent years.<br>There are simple reasons for the small gap in starting pay.<br>First of all, Cornell’s data is for 2017, while Penn and Michigan’s reports are for 2016 graduates. That alone accounts for a 3%-4% difference in pay.<br>Second, the makeup of the students in the engineering programs. For example, at Michigan, most engineering students (over 70%) major in Aerospace, Civil, Chemical, Electrical, Industrial, Mechanical etc…Those aren’t the highest paid Engineering disciplines. At Penn, roughly 50% major in CS, CE-related majors, which pay significantly more. In this regard, Cornell, Michigan and Northwestern have a more balanced concentration of majors than Penn, which seems to lean heavily on CS/CE majors.<br>But even then, the advantage when it comes to placing graduates in companies like Apple, Google and Microsoft clearly favors Michigan, even over the likes of Cornell:<br>Michigan: 149<br>Penn: 39<br>Cornell: 38<br>Michigan is obviously twice larger than Cornell and three times larger than Penn (although Penn has roughly almost as many CS/CE majors as Michigan), but advantage in the number placed in those tippy top Tech firms clearly favors Michigan.<br>Third, while many CS majors end up in Silicon Valley, the majority, certainly over 50%, will work regionally. For example, according to Penn’s report, close to 60% of Penn graduates took jobs in the Mid Atlantic (DC to NYC) and Northeast (mostly Boston). In the case of Michigan (and Northwestern), approximately 50% work in the Midwest. The cost of living in the Midwest is significantly  lower than the cost of living in cities like DC, NYC and Boston, and the starting salaries will usually reflect the cost of living. Since 50%-60% of the graduates work and live regionally, it stands to reason that those take jobs in the most expensive region will have higher starting salaries.  That can easily account for the 15% gap between Michigan (and other Midwestern schools like Northwestern and UIUC) and East Coast universities (like Cornell and Penn).<br>Below are the average starting salaries Engineering/CS graduates:<br>Cornell: $79,000<br>Michigan: $76,000<br>Northwestern: $70,000<br>Penn: $88,000<br>https://issuu.com/nucareeradvance/docs/beyond_northwestern_handout_2016_fi<br>http://www.engineering.cornell.edu/resources/career_services/students/statistics/upload/Undergraduate-Class-of-2016.pdf<br><br>", "<b>Username: CU123</b><br><br>First of all, Cornell’s data is for 2017, while Penn and Michigan’s reports are for 2016 graduates. That alone accounts for a 3%-4% difference in pay.<br>@Alexandre Your good at making stuff up and presenting it as factual.<br>Also failing to normalize for size,  UMich has 5 times as many engineering students as Penn.  that would put Penn at nearly 200 vs 149 for UMich after a simple normalization, but I did meet a UMich grad working at the Genious Bar so Apple does hire them.<br><br>", "<b>Username: northwesty</b><br><br>Boy this thread is off the rails.<br>OP – recognize that the average college student changes majors three times while in school.  So there’s a good chance that all the fighting over  Columbia’s CS program vs UM’s CS program will be irrelevant to you.  Since you may wind up studying something completely different.<br>If price is an object, most everyone would pick UM in-state over Columbia.  If price is no object, most people would pick Columbia over UM.<br>According to you, price is no object.  So pick the school you like better – UM and CU are going to be VERY different animals in terms of your college experience.  Pick UM if you want a BIG school, close to home, great college town and rah rah football atmosphere.  Pick CU if you want smaller, away from home, and urban.<br>And ignore all the Bravo Sierra back and forth above.<br><br>", "<b>Username: Alexandre</b><br><br>\"First of all, Cornell’s data is for 2017, while Penn and Michigan’s reports are for 2016 graduates. That alone accounts for a 3%-4% difference in pay.<br>@Alexandre Your good at making stuff up and presenting it as factual.\"<br>I am merely stating a statistical reality. If you look at average starting salaries at Cornell, Michigan, Northwestern or Penn, there is an increase of 3%-4% annually. For example, the average Penn starting salary for the SEAS in 2012 was $69,000, 2013 was $72,000, 2014 was $75,000, in 2015 was $83,000 and in 2016 was $88,000. Since Cornell’s report is for 2017 graduates, while Michigan’s and Penn’s report is for 2016 graduates, the comparison isn’t entirely fair.<br>“Also failing to normalize for size, UMich has 5 times as many engineering students as Penn. that would put Penn at nearly 200 vs 149 for UMich after a simple normalization…”<br>Penn lists 68 CS majors out of the 177 who reported their placement and salaries from the SEAS at Penn, compared to 110 CS majors out of the 406 who reported their placement and salaries from the CoE  at Michigan. So it is nowhere near five times more. Like I said, Michigan’s College of Engineering (roughly 6,500 undergraduate students) is 4 times larger than Penn’s SEAS (close to 1,700 undergraduate students, so not 5 times larger), but when it comes to CS majors, Michigan and Penn have roughly the same numbers. As I stated above, Cornell, Michigan and Northwestern have a more balanced concentration of engineering majors than Penn, which seems to focus disproportionately in CS/CE.  Even if you adjust for size, Michigan places a significantly higher number of graduates as Amazon, Apple, Google, Microsoft than Penn.<br>“…but I did meet a UMich grad working at the Genious Bar so Apple does hire them.”<br>Hehe! You got it there!  I did go to Genius Bar a couple of times, but I never had the presence of mind to ask the service reps for their resumes! <br><br>", "<b>Username: Much2learn</b><br><br>“at Michigan, most engineering students (over 70%) major in Aerospace, Civil, Chemical, Electrical, Industrial, Mechanical etc…Those aren’t the highest paid Engineering disciplines. At Penn, roughly 50% major in CS, CE-related majors, which pay significantly more. In this regard, Cornell, Michigan and Northwestern have a more balanced concentration of majors than Penn, which seems to lean heavily on CS/CE majors.”<br>I agree that the mix of majors is an issue. I was only looking at Computer Science.<br>For a ME, EE, ChemE, choosing Michigan over an Ivy if it is cheaper seems to be more clear cut for most students. The pay range is much smaller for these majors and the related jobs.<br>“But even then, the advantage when it comes to placing graduates in companies like Apple, Google and Microsoft clearly favors Michigan, even over the likes of Cornell”<br>These 4 companies seem to be the focus of Michigan graduates. I think a lot of grads at Ivies have those options too, but may simply decide that other offers are better for them. Those 4 are not necessarily superior to other options: Facebook, AirBnB, Lyft, Bloomberg, Jane Street, D. E. Shaw, Drop Box, Palantir, etc.<br>I think the better job depends on many factors: the specific duties, compensation, location, etc.<br>“In the case of Michigan (and Northwestern), approximately 50% work in the Midwest. The cost of living in the Midwest is significantly lower than the cost of living in cities like DC, NYC and Boston, and the starting salaries will usually reflect the cost of living.”<br>I don’t understand this. I don’t think that many top CS jobs exist in the midwest that would be comparable to SF, NYC, Seattle, or Boston. There are probably a reasonable number of comparable positions in Chicago, and I am sure there are a few startups in Ann Arbor, but if a large number of CS students are staying in Michigan, then I would think that suggests that they are not getting similar positions.<br><br>", "<b>Username: hannuhylu</b><br><br>Following rankings like they are definitive is hillarious some of you geesh lol.<br>Again total rip off to pay that upcharge for UG as others have said in many circles it is not even the better program.<br><br>", "<b>Username: prezbucky</b><br><br>Michigan is underrated by USNews for undergrad. In terms of academic strength across the board, Michigan might trail only Berkeley among public schools. Might. And they’re probably better than the rest.<br>Realizing that grad school rankings are not a proxy for undergrad quality – but if the grad program is strong, chances are the undergrad version is at least pretty good – Michigan is top-20 in almost everything and top-10 in most things. UCLA and UVA (especially UVA) can’t say that.<br>Columbia is a totally different environment and a great school, but if it is better than Michigan, it isn’t six-figures better.<br><br>", "<b>Username: theloniusmonk</b><br><br>Others have said it is cost of living that causes Michigan salaries to be lower, but that does not make sense to me because CS majors at top schools all seem to be moving to the same cities. I have no doubt that the best Michigan students can compete with anyone and can command salaries in the $110k - $150k range. However, I suspect that the average and below average Michigan students may not be so competitive and that may bring their average down. To me it appears that there is just not enough information to tell why the Michigan average is lower. Maybe you have some insight?<br>I didn’t see a huge difference in CS (90K for UM, 100K for Penn?) which is the major we’re discussing.  So lot will depend on the respondents as well, Cornell only had 114 respondents (119 responded but five didn’t answer a lot of the questions it looked like) so that’s not a huge response rate.  Maybe those that didn’t have great salaries decided not to report.  Also you’re assuming that everyone is honest in these things.<br>Second, you have stock options that will lower the starting salary in companies, esp in tech.  Grads will take a lower salary if it means 500 Google stock vesting over 4 years.  Also Google I believe sets salary on how well you do in your interview, so once you get an interview, if you’re a SJSU grad (and there are a lot of those at Google and Apple), you can do better wrt compensation than an ivy leaguer if you have a superb interview.<br>And you’re comparing Michigan to Cornell and Penn, who have better engineering and comp sci programs than Columbia.  That’s not as straightforward a comparison as UM and Columbia, where UM has the clear edge.  Cornell and Penn have the two best engr/cs programs in the ivies and would be in the second set of schools I mentioned.  I have actually met grads from those schools out here :-).<br><br>", "<b>Username: Alexandre</b><br><br>These 4 companies seem to be the focus of Michigan graduates. I think a lot of grads at Ivies have those options too, but may simply decide that other offers are better for them. Those 4 are not necessarily superior to other options: Facebook, AirBnB, Lyft, Bloomberg, Jane Street, D. E. Shaw, Drop Box, Palantir, etc.<br>I think the better job depends on many factors: the specific duties, compensation, location, etc.\"<br>Much2learn, I agree that other companies may offer more appealing alternatives, although I am not sure that those companies are hiring any fewer Michigan graduates vis-a-vis graduates from other top universities. For example, Michigan grads still do better with some of those secondary companies you mentioned, including Facebook, which hired more Michigan grads (12) than Cornell (fewer than 5) and Penn (2).<br>Location, as you point our, plays a major role here. That is why many graduates end up working in their respective regions. It is difficult for many graduates from schools like Michigan and Northwestern to accept jobs on the West Coast or East Cost because that would mean going far from home. Many would rather take good jobs locally, or regionally.<br>That being said, I do not think the pay gap is sufficient to make any assumptions or draw any conclusions. The Michigan average starting pay for a CS major is $94,000, vs $101,000 for a Penn CS major. That $7k gap could well be explained by a variety of reasons/factors, including regional pay differences and relative differences in variable pay (stock options etc…).<br><br>", "<b>Username: theloniusmonk</b><br><br>One more thing that sets salaries, how well you can negotiate, I wish I had known that when I just got out of school.  Typically grads just of of school don’t negotiate as they either don’t think that it’s an option or they don’t want to get on a bad footing with the company.  But as you go on, what you earn is dependent on how well you can negotiate.<br><br>", "<b>Username: jym626</b><br><br>Haven’t read since this was first asked on pg one, but why is this an issue until the admission results are out…<br><br>", "<b>Username: Much2learn</b><br><br>@theloniousmonk “And you’re comparing Michigan to Cornell and Penn, who have better engineering and comp sci programs than Columbia. That’s not as straightforward a comparison as UM and Columbia, where UM has the clear edge. Cornell and Penn have the two best engr/cs programs in the ivies and would be in the second set of schools I mentioned. I have actually met grads from those schools out here.”<br>I agree that Columbia may not be comparable to Cornell and Penn. I thought that was a reasonable comparison, but that makes sense.<br>@theloniusmonk “Second, you have stock options that will lower the starting salary in companies, esp in tech. Grads will take a lower salary if it means 500 Google stock vesting over 4 years.”<br>That is definitely true. This year is the first time I have seen a 21 year old undergrad with a CS offer of $100k+ salary and another $100k+ in onboarding (signing bonus + relocation + stock/options). The talented CS kids seem to be really cleaning up this year. Are you seeing that more broadly?<br><br>", "<b>Username: northwesty</b><br><br>“Columbia is a totally different environment and a great school, but if it is better than Michigan, it isn’t six-figures better.”<br>OMG.  Price is NOT an object for this kid!!<br>FYI, the Parchment cross-admit data (imperfect data but still data) says that Columbia thrashes UM on cross-admits 73% to 27%.  That’s made even more impressive when you consider that some portion of those UM admits would be in-staters getting a deep discount on COA.<br>“Michigan is top-20 in almost everything and top-10 in most things. UCLA and UVA (especially UVA) can’t say that.”<br>Don’t you be messing with Mr. Jefferson’s U.  Parchment says the kids like UVA (#23 ranked by student choices) more than UM (#26).   And UM undergrad hasn’t beaten UVA in USNWR in like 25 years.  Wa-hoo-wa!!!<br><br>", "<b>Username: saillakeerie</b><br><br><br>\"\"<br>OMG. Price is NOT an object for this kid!!<br>\"\"<br><br>Not sure what you are talking about here.  OP asked the very question of whether Columbia is worth the additional $180k.  Price is clearly an object.  Even if the funds are there.<br><br>", "<b>Username: theloniusmonk</b><br><br>“Don’t you be messing with Mr. Jefferson’s U. Parchment says the kids like UVA (#23 ranked by student choices) more than UM (#26). And UM undergrad hasn’t beaten UVA in USNWR in like 25 years. Wa-hoo-wa!!!”<br>You need to maybe stop with parchment and usnews (and other) rankings and maybe give better advice than look at the rankings for your decision.  In this case that would be a disservice, a serious one,  A CS major will be a fish out of water at Columbia but will be right at home at Michigan, access to labs, research, a technology culture that’s not reflected in rankings.<br><br>", "<b>Username: jym626</b><br><br>Has anyone noticed that the OP was a new poster, who started this one thread/one post 4 days ago and hasn’t returned?<br><br>", "<b>Username: PengsPhils</b><br><br>@jym626<br>Forget the OP, this is serious. Someone is wrong on college confidential! (Some poster had a great profile picture adapted from XKCD about this and I’m sad it’s no longer present)<br><br>", "<b>Username: jym626</b><br><br>It’s a tragedy…  <br><br>", "<b>Username: payubisoft1</b><br><br>Thank you for the comments everyone! NYC definitely has that extra appeal to me but the money of course is a huge drawback. I know that Michigan has the slightly higher CS rating, but I feel like there would be more opportunities in NYC? And there also is the possibility that I may change the CS major at some point. I am not a socially awkward person (like many CS people are stereotyped as) and I could see myself going more into the business/ management side.<br>Do most CS majors end up in grad school/ is that the smart move?<br><br>", "<b>Username: jym626</b><br><br>People who are “not socially awkward” don’t usually go around insulting CS majors. Just sayin’…<br><br>", "<b>Username: Much2learn</b><br><br>Many CS majors do end up in grad school, but most of them work for a few years first. Also, there is not usually a large premium for a MSE on top of a BSE, but you may learn some valuable things. MBA is possible too but there are a lot of them right now, so getting into a top program is important.<br><br>", "<b>Username: payubisoft1</b><br><br>Definitely not trying to insult at all!! I know many people who are going into CS who are the most outgoing people I have ever met and I know that there is a very social aspect with it. However I personally have found the stereotype to be associated with it, and I have been told that people can’t see me in CS bc “I am more outgoing person” (which I definitely don’t agree with). I personally could see myself in any CS job but also going a more business/ management path with it. My point is that is something that I am considering looking more into.<br><br>", "<b>Username: Alexandre</b><br><br>“I personally could see myself in any CS job but also going a more business/ management path with it. My point is that is something that I am considering looking more into.”<br>Management is a career track. It depends on your performance at work over time, not on the college you attended. Engineering/CS majors from both universities are recruited into a variety of jobs, not all of them technical. Many go straight into consulting or banking. As for switching majors, you may do so at both Columbia  and Michigan, and still go on to have an excellent education regardless since both universities are excellent across virtually all disciplines.<br><br>", "<b>Username: PengsPhils</b><br><br>@payubisoft1<br><br>\"\"<br>I know that Michigan has the slightly higher CS rating, but I feel like there would be more opportunities in NYC?<br>\"\"<br><br>You will be able to get a job in any city after graduation with a degree from either, and recruiters from all the big companies will be on campus. I would say Michigan offers more opportunities.<br><br>\"\"<br>Do most CS majors end up in grad school/ is that the smart move?<br>\"\"<br><br>Most CS majors do not go to grad school at all unless they are planning to go into research or academia. If you plan to work in the software/business world, you will only need a bachelors degree.<br><br>", "<b>Username: SincererLove</b><br><br>Michigan has good business school too.<br>D had interviews with an ivy league alumni, who told her that there was a research showing that for people who got accepted to both U Penn, and Penn State, years later, they were roughly at the same spots in their careers.<br>I quoted an excerpt of her essay on college decision…hope that helps someone.<br>\"First and foremost, please remember that college is not the end destination; college is not where you should be peaking. No matter what college you choose, more times than not, your happiness and success at a college is a result of self-determination. A result of you, standing up and resolving, “I will be happy and successful.”<br>Perhaps, most importantly, remember that college is a personal decision, a decision that can’t be decided by your parents, friends, or for that matter, absolute strangers that think they know your best interest. It’s you that’s going to college – not your Aunt Sally or your mom. It’s you, and you better be invested in your own education.\"<br>Best of luck!!<br><br>", "<b>Username: austinmshauri</b><br><br>Have you applied to either of these colleges yet? If not, you really don’t have a choice to make unless you’re deciding whether or not to apply early (action/decision) to one.<br>You haven’t posted your stats so I don’t know how competitive you are for admission, but even if you’re competitive I hope you plan to apply to more than an Ivy League university and one backup. What other colleges are you considering?<br><br>", "<b>Username: i012575</b><br><br>OP, there is very little advantage, if any, in going to an Ivy league school for CS for undergrad. I work for a VC firm in the Bay area and am very familiar with the target hiring at some of the best start-ups and established firms.<br>PayPal Mafia<br>https://en.wikipedia.org/wiki/PayPal_Mafia<br>“PayPal Mafia” is a term used to indicate a group of former PayPal employees and founders who have since founded and developed additional technology companies[1] such as Tesla Motors, LinkedIn, Palantir Technologies, SpaceX, YouTube, Yelp, and Yammer.[2] Most of the members attended Stanford University or University of Illinois at Urbana–Champaign at some point in their studies. Five members, Peter Thiel, Elon Musk, Reid Hoffman, Luke Nosek and Ken Howery have become billionaires.<br>Even at one of my well-known competition (KPCB) - not strictly CS related - check out where most of them did their undergrad for CS or Eng.<br>http://www.kpcb.com/teams<br>Similarly, if you “google” the profile of the Google Fellows, most of these high flyers did not attend an Ivy for undergrad. In fact, the most famous of them, Jeff Dean ((after Brin (UMD) and Page (UMich) of course)), attended UMinn for undergrad and UDub for his PhD.<br>What the above examples have in common is that these guys/gals attended some of the toughest CS/Eng schools, whether be it is the US or abroad (my alma mater IIT as an example) and did well there.<br><br>", "<b>Username: jym626</b><br><br>https://qz.com/967985/silicon-valley-companies-like-apple-aapl-hires-the-most-alumni-of-these-10-universities-and-none-of-them-are-in-the-ivy-league/<br>https://www.timeshighereducation.com/student/news/which-colleges-do-facebook-google-and-other-top-employers-recruit<br><br>", "<b>Username: intparent</b><br><br>The OP doesn’t actually have a choice yet, unless maybe they are a recruited athlete.<br><br>", "<b>Username: jym626</b><br><br>Exactly, @intparent. This is pure conjecture and putting the cart before the horse. Acceptances first, decisions second.  And as @austinmshauri mentioned, we have no information on the applicants’ stats. So this is all candy canes and unicorns at this point. There is no decision to be made until acceptances  are complete and FA packages can be reviewed.  Perhaps the OP meant to say, in the OP “I hope to have to choose between…”<br><br>", "<b>Username: northwesty</b><br><br>This thread is getting silly.<br>Do you all think the OP should attend San Jose State over MIT?  Since SV hires more people from SJS?  Meg Whitman, Jeff Bezos, Sheryl Sandberg, Mark Zuckerberg, Bill Gates attended schools in what athletic conference?<br>If getting a job in SV was the only factor involved, this kid should be applying to a school in CA.  But college is about more than a major and a post-grad job.  Go where you can get in, where your parents can pay for, and where you will be happy and successful.<br>Kid should go where they are most interested/excited to go.  Which clearly seems to be Columbia in this case based on what this kid is saying.  Since this kid probably does not have expensive grad school in the cards, there’s no money advantage to saving the 529 by going to UM.  The data says 75% of cross-admitted kids would make that same choice.<br>Apply ED to Columbia and EA to UM as a back up.  Good luck.<br><br>", "<b>Username: sevmom</b><br><br>“The data says 75% of cross admitted kids would make the same choice.”  Parchment doesn’t seem that reliable in this kind of comparison. A Michigan kid that bothers to apply to both Michigan and Columbia, probably would be more likely to pick Columbia.  They made the effort to apply OOS to an Ivy  even though they have a highly ranked instate choice,  may want to get out of Michigan, think Columbia will gain them more prestige,etc.  But many high stats Michigan kids will not even bother to apply to a school like Columbia. For instate kids, the more interesting comparison would be Michigan vs. MSU. If accepted to both, many more will pick Michigan than MSU.<br><br>", "<b>Username: intparent</b><br><br>@northwesty Well, I think the OP should attend Harvey Mudd instead of either of the other two (and I’m a Michigan grad who works in tech). <br><br>", "<b>Username: jym626</b><br><br>Yes, @northwesty, this is a silly thread. The OP asked about a choice that doesn’t seem to exist yet, and IIRC, cc isn’t really a place for “hypotheticals”.  As far as job placement in SV, I’ve been told by an employee of one of the big employers there that the large majority of offers of employment  for new hires out of college are made to their interns, so the OP should be looking at which schools have a better track record for placing interns in the tech companies (if that is a desired goal).  And as for the examples of people like Gates and Zuckerberg, mentioning dropouts seems off the point.<br><br>", "<b>Username: sevmom</b><br><br>Harvey Mudd’s a great school (girlfriend of one of my son’s is a CS grad from there)  but seems so different than either Michigan or Columbia.  The OP has provided so little information, that is not even possible to make suggestions in terms of what schools could be a financial, social,  and academic fit.<br>Other son does some recruiting for one of the tech firms mentioned here a few times (he is there to talk about the technical side of things and working for the company). Most of his time is spent on technical projects, the campus visits are just an extra thing he’s been asked to become involved with.  He just went to Michigan last month. He has also been to Yale, Penn, and Georgia Tech in the last year. Michigan is certainly not going to hold the OP back in any way.<br><br>", "<b>Username: jym626</b><br><br>These kinds of threads are predictably similar. Someone asks “should I spend a gazillion $$ for an elite or very little for a flagship”. This leads to the  “NO WAY- save your $$” and “if your parents can afford it without blinking an eye, do what you want” posts,  the “”what are your stats? We don’t have enough information to be helpful” posts, then followed by the fans of each of the schools throwing statistics at each other to support their school.  Then the thread derails and gets closed. Wash, rinse, repeat.<br><br>", "<b>Username: saillakeerie</b><br><br>So true.  There are a number of repetitive/predictable threads here.  Read threads here long enough and you can predict who posted what even if you block the names/icons.<br><br>", "<b>Username: jym626</b><br><br>^ So, true @saillakeerie - and you have only been on cc for a year and a half???<br><br>", "<b>Username: saillakeerie</b><br><br>I lurked here for a while before posting.  Though a lot of the patterns aren’t difficult to discern.<br><br>", "<b>Username: sevmom</b><br><br>Yes, “silly thread” but people are still participating! I wondered in post 70 why we had not heard back from the OP , and @jym626  seemed to be pointing out a similar issue still in post 94 . But , we are all  still here many posts later, still chiming in.   Most families  are going to do what they’re going to do, regardless of what anyone here says.  Although , sometimes there is useful advice and  good tips!<br><br>", "<b>Username: jym626</b><br><br>LOL, @sevmom. Its the same old song… but with a different verse. Oh great… now I have the  Four Tops song as an earworm   https://www.youtube.com/watch?v=uS2nWLz-AbE<br><br>", "<b>Username: CU123</b><br><br>The OP will be a senior member in no time based on this thread alone.  So to continue his climb, 75% choose Colombia over UMich and the 25% that do go to UMich, it’s due to the cost.<br><br>", "<b>Username: jym626</b><br><br>Huh? Changing levels of “membership” have to do with the posters post number not the thread count number<br><br>", "<b>Username: CU123</b><br><br>Didn’t know you would take it seriously. ;))<br><br>", "<b>Username: jym626</b><br><br>Sure  looks like a misunderstanding of the process here… But the misspelling/confusion of the College for the country (Columbia/Colombia) should have been a tip. Unless the OP wants to REALLY go out of state :D/<br><br>", "<b>Username: CU123</b><br><br>Oh no, I guess I don’t know what the process here is for climbing the forum ladder.<br><br>", "<b>Username: theloniusmonk</b><br><br>@Much2learn “That is definitely true. This year is the first time I have seen a 21 year old undergrad with a CS offer of $100k+ salary and another $100k+ in onboarding (signing bonus + relocation + stock/options). The talented CS kids seem to be really cleaning up this year. Are you seeing that more broadly?”<br>I can’t really speak for companies outside of bay area, stocks are used as a differentiator out here and also to help these young kids get some money for housing :-).  So it’s tough to say whether Google uses stocks outside the bay area where they don’t run into other companies offering stock as a key part of their compensation.<br><br>", "<b>Username: Hunt</b><br><br>This kind of thread comes up often, and the points made are more or less the same. My point is this: a school like Columbia is a luxury, and an expensive one if you have to pay full price. It provides some benefits Michigan doesn’t, the chief of which (in my opinion) is a set of more academically accomplished peers (compare the two on https://bigfuture.collegeboard.org/compare-colleges) to see the difference here. That is a factor that matters a lot to some people, and much less to others. The difference is not all that great when we’re talking about Michigan, which is a top public, and perhaps even less if a student is definitely interested in CS (or engineering). The decision is actually not a “no-brainer” for a thoughtful person. But it does boil down to how much you’re willing and able to spend for a luxury item.<br><br>", "<b>Username: theloniusmonk</b><br><br>Do you all think the OP should attend San Jose State over MIT? Since SV hires more people from SJS? Meg Whitman, Jeff Bezos, Sheryl Sandberg, Mark Zuckerberg, Bill Gates attended schools in what athletic conference?<br>None of them wen to Columbia, they want to Harvard and Princeton, which is a different discussion.  For UM vs Columbia for Computer Science, Michigan is better all around in terms of prestige, campus feel, cutting edge research etc…  Harvard vs Michigan or Princeton for CS is different, I’ll grant that.<br><br>", "<b>Username: Alexandre</b><br><br>“It provides some benefits Michigan doesn’t, the chief of which (in my opinion) is a set of more academically accomplished peers”<br>Hunt, it should be noted that Michigan differs significantly from Columbia in that a significant portion of its student body (20%) are pursuing non-traditional tracks, such as architecture, performance arts (music, student dance etc…), nursing, kinesiology, etc…not to mention Division I athletes. Students enrolled in the same programs as those offered at Columbia will likely not be noticeably less “accomplished” at Michigan, whether it is students enrolled in the CoE, or those majoring in Business, Chemistry, Computer Science, Mathematics etc…<br><br>", "<b>Username: northwesty</b><br><br>“The decision is actually not a “no-brainer” for a thoughtful person. But it does boil down to how much you’re willing and able to spend for a luxury item.”<br>Hunt nails it.  The kid expresses a clear preference for the Columbia “experience” over the nearby State U “experience” (even though the State U here is one of the best state Us there is).  6,000 undergrads in NYC and 29,000 undergrads in Ann Arbor are very different propositions obviously.  Seems like this kid likes strawberry more than chocolate, which is fine.<br>Unless there’s a clear need to preserve cash for grad school (doesn’t seem to be), the family can afford to pay full price.  So this very lucky kid should go to where this kid wants to go.  Which is probably Columbia.<br><br>", "<b>Username: PengsPhils</b><br><br>@northwesty<br><br>\"\"<br>Unless there’s a clear need to preserve cash for grad school (doesn’t seem to be), the family can afford to pay full price. So this very lucky kid should go to where this kid wants to go. Which is probably Columbia.<br>\"\"<br><br>It’s nowhere near that simple. The strength of preference is an important consideration, as is where the 180K goes if they do not spend it. If I as the student got to keep that 180K for post-grad to invest or buy a house or a car or get ahead in various ways financially, Columbia is in no way worth it. If that 180K means my parents can retire two or three years earlier, that’s a consideration as well. It’s a conversation to have with them.<br><br>\"\"<br>The kid expresses a clear preference for the Columbia “experience” over the nearby State U “experience” (even though the State U here is one of the best state Us there is).<br>\"\"<br><br>I’m not sure where you’re getting this strong strength of preference which you have been using as part of your argument all thread. The quotes below are the only mentions of preference in the thread by the OP:<br><br>\"\"<br>I prefer Columbia but I’m not sure it’s worth the additional $180,000.<br>\"\"<br><br><br>\"\"<br>NYC definitely has that extra appeal to me but the money of course is a huge drawback.<br>\"\"<br><br>Not to mention that the OP originally mentions going to grad school.<br>You also keep insisting price is not important when the OP explicitly states that it is a factor for them.<br><br>All of this also ignores the possibility that Michigan for CS could be the better choice in a vacuum for some students, possibly this one, given the additional information in this thread (unfortunately buried in tangents).<br><br>Hunt’s analysis does indeed lay it out well. While very helpful, it doesn’t answer the question for this specific case.<br><br>", "<b>Username: moooop</b><br><br>The question isn’t whether a Columbia education is worth a ton of money, it’s whether the small trace of superiority that some claim Columbia holds over Michigan is worth $180,000. Unless the OP is filthy filthy rich, that’s almost the definition of a no brainer.<br><br>", "<b>Username: citymama9</b><br><br>If class size matters, Columbia would have smaller classes, but is that worth all that money?<br><br>", "<b>Username: theloniusmonk</b><br><br>“Do you all think the OP should attend San Jose State over MIT?”<br>I don’t think anyone said that or even hinted it.  What it shows is that in Silicon Valley prestige of where you attended undergrad is not as important as in the northeast.  In order to get promoted you have to get stuff done and be able to work well with other people, typically not in brand conscious industries like consulting and finance.  You have get stuff done too but you can be pretty cut throat about it.<br><br>", "<b>Username: alphengheinst</b><br><br>Michigan! especially since columbia is among the most expensive schools of the usa, and Michigan is a school many people would die to go to<br><br>", "<b>Username: i012575</b><br><br>Interesting but UMich is not showing up in the latest Times CS rankings. Oversight ?!? Columbia is #19.<br>https://www.timeshighereducation.com/world-university-rankings/2018/subject-ranking/computer-science#!/page/0/length/100/sort_by/rank/sort_order/asc/cols/stats<br>UMich does appear in the Eng rankings!<br>https://www.timeshighereducation.com/world-university-rankings/2018/subject-ranking/engineering-and-IT#!/page/0/length/100/sort_by/rank/sort_order/asc/cols/stats<br><br>", "<b>Username: simba9</b><br><br>I’m not seeing UC Berkeley or UCLA in the latest Times CS rankings.<br><br>", "<b>Username: Alexandre</b><br><br>The Times is a British ranking. They don’t really know much about US universities. Not ranking Cal in the top 5 (let along the top 30) is an egregious oversight that casts serious doubt on the credibility of the CS ranking. Michigan and UCLA’s absence from the top 30 is less damning, but still pretty telling. UIUC should be ranked slightly higher, and Brown should be ranked higher too.<br>The fact that Cal, Michigan and UCLA were not at ranked at all suggests that they were inadvertently left out.<br>The Engineering ranking is more consistent, although again way too British-heavy. Oxford ranked higher than MIT in Engineering?! In what world?<br><br>", "<b>Username: jym626</b><br><br>Read up on Tony Fadell,  a U Michigan engineering grad https://www.wired.com/story/tony-fadell-revenge-on-silicon-valley-from-paris/amp<br><br>", "<b>Username: Alexandre</b><br><br>This article also references NiKlas Zennstrom (the founder of Skype), another Michigan man. <br><br>", "<b>Username: theloniusmonk</b><br><br>“I’m not seeing UC Berkeley or UCLA in the latest Times CS rankings.”<br>I’m wondering if that’s because they also have EECS or EECE programs in addition to CS in their Arts and Science college, and the ranking decided to rate the engineering/cs and not pure CS if you will.  Otherwise it does’t make sense not to have those three schools.<br><br>"]}