{"title": "amherst vs harvey mudd engineering vs medicine", "comments": ["<b>Username: CCThunderfin</b><br><br>Hey everyone,<br>I’m a Canadian student who just graduated from a NE boarding school this past spring.  I’m currently taking a gap year and will be applying to college in a month’s time.<br>I’m a competitive swimmer and I’m being recruited to Amherst College & Harvey Mudd College.  I haven’t decided yet what I’d like to focus on in college, though I’ve narrowed it down to either medicine or engineering.<br>I know these two LACs are pretty different, so I’d appreciate opinions on where I should apply ED.<br>Amherst: I’m especially attracted to the Open Curriculum and research opportunities in the Consortium.  Given my experience at my high school, I think I’d enjoy the social scene a bit more, too.  I talked to the swim coach and he offered to support my application (he said that in his time at Amherst, only one student who’s had his support & applied ED hasn’t been admitted… basically if I decide to apply ED, I should be accepted).  If I go to Amherst, I’d start on a premed track with med school admission the ultimate goal.<br>Harvey Mudd: my parents and I feel that having an engineering degree from here is valuable, and it’s nice that I’ll be able to start working right after undergrad rather than having to go to grad school.  I’m also interested in Mudd’s Clinic Program, the Claremont Consortium and the supposedly collaborative environment.  I’m still waiting to hear back from my pre read, but I had the coach’s support last year when I considered applying ED, so I’m assuming I’ll have his support again this year, should I apply ED.<br>Does anyone have advice for me, given that I’m still unsure of what career I’d like to have?  I’ve always been attracted to medicine, but I know the road’s long and expensive.  STEM was my strong suit in high school, but I don’t know if I’ll be able to handle the rigorous engineering program at Mudd.  Any other things I should consider, apart from cost (Amherst will likely be a bit cheaper, but I think a Harvey Mudd degree will “pay back” quicker, so my parents aren’t too concerned with the tuition fees)?<br>Thanks in advance!<br><br>", "<b>Username: intparent</b><br><br>If you think you want to go to med school, I’d skip Mudd.  Being an athlete on top of the need for a very high GPA is almost impossible there.  My kid just graduated from there.  She mostly loved it, but the workload is grueling, and they don’t really have grade inflation.<br><br>", "<b>Username: simba9</b><br><br>Why is swimming an issue if you’re not getting an athletic scholarship?<br>I agree that if you’re interested in med school, forget about engineering at Mudd. But if you’re more interested in engineering than medicine, it’s hard to beat Mudd.<br><br>", "<b>Username: Corbett</b><br><br>Amherst is great for pre-med, but maybe not so good for engineering. The only way to get an engineering degree at Amherst would be through a 5-year program, where you spend years 3 and 5 at Dartmouth. Such programs are commonly offered by liberal arts colleges, but rarely utilized in practice;. Amherst says that only one or two students per class go that route.<br>http://www3.amherst.edu/~waloinaz/engineering.html<br>HMC is great for engineering, but maybe not so good for pre-med. HMC does offer common pre-med majors, like biology and chemistry, although they are less popular than engineering. However, it may be difficult to maintain a high GPA at Mudd, as noted above, especially if you also want to swim competitively:<br><br>\"\"<br>Prospective pre-medical students considering Harvey Mudd should realize that the College’s technical requirements are considerably more demanding than in typical pre-med programs<br>\"\"<br><br>https://www.hmc.edu/biology/programs-and-courses/pre-med-preparation/<br>So while both paths are theoretically possible at both institutions, you should assume that Amherst sends far more students to med school than into engineering, while HMC sends far more students into engineering than to med school. So in practice, these two schools may not be the best choices if you are truly undecided and want to keep both options open.<br>There are few LACs that are good for both pre-med and engineering. Swarthmore would be an obvious pick, or Smith if you are female. If you can swim competitivelly at a low Division I level, then Bucknell or Lafayette. If you want to stick to Division III, then maybe consider small DIII universities, like Tufts or Rochester, as well as LACs.<br><br>", "<b>Username: intparent</b><br><br><br>\"\"<br>Why is swimming an issue if you’re not getting an athletic scholarship?<br>\"\"<br><br>Lots of students want to continue their sport in college, and compete at the DIII level because it is something they love and are good at.  I think it is perfectly legitimate to want to swim in college.  BUT… I do agree that having it as a driver for where to apply is maybe short sighted.  As @Corbett says, neither is ideal for what the OP wants.  Honestly, I suspect it would be grueling to keep the needed GPA for med school at Amherst as well (not quite as much as Mudd, but still super challenging – not much time for anything but sport and studying).  I also think Swarthmore is a risky choice – again, VERY difficult academically (my kid picked Mudd over Swat, but liked both because she wanted the highest level of academic intensity she could find).  I wouldn’t pick a top 5 LAC in general to do a sport and pre-med – stiff competition for the grades you need there.<br><br>", "<b>Username: ucbalumnus</b><br><br>Harvey Mudd has a core curriculum that covers many of the pre-med course requirements; the remaining ones can be taken as electives, regardless of major.  However, the academic intensity is high (regardless of major), and the large core curriculum (including HSA requirements) means that cherry picking courses that you are most likely to get A grades in is more difficult.<br>In contrast, Amherst has no general education requirements, which means that you can cherry pick courses that you are most likely to get A grades in to boost your GPA for pre-med purposes.  But there is no native engineering degree program.<br>You can do pre-med as an engineering major at many schools, but the high volume of non-overlapping requirements for most types of engineering and pre-med course requirements can make it difficult to fit all of the course work into four academic years of normal course loads.  Adding intercollegiate athletic workload makes that even more difficult.<br><br>", "<b>Username: Much2learn</b><br><br>@ccthunderfin<br>You might wish to consider a small D1 schools that would offer both and provide flexibility like Lehigh or Lafayette. They are very challenging academically, but just a bit less intense than the most difficult schools. There is real value to attending a school where you can change your mind later, should you decide to switch, or even do both.<br>Also, a bio engineering major would not need many added courses to meet the pre-med requirements.<br><br>", "<b>Username: Corbett</b><br><br>If you are torn between medicine and engineering, then biomedical engineering seems like a possible fit. You could start in a BioE program to see how it goes. If you liked the engineering part more, you could stay in BioE, or you could switch to a more traditional engineering discipline. If you liked the biomedical part more, you could switch to a traditional pre-medical program.<br>You would find both biomedical engineering and DIII swimming at at smaller universities like Tufts, Rochester, Case Western, RPI, or WPI. Bucknell would be a LAC option, but they have DI swimming. Tufts competes in NESCAC, the same DIII league as Amherst.<br><br>", "<b>Username: juillet</b><br><br>Well, just based on your post here, it sounds like you actually like specific features of Amherst. The only things that seem to attract you to HMC are the fact that you can have an engineering degree and the Claremont Consortium - but Amherst is in the Five College Consortium.<br>You can also start working right after undergrad from Amherst - you don’t need a graduate degree just because you don’t go into engineering. Most college students do start working right after college, especially from a college like Amherst.<br><br>", "<b>Username: ThankYouforHelp</b><br><br>Reading your post, I don’t see any indication that you WANT to be an engineer.   If you actually do, then don’t go to Amherst.  It’s a fantastic school for everything that it offers, and opens doors to graduate schools, professional schools, Wall Street, and other careers at the level of the Ivies, but it does not offer engineering.  If you want to be an engineer, go to Mudd.<br>You need to make that decision first.  The rest will fall into place.<br><br>", "<b>Username: SwimDad99</b><br><br>@intparent One of the key reasons to pursue swimming at Amherst and HM is because it’s the coaches who will get him admitted. Otherwise both schools are a reach for just about anyone. Of course, once he’s admmitted and given the swimming thing a fair effort (say, for one year) he could quit.<br>I would just advise the OP that a promise of support from Coach Nichols at Amherst is worth a heck of a lot more than a promise of support at HM. As you point out, Nichols gets his guys admitted. HM and the other Claremont McKenna colleges have a reputation for over-promising to prospective athletes on occasion — the process of athletic support has been in place much longer and is more established in the NESCAC. And, of the five schools in the consortium, Harvey Mudd is the one LEAST interested in sports and in supporting athletes at admission. If you were truly driven to study Engineering, then I’d encourage you to assume a bit more risk and apply ED to Harvey Mudd. But given your ambivalence, I think you have to factor in the difference in coach support between the two schools (and more generally between the NESCACs and the five colleges of the consortium) and go with the bird-in-the-hand, Amherst. I’d hate to see you lose the nearly certain ED admission at Amherst and then fail to secure admission at HM. After the ED round, you’d be SOL at Amherst. Coach support in the NESCAC works only in the ED round.<br>If you do decide to apply ED at HM, I’d encourage you to line up support for EDII. Middlebury could help you there. And you’d really like Coach Rueppel.<br>Good luck!<br>p.s. You might also grow your short list to include Pomona, CMC, Williams, and Swarthmore.<br><br>", "<b>Username: artloversplus</b><br><br>What is your safety? None of the schools discussed here are safety schools, not even matches, other than you are a recruited athletes. As a premed, you should not go to a school if your stats are not at least top 25% of the entering class. To me, you should work on some  thing much lower to survive the premed weed out. Perhaps some thing like your IS public, they should have swimming as recruits.<br><br>", "<b>Username: intparent</b><br><br>Getting into a college where your admission is questionable to start with, and adding the pressure of athletics in top of that is not a recipe for getting the necessary grades for me school.  Although international student admissions to med school in the US are a whole different kettle of fish that someone else may be able to speak to.<br><br>", "<b>Username: SwimDad99</b><br><br>“Getting into a college where your admission is questionable to start with, and adding the pressure of athletics in top of that is not a recipe for getting the necessary grades for me school.”<br>I’m surprised that an experienced CC poster would make that statement in reference to top LACs, @intparent. Admission to Amherst or HM is “questionable” for virtually everyone. The admission rates at those schools are in the mid-to-low teens, and even extraordinarily well prepared students are rejected by the hundreds every year. Additionally, nearly half of the students at these top LACs are varsity athletes. Are you really suggesting that these talented young people can’t handle sports and a pre-med major? Most would find that proposition laughable – my own son among them.<br>Now if you’re talking about DI athletics at the Big Ten or SEC level, then you may have a point. But these are D3 programs that work extraordinarily hard to create an environment where student athletes can flourish. And they do – often while juggling pre-med courses.<br><br>", "<b>Username: intparent</b><br><br>I agree that admissions to those schools are very selective, and the OP may be as qualified as any other applicant.  But SOMETIMES athletic recruits are in the lower end of the applicant pool in terms of test scores and or grades.  They are hooked, so can get a slight edge there.  If the OP falls in that category, honestly, and wants to get the grades needed for med school, it might not be the best choice to be competing against (1) students with somewhat higher academic qualifications, and (2) students who don’t have the same commitment to a time intensive EC.<br>I suspect it is easier at Amherst than Mudd.<br>https://www.princetonreview.com/college-rankings?rankings=students-study-most<br>This isn’t an exaggeration.  My kid worked insanely hard just to pass her classes there.  No way could she have stacked a sport on top of it (and her GPA was still not med-school worthy).  Her friends who were athletes really struggled to keep up, too.  Mudd is a great school.  But it is not a great place for pre-meds to start with.<br>Most schools have some students in premed who don’t do much but study.  There is something to be said for going to a slightly easier school if that is you chosen path so you can keep the needed GPA.<br><br>", "<b>Username: SwimDad99</b><br><br>@intparent – Yes, that all makes sense. I\"m sure there are special cases – even at D3 – where it would be very difficult for a student athlete to juggle their sport plus pre-med (or Engineering). And it doesn’t surprise me that Harvey Mudd might be one of those special cases. It’s exceptionally rigorous. But Williams, Amherst, CMC, Pomona, Middlebury – these are schools where the large pluralities of the students are varsity athletes, and most chose D3 just so that they could find the right balance between sport and school. And, by all accounts, most do that very well.<br><br>", "<b>Username: ThankYouforHelp</b><br><br>Sports at either of these places will be an activity, not a lifestyle.  School always comes first.<br><br>", "<b>Username: CCThunderfin</b><br><br>@intparent, yeah if I go to Mudd I won’t be doing anything pre-med related.  I’d be do engineering there.  That’s why I need to decide between pursuing medicine or just doing engineering.<br><br>", "<b>Username: CCThunderfin</b><br><br>@simba9 it’s not an issue per say; I just included it in my post since it’s my “hook” for admission into these selective schools.  Both schools in my opinion have a good balance of academics and athletics, and I’m hoping to swim all 4 years in college.<br><br>", "<b>Username: CCThunderfin</b><br><br>@Corbett thanks for the info.  Yeah, I read into that 3-2 engineering program a bit but it doesn’t seem very popular.  I’m actually in contact with Swarthmore’s swim coach right now, but it’s not need blind compared to Amherst, so it’d be more expensive.  I’ve also heard it’s extremely academically rigorous, which turns me off - if you have any opinions about that, I’d love to hear them.<br><br>", "<b>Username: CCThunderfin</b><br><br>@intparent Just want to clarify that swimming is not dictating where I’ll be applying, the only reason I mentioned it is because it’s my “hook” to get into these colleges.  I’ve met both coaches and would be happy swimming at either program.  As a side question, I know Swarthmore is very hard (which is why despite getting interest from the coach I’d rather not apply there), but is Amherst that difficult?  By no means am I saying that balancing a sport & having a 4.0 is easy, but I thought it’s doable to try pre med and play a DIII sport.  Would love more info if possible, as I’m considering just staying in Canada to do pre med instead (though most universities here grade harshly, too!).  Thanks.<br><br>", "<b>Username: CCThunderfin</b><br><br>@ucbalumnus Yep, I definitely wouldn’t do pre med at Harvey Mudd.  Out of curiosity, if I was 100% set on medicine, would you suggest just staying in Canada to do the requirements (much cheaper, but I heard most universities here grade harshly, too)?  Thanks.<br><br>", "<b>Username: CCThunderfin</b><br><br>@Much2learn Thanks for the suggestions, though I probably wouldn’t apply to those schools since I’m international and I’d be paying full sticker price for an education I could receive in Canada.  And yeah, I’ve considered bio engineering before.<br><br>", "<b>Username: CCThunderfin</b><br><br>@Corbett I’ve heard job prospects for bioengineering aren’t great-- is that true (this is assuming the med school path doesn’t work out and I just land up with a bioengineering degree)?  I probably wouldn’t apply to those schools since I’m international and would be paying full tuition.  Thanks again though.<br><br>", "<b>Username: CCThunderfin</b><br><br>@ThankYouforHelp yeah, that’s the main thing I’m still trying to decide.  My parents are sort of pressuring me to do engineering since they don’t think I can last through the next 15 years of becoming a doctor.  They think engineering will just be 4 years and then I can start working.  Certain aspects of engineering (especially sustainable/env. engineering) have appealed to me, but I have never had shadowing experience / classes for engineering, so I don’t know much about the field.<br><br>", "<b>Username: CCThunderfin</b><br><br>@SwimDad99 Thanks for your comments, think I’ve seen you post in the Athletic Recruit section on CC before… does your kid go to a NESCAC?  I didn’t mention this in my original post, but I applied to Harvey Mudd RD last year, though ended up getting waitlisted.  At my interview back in the summer of 16 the Dean of admissions said that if I applied ED with coach’s support & no asking of FA, my chances of admission were “very good”.  Didn’t end up doing that in the end, but I think that if I hypothetically apply ED this year I have decent chances.  I do agree with you that Amherst is a probably slightly safer bet.  Funny you say that, I was in contact with Coach Rueppel until Amherst offered me.  I talked to Swarthmore a bit, but I prefer the culture at NESCACs.  Was in contact with Coach Kuster, but they’re not looking for breaststrokers this year.  Not really interested in Pomona or CMC.<br><br>", "<b>Username: CCThunderfin</b><br><br>@artloversplus my safety is just going to school in Canada.  I think my stats are pretty decent (35 superscored ACT, 2 subejct tests &gt;700), Amherst coach told me that I’m A band academically.<br><br>", "<b>Username: CCThunderfin</b><br><br>@intparent That’s what I’m wondering, how hard is premed & a sport at Amherst?  Is it better to just stay in Canada?  But then I feel that the “backup” routes at Amherst (finance, etc.) and connections make the extra costs worth it…<br><br>", "<b>Username: CCThunderfin</b><br><br>@intparent I won’t be doing pre med at Mudd.  Just engineering.  And my stats are 35 superscored ACT, 2 subject tests &gt;700.<br><br>", "<b>Username: intparent</b><br><br>From your comments above, I feel like a few things should be clarified around financial aid.  Unless you are a US citizen, likely Amherst is the only school on your list that will “meet need” for you.  There are only 5 schools in the US that are need blind and meet need for internationals, and Amherst is on that list. Mudd (and Swat) are not.  I know for a fact that Mudd is very specific in saying this to international students that you very likely will NOT get your full need met.  I think Swat will be the same.  You mentioned being need blind above –  that means a college won’t reject your application because you need FA, but it has nothing to do with whether they will offer enough aid for you to attend.<br>Also, I get the impression you want to go to med school in the US.  There are a small number of med schools in the US that treat Canadians like US citizens in admission, but nearly all consider them international.  It is extremely hard for international students to gain admission to US med schools (and to finance that education).  I’d suggest you research that further before embarking on that path.<br><br>", "<b>Username: SwimDad99</b><br><br>@CCThunderfin – Sounds like you’ve got this all well in hand. Yes, my son is a swimmer at Williams and loves it. Of the NESCAC schools we visited, I liked all of them – Williams, Amherst, Middlebury, and Bowdoin. The coaches were terrific at each school. We really liked Swarthmore, too, and the new coach there, Karin Colby, was terrific. But we shied away from Swarthmore for the same reason you mentioned – the academic environment seemed a bit intense. Of course, Williams and Amherst are pretty intense, too, but Swarthmore does have a special reputation in that regard. My sense is that Harvey Mudd shares that reputation.<br>It sounds like you’ve gotten the assurances you need at HM – that your odds of admission are very good. But, as for Engineering, my own personal experience is that there is no undergraduate major more intense. Those who choose that major learn a lot, get a strong degree, and find work. But they don’t have much fun in college. If you’re shying away from Swarthmore because of its academic intensity, then I’d suggest you keep in mind that an Engineering major at HM would be VERY intense – probably much more than most students at Swarthmore experience. Pre-med at Amherst would be intense but manageable. Of course, I’m just “some guy” with an opinion, but I’d encourage you to give this Engineering some additional thought. I’ve had a dozen or more friends who attempted Engineering in college quickly move on to something else. Even our valedictorian was pulling very low grades at Notre Dame while attempting Engineering – moved on to something else after the first year and found success. And if you ran into trouble with Engineering at Harvey Mudd, I’m not sure what your other options would be. One last plug – the NESCAC appears to be a terrific place to swim. And Amherst is a great college town, among the best in the US. If you do apply to Amherst, there’s no harm in reaching out to Rueppel and asking if he would support you for EDII.<br>As for whether to attend a top school for med school, you’ll get lots of opinions here on CC. Some suggest that it doesn’t matter AT ALL where you go – so long as you have the GPA and the MCAT scores. My sense is that these elite LACs are great places to go pre-med. And if you succeed, you’ll have your pick of top medical schools. And if you don’t succeed – or simply change your major as a great many do – you’ll still graduate from one of the top colleges in the country (with a terrific education), and you’ll have wonderful options going forward.<br><br>", "<b>Username: tenniswimvball</b><br><br>Re: Post 10, although HM is not interested in sports, the teams are a combination of HM, CMC, and Scripps. The CMS teams are very focused on athletics at this time. For the first time ever, I believe they were in the top five of the Director’s Cup, which is the overall athletic ranking for D3.<br><br>", "<b>Username: OHMomof2</b><br><br><br>\"\"<br>If you do apply to Amherst, there’s no harm in reaching out to Rueppel and asking if he would support you for EDII.<br>\"\"<br><br>Amherst doesn’t have EDII. Just ED and RD.<br>It does have an excellent record with med school placement and very individualized med/health advising. It doesn’t screen applicants for committee letters and supports all of them even if they don’t make what it considers to be “likely admit” MCAT and GPAs.<br>But the question of Canadian vs US med schools is definitely important to look into. If it will be really hard to get into a US Med school as a Canadian citizen, you may be better off applying to Canadian med schools and that might or might not mean applying from a Canadian undergrad.<br>Many students who think they want to be pre-med change their minds, and not necessarily because it’s “too hard”, but because they discover related careers that they didn’t know about that require fewer years of education, pay well and are better fits.<br>I’ll also add that Amherst’s recent study of its athletics program, just completed this year, found that few varsity athletes major in the sciences. As a pre-med you have something like 7 required science courses with labs, so this may be something to look at - can you make time for the work and the required labs and still compete on the team?  Some can and do, but fewer than non-athletes.<br>https://www.amherst.edu/system/files/media/PlaceOfAthleticsAtAmherst_Secure_1.pdf<br><br>", "<b>Username: ThankYouforHelp</b><br><br>@OHMomof2   I wonder how those stats at Amherst would look if football players were excluded.  Anecdotally, I know that many of the athletes in other sports are science and math majors, but football players all seem to gravitate to econ/wall street type majors.<br><br>", "<b>Username: SwimDad99</b><br><br>@OHMomof2 Rueppel is the head coach at Middlebury which does have EDII. <br><br>", "<b>Username: OHMomof2</b><br><br>@swimdad99 my bad on the coach name.<br>The report actually says that the difference is most stark in “high profile sports such as men’s basketball, baseball, football and lacrosse”.<br>It also says that “athletic factor” athletes - the ones who need the biggest athletic push because their stats are otherwise too low to be accepted  are the ones who don’t pursue the sciences (or math, actually).<br>The athletes (coded or walk on) who don’t need that much help to get in seem to major in the sciences as much as the non-athlete population…though a TON of all types of athletes are still Econ and Poli Sci majors <br>It seems it’s not the time needed to do labs and such as much as it is the team culture or the feeling among lower stats athletes that they aren’t prepared well enough to major in STEM, or something.<br><br>", "<b>Username: intparent</b><br><br>@SwimDad99, I think he is Canadian. He will not “have his pick” of US medical schools.<br><br>", "<b>Username: Mastadon</b><br><br><br>\"\"<br>The CMS teams are very focused on athletics at this time. For the first time ever, I believe they were in the top five of the Director’s Cup, which is the overall athletic ranking for D3.<br>\"\"<br><br>CMS was indeed ranked 4th this year, behind Williams, Wash U  and Tufts.<br>Amherst was ranked 8th.<br>4 of the top 10 schools are from NESCAC: Williams, Tufts, Middlebury and Amherst. This has been the case for the last several years.<br>CMS has typically ranked outside the top ten.<br>PP has typically ranked outside the top 50, but has been moving up as well. This year it was ranked 29th.<br>Bates (NESCAC) had a good year as well. This year it was ranked 20th.<br>http://grfx.cstv.com/photos/schools/nacda/sports/directorscup/auto_pdf/2016-17/misc_non_event/June1FinalDIIIOverall.pdf<br><br>", "<b>Username: retiredfarmer</b><br><br>@CCThunderfin  I would put Tufts on my list for premed.  I think you may be able to go either engineering or non-engineering premed at a university that has a top med school.  Check out http://admissions.tufts.edu/academics/after-tufts/pre-health-information/ :bz<br><br>", "<b>Username: bouders</b><br><br>Amherst has an excellent track record of getting their students into law school and med school. They have lots of support and high GPAs. Canadian universities have no support and C+ to B- GPAs.<br><br>", "<b>Username: Mastadon</b><br><br>Tufts has a two- time all conference defensive lineman - who is a theatre major!<br>https://now.tufts.edu/articles/drama-gridiron<br><br>", "<b>Username: CCThunderfin</b><br><br>Thanks for all the info, everyone.  Leaning towards Amherst right now.<br><br>"]}