{"title": "bates vs bowdoin vs middlebury", "comments": ["<b>Username: joy12345</b><br><br>Hi! I’ve just visited all three schools and have loved them all equally. Wondering what you think would be the best fit for me?<br>Cum Laude<br>34 ACT<br>national merit scholar<br>4.0 GPA (unweighted) school doesn’t weight<br>Several awards<br>3 seasons of sports<br>President of 1 club, treasurer of another, and i partake in several other charity organizations<br>I like a collaborate over competitive environment<br>interested in running cross country/track<br>i LOVE the outdoors(hiking, skiing, surfing)<br>I care about prestige but I would rather have an amazing four years than go to a high profile school that i dislike.<br>Thanks!<br><br>", "<b>Username: joy12345</b><br><br>Also interested in econ, math, polisci or history. cost isn’t an issue<br><br>", "<b>Username: lr4550</b><br><br>Three of my personal favorite NESCACS. Can’t go wrong! Each is a little different, and take my impresions with a grain of salt as they are subjective of course. I think (overall) all three schools are pretty equal in your academic areas of interest- some might be stronger than others in certain areas but overall it’s relative as all three are top notch schools.<br>Bates- wonderful community. Gorgeous (although small) campus/architecture. Very friendly vibe, students are welcoming and the close knit community feel is palpable. Strong academics, just a lovely school. Has the month long May plan which is useful for starting summer internships early or for traveling abroad. Major difference to me between it and the other two is a more laid back vibe. Doesn’t feel as intense. Definitely collaborative. Best food of the three. Nephew is a current student. D15 would have applied regular decision if her ED school had fallen through. Bates is very high on D18’s list this year.<br>Bowdoin- neat school. Lovely campus in it’s own quirky way. Location near Portland is nice, it is more suburban than rural if that matters to you. Great if you like the ocean. Pretty far away from mountains though if you like having them in your back yard. Of course great academics. Personally, I sensed a little more academic elitism at Bowdoin than the other three. I don’t mean it in a bad way, and perhaps I have used the wrong word. Just seemed a little bit more academcially snobby than the other two. Not sure how collaborative/competitive, don’t know enough kids who go there.  D15 liked Bowdoin a lot, would have applied if her ED school fell through. D18 didn’t even look at Bowdoin, too intense of a school for her.<br>Middlebury- awesome location in the mountains, lovely campus. Feels considerably bigger than the other two schools. D15 went ED and attends. Loving her expereince, it is the right mix of academic intensity and fun for her. Raves about (most) of the professors/classes she has taken. Has found Midd more collaborative than competitive (she is env policy major). Heavily involved in the Mountain Club. Knows women on the cross country/track team and they are a great group. Jan Plan is very popular- fun to have the one block class in the middle of ski season. Lots of students ski. D18 not interested in Midd, a bit too intense for her.<br>Good luck!<br><br>", "<b>Username: doschicos</b><br><br>Are you being recruited? Planning to apply ED?<br>If not, apply to all 3.<br><br>", "<b>Username: wisteria100</b><br><br>More similarities than differences but one big difference is size with Midd being about 33% bigger in terms of students. They are still all small schools, but the extra kids at Midd does make a difference for some. All have active outdoors clubs, but Midd probably has the most active one with the most serious outdoor kids. If you’re not outdoorsy, Bates or Bowdoin may more suit you. @lr4550  makes some excellent points, but I disagree about the food. Bowdoin’s is best!  But if you’re looking at LACs, can’t go wrong with any of them. Good luck!<br><br>", "<b>Username: citivas</b><br><br>@wisteria100 Why would you say Midd has a more active outdoors club than Bowdoin?  Bowdoin’s Outing Club is famous.  They have their own permanent building on campus, and they own both an island and a remote cabin.  They organize multiple trips a week.  And to end up being a leader they send you on a 300 hour certification program that pretty much makes you an expert survivalist.  But for casual members they do everything from simple hikes, biking or kayaking to extreme hiking and camping.  Not taking anything away from Midd which is a great school too but would be hard to say any school is a level up from Bowdoin on outdoorsy student opportunity.<br><br>", "<b>Username: joy12345</b><br><br>This was so helpful thank you!!<br><br>", "<b>Username: wisteria100</b><br><br>@citivas  What I was trying to say, is that you aren’t outdoorsy, then Bowdoin or Bates would offer more non outdoorsy activities than Midd.  That is in part due to locatIon. If you are outdoorsy all are great places but in particular Midd and Bowdoin<br><br>", "<b>Username: morandi</b><br><br>Thanks for clarifying, Wisteria100.  I’ll add that to say Middlebury has the most serious outdoor kids of the three schools makes little sense based on my observations.  I know that my son chose Bowdoin, in part, because of it’s tremendous Outing Club and the school’s emphasis on exploring nature.  It transformed his life.  Today he teaches, and lives, the outdoor adventure world (along with his day job of teaching biology) as do many of his Bowdoin friends now scattered about the planet combining education with the outdoors.  I’ve no doubt Middlebury is similar, and have less connection with Bates.  You’re correct in suggesting that Bowdoin is unique in it’s balance for those who may not be interested in the outdoors…It’s a school set in beautiful Brunswick and attracts a wide range of students from all cultures.<br><br>", "<b>Username: citivas</b><br><br>Bowdoin owns a nature reserve island.  Midd owns it’s own private ski resort that students ski down in their gowns as part of a graduation ritual.  Really can’t go wrong either way.<br><br>", "<b>Username: Corbett</b><br><br>If you want a really outdoorsy NESCAC LAC in New England, with great track/XC programs and attractive running opportunities, with very strong social sciences and math departments, then Williams seems like a great fit. At least as good as Bates, Midd, and Bowdoin, and maybe better.<br>A lot of people are forced to skip Williams on their college visits because it is too far off the beaten track to fit into their schedule. But if you love the outdoors, then a remote location in a snowy mountainous corner of New England may be exactly what you are looking for.<br><br>\"\"<br>Middlebury- awesome location in the mountains, lovely campus.<br>\"\"<br><br>Williams is even closer to the mountains. On the other hand, Midd arguably does have a lovelier, more carefully planned campus. The Williams campus seems somewhat randomly organized and has a two-lane highway running through the middle.<br><br>", "<b>Username: joy12345</b><br><br>@corbett I was looking into williams but it seemed to intense/cutthroat for me. I’m looking for something a little bit more laid back.<br><br>", "<b>Username: CrewDad</b><br><br><br>\"\"<br>Midd owns it’s own private ski resort that students ski down in their gowns as part of a graduation ritual.<br>\"\"<br><br>Only the Feb admits/grads. Unfortunately, the snow has long disappeared by the May graduation.<br>http://www.middlebury.edu/student-life/annual-events/february-celebration<br><br>", "<b>Username: joy12345</b><br><br>@lr4550 Did she ever complain about Middlebury feeling too elitist?<br><br>", "<b>Username: joy12345</b><br><br>@doschicos I’m planning to ED to one of them, so that’s why I’m so torn. I feel like I won’t get into Bowdoin or Middlebury if I do RD<br><br>", "<b>Username: Corbett</b><br><br><br>\"\"<br>I was looking into williams but it seemed to intense/cutthroat for me. I’m looking for something a little bit more laid back.<br>\"\"<br><br>I would question whether there is really any discernible difference between Bowdoin, Midd, and Williams on the “laid-back vs. cut-throat” scale.  Williams might have slightly higher stats, but not by much. Bates might be a little further towards the laid-back end of the scale.<br><br>\"\"<br>Bowdoin or Bates would offer more non outdoorsy activities than Midd. That is in part due to locatIon.<br>\"\"<br><br>This is a point where there actually would be a discernible difference. Williamstown MA is even smaller than Middlebury VT, and offers even fewer non-outdoorsy activities. Williams is arguably at the far end of the “outdoor vs. indoor activities” scale.<br><br>", "<b>Username: doschicos</b><br><br>\" I’m looking for something a little bit more laid back.\"<br>I think Bates would best fit this description.<br><br>", "<b>Username: rman0070</b><br><br>All great schools. Middlebury being the most prestigious. Bowdoin is a step up with schools like Haverford. All great options though.<br><br>", "<b>Username: lr4550</b><br><br>@joy12345 my daughter has never felt an elitist vibe at Middelbury. Her friend group is geographically pretty diverse, and generally speaking (at least from her experience) students really don’t know/care who is full pay or who gets financial aid. Of course there are always exceptions at every school but middkids are a prety down to earth group.  I do, however, agree with @doschicos that Bates is arguably the most laid back of the three you are considering.<br>On a side note- when my daughter visited Williams she spent the day on campus. Attended class, danced in the studio, tried to take in as much as possible. She did feel the environment was intense at Williams, that it had a similar feel to Swarthmore, and for that reason Williams did fall off of her list. At Middlebury the students seemed like they were having fun; at Williams not so much that particular day. Having said that, she has two friends at Williams and they absolutely love Williams!<br>Bottom line is that all three are great school and the comparisons are truly relative and certainly subjective <br><br>", "<b>Username: Lindagaf</b><br><br>Bates is very outdoorsy! There are hiking trails that leave from campus and a lovely 380 acre bird-sanctuary literally across the street. Bates has a private 600 acre nature preserve, the Bates-Morse Mountain Conservation Area, with beaches, salt marshes and woodland. Bates also has a famous Outing Club and a sailing club. Many kids engage in winter sports.<br>I am not an expert, but from what I have gleaned over the years, Bates is probably the most laid-back of the three. Having said all this, I am biased because my D attends:-).<br><br>", "<b>Username: joy12345</b><br><br>@Lindagaf does your daughter play any sports? what would she say is the balance between school and social life like?<br><br>", "<b>Username: fleishmo6</b><br><br>@joy12345<br>My two sons were/are involved in sports at Midd<br>Both had no problem with balancing social and academic life<br>All the schools in the Nescac are set up so that your student can succeed in both aspects of college life<br><br>", "<b>Username: Lindagaf</b><br><br>Does vegging with friends count as a sport?  No, but she did debate last year, which was a big time commitment.<br>That’s a good question about balance. She is taking what seemed at first to not be a heavy schedule, including a foreign language and Art. But both classes are very intense, in a good way. She has another class with no tests, but it meets for four hours once a week and there is a lot of writing. 30% of the grade is class participation, which I LOVE because she has to talk (she’s a shy person.) Her fourth class is for her major and is the surpise cool class, which she initially thought would be uninteresting. She hasn’t yet had a single class she didn’t like. As far as social life, she has a very good group of friends and a boyfriend, and they go to campus activities. They take advantage of weekend shuttles to various places in Maine, and some of them drive so they go out in Lewiston, which is in fact a cool little town. They go other places too. She is never bored.<br><br>", "<b>Username: gearmom</b><br><br>@joy12345 Bowdoin is incredibly difficult to get in. What is your home state?<br><br>", "<b>Username: joy12345</b><br><br>@gearmom new york. i’m aware it’s very hard that’s why i plan on ED1 to one school and if i don’t get in which is likely i’ll ED2 to another<br><br>", "<b>Username: gearmom</b><br><br>@joy12345 If you are female white and from NE (NY is close), it is particularly hard to get in. I would pick one of the others.<br><br>", "<b>Username: joy12345</b><br><br>@gearmom  do you think bowdoin is that much more selective than middlebury? I know Bates, especially ED, is much less selective than the other two<br><br>", "<b>Username: urbanslaughter</b><br><br>@gearmom, Bowdoin is really no more selective than Middlebury or Bates. If you’re a white female from the NE, your chances of getting into Midd are less than 10%. All of these schools are selective schools.<br><br>", "<b>Username: gearmom</b><br><br>@urbanslaughter Really because Bates is in the low 20s for acceptance and Bowdoin is lower teens?<br>I do realize they are all selective but she needs to pick one.<br>@joy12345 I don’t think Bowdoin is much more selective than Middlebury but I don’t think your profile is strong enough for Bowdoin after seeing stronger applicants get denied ED1<br><br>", "<b>Username: NEPatsGirl</b><br><br>I think Midd would be a good fit given everything you’ve said.  Bates was a top choice for my D, she applied to both Midd and Bates but did not like Bowdoin.  I would agree with the comment about “eliticism” feel.<br><br>", "<b>Username: Lindagaf</b><br><br>You are a strong applicant. I think you should use ED1 for the school you truly see yourself being happiest at. Then do ED2 if you don’t get in to your top choice. This past cycle, more males than females matriculated at Bates. A lot of ED spots go to athletes at all of these schools. Any ED decision should be used for your unequivocal top choice. They are all very selective, so don’t use acceptance rates as a criteria.<br><br>", "<b>Username: gearmom</b><br><br>@Lindagaf Her stats are good but I’m not sure about the everything else. Especially the ECs. OP you need to hit it out of the park with the essay.<br><br>", "<b>Username: citivas</b><br><br>@rman0070 Why do you think Middlebury is “more prestigious” than Bowdoin, Bates or Haverford?  They’re all close enough that any stratification between them is subjective.  Bowdoin is statistically harder to get into than Midd and typically does as well or better on most of the rankings as Midd.<br>Again, they are all close enough that it’s splitting hairs but I would say the conventional stratification is Williams, Amherst, Swarthmore and Pomona on top then a bunch of close seconds that include Bowdoin, Middlebury, Haverford, Claremont MdKenna, Wesleylan, etc.<br><br>", "<b>Username: Lindagaf</b><br><br>OP also needs to interview for any of those she applies to. They all consider the interview. OP, I suggest you request alumni interviews asap, if you haven’t already done so.<br><br>", "<b>Username: wisteria100</b><br><br>Your strategy of ED to one and then if it doesn’t work out doing ED2 at another is a good one, considering you seem to like all 3 equally.  Do your parents have a preference, or can they picture you at one more than another?  Maybe ask your gc that question as well.<br><br>", "<b>Username: citivas</b><br><br>@gearmom I think her profile has a great chance in ED.  She’s correct that it’s more iffy with RD. Over half the final class at Bowdoin ends up coming from the ED pool and similar for Midd.  RD admit rate is 12%, and harder than that for girls.  But ED is in the 40% range.<br>The OP shouldn’t torture herself on this choice.  She’ll likely have an amazingly great experience at either school and if she doesn’t it will likely be for reasons that would have been true at either of them.  They both are truly great places.  Midd is more rural but also prettier in my opinion.  It’s physically larger and more spread out.  It has 25-30% more students than Bowdoin but neither are large.<br>Having toured Midd twice, attended a couple days of seminars at accepted student day and spoken to numerous parents I know personally, I got the vibe that Midd is the most coddling/nurturing of the NESCAC schools, which I don’t say pejoratively – it can be good or bad depending on the student or parents POV.  They focused way more time walking parents through everything from housing matching to the ability to appeal and move to how they deal with any student with marginal grades, etc. and assuring them all the ways they will keep parents involved and watch out for their kids than the others schools.  They actually banned energy drinks on campus because they said it promotes “high risk sex” and leads to more alcohol consumption.  Wesleyan was the other extreme, relative to the NESCAC’s.  Definitely got a vibe that they consider the students adults who have both the freedom to do stupid stuff and the responsibility to figure most things out on their own.  But this is splitting hairs – there is plenty of freedom and good resources at all the schools.  I did like the sound of Midd’s special “Leadership” program.  My son considered Midd, Wes and Bowdoin all very seriously after acceptances and decided at the last minutes on Bowdoin.  He was leaning toward Midd until he did the accepted student overnight and got a bad vibe after being paired with a bunch of jocks.  We would have been happy with any of them.  He feels super confident he made the right choice, but I’m convinced he would have felt that way with any of those choices.<br>BTW, he was very worried about not ending up at a school that was too “preppy” or elitist or “no chill” when it came to studies and he says he hasn’t experienced any of that at Bowdoin.  No one talks to each other about their grades or is academically competitive with each other.  Most people seem self conscious if they come from wealth to not demonstrate it – if anything it’s considered social negative to flaunt affluence.  The place isn’t full of students with fancy cars (like I used to see in LA around USC students or still see around Princeton).  The only sign he’s seen of conspicuous wealth he says are all the Canada Goose jackets in the winter.  He’s personally most wearing clothes from Target or T-shirts he got from the various high school activities over the years and gets no stigma about it.  He doesn’t see any signs of or get any vibes about “elitism” at all, other than the sarcastic, self-mocking name of their major week-long spring party called “The Ivies” because supposedly so many of them turned down the Ivy League to go there (again, treated very tongue-in-cheek).  And the professors are mostly super accessible and he knows many on a first name basis.  All I can say is the image of elitism is totally at odds with his experience and he is definitely someone who wanted to eschew it.<br><br>", "<b>Username: joy12345</b><br><br>@gearmom i asked which you thought would be the best fit not which you thought i’d get into. that’s something that’s very hard to predict. I also have additional EC and awards not listed. I also plan on interviewing, and I have extremely strong rec letters<br><br>", "<b>Username: joy12345</b><br><br>@Lindagaf  do you think it’d help that I could get a rec letter from a middlebury alumnai?<br><br>", "<b>Username: Lindagaf</b><br><br>Typically, that kind of thing isn’t particularly helpful these days. If Midd accepts additional letters of rec, and the alum knows you well, there’s no harm. Don’t submit more than they allow though. If you just know the alum casually, it’s worthless, tbh.<br><br>", "<b>Username: joy12345</b><br><br>@citivas thank you!!! this was very helpful<br><br>", "<b>Username: citivas</b><br><br>@joy12345 It doesn’t hurt but it may only help if the alum has significant juice with Midd.  Lots of people track down alums for letters so for the most part average alum X is not going to make a difference.  But if you happen to find someone that has been on their alumni boards or trustees or whatever, and who knows you personally or met with you personally, that could help if you’re on the bubble.<br><br>", "<b>Username: gearmom</b><br><br>@joy12345 I’d still pick Bates for a collaborative, laid back environment. You could not go wrong at either three.<br>One I know who got rejected, had an elite HS education with top ECs such as medical research in addition to normal school sports, club sports and school clubs, volunteering summers in Africa with needy kids in her future major and BOTH parents are active Bowdoin alumni. She was rejected ED1 from Bowdoin but ended up at a higher ranked university. Really the acceptances are ivy like. Apply to Bowdoin ED1 if your heart is set on it.<br><br>", "<b>Username: doschicos</b><br><br>Honestly, if one doesn’t stand out to you as a favorite, maybe you shouldn’t apply ED. It sounds like you are applying ED to game the odds and once athletes and legacies are removed, the odds for an ED applicant aren’t as high as the ED acceptance rate would make one assume.<br><br>", "<b>Username: Lindagaf</b><br><br>@doschicos is spot on.<br><br>"]}