{"title": "nc state vs syracuse", "comments": ["<b>Username: meganewarren</b><br><br>Hello all.<br>I’m in the process of finishing up all of my applications and I am torn between applying to NC State or Syracuse.  I only want to apply to one more school because these application fees are adding up quick (I’ve already applied to seven other schools).  I am planning on going into school with my major undecided but I am interested in biology/environmental science.  Both schools are OOS for me I have family in both of these cities.  Does anyone have any input to help me make a decision?  Thank you in advance!<br><br>", "<b>Username: merc81</b><br><br>T&L magazine ranked Syracuse first in the nation among college towns, should this tip the scales for you:<br>http://www.travelandleisure.com/slideshows/americas-best-college-towns<br><br>", "<b>Username: Postmodern</b><br><br>^^^ I am a happy and proud Syracuse grad.<br>However, I can only assume the author suffered from third-degree brain freeze to reach that conclusion.<br><br>", "<b>Username: meganewarren</b><br><br>@Postmodern would you consider Syracuse as a big city with lots to do?  I am not too familiar with the city, it just know it has very cold winters!  Being in a medium/large city is very important to me.<br><br>", "<b>Username: Postmodern</b><br><br>Yes, there is a lot to do at Syracuse, @meganewarren .  Tons of concerts and sporting events and clubs and things of that nature.  A good local theater group (Syracuse Stage) and beautiful proscenium theater (The Landmark). The Dome, despite it’s ugliness, has many premier events.  Few things are more fun than a packed SU basketball game!<br>Like many big colleges, the University Union is well funded and always has something going on.  I was very involved with it and saw everything free! lol Films, Concerts, Speakers, etc.<br>http://www.universityunion.syr.edu/<br>Because of the weather SU is big on what I will refer to as “indoor sports”.  Marshall street is where the bars/restaurants are, but it is essentially on campus.  You’ll run into everyone there.  The Varsity is the most famous local beer/pizza/wings joint but there are many. http://varsitysyracuse.com/.  And of course Dinosaur BBQ.<br>I had an excellent time there and was very involved in stuff, although it was long ago.  Campus is great, weather is awful… all the things you hear are true.  But the city of Syracuse, which I have an affinity for, is not what I would call a “great college town”.<br>But you will not be bored.<br>Good luck!<br><br>", "<b>Username: Otterma</b><br><br>Is your current list especially heavy on northeast or southern schools? If so, maybe choose the university in the underrepresented region.<br>NC State would give you access to Research Triangle firms for internships. I went there many years ago but was in the engineering school so I have no idea how the programs at the two schools compare for bio/env sci. The faculty at NC State were terrific though.<br><br>", "<b>Username: meganewarren</b><br><br>@Otterma  I live in the south so naturally my parents prefer me to stay in that region but if its the right school they agree that anywhere on the east coast would be fine (with an exception to one mid-west school).  I have four schools in the south, two in the northeast, and one in the mid-west.  My dad is VERY biased towards NC State, and my mom is indifferent.  I have visited NC State (it was on a rainy day, which might have been why it fell off of my radar truthfully) and recently got to explore the city of Raleigh more which I really liked.  I have yet to tour Syracuse and probably wouldn’t be able to.  Both schools have the majors(s) I am looking for, I want to avoid transferring unless I absolutely hate the school.  This will be tricky!  Would you change anything about your experience at State?<br><br>", "<b>Username: happy1</b><br><br>If you visited NC State and think it is fine, your dad prefers it and you haven’t seen Syracuse then NC State seems like the better/safer application for you.<br><br>", "<b>Username: meganewarren</b><br><br>@happy1 Yeah it definitely seems to be the safer place to apply.  My only worry is whether or not I’ll get some financial aid coming from OOS.  Syracuse might end up being more affordable just because its private.<br><br>", "<b>Username: yankeeinGA</b><br><br>I’m also a Syracuse grad and @Postmodern made me laugh. I would say Syracuse has a lot to do, sure. I would also say that if you’re a southerner you need to be prepared that lake effect snow is not kidding around. It will snow a lot. A LOT. It will be very cold and windy, like from October until April. If you’re not prepared for that sort of weather, I’d mark it off your list. (I grew up nearby so it wasn’t a huge change for me, but coming from the south I imagine it would be a huge shock.) I also didn’t find Syracuse all that public-transportation-friendly, but things may well have changed since I was there.<br>My most vivid memory of my time there was walking up to campus to take the GRE on a Saturday when the wind chill was something like 30 below zero. I lived three blocks from the building where I took the test and when I got there I was afraid I had frostbite. (I was fine.) It’s a great school, don’t get me wrong. But the weather is nuts.<br><br>", "<b>Username: twogirls</b><br><br>Do not underestimate the winters in Syracuse. My daughter went to school nearby and found it intolerable at times- and we are from the northeast. There is a lot to do in the area but in my opinion it is very different than NC State, both in terms of location and students. Fill out the NPC and see what kind of aid you may get.<br><br>", "<b>Username: Otterma</b><br><br><br>\"\"<br>Would you change anything about your experience at State?<br>\"\"<br><br>I wish I had taken better advantage of the opportunities I was offered at NC State. I also wish I had done a better job of seeking out friends. Both of those were my shortcomings though, not the school’s (funny what a few decades of perspective can do).<br>I did participate in the co-op program and it was one of the best things I’ve ever done.<br><br>", "<b>Username: meganewarren</b><br><br>@yankeeinGA @twogirls I appreciate the quick responses.  I visited family in New York many times in the winter but I guess that is a lot different than living there.  Right now my body is used to 40 degree winters and 100 degree summers.  Giving me a lot to think about!<br><br>", "<b>Username: meganewarren</b><br><br>@Otterma Thanks for the info!  After hearing everyone on this thread I think I am leaning a bit towards State, but I won’t finalize any applications for at least another week.<br><br>", "<b>Username: Otterma</b><br><br>Making Dad happy will pay dividends too. <br><br>", "<b>Username: meganewarren</b><br><br>BUMP.  Would love other’s opinions/thoughts.<br><br>", "<b>Username: happy1</b><br><br>Did you run the net price calculator to see if both are affordable?  That might sway you as well (and your dad too).<br><br>", "<b>Username: merc81</b><br><br>“Despite all I have seen and experienced, I still get the same simple thrill out of glimpsing a tiny patch of snow in a high mountain gully and feel the same urge to climb toward it.”<br>– Edmund Hillary<br><br>", "<b>Username: meganewarren</b><br><br>Good idea.  I have not done that yet.  All I know is that Syracuse offers good financial aid and I might be able to get merit aid from them as well since my scores are towards the top of their range.  Not so sure with NC State, but I’ll run some numbers after school.<br><br>", "<b>Username: merc81</b><br><br>The private Syracuse will offer greater geographical diversity in their student body. This might be another aspect you could consider as you make your decision.<br><br>", "<b>Username: meganewarren</b><br><br>BUMP.<br><br>", "<b>Username: informative</b><br><br>I’d prefer NC State but for non-academic reasons. Neither school is academically amazing, but you can’t get better than the weather in NC. Syracuse is freezing during most of the school year.<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>Syracuse is freezing during most of the school year.<br>\"\"<br><br>Technically, however, the city’s climate, even when considered by daily low temperature, averages above freezing during September, October, November, April and May.<br>(Placed Rated Almanac.)<br><br>", "<b>Username: informative</b><br><br>LOL, the colloquial use of the term “freezing”, meaning freaking cold. <br><br>", "<b>Username: merc81</b><br><br>And “technically,” of course, referred to the literal meaning of the word.<br><br>", "<b>Username: siliconvalleymom</b><br><br>Have you run the NPCs for your whole list?  It may be that you need to add a financial safety instead of one of these options.  Were you comfortable with the NPC results for Syracuse and NC State?<br><br>", "<b>Username: meganewarren</b><br><br>@happy1 @siliconvalleymom I just got the chance to run the NPC for all of my schools.  Syracuse was about $5,000 more than State, before loans (which I do not plan on taking).  The most shocking thing about the NPC was finding out that I shouldn’t expect any aid for Boston University…which I definitely cannot afford without!!  Wondering why I even applied…hahaha<br><br>", "<b>Username: happy1</b><br><br>Glad you ran them…affordability is a very important part of the process.  Since BU is probably out of the equation, maybe see if you can find a way to apply to both Syracuse and State…if you have to choose one it sounds like State is the more affordable option, a school you have seen, and one your dad prefers…<br><br>", "<b>Username: meganewarren</b><br><br>@happy1 Me too, I guess I assumed with BU being private and ridiculously expensive, everyone would receive some kind of aid.  I’ll definitely be talking to my parents.  I hope I’ll get scholarship letters/financial aid letters soon from the schools I’ve been accepted to so far.<br><br>", "<b>Username: happy1</b><br><br>Good luck!<br><br>", "<b>Username: BB1313</b><br><br>I live in NC and NCSU is a fine school (especially for STEM) and a really wonderful campus for me. However it is not particularly flexible for majors since you have to apply to the particular school you want to major in, and it is pretty focused once you are in it (ex. in the engineering school your first year courses are pretty much entirely for that major, so if you wanted to switch to polysci sophomore year, you’d not only have to switch schools but be behind). For an undecided person, this could be a problem, combined with the low availability of aid for OOS students.<br>On the other hand, NC State is bigger and has lots of major choices and social scenes. Raleigh is also an incredible location both for fun and for jobs/internships. Syracuse is much more difficult to get into, even being OOS for NCSU. I don’t know much about the flexibility of Syracuse.<br>If you want to know anything about NC weather or NCSU I can answer a lot, since I used to be rather obsessed with attending there. <br><br>", "<b>Username: siliconvalleymom</b><br><br>I am glad to hear that you took the time to run the NPC for your whole list.  It is much better to realize the issue now than to be one of the many threads in the spring written by a family shocked by the financial reality.<br>Are you planning to add some financial safeties?  Or apply to more colleges where you might get merit aid?<br><br>", "<b>Username: meganewarren</b><br><br>@BB1313 thanks for the info.  One of the reasons I was actually very interested in the school was because it isn’t too far from where I live and its undecided program.  When I toured the school I talked with a student who was in the program her freshman year who explained that it helped her figure out exactly what she wanted to do and she wan’t behind in the major she decided to pick.  I wonder if this is the case for all of the majors there, because I do agree that generally switching science majors or switching into a science major would be much more difficult.  The weather is pretty fantastic.  Do you feel that you had a lot of opportunities at state?  Also how were the class sizes?<br><br>", "<b>Username: meganewarren</b><br><br>@siliconvalleymom yes, your post actually reminded me to do that, so thanks!!  I have already been accepted to USF with a $36,000 scholarship (9k a year) making that really affordable for OOS.  University of South Carolina (my state school) has been sending me letters giving estimates of what they could offer me which is around $15,000 a year if I remember correctly.  I don’t expect to receive an official offer for a little while since they just began sending out acceptances a couple of weeks ago.  Any other suggestions for colleges are welcome, I would prefer to go more North than South   Please let me know if I should post my stats.<br><br>", "<b>Username: BB1313</b><br><br>Oh! If you’re looking at the undecided major then that will be a lot easier, though do be warned engineering is very hard to get into later.<br>There seemed to be a lot of opportunities there in terms of shadowing, internships, and research. There are several companies on-campus where students often intern (https://centennial.ncsu.edu/partners-directory.php), and even more in the research triangle. Research is fairly easy to come by, too. NC State also has one of the only BTEC (biomanufacturing) centers in the nation if that’s something you’re interested in. For social science, I have a friend who is president of the student body in student government and in polysci and absolutely loving it. He has found NCSU to be a great school for the opportunities he wanted for pre-law and politics.<br>It’s a big enough school that there is something for everyone, and if you can stand out in your class<br><br>", "<b>Username: BB1313</b><br><br>then it’s even easier. (sorry I got cut off lol). The class sizes were bigger than, say, UNC or Duke’s but they do have small courses once you get into sophomore/junior year and take more specific courses (the general classes will always be bigger)<br><br>", "<b>Username: LBad96</b><br><br>Go NC State. MUCH warmer weather than Syracuse, more desirable location, and is just as good as, if not better than, Syracuse. Also sort of biased because I’m a northerner who goes to school here in NC lol<br>EDIT: I see you already made that decision. <br><br>", "<b>Username: meganewarren</b><br><br>@LBad96 I haven’t submitted any new applications yet but I’m definitely leaning towards NC State.  Thanks for the comment!!    I appreciate all of the feedback.<br><br>", "<b>Username: meganewarren</b><br><br>Update to anyone following this thread:  I had a long conversation with my parents last night and they agree that I should go ahead and apply to both schools.  If anyone still has anything to add to this thread please continue to comment!<br><br>", "<b>Username: universityjoe</b><br><br>I wouldn’t call Syracuse a great college town, in fact, it’s rather depressed.<br><br>", "<b>Username: JustGraduate</b><br><br>Poke around the website of your major at each school.  See if you can get an idea of internship options, what the recruiting looks like for jobs out of school (job fair?  how many companies recruit there?  primarily regional recruiting?).  If not, it would be worth an email to each school to try and get that info about your prospective major.  Then think carefully about which area you’d like to be in for the next 4+ years.  Is transportation to/from Syracuse or Raleigh an issue?  Look at flight schedules, etc.  FWIW my son loved the Raleigh area but NCState not so much so in the end he passed on it after being accepted.  It was probably my first choice for him mainly because we lived in the area years ago and absolutely loved it.  Good luck!<br><br>", "<b>Username: hbh2017</b><br><br>@meganewarren.  What did you decide?  Are you still considering NC State?<br><br>", "<b>Username: meganewarren</b><br><br>Sorry to anyone who was following this thread!!  I want to do a follow up post to help out everyone working on college apps right now, because this website was so helpful to me last year.<br>I ended up picking NC State!!<br>Very tough choice, I ended up receiving a $25k scholarship (per year) from Syracuse + financial aid.  Needless to say I was completely blown away.  My mind was pretty much made up for Syracuse until I got a letter from State offering me about $13k in financial aid, bringing my COA within a couple thousand dollars of the instate rate, and about $5k less than Syracuse.<br>If anyone has any questions for me, please comment or shoot me a message!<br><br>"]}