{"title": "u chicago vs stanford", "comments": ["<b>Username: The_Corntown_Kid</b><br><br>I’m starting to prep my college apps. For a long time I planned to apply early restricted to Stanford but after visiting the University of Chicago a few weeks ago, I’m not sure which I like better. I really like the both of them a lot and now am trying to figure out which one I want to apply early restricted too. I want to study International Relations and Political Science, and possibly minor in like theater or some sort of art. Any comments or suggestions on the schools?<br><br>", "<b>Username: Srabookworm</b><br><br>I have friends at both universities and have generally heard more positive things about Stanford, although I think the people I know at both universities are happy with their choices. From what I’ve heard, Stanford students are more friendly and the party scene is less intimidating, and I’ve also heard that the California weather is preferable to Chicago’s, although that may be a matter of preference. In general I’ve heard wonderful things about them both, so unless there are particular factors you care about that you haven’t mentioned, it seems like your choice comes down to personal feelings about the environment/culture at each school.<br><br>", "<b>Username: Penn95</b><br><br>They are very different schools in terms of campus vibe, social life and academic philosophy. Obviously Stanford is quite more prestigious overall and stronger in your areas of interest, but it is so different from UChicago that if you think you fit in better at UChicago you should seriously reconsider applying to Stanford SCEA. Same goes vice versa. If you fit in well at Stanford chances are u won’t fit in that well at UChicago.<br><br>", "<b>Username: tk21769</b><br><br><br>\"\"<br>I’ve also heard that the California weather is preferable to Chicago’s<br>\"\"<br><br>This really isn’t a matter of opinion. I can’t imagine any sane person preferring Chicago weather.<br>UChicago is quite strong in political science. Stanford may be even stronger, but not by obvious leaps and bounds for undergraduates. For social science overall, UChicago is one of the strongest research universities in the world. Undergraduate instruction in UChicago’s social science and humanities Core classes, which take up about 1/3 of the college  program, is about as good as you’re likely to find anywhere (in terms of course content, class size, and instructor quality.)<br><br>", "<b>Username: artloversplus</b><br><br>To say Stanford is better or more prestigious then Chicago is splitting hairs. They are all top schools and they all have strong programs.  It’s matter of personal preference, do not listen to those anecdotes. Go with your guts.<br><br>", "<b>Username: CalvinCoolidge</b><br><br>Chicago weather will drive you nuts. Go to Stanford. This is coming from a U of C grad.<br><br>", "<b>Username: The_Corntown_Kid</b><br><br>I am from the Bay Area in California so the Stanford weather is definitely more my speed. Both have highly rated international relations programs and are also just as prestigious as the Ivy League schools. Can I hear more about how that atmosphere is and how the students are at each school?<br><br>", "<b>Username: sheepskin00</b><br><br>They’re both powerhouse schools with amazing faculties and students, really the top of the top.  That said, they’re also extremely different in terms of school culture.  Stanford is filled with entrepreneurial, driven, type-A personalities, tempered a bit by the mild weather.  Chicago is filled with introverted scholars who don’t work hard/party hard.  They just work hard.  The stereotype of Chicago as “where fun goes to die” is overstated but not without some truth.  No one should go to Chicago unless they’re prepared for the intensity.  The academics are intense, the weather is intense, the students are intense.  It requires a certain mindset in order to thrive there.  You really have to be happy with your nose in a book all the time.  Stanford, on the other hand, is a little less classically egghead.  The students are all extremely talented but the overall vibe of the place is mellower and the pace is a bit slower.  You’re more likely to find big house parties, sports mania, rah rah stuff at Stanford.  Either one will put you in good stead for grad/prof school or employment.  This is a choice about lifestyle, not academics.<br><br>", "<b>Username: preppedparent</b><br><br>Go with your heart. That’s the idea of ED1 and SCEA.<br><br>", "<b>Username: HyperTurbo</b><br><br>If you can visit then it would help a lot IMO. Research the departments on their respective websites.<br>As people above have said, go with your heart. Both are amazing schools. Visiting will help you see for yourself what you wouldn’t be able to see on paper or with stats.<br><br>", "<b>Username: bluesky100</b><br><br>The difference in atmosphere between Uchicago and Stanford is definitely overstated in this thread.  Especially over the past five years, Uchicago has become an increasingly social place with more students who are career driven than ever before.  I was admitted to both this past March, and I ended up choosing Uchicago because of its excellent job placement in finance as well as its incredible econ program.  Choose to apply early to whichever one you feel the most comfortable at, since you cannot go wrong with either one.<br><br>", "<b>Username: Chrchill</b><br><br>Chicago is a world class city with some of the worlds greatest music, theatre, museums and restaurants.  Palo Alto is one giant strip mall.  The area surrounding Palto Alto , however, is scenic and beautiful.  Much better outdoor activities.  Chicago winters are not for the faint of heart. But fall and spring are glorious.  Palo Alto weather is mild year round with no real seasons.<br><br>", "<b>Username: katliamom</b><br><br>I don’t think you could have picked two more radically different universities - one of the few characteristics they share is their excellence.<br>This shouldn’t be a choice between “which is better” but more “which suits my academic style better.”<br><br>", "<b>Username: Studious99</b><br><br>At U Chicago, ED will certainly give a bigger bump than Stanford REA. For that reason alone, I’d strongly encourage using your ED bullet on Chicago.<br><br>", "<b>Username: theloniusmonk</b><br><br>“Palo Alto is one giant strip mall.”<br>I’m assuming this is sarcasm, Palo Alto is a gorgeous college town, right up there with Cambridge, Ann Arbor and Madison.  Hyde Park doesn’t really compare, now if you want to talk Evanston ok.<br>Here’s what you should do - go to Chicago and Stanford in February, during mid winter break.  I visited Chicago then and the tour guide kept saying, don’t worry, we’ll go inside in a minute, we’ll go inside I promise.  Needless to say Stanford’s tour guides rarely say that.<br>Anyway back to the OP, despite the weather, Chicago is a top notch school for your intended majors so if you’re comfortable there, apply EA if you can, if it’s ED, I’d recommend you not apply ED as that will really cut down on your flexibility.  Apply SCEA Stanford as your original plan and RD Chicago and see what happens.<br>The only drawback to Chicago wrt Stanford is that students change majors a lot, and if you decide that you’d like to pursue computer science, then you’re better off at Stanford.  Like really better off.<br><br>", "<b>Username: artloversplus</b><br><br>With all due respect, the CS department is very small and seems insignificant at UofC in comparison to the giants like Stanford, CMU and UCB, but the graduates from CS department at UofC are heavily recruited by the majors in the industry. Of the 20+ graduates in 2013, they all got into companies like Google, Amazon and Apple or the equivalent. I happened to know many of them and they are very bright kids with a lot of CS background on their back before entering UofC. Since then, the class has grown 3 fold until today.  Don’t worry about academic excellence at UofC, except Chicago does not have an Engineering Department.<br><br>", "<b>Username: Rivet2000</b><br><br>I have to admit that UoC was not on my son’s list to apply to (this time last year). He put the list together, so it might have been an oversight of his. The top 4 on his list (specifically crafted for CS) were: Stanford, CMU SCS, MIT, Berkeley. He toured all these schools and Stanford remained #1 in his final analysis. When it comes to a coin-flip type of decision weather wins!   <br><br>", "<b>Username: ThankYouforHelp</b><br><br>@theloniusmonk   I live near Stanford and it is a great place, super pleasant, but Palo Alto is not a “great college town.”  It isn’t a college town at all - it is an extremely wealthy suburb full of tech money - all those restaurants and shops are too expensive for students and don’t cater to them.  The Stanford campus is huge, and  removed from town.  Students don’t live off campus or hang out off campus.  In fact, students rarely leave campus at all except to go on outings to San Francisco or maybe to the movies.<br>tl/dr  Palo Alto has almost nothing in common with Ann Arbor, Madison, Cambridge or Hyde Park (but the weather is far nicer).<br><br>", "<b>Username: Rivet2000</b><br><br>Palo Alto is expensive no doubt. But there are many off campus places my son visits. He has also made school sponsored trips to San Francisco, a weekend ski trip to Tahoe, etc. But I must say that during the school year he spends much more time studying than having a “college town” experience. He understands why Palo Alto is expensive but his plan is to one day be a customer of that McLaren dealership just off campus, so…<br><br>", "<b>Username: CU123</b><br><br>Of course you do have to get admitted to one of these two excellent schools.<br><br>", "<b>Username: EatwillBAux-K</b><br><br>I don’t know much about Stanford, but Uchicago has very…quirky, and perhaps nerdy atmosphere. It also is more academically oriented.<br><br>", "<b>Username: theluckystar</b><br><br>It’s not a matter of which one is better than the other. They are both two of the best powerhouse research universities in the world. It boils down to which one you feel more right about. In regards to weather, Chicago has the four seasons and winter time really helps build character. Needless to say, Stanford enjoys beautiful weather practically all year round. It’s a tough choice, but it’s an easy choice if you trust your guts. Since you live in the Bay Area, I would challenge myself to go out of my comfort zone and try a new environment to spend the next four years enriching my life of the mind in a world class university just like the one in Palo Alto.<br><br>", "<b>Username: katliamom</b><br><br>I went to the better Bay Area school – UC Berkeley, go Bears – of often entertained in town bored Stanford students who escaped Palo Alto on weekends. The poor sods. Stuck in the suburbs in a school that looks like Taco Bell.<br>(Tongue firmly planted in cheek.)<br><br>", "<b>Username: Carino</b><br><br>^ Taco Bell…Oh God…<br><br>", "<b>Username: stanfordfoodie</b><br><br><br><br><br> bluesky100:<br>\"\"<br>The difference in atmosphere between Uchicago and Stanford is definitely overstated in this thread. Especially over the past five years, Uchicago has become an increasingly social place with more students who are career driven than ever before. I was admitted to both this past March, and I ended up choosing Uchicago<br>\"\"<br><br>Here’s what @bluesky100 stated in a couple of previous posts:<br><br><br><br> bluesky100:<br>\"\"<br>Yes I was personally deferred from an SCEA school [Stanford] and went on to apply ED II to Uchicago<br>\"\"<br><br>http://talk.collegeconfidential.com/discussion/comment/20313272/#Comment_20313272<br><br><br><br> bluesky100:<br>\"\"<br>As for the interviews, I did receive one even though I applied on January 3rd so it must just be based on availability in your area. I won’t be receiving a [Stanford] decision today [3/31/17] since I ended up deciding to accept my offer of admission from Uchicago and I withdrew my other applications<br>\"\"<br><br>http://talk.collegeconfidential.com/discussion/comment/20504249#Comment_20504249<br><br>", "<b>Username: CU123</b><br><br>Ouch, no sense in not calling someone out…<br><br>", "<b>Username: CU123</b><br><br>BTW, Stanford weather is not San Diego weather, it’s a perpetual 55 degrees rain or shine, sometimes windy sometimes not.  Now if Stanford were in San Diego that would be nice.<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>It isn’t a college town at all - it is an extremely wealthy suburb full of tech money - all those restaurants and shops are too expensive for students and don’t cater to them. The Stanford campus is huge, and removed from town. Students don’t live off campus or hang out off campus.<br>\"\"<br><br>Ya, I’ll disagree with this. I live in the vicinity of Stanford/Palo Alto and it’s a great college town. I see loads and loads of students on University and California Avenues as well in Town & Country Village. Geez have you seen the lines for Philz coffee on Alma? If you can’t walk or bike from campus to Town & Country and/or University Avenue, then I’d say get a gym membership.  :))<br>And the Stanford campus is 800 acres and gorgeous.There’s always a mass migration of students walking to and from the Dish.<br>As for the weather, my D has played soccer for years and years for a club soccer team based in Palo Alto. I’ve spent many an early winter morning (fond memories of those 8:00 AM weekend mornings) at various fields in and around Palo Alto. And I can’t think of many, if any, mornings where I didn’t wear shorts and flip flops to watch or just go for a run during the game.<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>I went to the better Bay Area school – UC Berkeley, go Bears – of often entertained in town bored Stanford students who escaped Palo Alto on weekends. The poor sods. Stuck in the suburbs in a school that looks like Taco Bell.<br>\"\"<br><br>The running joke around here (Silicon Valley) is when you ask a Cal grad why they decided to go to Cal, they’ll answer “because they couldn’t get into Stanford.”<br>I have many relatives that attended Cal and one that currently attends. <br><br>", "<b>Username: katliamom</b><br><br>@sushiritto<br>\"when you ask a Cal grad why they decided to go to Cal, they’ll answer “because they couldn’t get into Stanford.”<br>– And that’s a JOKE? <br>I love the rivalry. Both are great schools and their energies are reflected throughout the Bay Area, a most dynamic place. I had a roommate who did her undergrad at Stanford, then got her Master’s at Cal. She was interviewing for a job and the interviewer looked over her resume, smiled a bit, and said, “I see your taste in school’s improving.” Guess we know where he went to college <br><br>", "<b>Username: The_Corntown_Kid</b><br><br>Because I live in the Bay Area and spend a lot of time in Berkeley, I already know a lot about the rivalry between Cal and Stanford.<br>I’m also not applying to which one I think I would have a better chance at getting in, my stats are very gokd as are my extracurriculars, I’m applying to which one I think I would be a better fit for me.<br>I am touring Stanford in September but as of now I still plan on applying to Stanford Early Action.<br>Does anyone know what the theatre and performance programs are like for both schools? Also I want to hear more about their International Relations and Political Science programs. I’m not going to be majoring in a STEM field, its not my thing at all.<br><br>", "<b>Username: Carino</b><br><br>No doubt Stanford is an extraordinary university, but comparing Chicago with Palo Alto is simply nonsense, weather included. You have to deal with winter weather only two months a year since the students leave campus in the first week of December. The rest of the year the weather is awesome, besides January and February, and, in my opinion, nothing compares to having four seasons.<br>Also, the cultural life, internships, and job opportunities in Chicago can be compared only to NYC’s, and that means a lot to many prospective students.<br><br>", "<b>Username: katliamom</b><br><br>OP, I think you would get better, more detailed answer to your theater/IR/PS questions in the individual Stanford/Cal threads. You’ll find them in the Colleges and Universities forums.<br>Another big thing for you to think about is the Core curriculum at Chicago. It makes for a very different intellectual experience than Stanford’s, which doesn’t have it.<br>Frankly, with all due respect to Stanford, if it’s intellectual breadth and rigor that intrigues you, Chicago’s the place.<br><br>", "<b>Username: sushiritto</b><br><br>The internships and job opportunities in SF/Silicon Valley are inferior to Chicago? You mean besides Silicon Valley being the center of technology, innovation and venture capital?<br>At this point the Apple, Google and Facebook campuses are the size of Chicago.  :))<br><br>", "<b>Username: katliamom</b><br><br>^^^ I don’t know if internship opportunities are better/worse in Chicago, but the OP DID state he/she is NOT into STEM, rather theater, political science and maybe IR<br><br>", "<b>Username: The_Corntown_Kid</b><br><br>I plan on majoring in IR and minoring in Theatre. i want to work in goverment/politics. So STEM-based internships and opportunities arent really my speed<br><br>", "<b>Username: CU123</b><br><br>We’ll besides having a bunch of Stanford and UChicago people argue about the weather and respective qualities of the schools which is always what these threads devolve to, you’ll have to make s decision based on your own research.<br><br>", "<b>Username: CU123</b><br><br>Just to continue the weather thread and since I like facts,  Palo Alto has an average temp of 58.55 degrees so if you can hang out on shorts and thongs at that temp…we’ll go for it. <br><br>", "<b>Username: ThankYouforHelp</b><br><br>UChicago is not strong in theater.  Stanford isn’t either, but it probably is a little bit stronger than UChicago.  Neither is remotely close to places like Northwestern, NYU or CMU.<br>For political science and IR, UChicago is exceptional.  In addition to a strong traditional faculty in these areas, David Axelrod’s non-partisan Institute on Politics brings dozens of speakers to campus, finds hundreds of internship opportunities all over the country for undergrads, conducts workshops, and brings several politicians to live on campus each term to teach students the practical realities of the business (this term these visiting fellows will include former Democratic governor Kathleen Sibelius and the 2016 campaign manager for Republican Presidential candidate Ted Cruz).  The Institute basically jump starts students into careers in politics in a way that perhaps no other school can offer.<br>http://politics.uchicago.edu/<br>Stanford is very strong in political science and IR as well.   The Hoover Institute is there (but it is mostly conservative and I believe it mostly has application to grad students).<br>Either school will serve you well.<br><br>", "<b>Username: Penn95</b><br><br>@“Cariño” Sorry but have to agree with sushiritto here…saying that somehow Chicago has superior job/internship opportunities which are only comparable to NYC is completely untrue. The opposite is in fact true. For most industries SF/Sillicon Valey blow Chicago out of the water. SF/Sillicon Valley is comparable some might say surpassing New York. Chicago falls quite further behind, after NYC, SF, Boston and DC.<br><br>", "<b>Username: Carino</b><br><br>^I was talking about jobs and internships in the areas he/she is interested in…government/politics/theater.<br>SF and Boston?..Really?<br>@sushiritto, he/she is not interested in STEM…<br><br>", "<b>Username: theloniusmonk</b><br><br>\"Just to continue the weather thread and since I like facts, Palo Alto has an average temp of 58.55 degrees so if you can hang out on shorts and thongs at that temp…we’ll go for it. \"<br>Just looking at an average is very misleading, the monthly average high doesn’t dip below 58 degrees in Palo Alto, whereas in Chicago there are five months where the average high is below 50 (cold for us Californians).  PA is more moderate, so the average of 58 means typically highs of 65 lows of 50.  Chicago has an average temp of 50 but more variation. like highs of 80 in the summer and 20’s in the winter.   There are only a few days in Palo Alto where you’d need a light jacket for the cold.  Typically you only need one when it rains.<br><br>", "<b>Username: theluckystar</b><br><br>As I said, Chicago winter helps build character. Palo Alto is too comfortable. <br><br>", "<b>Username: Rivet2000</b><br><br><br>\"\"<br>@ThankYouforHelp Stanford is very strong in political science and IR as well. The Hoover Institute is there (but it is mostly conservative and I believe it mostly has application to grad students).<br>\"\"<br><br>Stanford’s Hoover Institute has a great reputation, and while it may have a conservative reputation there are many liberal voices there as well. Michael McFaul is almost a regular on CNN.<br>Also, while I’m not completely clear on the depth of undergraduate offerings they support, the Hoover Institute hold a freshman class specifically for freshman. Small class size too  <br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>Just to continue the weather thread and since I like facts, Palo Alto has an average temp of 58.55 degrees so if you can hang out on shorts and thongs at that temp…we’ll go for it.<br>\"\"<br><br>It’s a dry heat though.  :))<br>Seriously, I’m surprised it’s that low, because but for a days here or there, I’m nearly always in shorts either going about my daily routine or exercising.<br><br>", "<b>Username: sushiritto</b><br><br><br>\"\"<br>^^^ I don’t know if internship opportunities are better/worse in Chicago, but the OP DID state he/she is NOT into STEM, rather theater, political science and maybe IR.<br>\"\"<br><br>Well, theater requires technology. Robots will be controlling the lights, theater sets, sound, etc. very soon. :))<br>Sorry, I overlooked the OP’s interest in theater and internships and jobs related to that industry. My bad.<br><br>"]}