{"title": "mcgill vs mount holyoke college", "comments": ["<b>Username: intstudent2021</b><br><br>This is probably the weirdest question but here goes<br>So, I’ve been admitted to the McGill Faculty of Arts (Canada) and to MHC in the USA. I’m yet to make a fully final decision.I’m hoping to study Pol. Sci (IR conc) and Econ, and would also enjoy taking basic Marketing courses if possible.<br>Let me know what you people think about every/some factors mentioned.<br>Factors that matter to me- (none of these would have an absolute bearing alone)<br><br>Fees- Oui, McGill is cheaper<br>Reputation- ?<br>Masters (MA/MBA) prospects- ?<br>Job Prospects- ?<br>Internship opportunities-?<br>Courses offered- I don’t think I can take up Marketing at all at McGill cuz diff faculty so that’s bad.<br>Adjusting-?  I’m an international student who has been struggling with some mental health issues. Too much socializing scares me, but I can definitely strike up a convo/get to know people.<br>Extra Curriculars- ? No sports. Singing, dancing, debating, volunteer work, etc<br>Weather- Yesss, I know. (Are the Montreal winters completely unbearable?)<br>Housing-<br>I would love to stay in an apartment (which I will have to do from McGill 2nd yr) but i don’t know if it takes up too much study time.<br>I want to do well academically. I know this sounds stupid to say. But I’m clueless about both the education systems, and studies stress me out to the point of madness.<br><br>Alsooo things to look into,<br>I have a $15k pa scholarship from MHC (its still more expensive)<br>I’ve never visited either of the countries.<br>I can only read and write french as of now.<br>I’m from a tropical country.<br>I haven’t done IB so I will have to do 4 years at McGill although there is a 3 yr option.<br>Thanks in advance &lt;3<br><br>", "<b>Username: TomSrOfBoston</b><br><br>The winters at both colleges are cold and snowy.<br>There is no 3 year option at McGill without IB or AP credits.<br>MHC is strictly arts and sciences, no business courses although you may fit in an elective at UMass Amherst.<br>A knowledge of French is not required at McGill nor as a student in Montreal.<br><br>", "<b>Username: intstudent2021</b><br><br>@TomSrOfBoston yep I know there’s no 3 yr option for me. I meant in general.<br>The french part, okay phew thats a relief.<br>What would you suggest?<br><br>", "<b>Username: PurpleTitan</b><br><br>The experience of studying at a small private female LAC (though part of a consortium, so you’d have access to more classes if you want them) that’s kind of out of the way vs. studying at a massive public urban uni is extremely different.<br>@MYOS1634, how would you describe it to someone like the OP?<br>What can you afford?<br>And wouldn’t you have had to have decided by now?<br><br>", "<b>Username: TomSrOfBoston</b><br><br>Really can’t advise on that.  Totally different environments.<br><br>", "<b>Username: 57special</b><br><br>I feel like you haven’t addressed a few major points about the two schools, mainly;<br><br>one is a women's college, one is most decidedly not.<br>one is a small LAC, one is a very large University.<br>one is in a rural, or at least semi-rural setting, the other is smack dab in the middle of a city. <br><br>Both have prestige and history. I could care less myself, and would strongly suggest you pay more attention to what school is a better fit. McGill is known to be relatively easy to get into(compared to similar schools in the US), but is quite challenging, and it is usually left up to the student to sink or swim. I would guess that Mt. Holyoke would give you more personal attention should you need it.<br>Montreal gets really cold, but central MA is only marginally warmer.<br>Do you want to be in the swing of things in a vibrant, muliticultural city, with it’s excitement and distractions, or do you think you would do better if a small, supportive(hopefully), cocoon-like environment ?<br>Both offer very good to excellent academics.<br>As an International, job prospects would be limited.<br><br>", "<b>Username: intstudent2021</b><br><br>@PurpleTitan I can afford both. MHC is just obviously tougher to afford, but if I believe it is truly better then I can go there.<br>@57special Thanks for your input. I’m not very keen on going to an all women’s college but its not an issue either.<br>I’m unsure about what difference the size makes.<br>I don’t mind rural or urban settings.<br>I definitely would prefer a place that gave me individual attention.<br>However, where these 4 years are going to take me in terms of further education or maybe some work experience is quite important to me. Which would you say is better for that?<br><br>", "<b>Username: RelicAndType</b><br><br>You want to do marketing so you applied to the Faculty of Arts at McGill and a liberal arts college? Something’s not adding up.<br><br>", "<b>Username: PurpleTitan</b><br><br>Size makes a huge difference.<br>What type of education do you get in your home country? Lectures? Seminars? Something else? How many people in a class?<br><br>", "<b>Username: Corbett</b><br><br><br>\"\"<br>I don’t mind rural or urban settings.<br>\"\"<br><br>Just make sure that you understand what “rural” means with respect to MHC. There is a small shopping center across the street from the MHC campus, and not much else within walking distance. This is a school where your horse can live on campus with you.<br>http://athletics.mtholyoke.edu/facilities/equestrian_center/boarding/index<br>While there isn’t much in the immediate vicinity of MHC, it is connected to other towns, schools, and shopping by good bus services.<br><br>", "<b>Username: CrewDad</b><br><br>Intstudent, did you make a deposit at MHC after you were accepted?<br>I see that you were also accepted at Vassar but didn’t receive enough aid to attend. I’m sorry.<br><br>", "<b>Username: intstudent2021</b><br><br>@RelicAndType if you read what I’ve said again, you will see that no, I do not want a major or a minor in marketing. Just thought of taking it up for at least 1 sem in the first yr.<br>Of course I applied for the Arts, where else will I major in Pol. Sci and minor in Econ.<br><br>", "<b>Username: intstudent2021</b><br><br>@Corbett yes, I understand that, thank you. <br><br>", "<b>Username: intstudent2021</b><br><br>@PurpleTitan in my home country, lectures are conducted every day with about 50 people on an average.<br>We have textbooks to mug up and vomit out answers during our exams.<br><br>", "<b>Username: PurpleTitan</b><br><br>That would be somewhat like McGill, at least early on, except with much bigger classes.<br>At MHC, you would have more seminars and student participation as well as faculty who would notice how well you are doing and whether you are learning or not.<br>McGill is cheaper and much better known outside the US but your education would be much more up to you.<br>MHC probably would have better mental health services as well.<br>You are likely to end up back in your home country, BTW. Though it may be easier to stay in Canada than the US.<br>What are goals?<br>Mods really should move this to the International Students forum.<br><br>", "<b>Username: DadTwoGirls</b><br><br>I used to live in Montreal, have relatives who went to McGill, and now live in Massachusetts. So why not, here is my take on your questions and issues:<br><br><br>Fees: In general education in Canada is usually much less expensive than in the US. This can differ in specific cases but apparently this is your experience also. Getting more financial aid in the US but having it still cost more is perfectly normal.<br><br><br>Reputation- McGill has a very strong worldwide reputation. Mount Holyoke is a good school.<br><br><br>Masters (MA/MBA) prospects- This probably depends more on your grades that anything else. See 11 below… However, McGill does have a wide range of Master’s and Doctorate programs.<br><br><br>Job Prospects- Depends widely on what you study, how you do, and where you want to work. You mentioned that you have never been to Canada nor to the US. If you are not a US citizen nor permanent resident, then getting a visa to work in the US after graduation is unlikely. If you get a 3 or 4 year degree from McGill, this entitles you to get a 3 year work visa for Canada (but not for the US).<br><br><br>Internship opportunities- Mount Holyoke is sort of in the middle of nowhere, which makes me wonder what would be around (there are a couple of nice small towns nearby, but not much in the way of large businesses). McGill is in the center of a large city, and quite near the business center of the city. I am not sure about visa requirements in either case.<br><br><br>Courses offered- Obviously McGill is very good at a very wide range of subjects. I am not sure about taking classes between faculties there. I have heard that McGill students can also take occasional courses at Concordia (a slightly larger nearby university, the only other English university in Montreal), but I don’t know details.<br><br><br>Adjusting-? I’m an international student who has been struggling with some mental health issues. Too much socializing scares me, but I can definitely strike up a convo/get to know people.<br><br><br>McGill is a large university which tends to treat you as an “adult”, which means that support is minimal and you have to go looking for it. If you are not doing well and you don’t ask for help, they no one is going to come find you. Mount Holyoke is a very different environment but I don’t know as much about this.<br><br>Extra Curriculars- ? No sports. Singing, dancing, debating, volunteer work, etc<br><br>I am not sure that I understand your comment. McGill has sports, singing, small music events almost every night (for example, students in their excellent music school give concerts), and pretty much anything else that you would want to look for. I recall on our last visit an informal hockey game being played on an outdoor rink on the campus (I am pretty sure that the rink disappears and becomes lawn in the spring). You don’t have to partake in any of it if you don’t want to.<br>I might note that the drinking age in Montreal is 18. Some allege this makes drinking on campus less bothersome, because it brings the drinking students out of their dorms and into the bars, where they are less willing to embarrass themselves and also where they are less annoying to anyone who didn’t walk into the same bar. Drinking age in Massachusetts is 21.<br><br><br>Weather- Montreal winters are fine most of the time, but there will be a few very cold snaps. When you are out of the wind it should be ok. Mount Holyoke will also have “real” winters, but not quite as cold. My wild guess is that there might actually be very slightly more snow in Mount Holyoke, but there will be plenty of snow in either location.<br><br><br>Housing- I would love to stay in an apartment (which I will have to do from McGill 2nd yr) but i don’t know if it takes up too much study time.<br><br><br>There are a lot of apartments very close to McGill, and a lot more one or two or three subway stops away. The McGill students seem to do fine with it. Housing in Montreal is relatively moderate in price. I might add that the crime rate will be very low at either school.<br><br>I want to do well academically.<br><br>Here is a big difference. McGill will be VERY challenging academically. The top universities in Canada, particularly McGill and Toronto, compared to top universities in the US are easier to get into but once there harder to graduate from. You will need to work very hard there, and put in very long hours. If you are very smart and work very hard then you can learn an enormous amount at McGill from professors who really know their stuff. But, this is important: YOU HAVE TO WANT TO DO IT. It is very hard to get an A at McGill.<br>In comparison, Mount Holyoke will not be as academically challenging. It will still be academically very good but it will be easier to get an A (or all A’s).<br>One question: Which will make it easier to go to graduate school? It is hard to say. If you get straight A’s at McGill, then this will be impressive even to the top graduate schools in the US and elsewhere. However, this will be very difficult (or impossible) to do. For most people, getting A’s at Mount Holyoke will probably be so much easier that they will get into graduate school more easily than they would have at McGill.<br>“I can only read and write french as of now.”<br>You don’t need any French at all to go to McGill. If you learn to speak a little bit (un petit peu) of French this will enhance your experience living in Montreal.<br>“This is probably the weirdest question”<br>This is indeed an Apples versus Watermelons sort of comparison. But I can see why it is not an easy choice to make.<br><br>", "<b>Username: PurpleTitan</b><br><br>I imagine that MHC would have on-campus recruiting and in general offer much more career services than McGill. However, as an International, your ability to work in the US may be impeded.<br><br>", "<b>Username: intstudent2021</b><br><br>@DadTwoGirls  I cannot thank you enough for taking the time to do this.<br>Oh and by ‘No sports. Singing, dancing, debating, volunteer work, etc’ I meant I’m not into sports but definitely into the other stuff I mentioned.<br>If I were to consider all the things you mentioned, McGill would have a higher standing. However, the academics part still holds me back. I have heard before as well that most Canadian colleges do deflate the grade and its tough to get an A at all. But then I was told that this is only the case with the Science courses and its not like that in the Arts. I don’t know how far this is true (could somebody confirm?)<br>Also, you mentioned that since MHC gives better grades, I may get better Master’s opportunities. What I’m confused about is, aren’t the colleges aware of the system followed in Canada/McGill? I was hoping they would consider the fact that people do get significantly lower grades as per the marking system followed.<br>After reading all of your answers I have also come to understand that the weather may not be extremely different in the two places, so I guess I will rule that factor out.<br><br>", "<b>Username: DadTwoGirls</b><br><br>“But then I was told that this is only the case with the Science courses and its not like that in the Arts”<br>I have heard that this is also true in the faculty of arts. However, I don’t know anyone who studied in the faculty of arts.<br>“aren’t the colleges aware of the system followed in Canada/McGill?”<br>To some extent yes. The last time that I looked (several years ago) McGill didn’t even publish the GPAs of students that they accepted into medical school. I suspected (but never found any real information) that this was because they understood how hard they themselves grade in premed, and adjust for it. I doubt that other schools fully adjust for it however.<br><br>", "<b>Username: tk21769</b><br><br>Most LACs will treat you as an adult (just as much as universities do). Nobody comes around in the morning to ask if you remembered your vitamins or to take your dirty clothes to the laundry. The big difference is that classes at a LAC are consistently small (usually &lt; 20 students, seldom 50 or more); there are no (or few) pre-professional majors (architecture, business, engineering, etc.); total focus is on undergrads; there are fewer majors and course offerings.<br>In some respects, LACs may be more challenging for undergrads than research universities, although I’m generalizing here (not directly comparing McG & MoHo). At a LAC, you generally can’t sleep your way through a lecture class without the professor noticing. You can expect more class discussion. You’ll probably have more faculty-graded writing assignments, more essay (or short answer) questions on exams, and fewer easily-graded multiple choice (or true/false) tests. You’ll be expected not only to keep up with the reading for class, but also to think about and discuss it, starting in year one. If you cut classes, your absence is more likely to be noticed soon. Grading standards could be tougher or easier (it depends on the school).<br>Montreal should have a strong edge in internship opportunities over South Hadley and Amherst (although I’m not familiar with how jobs/internships work for internationals in Canada.)  If money is no object, Montreal is a great restaurant city with shops, museums, etc., that you won’t find in the South Hadley area.<br><br>", "<b>Username: PurpleTitan</b><br><br>^ Richer remote LACs bring entertainment on-campus, though I don’t know how MHC is in that area.<br><br>", "<b>Username: skieurope</b><br><br>MODERATOR’S NOTE:<br><br>\"\"<br>Mods really should move this to the International Students forum.<br>\"\"<br><br>OP is asking about 2 colleges, so this is the correct subforum.<br><br>", "<b>Username: intstudent2021</b><br><br>@tk21769 thanks for your inputs!<br>I know this may not be easy to answer but, now I that I know the difference properly, what would you people choose in my position?<br><br>", "<b>Username: PurpleTitan</b><br><br>^ Wouldn’t that depend on goals (as well as strengths and weaknesses)?<br>What are your potential endgames?<br>BTW, you would likely get more insightful letters of recommendation from faculty at a LAC as well.<br><br>", "<b>Username: 57special</b><br><br>Most LACs will treat you as an adult (just as much as universities do). Nobody comes around in the morning to ask if you remembered your vitamins or to take your dirty clothes to the laundry.<br>That’s funny, because at a recent visit to a top 10 LAC we were told that(paraphrasing), \" We are like a family and look out for one another. For example, if you are not in a morning class we’ll send someone around to make sure that you are OK and haven’t slept in.\"<br><br>", "<b>Username: tk21769</b><br><br>If you were one of my kids, I’d rather visit you in Montreal than in South Hadley MA.<br>In other respects (but before considering costs) I’d lean toward MoHo.<br><br>", "<b>Username: OHMomof2</b><br><br><br>\"\"<br>That’s funny, because at a recent visit to a top 10 LAC we were told that(paraphrasing), \" We are like a family and look out for one another. For example, if you are not in a morning class we’ll send someone around to make sure that you are OK and haven’t slept in.\"<br>\"\"<br><br>My kid’s first year dean said something very similar at the parent orientation in regard to a first year student beginning to flounder academically. If the student wasn’t responding to emails etc the dean said he’d go find them in their room.<br><br>", "<b>Username: Lindagaf</b><br><br>I didn’t read all posts, but you seem to be heavily leaning towards MHC. You will get a lot of personal attention there and will undoubtedly form close friendships with people. LACs do make an effort to provide entertainment and actvivites. Maybe it willbe boring in occasion, but it’s very tiresome being in a city 24-7. I think the quality of education will be better at MHC and I would choose it in your shoes.<br><br>", "<b>Username: PurpleTitan</b><br><br>@Lindagaf: I think you should read through all the posts.<br>The OP was leaning towards McGill.<br><br>", "<b>Username: 57special</b><br><br>And I don’t agree at all that the quality of  education would be better at MHC. McGill is  large Uni filled with brilliant people from all over the world in an interesting, unique, location. The only thing some of us are doubting is whether the OP is up for the challenge. MHC seems to be the safer choice, but who knows, really? Some people fall in love with Montreal.<br><br>", "<b>Username: PurpleTitan</b><br><br>@57special: Depends on what you consider “quality of education”. Yes, McGill will have some very bright people and very challenging classes.<br>It also will (at least early on) have gigantic lectures with pretty much no student participation and nobody’s going to care if you struggle or fail or drop out.<br><br>", "<b>Username: 57special</b><br><br>And they also have small, stimulating discussions both officially, and informally, at Profs offices, homes,<br>or late night brainstorming sessions in coffee shops along St. Denis or in Old Montreal. The huge lectures do happen, but please don’t  give the impression that is all that happens. MHC might be very safe, though perhaps stifling. McGill and it’s surroundings will be more  stimulating for most people, and certainly more diverse.<br>It depends what the OP is looking for. The mention of mental health issues gives me pause.<br><br>", "<b>Username: OHMomof2</b><br><br><br>\"\"<br>The mention of mental health issues gives me pause.<br>\"\"<br><br>Services there are worth looking into. Some schools have better resources for that than others, and it’s not always a big v small school thing.<br><br>", "<b>Username: DadTwoGirls</b><br><br>“The only thing some of us are doubting is whether the OP is up for the challenge.”<br>I wasn’t doubting this. I don’t know OP at all. I was just asking OP to decide for himself whether or not he feels that he wants the challenge. To some extent every student has to decide this for himself or herself.<br>“McGill will have some very bright people and very challenging classes. It also will (at least early on) have gigantic lectures”<br>During a tour I sat in the largest lecture hall at McGill. I did not count the seats, but as far as I could tell it is the same size as the largest lecture hall at MIT, the room where I studied freshman physics. (Okay, I checked, the largest lecture hall at McGill seats 600, the largest at MIT seats 566).<br>“It depends what the OP is looking for.”<br>I agree.<br><br>", "<b>Username: Alexandre</b><br><br>Both great school. Neither is “better” than the other, and neither will provide its graduates with better odds at success. McGill obviously has a stronger reputation globally. Few people outside of the Northeast have even heard of MHC. but where it really matters, among graduate school admissions committees and potential employers, I think the two are highly regarded.<br>I would recommend going for fit. McGill is a large, urban, coeducational, public research university. MHC is small, private, rural-ish, women’s liberal arts college. This is a fairly easy choice if you ask me. Where would intstudent2021 be happier?<br><br>", "<b>Username: PurpleTitan</b><br><br>@DadTwoGirls: MIT (and any research U) would also have gigantic (or at least big) lectures.<br>But the OP isn’t comparing MIT as an option.<br>MHC won’t have classes of that scale.<br><br>", "<b>Username: intstudent2021</b><br><br>I guess, since I don’t have a specific choice of “environment”,  it would come down to a college where there are higher chances of me getting good grades, but no good ranking, etc vs a Uni that is quite well reputed internationally.<br>And that’s confusing<br><br>", "<b>Username: intstudent2021</b><br><br>Also, I do realize that I will have a more “family-like” protected environment at MHC, which really means a lot to an international student, and takes away some of the anxiety of studying 8500 miles away from home.<br>But then I also think that McGill will kind of force me to become more independent and responsible, which may be scary in the first few months but would help me greatly in the long run.<br>What do you guys think about that?<br>Again, this is the weirdest but the toughest choice I have had to make.<br><br>", "<b>Username: OHMomof2</b><br><br>Does McGill offer courses in French? Obviously there’d be more french speaking people around, if that matters to you,<br><br>", "<b>Username: PurpleTitan</b><br><br>You don’t care about the environment probably because you can’t envision both. It seems like there is nothing like a LAC in your home country.<br>I doubt many people would be indifferent between the two very different environments.<br><br>", "<b>Username: DadTwoGirls</b><br><br>“Does McGill offer courses in French?”<br>McGill, like most universities, offers language courses. This includes courses intended to teach French, and well as courses intended to teach many other languages.<br>Other than language courses, all courses at McGill are taught in English. Other than language courses, tests are in English but students if they prefer are allowed to instead take tests in French. I have heard that very few students do this however, (nearly all take tests in English).<br>“Obviously there’d be more french speaking people around,”<br>Yes. My impression is that the vast majority of restaurants and stores near the McGill campus (and near the nearby Concordia campus) will have many employees who are bilingual. There will be many people in Montreal who prefer to speak French, as well as many people who will speak either French or English with equal ability and equal comfort.<br><br>", "<b>Username: DadTwoGirls</b><br><br>@intstudent2021 said: “What do you guys think about that?<br>Again, this is the weirdest but the toughest choice I have had to make.”<br>I agree that this is a “weird” choice, but I can also see that it is not an easy choice. It is a pity that you don’t get to visit, but I can see that it would not be easy to travel to both the US and Canada to visit the two universities. You appear to be making a very reasonable and thoughtful attempt to make a well informed decision.<br>I don’t think that there is any bad choice here. Good luck whichever you choose.<br><br>", "<b>Username: intstudent2021</b><br><br>@PurpleTitan You’re right, there are only 2 liberal arts colleges in my home country but they’ve taken that name and provide the same type of education as any other university, so I really am having a hard time envisioning myself anywhere.<br>@DadTwoGirls I’m trying my best to not mess this choice up since its not just about my future work/education but also a lot of my parents money and I hope to make it worth every penny they spend on me. Thanks for your kind words <br><br>", "<b>Username: intstudent2021</b><br><br>@Alexandre If I knew that then I’d have chosen by now <br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>After reading all of your answers I have also come to understand that the weather may not be extremely different in the two places<br>\"\"<br><br>The seasons at these locations would follow the same progression, but you would find quite a difference in temperature between them:<br>Average January Low<br>S. Hadley: -9°C, 15°F<br>Montréal: -17°C, 2°F<br>(Sperling’s.)<br><br>", "<b>Username: merc81</b><br><br>For perspective, populated parts of Alaska tend to be warmer than Montréal during winter nights. In the case of Alaska’s largest city, Anchorage, January nights typically average -13°C (9°F).<br><br>", "<b>Username: PurpleTitan</b><br><br>You can travel large parts of Montreal underground, however.<br><br>", "<b>Username: merc81</b><br><br>To be clear, I wasn’t expressing a preference for one climate over another, but think the differences between them should be made as clear as possible.<br><br>", "<b>Username: TomSrOfBoston</b><br><br>Yes winters in Montreal are cold and snowy but the Montréalais do not hibernate:<br>https://www.youtube.com/watch?v=adnt79JlRU4<br><br>", "<b>Username: bouders</b><br><br>One thing that OP should consider is the  different academic calendars that the 2 schools have: https://www.mtholyoke.edu/sites/default/files/registrar/docs/2017_18.pdf<br>https://www.mcgill.ca/importantdates/key-dates  Also, a full course load at McGill  is defined differently than a full course load at MHC.<br><br>", "<b>Username: intstudent2021</b><br><br>Hey everybody, thanks for your inputs. I’m most probably choosing McGill between the two (hoping they don’t rescind my offer haha).<br>Factors I considered were-<br>Cost<br>World reputation/ ranking<br>Internship opportunities<br>Option to take certain electives from Deslautels at McGill<br>Better post grad/work chances<br>Some people advised me not to go to the US as it might become a pain to get work and good opportunities for internationals cuz of the current political scenario. (I don’t think I really considered this but I did hear this from a lot of people so I’m mentioning it)<br><br>"]}