{"title": "wpi vs rpi", "comments": ["<b>Username: MQD</b><br><br>Any thoughts?<br><br>", "<b>Username: dadinator</b><br><br>This subject has come up in the past. This thread is from a few years ago:<br><br><url>http://talk.collegeconfidential.com/rensselaer-polytechnic-institute/676824-rpi-wpi.html?highlight=wpi</url><br><br>Hope this helps!<br><br>", "<b>Username: catrin17</b><br><br>We need to make that decision soon.<br><br>My son just got accepted into RPI - Computer Science with emphasis on Game Design. We are waiting to hear from WPI. WPI is his first choice based on location, but it will all come down to money.<br><br>We are visiting RPI in two weeks, however. We were actually surprised with his offer - his GPA is relatively low, but he had great SAT scores.<br><br>I am not that hopeful on WPI for some reason. They say they had a record number of applications and it is becoming increasingly more difficult to get accepted.<br><br>He LOVED that campus and school, however. WPI is really his wish school.<br>Catrin<br><br>", "<b>Username: Mom2kids</b><br><br>MQD - why those two colleges? Is your son a Jr or already applied? If you are asking for next year, I'd say cast a wider net and look at schools that have lots of strengths. I'd look at schools that have a good general core of classes that all students need to take. That will give exposure to other fields.<br><br>Harvey Mudd is a good one for its core and I'll bet quite a few others. Maybe even some liberal arts colleges with strong computer science programs. Anyway, just a thought!<br><br>", "<b>Username: MQD</b><br><br>Thx all. He was accepted into RPI and waiting to hear from WPI.<br><br>Gaming is his first priority but has other interests that I want to make certain are kept alive.<br><br>", "<b>Username: catrin17</b><br><br>Looks like we are in the same boat. The waiting is hard!! We are heading up to RPI next week. Hopefully WPI news will be good and come out soon.<br>Good luck!<br>Catrin<br><br>", "<b>Username: MQD</b><br><br>We have not visted either since we are in the west coast. Good luck to you. I am interested to hear your thoughts after the visit.<br><br>Do you have any opinions about Miami University. DS was offered a full tuition merit scholarship and we are weighing the benefits such as small program in big school, growing program in 15-30 ranking, good boy/girl ratio, happy safe place, balanced atmosphere, eager/entrepreneurial attitude, good graduate school acceptance but ... Far away, newish program, not yet as highly rated, not well known out west ... Etc.<br><br>", "<b>Username: GraniteStateMom</b><br><br>My D had to make that decision last year. She was on the fence until the last minute. Drove me nuts! In the end, she chose WPI which she felt was the better fit for her. It has turned out to be an excellent choice for her.<br><br>You really can't go wrong with either school. Some people like to argue about which one is better, but in my opinion, they are pretty much academic equals. There are some differences, however, that are important to consider.<br><br>Size of school: WPI has a somewhat smaller undergraduate population and a significantly smaller campus<br><br>Location: Worcester vs. Troy; No great winners there, but some people prefer one over the other.<br><br>Terms vs. semesters: How does your student feel about taking 3 complete classes for 7 weeks? Both schools offer rigorous courses, but the 7 week terms can be challenging for some students. The pace of the classes is very quick. Students either love this or hate this.<br><br>Project based curriculum: How does your student feel about doing 3 major projects in their 4 years? Again, students either love this or hate this. On the plus side, these projects foster interdisciplinary work among students in real world settings which is appealing to employers. Negatives are that these projects are time consuming, challenging, and some students just don't like learning in this way<br><br>Structure of curriculum: It seems as though RPI structures their curriculum more than WPI. While WPI has guidelines for each major about which courses need to be taken, the student needs to take the initiative to make sure that all required courses are taken. RPI had nice tables outlining exactly which courses need to be taken each semester in order to meet graduation requirements. If your student is very organized, it probably won't matter. If s/he is disorganized, the greater structure may be helpful.<br><br>Extracurriculars: Both schools have a wide assortment of ECs. WPI has excellent instrumental and vocal performing groups that tour worldwide. RPI also has music groups and a beautiful performance space. Both are D3 schools for sports, but RPIs men's ice hockey team is D1, so games are great.<br><br>Non STEM curriculum: Both offer a variety of humanities courses. If your student decides that a STEM major isn't for them, I don't think either school is stellar (with the possible exception of business at RPI), but in my opinion RPI edges out WPI on this one.<br><br><br>YMMV, but hope this helps. This is just the opinion of one mom who's student loved both schools and looked very carefully at each of them in order to make a decision.<br><br>In my opinion, you can't go wrong with either school; you just have to decide which is a better fit for your student.<br><br>", "<b>Username: catrin17</b><br><br>Thank you granitestatemom for your perspective!!<br><br>", "<b>Username: Snowdog</b><br><br>Granitestatemom - which of two has the project-based curriculum? (I think my son would prefer the other LOL.)<br><br>", "<b>Username: GraniteStateMom</b><br><br>WPI has the project based curriculum. Here is a link to more information:<br><a href=\"http://www.wpi.edu/academics/Projects/index.html\" rel=\"nofollow\">- Welcome</a><br><br>On the plus side, many students do at least one of these projects abroad.<br><br>", "<b>Username: dadinator</b><br><br>My S had to make the same decision 4 years ago.<br><br>He liked both schools very much, but ended up going to RPI because it had a program that he was very interested in (Information Technology).<br><br>Being from a very small high school, he did like the smaller feel to WPI.<br><br>Both are great schools. I agree that it is just a matter of personal fit.<br><br>", "<b>Username: KD94025</b><br><br>DS and I visited both campuses last year. I think both are excellent schools. WPI's campus is more intimate. RPI's is very nice (really large quad - my son's eyes lit up, because he loves ultimate frisbee).<br><br>RPI has a higher reputation, but I think that WPI has made strides to close that gap, but is still more regional.<br><br>My understanding is that WPI has FOUR 7 week terms (A,B,C and D) in a standard school year (starts in late august, ends in early May). The scholarship and financial aid paperwork refers to all four sessions. RPI is on a standard semester program.<br><br>WPI just completed construction of new dorms and I think the new athletic facility is open or will be by fall. They've increased their student population and have been catching up with space. I did think that the dorms we saw at RPI were a bit run down...and when we toured WPI showed doubles that were being occupied as triples...so - kind of a ding on both.<br><br>Last, but not least - we got much better financial aid offered from RPI. Although WPI has stated it wants to improve its performance on average student debt at graduation, it's also clear that it considers students and families responsible for the cost of education, not that they don't have some good scholarships...<br><br>We are waiting on hearing back from some UCs, so the decision making is tough...there are also a few LACs on our list (an odd compilation...). Best of luck to all who at least have this choice. Both schools had record-breaking application years.<br><br>", "<b>Username: KD94025</b><br><br>Oh, one more thing. To the post regarding planning your degree... I found this tool quite a while back and thought that this was an excellent planning tool at WPI. <a href=\"http://www.wpi.edu/Admin/OAA/Designs/academic.html\" rel=\"nofollow\">Office of Academic Advising - 1. Academic Overview</a>. I thought this was actually one of the best planning tools I had encountered at a college - wish they ALL worked this way.<br><br>", "<b>Username: Mom2kids</b><br><br>KD94025 - Do you know the numbers on applicants this year for WPI? Is it listed somewhere?<br><br>Thanks!<br><br>", "<b>Username: lotsalego</b><br><br>Can someone (GraniteStateMom?) explain a little more about the projects at WPI? I have looked at several links but still don't have a clear picture of how this works. Do the students do these projects alone or in a team/as part of a group?<br><br>There is a lot to like about project-based learning, I think, as it is the way the \"real world\" often works. But \"projects\" makes my kid think of those horrible group projects in high school in which one or two kids do all the work while the rest of the kids slack off. Presumably this is not like that?<br><br>It also sounds like you would have to be very organized and a self-starter to conceive of and succeed at a project -- true? Do the kids (esp. in early years of school) get a fair amount of oversight and guidance?<br><br>Many thanks for info.<br><br>", "<b>Username: dadinator</b><br><br>Mom2kids - here is a release on the number of applicants at WPI this year - 12% increase this year:<br><br><a href=\"http://www.wpi.edu/news/20123/2013admins.html\" rel=\"nofollow\">WPI Achieves Record-Breaking Number of Undergraduate Applications - WPI</a><br><br>", "<b>Username: GraniteStateMom</b><br><br>lotsalego- my D is just a freshman, so I don't have any 1st hand experience yet, but I can share what I've heard from her upperclassmen friends. Also, my H graduated from WPI eons ago and the project curriculum was in place way back then. Although some details have changed, they are still pretty similar. I believe that students have an advisor for each project.<br><br>Humanities (formerly called sufficiency) - based on a series of related classes that students take. D is taking Arabic language, history, and culture classes. No idea what she will do for a project. H took music classes and performed a solo recital for his project. from what I understand, these projects are usually done individually (as opposed to groups) and are pretty flexible. Many students do this their Sophomore year, but it can be done at any time once the courses are taken.<br><br>IQP - this is done Junior year and is collaborative with students from different majors. Many students choose to go abroad to project centers where there is a specific, real world problem to address. I have heard of students working in Africa on water delivery systems. It sounds like the centers are well organized and supervised. I would expect that slackers in the group would not go over well.<br><br>MQP - done senior year and is basically research with an advisor in your major. D is a BME and I have heard of students doing research at UMass medical school (also in Worcester). My H was Chem E and researched something with zeolites. I believe that these are individual projects.<br><br>Not sure this was helpful. Maybe someone else who has more knowledge about the projects will chime in!<br><br>", "<b>Username: lotsalego</b><br><br>Definitely helpful -- thanks GraniteStateMom!<br><br>", "<b>Username: BeanTownGirl</b><br><br>MQPs can be individual or group projects and can be done on campus or away. Each major has its own project sites for MQPs. CS majors for example can go to Wall Street, Budapest, Silicon Valley, Japan or at do them at some local companies such as Microsoft's Cambridge office.<br>IQP sites are all over the world but you can also complete them in Worcester or Boston. My son is looking forward to going to Copenhagen next year for his IQP.<br>The humanities/arts project is not always a true project, though it can be. You have to demonstrate depth in an area of Humanities/Arts. My son for example is taking German and the completion of the high level courses in German satisfy the requirement. There is a lot of flexibility.<br><br>We too compared WPI and RPI. My son really liked the smaller, more intimate campus at WPI and thought the students seemed \"happier\". Just his impression of course. And although Worcester is not the greatest city he (and we) liked it better than Troy.<br>I think WPI and RPI get compared more than any two schools I can think of except perhaps the eternal Bates/Colby/Bowdoin debates. They are very similar in terms of majors offered (though RPI is bigger), size, lopsided male/female ratio, and the types of students that go there (STEM kids, pretty nerdy!).<br>Other things - the new 4 story Sports and Recreation Center opened last August. They are building a new apartment-style dorm right now for next fall. Agree that the freshman dorms are not the greatest, but options are better after freshman year.<br>Apps are up 12% but apps from females are up 17% :)<br><br>", "<b>Username: HPuck35</b><br><br>My DD is a junior and is in the middle of her IQP. She is in London for the term.<br><br>One interesting facet about the IQP project is that you have to write a resume and apply for some (all?) of these projects. The more popular centers will have more people apply than can be accomodated. So, they conduct interviews and review the resumes to decide who gets to go to that project. Kind of like applying for a job the way I see it. A very valuable experience but can be disappointing if you don't get selected (as happened to one of my DD's roommates).<br><br>An IQP project outside of Worcester (yes, there are some right on campus or at least in town) does get a little pricey. You are on the hook for airfare, the extra rent of the project housing (apartments around the WPI campus come with year leases and just because you are out of town, it doesn't go away) as well as the \"vacation\" type weekend trips.<br><br>", "<b>Username: MQD</b><br><br>I read WPI is going to the semester system for Fall 2013<br><br>", "<b>Username: dadinator</b><br><br>You might mean RIT:<br><br><url>http://www.rit.edu/~w-conver/</url><br><br>", "<b>Username: gsmomma</b><br><br>The schedule for next year at WPI is already released, and it is the same 4 7 week terms.<br><br>", "<b>Username: tpcrd66</b><br><br>Hi all! MQD and catrin17...my son is a junior and sounds like we are following your paths...starting our visits next week to look at Game Design schools. WPI and RPI are on our list. Anxious but terrified to get started. Do you mind my asking where else you looked? Unfortnately, like many, $$ will be an issue...any \"generous\" offers? Would love to hear your son's final decisions!! Best of luck!<br><br>", "<b>Username: KD94025</b><br><br>Sorry for my tardy post, Mom2kids...I see the link above... I know that initially I read that RPI had 10% less applications, but actually they ultimately reported that they had 6% MORE applications this year...with very few exceptions schools posted increases again this year...it's nerve-wracking.<br><br>Last year, WPI had a record-breaking 7500 applications and admitted around 4000. About 1000 enrolled.<br><br>I think the reason for enrollment and application growth is primarily that the school has a spectacular reputation for post-graduation employment and for providing a first-class education. They've been struggling to keep up with enrollment which exceeded their projections.<br><br>Best of luck to you!<br><br>", "<b>Username: KD94025</b><br><br>My son and I went to the Silicon Valley open house, and we saw presentations by groups of students who were working offsite for a term. I have to say I was extremely impressed with the diversity and general competence of the groups...<br><br>", "<b>Username: MQD</b><br><br>Hi tpcrd66,<br><br>The schools DS applied to for gaming were on the Princeton Review top gaming design program list, were well regarded and generally known on the west coast as well, had a broad curriculum since he has many interests, and spanned a range of schools so that he might be offered $$. We were advised many years ago to attend a college where the student will excel and the school will pay the way. Prestige should be reserved for graduate school. So much can happen in UG that taking on debt is risky and consider the ROI. Taking on debt for a masters with potential for much higher pay is a better bet.<br><br>Two DSs of friends so far are looking at $10 per hour jobs out of top five schools for industrial design and film. Each put at least $200,000 into their child's education, each child had excellent SATs. Both are likely in the middle of their class as far as performance.<br><br>Once again, I suggest have someone pay the way and have your child end up close to top of their program.<br><br>DS applied to<br><br>Rensselaer - accepted<br>Worcester - ?<br>Rochester - accepted with nice scholarship<br>USC - ?<br>UCSC - accepted - instate<br>Miami of Ohio - accepted with great scholarship<br>Case Western - rejected<br><br>My son had a medical episode for a few months in Sept of senior year from which he has fully recovered but his grades suffered. The results are colored by this hiccup. He also has ASD (Asperger's Syndrome) and wanted to make certain that it was not a big deal for the school he attended so he provided full disclosure.<br><br>ACT<br>Comp = 33<br>Science = 35<br>Critical Reading = 35<br>English = 32<br>Math = 30<br>Writing = 10<br><br>More than you asked for but in the midst of deciding and this post is helping me sort out the important issues, reminding me of advice I was given.<br><br>Hugs to us all!<br><br>", "<b>Username: tpcrd66</b><br><br>Hi MQD...thank you for your reply! Wow!! Congrats to your son on incredible acceptances/awards...no doubt he will be accepted to his couple of pendings!<br>I'm anxious to hear what he decides. Are you planning to visit Miami Ohio? It's nice to have lots of options :)<br><br>", "<b>Username: MQD</b><br><br>Yes, we will be visiting Ohio sometime in April. He is flattered about the scholarship and this last weekend we met the Director of the program that houses gaming. DS was quite impressed.<br><br>Last night on LinkedIn, I made use of my InMails and sent our notes to 15 people listed as designers in game companies, large and small. I asked for their opinions of the schools where he was accepted and also any thoughts thy ould pass on. So far 5 folks have responded and my son is in awe. These random guys are carrying lots of weight with DS.<br><br>Basically they do not care what school you attended. They only care what you can do and what you have already produced. One fellow did mention that UCSC has a great geographic advantage since it is just over the hill from SV and they are a rising star with industry leaders in residence and large enough to have a powerful alumni network.<br><br>At the end of the day, who you go to school with and the alumni network is what will carry your career, not the school.<br><br>", "<b>Username: tpcrd66</b><br><br>MQD...I've been following your posts and anxious to hear how your visits go these next couple of weeks and what your son's final decision will be! Good luck!<br><br>", "<b>Username: Dustyfeathers</b><br><br>Bump: I'm starting this process. I'd love to hear about what schools you ultimately chose and how your children love (or hate) them. Please tell me about WPI, RIT, RPI, UCSC, etc.<br><br>Thanks!!<br><br>", "<b>Username: Gaming2013</b><br><br>Dustyfeathers, I think you and I may be in the same boat? my s will major in game d&amp;d and interested in WPI, RIT, RPI, Drexel and Champlain. We visited WPI, RIT &amp; RPI over the summer. He felt at home at RPI but could see himself at RIT as well.<br><br>", "<b>Username: catrin17</b><br><br>Hello... found myself here again tonight after I was doing some research.<br>I was one of the posters on page 1.<br>My son is now a Freshman at RPI, majoring in GSAS - Game Simulation Arts and Science. He loves the school and program, but I admit is finding the course load very difficult. Hopefully he will get back on track second semester and learn how to manage his time.<br>He was accepted to RPI, RIT, Drexel, Stevens, Wentworth, URI and UMass.... but did not get into his first and second choice, which were WPI and Northeastern. We were happy to chose RPI based on the program, campus and more than anything, how much money they offered off the very expensive tuition.<br><br>My son is not unlike many boys who struggle.... High SAT scores, Lower Grades, Bad (or no) study habits. RPI, however, has offered a very concrete plan for his second semester. I love the support they have offered.<br><br>", "<b>Username: GraniteStateMom</b><br><br>@catrin17 - Glad to hear that your son is happy at RPI. Also glad that RPI has helped put together a plan to help for his second semester. One of the things that impressed me about RPI when my D was deciding between the 2 schools was the amount of support they have in place for Freshman. I hope your S has a fabulous 2nd semester and continues to enjoy his time at RPI.<br><br>", "<b>Username: worldspirit</b><br><br>Any more recent experiences contrasting the cultures of RPI and WPI?<br><br>Past posts report a friendlier and more cooperative climate at WPI (+ projects and quarter system). Bigger campus with more sport opportunities at RPI. The campus size is an objective measure (easy to see by reading data or Google Maps). Any other notes around the culture of these two schools?<br><br>This post, shared earlier, highlighted observations from 5 years ago. Is this consistent with what visitors to both schools experience these days? <url>http://talk.collegeconfidential.com/rensselaer-polytechnic-institute/676824-rpi-wpi.html?highlight=wpi</url><br><br>", "<b>Username: BeanTownGirl</b><br><br>These two schools are more alike than they are different. Similar majors offered, similar types of applicants.<br>I think most kids that apply to one also apply to the other. I don't think there is a big culture difference at all.<br>My son preferred the smaller, friendlier vibe he got from WPI. Also, he really like the concept of the IQP and MQP - the two biggest projects that are required. He is currently in Copenhagen for the term working on the IQP, and had the option of doing his MQP next year abroad as well (though he decided to stay on campus). On the weekends he has traveled to other parts of Denmark, and over Easter break he went to Berlin and Prague.<br>He slightly preferred Worcester over Troy as well.<br>I would urge anyone to visit the campuses thoroughly and perhaps more than once.<br><br>", "<b>Username: blevine</b><br><br>Likely going to have to make this choice. S got into WPI EA and have reason to believe he'll get into RPI too.<br>We visited both, as a parent, liked both campuses, did not like either city. S not thrilled about M-F ratio<br>at either school, his main hesitancy about both (he also applied to larger universities and got into our state flagship or engineering, which we have yet to visit).<br><br>At RPI/WPI visits, did get a warm and fuzzy feeling from some encounters, less warm at other encounters, at both campuses. I think you will get a wrong impression from anecdotal experiences spending a day on a campus. Students seemed really happy at WPI. Excellent treatment from school at RPI (profs and athletic staff).<br>Did not get to meet any profs at WPI.<br><br>Good to have choices, 2 good ones so far, waiting on RD RPI and others.<br>Leaning towards RPI due to academic reputation and athletic interest by a coach.<br>But really liked WPI (and cost of state flagship).<br><br>", "<b>Username: 4getit</b><br><br>Ditto what BeanTownGirl is saying. The IQP and MQP at WPI are fantastic opportunities. My S did not do his IQP abroad, but I imagine that it is a great experience if you get one. What does your S like outside of school? Is he into music? There are many music electives available. The best thing is that with a couple of AP credits, S had enough time to earn a music minor (major is not available in Music). He was never a singer, but joined the WPI Men's Glee Club to earn additional arts credit. Ended up loving it and even went to London one summer with the Glee Club and Alden Voices (girls). S completed an MQP that combined his interests of ECE and Music. He is now working in software engineering. He said he talked a lot about his MQP during job interviews. He also has had several instances on the job where he has been able to call on things he learned as part of his MQP. Not sure where you are geographically, but Worcester is easy to reach from Boston's airport. There are a couple of shuttle companies that make it pretty easy.<br><br>", "<b>Username: frontpage</b><br><br>WPI and RPI are both great schools. Disclaimer: I am a WPI alumni.<br><br>The MQP is a unique opportunity but you can do something similar elsewhere, though it will not be required. If you go to another school, there are opportunities to do something a design project similar in philosophy to WPI's MQP (ex. the Cornell Cup Embedded Competition, DARPA Robotics Competitions, etc) but you'd have to be more proactive. I did some of these design competitions and also did an MQP.<br><br>Similarly, there are more research opportunities at RPI and it will be easier to get into a PhD program. But this doesn't mean that you can't do research or get into an top PhD program from WPI (and many students have done this, just not as many as RPI). If you have an interest in research, you will have to be proactive and you can find professors who will advise you. And there is also the option of doing an REU.<br><br>Both schools can provide excellent preparation for a job and grad school. They both are engineering focused schools with a more pragmatic focus. Time is zero sum and a mandatory design project comes at the cost of possibly fewer upper division and graduate courses and less time to spend on research or social life. Though if you are interested in research, you can do a research-focused MQP (and there are many examples of this). You will have to weigh what is important to you.<br><br>At the end of the day, your personal qualities and how much you learn matter more than where you go to school. Optimize for maximizing your personal growth and learning when you decide where to go to school (within constraints of cost, geography, etc).<br><br>", "<b>Username: GraniteStateMom</b><br><br>I'm not sure about PhD programs, but my experience with my D (who was a freshman on page 2 of this thread and is now a senior at WPI) has applied to several masters programs. She is a BME major with a biomechanics concentration and wants to get her masters in ME with a biomech concentration. Her MQP advisor helped her pick some excellent programs and she has been fortunate enough to get into all of them so far (interestingly she is still waiting to hear from WPI but she has gotten into Cornell, GA Tech, and a few other selective programs).<br><br>After reading a thread on the Parents Forum about seeder classes in engineering programs, I want to point out that on e of the positive aspects of WPI (and I think RPI too) is that if they accept you, they hope to keep you and provide resources to help students that are struggling with particular courses. My daughter has not experienced any \"wedding out\" of students because of over enrolled programs.<br><br>", "<b>Username: GraniteStateMom</b><br><br>^^^above should read weeder courses in the 2nd paragraph. And weeding out (not wedding out). Aargh. Posting mobily with auto correct is not my strength.<br><br>", "<b>Username: frontpage</b><br><br>What I meant about PhD programs is that RPI has a stronger culture of undergraduate research than WPI. PhD programs are small and take in very few students and generally look for undergrad research.<br><br>Most undergrads are looking for to go directly into industry or get a masters though. In this case, undergraduate research is not particularly important. Even at universities with a very strong research culture like Cornell or GA Tech, most undergraduates are not interested in (and don't do) research.<br><br>WPI prepared me well for life after college. I think it was a good fit for me.<br><br>", "<b>Username: blevine</b><br><br>I did get the impression that WPI (along with Stevens and Northeastern) are better prep for working after undergrad, and RPI is more theoretical, which would be better prep for grad school. That said, my son may well end up at RPI,<br>for other reasons (athletic), we'll know soon, I think both are great schools, going to be hard to say no to either.<br><br>", "<b>Username: frontpage</b><br><br>@blevine<br><br>Agreed though I think RPI also bends towards applied, just not as much as WPI. At either school, your coursework can align to either theoretical or practical. I think there are advantages to more theoretical programs, even at the undergrad level. It depends on how you learn.<br><br>Northeastern is an excellent school with an excellent co-op program. The co-op is a great opportunity for students, as is the MQP. But you don't get guidance from a faculty member and the experience may vary greatly.<br><br>", "<b>Username: blevine</b><br><br>@frontpage Yes I know a student at NU and they had 2 coops arleady, one being far superior to the other in terms of having substantive work to perform and learn. Guidance is hit and miss like any job with any manager. Left to the kid and how aggressive they are to deal with the usual workplace issues. That has it's pros and cons.<br><br>", "<b>Username: frontpage</b><br><br>One other thing which I forgot to mention is the 7 week term. This is great for \"quick learners\" but not so great for \"slow learners\".<br><br>What I mean by slow learner is people who prefer having a bit longer to have the material sink in and prefer more depth. Most other schools do 4-6 semester long courses and this pattern is better suited to \"slow learners\". Some schools like Caltech go into a lot of depth and also have a fast pased 10-week quarter system. This is not suitable for most people. WPI students take 6-7 courses that are 7 weeks long and the classes feel somewhat hurried and occasionally sacrifice some depth. I consider myself \"slow\" in this regard. It's not bad to be either, but it's better to go to a school that matches your learning style.<br><br>As an example, in my AI class, my professor wanted to cover all 26 chapters of Russell and Norvig's AI book in a 7 week course. This was very stressful and while I got an A, I don't feel I recall the material particularly well and some of the course projects felt superficial (though this is an issue at many semester schools as well).<br><br>If you identify with \"quick\" then WPI would be a good choice.<br><br>", "<b>Username: Emotive</b><br><br>@frontpage Question about the AI course, is it mainly a theory course or does the course also involve implementing real-life practical intelligent systems?<br><br>", "<b>Username: frontpage</b><br><br>It was primarily a theory course but we also implemented some simple intelligent agents for game playing and a CSP solver.<br><br>", "<b>Username: insanedreamer</b><br><br>@GraniteStateMom can't say about WPI, but my D is a freshman at RPI and said there are definitely some \"weed out\" courses in engineering<br><br>", "<b>Username: blevine</b><br><br>I would think some students would welcome the ability to focus on 3 courses, and have only 3 professors<br>competing for your time on homework, projects and test schedules. Yes faster pace, but more concentrated.<br>Having had an older son in a program where they took 5 courses in a traditional semester, the opposite extreme<br>can be stressful too. You still need to move fast, so you can move onto the other 4 classes demanding your time.<br>I am sure it's different, but to say you can be slow when taking 5 full semester courses is not a true picture.<br>I think for most people the 4 courses in a full semester would truly be a bit slower a pace, but seems many colleges are forcing students to take five 3 credit classes instead of four 4 credit classes. I don't care how many credits,<br>you need to read the text, usually complete some project/essay, and study for midterms/finals for each class.<br><br>", "<b>Username: frontpage</b><br><br>@blevine<br><br>I wasn't making a universal generalization that students have much more slack in semester school. Most schools use the semester system and some semester schools like UC Berkeley and Harvard are highly rigorous. I'm just saying that more courses with slightly more depth at a less hurried pace and is better for some people (including, I would think, myself). You get more time for concepts to sink in (though there are more courses competing for your time). But still, you have more time to sleep over specific concepts you're learning and the professors get more time to go in depth on specific topics of their interest and assign longer projects.<br><br>WPI sometimes has a sequence of two (or three) 7-week courses for topics that need more depth. Ones that come off the top of my mind are the Advanced Calculus (Real Analysis) course and the Microelectronics courses.<br><br>The 7-week terms do work very well for many people. Some people would prefer to devote their complete attention to a smaller set of things rather than juggle their time between many different things.<br><br>I wasn't not saying the volume of learning is vastly different but that the style is different. I think the semester system is better where concepts build on each other, as is the case in science courses.<br><br>That's why I parenthesized \"slow\" and \"fast\"; I couldn't think of a better term to communicate what I wanted to say.<br><br>", "<b>Username: GraniteStateMom</b><br><br>@insanedreamer - interesting. I guess, in a way, all schools do since my D knows plenty of students at WPI who changed their major from engineering because they couldn't handle the rigor of some of the science and math courses during their first (or sometimes second) year.<br><br>That said, my point was referring back to another thread about schools that purposefully accept more students into engineering than they intend to graduate and, therefore, curve classes so that a certain percentage fail. This is not the case at WPI and unless things have changed greatly at RPI since my daughter was accepted (or the things she was told weren't true), this isn't the case there either. Between pre-admisdion visits, accepted student days, and visits with coaches, she was told that RPI offers many resources to help students be successful academically including someone in the freshman dorms that monitor grades, a tutoring center, and mandatory study halls for athletes. She was told by one of deans that the school sees the potential in all of the students it accepts and provides the resources to help the students it admits be academically successful. That also seems to be the philosophy at WPI (and many other schools). Certainly there are students that can't handle the rigor or pace at both schools - an engineering curriculum is very challenging - but that's far different from schools that actively seek to lower their numbers.<br><br>", "<b>Username: insanedreamer</b><br><br>@GraniteStateMom I haven't visited but I don't get the impression from what my D (an engineering major) has told me that RPI is actively trying to weed students out, just that some courses are known to be especially tough and only the strongest survive them.<br><br>", "<b>Username: frontpage</b><br><br>@GraniteStateMom<br><br>This is the feeling that I got at WPI as well. Though there were some students who didn't make it through engineering and switched to the management minor.<br><br>But there were times where I felt that the weaker students held back faculty from assigning projects that would challenge the strongest students. This was not the case with the MQP though. In the PL course, there was an option where taking an easier project would cap your grade to a \"B\". I think that sort of system balances the needs of weaker and stronger students.<br><br>", "<b>Username: blevine</b><br><br>As far as weeding out, my older son is at a large highly competitive univ, where there is a high level of rigor in many majors, and of course engineering (where majority of freshman came in with 800 Math SAT). He is taking those freshman and soph \"weed out\" math/science courses now. His friend got 40/100 on his first soph level calc class test.<br>Prof immediately emailed the student to come in and see him for help. My own son started off in business/liberal arts, he decided to change to pursue eng. The school has made every effort to help him with this difficult transition.<br>Both the colleges within the univ he is transferring from and to have advisors who are very helpful.<br>While I get the feeling they truly want these very bright kids to succeed, there certainly are some very difficult course<br>and SAT scores can't predict fully your ability much less your effort level. My son realized for the first time he<br>has to work harder than in HS, to do well in his Chem 101 (hates Chem but required of course). After getting a bad<br>grade on 1st Chem test he said, there are resources and I have to work harder. Not all 18-19 year old kids will<br>take responsibility in that way. I don't care what school you attend, you need to work hard and take advantage of help in courses you find difficult. The one negative I do see at his large univ is some grad students are not willing resources for help, and profs are busier with more students. But the college of engineering at that large U is still smaller than<br>the engineering school within RPI and WPI, so I am assuming you have access to similar levels of personal attention at any of these. WPI is a bit smaller avg class size, I would assume slightly better support. Everyone will have a story about a bad prof or TA but heard more good things about happy WPI students. Also don't underestimate the value of peer resources. Very smart kids at both schools, and I hear willing to help each other.<br><br>", "<b>Username: frontpage</b><br><br>@blevine<br><br>Agreed that SAT scores are not a good predictor of college preparation. Especially if you slack off since think you will have an easier time because you are above the 75th percentile.... It's not a particularly strong indicator of ability either, but is necessary to normalize the performance of students from high schools with varying levels of rigor...<br><br>I think weed out is eliminating students who don't understand the basics. WPI in my opinion should be doing this more. These students in my opinion slow everyone else down, though they can (and should) be encouraged to study better. Math especially is the language of engineering and all engineering students should understand linear algebra and differential equations cold. State space representations, eigenvalues and eigenvectors, Markov chains. Ideally a more theoretical follow up course as well.<br><br>M.A.S.H is a great resource at WPI. If you're not doing well in your intro science or math classes. It's possible you're doing poorly since you don't know how to study rather than you are not capable. Many including myself learned how to study in college.<br><br>WPI is good in this aspect, to learn how to study, as the environment isn't too competitive. But you should make sure you are understanding what you are learning. And it's also OK to go deeper in the material or learn more than what you need for the exam if you enjoy the material and are inclined to do this. But make sure you understand the basics well. Everything builds on the basics. Being able to distill what is basic or fundamental to the topic is one of the most important things I learned from of my education. And if you understand the basics very well, the exam will not be hard.<br><br>", "<b>Username: VMT</b><br><br>WPI and RPI have similar retention rates from freshman to sophomore year, indicating similar \"weed out\" rates.<br><br>WPI does have the NR system, which seems on the surface to make it easier to get through freshman year. What it also means, though, is anything less than a C is unacceptable, whereas other schools will accept a D. I actually like this aspect of the NR policy. NR'ing is not uncommon - my freshman daughter knows quite a few who have NR'd basic classes, like calc, physics, and chem. If you don't know the material well enough to earn a C, then you have to repeat it. The gentle side of the policy is the 1.0 doesn't show up in your GPA, and the curriculum has 3 NR's built-in. So, 3 or fewer NR's and one can theoretically still graduate on time. Merit awards are impacted by NR's, but I don't know how that works. I believe, that more than 3 NR's puts a students enrollment in jeopardy, but not sure about that either.<br><br>I agree with @frontpage, there is plenty of help at WPI, and students do need to make use all the available resources. They also need to learn that fundamental understanding matters. This can be a hard lesson for some.<br><br>", "<b>Username: blevine</b><br><br>Both came in at similar net cost to us, leaning towards RPI due to athletic opportunity.<br>Loved both schools, glad my S has option of both. Home stretch, have to send in deposit soon!<br><br>", "<b>Username: motortrend</b><br><br>RPI<br><br>", "<b>Username: GraniteStateMom</b><br><br>@blevine Congratulations to your son! It's a great decision to have to make. For us, it literally came down to the last few hours before decisions were due following a final trip to each school. Best of luck to him regardless of where he ends up.<br><br>", "<b>Username: blevine</b><br><br>Thanks !<br><br>", "<b>Username: VMT</b><br><br>I'm glad the two schools ended up similar financially. He has two great choices. Is his sport not available at WPI?<br><br>", "<b>Username: blevine</b><br><br>Coaches showed more interest at RPI. Got larger scholarships from Stevens and RPI than WPI, but nothing from NU.<br>As a parent I loved all 4 schools, for different reasons, but of course cost knocked out NU. Was up to my son to pick among the others, and he picked RPI. His love of robotics and proximity to Boston would have made WPI as great choice as well, but you can only pick one. Good luck to those who are going to WPI.<br><br>", "<b>Username: retiredfarmer</b><br><br>I suspect that the average test score of 40/100 in a first year university/college class is not a new game. In most challenging schools their is a need to establish/introduce new students to a higher level of understanding than they experienced in secondary school. When all freshmen are wearing their HS honor pins and feeling, rightfully proud, of their HS accomplishments arrive into an entire class of high achieving students, the bar needs to be raised to set a better understanding of the new goals. The purpose is not to intimidate, but to help the new students to reach higher.<br><br>In my first year physics class at WPI in 1963 (long time ago), the average test score on the first exam was 35/100. The exam was proctored by a German physics refugees with a heavy accent... it was right out of the WWII epoch movies! The same professor ate in the students dinning hall and was trying to eat lunch while I ranted on excitedly about the linear accelerator I had built in a HS science project. He listened politely and simply noted that I still had a long way to go before I would become a physicist. This delivered a mixed message to the new freshman who loved physics but married economics!<br><br>Teaching well is a remarkably challenging job no matter how the student has been prepared because a good teacher always wants the student to reach a little higher (and I don't mean SAT scores).<br><br>"]}