{"title": "scripps vs bryn mawr vs smith vs carleton and whitman for science and pre med preparation", "comments": ["<b>Username: BobShaw</b><br><br>So far, besides University of California campuses, my D has been accepted to:<br><br>Bryn Mawr with $25K per year Presidential Scholarship<br>Scripps with $27K per year Scripps Scholarship<br>Carleton with a modest amount of need-based aid<br>Whitman with their $16K per year merit-based scholarship + $3K per year music scholarship and free private flute lessons, if she declares (double) major in music.<br>She will hear from Smith later today, I believe. Carleton is her top choice, but we’re not sure if it’s worth going into that much debt and paying a $20K premium to attend any LAC, even Carleton, which she absolutely fell in love with. Whitman was her “safety” LAC, so it is unlikely she’ll choose it over the others, even though I hear it is a good school.<br><br>In any case, given the merit-based scholarships, the cost of attending one of women’s colleges listed suddenly comes within $10K of UC Berkeley, her top choice among the UCs she got into. Now we can seriously consider an LAC. The question is, which one is best for science and pre-med preparation? Nothing is for certain, but at this moment, she is interested in becoming a psychiatrist someday. However, as a backup, she also wants to take Computer Science and other practical skill-oriented classes to prepare herself for the job market, should her med school plans not materialize. Would appreciate any insight folks may have to help my D decide.<br>Since this is the Women’s Colleges subforum, I’ll focus on the pros and cons of Scripps, Bryn Mawr, and Smith.<br>SCRIPPS:<br>Pros:<br><br>Claremont Colleges consortium, so Harvey Mudd and Pomona classes are within walking distance<br>Keck integrated science program with Claremont McKenna and Pitzer offers an Early Conditional Selection agreement with George Washington University school of medicine<br>More leadership opportunities for women in a co-ed environment for all practical purposes<br>Pretty campus, good food (especially at Pitzer’s dining hall), lots of food choices across the 5Cs<br>Claremont is a nice, small, college town that is not too far from L.A., beaches, and mountains<br>In-state, so easy and inexpensive for her to come home for Thanksgiving and for us to visit with her beloved dog<br><br>Cons:<br><br>No major medical centers nearby for clinical volunteering etc., and it remains to be seen how good the research opportunities are<br>The tiniest of all schools she’s applied to and significantly smaller alumnae network than Smith, Carleton, and Bryn Mawr<br>Not as much socio-economic diversity, but to be expected at any small, private LAC<br>D is not 100% sure whether the environment will be as intellectually stimulating as Carleton<br>Poor air quality (L.A. County smog)<br><br>BRYN MAWR:<br>Pros:<br><br>Bi-co/ Tri-co/ Quaker consortia with Haverford, Swarthmore, and if you are okay with the distance, UPenn.<br>I have heard that they have a decent science program<br>Usual perks of being in an all-women’s school such as leadership opportunities<br>Based on photos, gorgeous, gothic architecture, pretty campus, but we haven’t visited yet; will go to one of the April welcome events<br>Supposed to have nice house system and good food<br>Close proximity to Philly and its medical centers<br><br>Cons:<br><br>Remains to be seen how good the research opportunities are<br>Distance from home = $$$ for travel back and forth, fewer visits from the family, and probably some missed Thanksgivings<br>D has read stories about strange rituals and traditions, making the college seem like one big sorority; visiting will obviously clear up misconceptions and stereotypes<br>Climate<br><br>SMITH:<br>Pros:<br><br>Consortium with Amherst, Mt. Holyoke, U. Mass<br>She really liked the alumnae and current students she met on the road, although she has yet to visit the campus. Again, we’ll visit during welcome events, if she is admitted.<br>Excellent women’s leadership programs and opportunities<br>History of strong alumnae leaders<br>Campus looks pretty in pictures, and Northampton is supposed to be a nice, small, college town<br>Supposed to have a decent science program<br>Open curriculum may be a good thing for some students; not sure if my D cares<br><br>Cons:<br><br>Not sure about pre-med clinical volunteering experience in the vicinity<br>Remains to be seen how good the research opportunities are<br>Distance from home = $$$ for travel back and forth, fewer visits from the family, and probably some missed Thanksgivings<br>Climate<br><br><br>", "<b>Username: doschicos</b><br><br>I don’t know Scripps at all and know a little about Smith (good school) however I think Bryn Mawr would do a good job of meeting your daughter’s academic needs. Strong own sciences and pre-Med as is Haverford and she can chose to major at Haverford if she desires. So, if you visit Bryn Mawr, allow a little time to pop over to Haverford to check it out. BM’s campus is lovely. I think it’s one of the prettiest in the country and the dorms are great. Haverford has a good CS dept and the students there have had good success.<br>Philly is so close by commuter train. Great research opportunities in Philly plus just a great arts/music/dining scene for fun.<br>Northampton MA is a great town but Philly has so many more opportunities.<br>Congrats to you daughter on wonderful choices and the scholarships.<br><br>", "<b>Username: MinnesotaDadof3</b><br><br>Congratulations go to your daughter on her many acceptances! My ability to provide concrete advice is limited by my lack of/tangential knowledge as to several of the colleges she is considering. But for what it’s worth…<br>Our daughter is a freshman at Carleton, intending to major in Bio with plans of attending medical school. Like you, Carleton gives us a small amount of need-based aid. Although she never looked into Bryn Mawr (we did circle the campus by car!), she did apply to Haverford last year. We also had looked at one women’s-only college – Mount Holyoke, where we toured, stayed in their guesthouse and where she interviewed and attended a class. But she quickly dismissed the idea of a women’s-only college as she just did not see the point of attending one.<br>Bryn Mawr to my mind is less of a women’s-only college due to its close interplay with Haverford. A colleague of mine who graduated from Bryn Mawr (Classics/Greek) about 10 years ago commented to me that Mount Holyoke would be a stronger science choice for our daughter than Bryn Mawr. Yet Haverford is only a mile away.<br>All of our daughter’s applications were filed regular-decision, as we wanted the ability to evaluate our ultimate costs for each. Although she received $24,000 of wonderful merit aid to attend one LAC strong in sciences, Carleton clearly become her first-choice college as we progressed. She is challenged, happy and doing well at Carleton – and we are managing it financially…<br><br>", "<b>Username: nostalgicwisdom</b><br><br>I can speak a little about Scripps and the other Claremonts. The Claremont system is incredible- really easy to cross-register in, rich social life, 7 dining halls, and all the employment opportunities hosted by one school are open by all schools. So you get a LAC experience, but with the resources seen at a larger university. Being a Claremont student means you get access to the alumni networks of all the 5 Colleges. It’s a much more intimate system than the one Smith is in. Carleton and Pomona are very similar to each other, so if she desires a more intellectual student body, she can make friends at Pomona easily or take their classes. Not to say Scripps students aren’t very bright and motivated themselves.<br>There are a few medical center nearby, and a lot within an hour to an hour and a half drive of Scripps. A lot of students intern at the nearby Pomona Valley Hospital, while some go further to USC Medical Center, Cedars-Sinai Medical Center, and UCLA. Having a car, or finding a carpool buddy, is critical, because while public transportation exists, it takes a really long time. Here’s a full listing of places she could work at: https://www.kecksci.claremont.edu/prehealth/Volunteer/Premed.asp<br>Keck’s acceptance rate to medical schools is very high- nearly twice the national average. I think all of these schools will report similar pre-med statistics. So premed outcomes aren’t something you should worry about. One big problem is that Keck is oversaturated with majors, and a number of students have been locked out from taking some courses simply because there isn’t enough room. You may want to get a Keck Sci student perspective on this. I haven’t heard of this happening at other LACs. Research opportunities are definitely there- I worked at Pomona over the summer and the 5C’s host summer research get-togethers, and there are a lot of kids from Keck in the summer. One really nice thing is the HHMI program, which will enable her to do research at Harvey Mudd or Pomona too if she so desires. You’re getting research offerings not from just Keck, but also Mudd and Pomona.<br>The smog issue is overblown, especially in the colleges themselves. SoCal has taken efforts seriously to combat smog in the last few years, and the air quality is much better than before, though it is worse than the US average. I went to Pomona a few years ago, and had friends coming from Vermont, Maine, and New Hampshire, and they never complained about the air quality. I actually can’t think of a single day in my four years where the smog was getting in the way, though there are a couple of days when you can see it hanging near the mountains. I’m not from California.  The bigger natural threat is earthquakes- California is due for a major earthquake within the next 30 years, and the Claremont Colleges are right on a fault line, though there is a great earthquake preparedness system across the colleges.<br><br>", "<b>Username: Snowball_City</b><br><br>Smith is walking distance to a hospital. I am assuming there are shadowing possibilities but I haven’t looked into it.<br>http://www.cooley-dickinson.org  http://www.cooley-dickinson.org/volunteer/volunteer-application-form/<br>My not pre med daughter took organic chemistry and had a great experience.  It was run very collaboratively and not at all like a weed out course.  She was considering taking Orgo 2 just for the heck of it even though it wasn’t required for her.<br>My kid is pretty lazy (shh don’t tell her I said that) and won’t be bothered to go to any of the consortium colleges. She does have friends that do.<br><br>", "<b>Username: Corbett</b><br><br>Women’s colleges vary quite a bit in the degree of STEM focus. Bryn Mawr is one of the strongest women’s colleges in this regard.<br>One way to evaluate this is to look at Section J (“Degrees Conferred”) of a school’s Common Data Set. Check out the total percentage of degrees issued in the categories of “Biological/Life Sciences”, “Computer and Information Sciences”, “Math and Statistics”, “Physical Sciences”, and “Engineering”. Here are the results for BMC, Smith, and Scripps, using the latest available CDS:<br>27.7 % Bryn Mawr<br>24.5 % Smith (only school with Engineering)<br>19.8 % Scripps<br>So STEM majors are most popular at Bryn Mawr, despite the fact that neither BMC nor Haverford has an engineering program.<br><br>", "<b>Username: BobShaw</b><br><br>Thank you for all the useful information and insights.<br>Update: D got waitlisted by Smith, but has been accepted to Oberlin (Arts and Sciences) with a $25K per year Oberlin Scholarship. You know, I had no idea private colleges gave out merit-based scholarships anymore! I was sure private school was a lost cause since we are at that cursed, upper middle class threshold. Income and assets (= Bay Area home) too high for meaningful need-based aid, but too low to afford that kind of tuition without major loans. Pretty awesome. Now, it may be a reality. I think my D would thrive at a small LAC in a way that might be difficult at a UC Berkeley or UCLA.<br>Any thoughts on Oberlin along the same lines?<br><br>", "<b>Username: BobShaw</b><br><br>@nostalgicwisdom - I just saw one of your comments on another thread about CMC in which you say that Keck is where people go to take “easy” science classes. I can believe that Mudd and Pomona have more challenging science classes given their selectivity, but is Keck really that weak in the sciences?<br><br>", "<b>Username: nostalgicwisdom</b><br><br>No, Keck is not weak in the sciences at all, and AISS- the combined bio/chem/physics class at Keck- may be one of the most challenging curriculums available at the 5C’s. The thing I’ve heard is people taking intro pre-med physics at Keck because it is better taught there than Pomona and less rigorous than Mudd (nearly everything is less rigorous than Mudd, though). It was wrong of me to generalize to all of their classes, and I regret my lack of maturity in the past (I think the comment was three years old, for reference, right when I was a young student at Pomona)<br>One thing I’d want to look into is how overcrowded Keck is. I’ve heard of students getting locked out of required courses because there is so much demand. The STEM majors at all 3 schools are growing and because that home for science isn’t growing any larger (whereas Mudd/Pomona have built new facilities), it’s getting quite constrained. A current science major at Scripps would be able to answer this for you.<br><br>", "<b>Username: BobShaw</b><br><br>@nostalgicwisdom - Thank you for that clarification. That’s helpful. Wife and D are visiting Scripps next week for the admitted students day, so D will look into the over-enrollment issue you raise. I’m also curious to find out how they prioritize registration each semester. Still trying to figure out which will be better for science, Scripps/Keck or Bryn Mawr/ Haverford (she got into both Bi-Cos, but given the merit scholarship, Bryn Mawr is looking more realistic, even though she really liked Haverford). She’ll visit Bryn Mawr & Haverford in a couple of weeks.<br><br>", "<b>Username: WISdad23</b><br><br>We visited the eastern women’s colleges on your list and Whitman. I am a psychiatrist too, FWIW. I would vote Bryn Mawr. It is a gorgeous campus, STEM strong, they have one of those 5th year pre-med booster years (forget what that is called), part of the consortium, and access to Philadelphia (which has several media schools). Haverford is also excellent.<br>Whitman is a very nice school but quite a bit different than Bryn Mawr. My only knock on Whitman is its remote location and the transit time to visit. For pre-med it is a bit isolated as well.<br><br>", "<b>Username: Bromfield2</b><br><br>^^^^Bryn Mawr post-bac program<br>https://www.brynmawr.edu/postbac/<br><br>", "<b>Username: BobShaw</b><br><br>@Bromfield2 - Does the presence of a post-bac program benefit undergrads in any way? (Besides the fact that the school has connections/ familiarity with medical schools that regularly admit students coming out of the post-bac program.) Incidentally, Scripps also has a post-bac program.<br><br>", "<b>Username: intparent</b><br><br>Some of it may come down to campus vibe for her.  They are fairly distinct.   Can she visit Oberlin as well has her planned visits to Bryn Mawr & Scripps?  Agree with @nostalgicwisdom that taking pre-med classes at Mudd isn’t a great idea.  Wicked smart students, heavy workload, and grade deflation.<br>I think the clinical opportunities are not a make or break thing. Students can often pick those up over summers.<br><br>", "<b>Username: Bromfield2</b><br><br>Post-bac students take the same classes as undergrads–one could argue that there may be a benefit in having them in classes with undergrads. Post-bacs may raise the level of instruction/discussion/interaction.<br><br>", "<b>Username: kol123</b><br><br>Hello, my daughter got accepted in to Smith and Bryn Mawr. She is considering majoring in Chemistry with a focus on continuing Grad studies in Chem. Any feedback/comments on Chem dept between Smith and Bryn Mawr academically?<br><br>", "<b>Username: collegemom3717</b><br><br>@kol123 and @BobShaw, I don’t think that there is enough of an academic difference- not in quality of teaching, strength in science, pre-med prep-  between the schools in question to make that the deciding factor. After $$, the key is really how your daughters respond to the environment. The thing about LACs is that they can be very alike on paper- and have a completely different feel.  Consortium or no, you live, eat, sleep and breathe on your home campus- and it is amazing how differently different kids react. I know (and also have) kids who have known within minutes of getting out of the car that it was not the place for them. Equally, I knew before one of my collegekids which college she would pick before she did- b/c I saw how she responded to the place.<br><br>", "<b>Username: BobShaw</b><br><br>Is there any grade deflation going on at Bryn Mawr? I heard rumors. Because my D is thinking about being a pre-med, this is critical to know. It’s one of the main reasons she is leaning away from UC Berkeley and UCLA. If she were not interested in pre-med, we wouldn’t care.<br><br>", "<b>Username: doschicos</b><br><br>How does one really judge grade inflation?<br>Bryn Mawr isn’t a cake walk but I wouldn’t call it grade inflation or deflation. It is an intellectual community with academic rigor but I’ve never heard folks describe it as overbearingly difficult to achieve. Don’t expect them to hand out 4.0s like candy, though.<br>For pre-med, I would suggest having the prospective student reach out to the pre-med advising office to get answers to your questions from the source. Might be just interesting to do for all the schools in contention just to get a feel for that end of things.<br>http://www.brynmawr.edu/healthpro/<br><br>", "<b>Username: BobShaw</b><br><br>@doschicos - Yes, she is scheduled to meet with the advisor during her upcoming visit.<br>When I say “grade deflation”, I mean whether a high percentage of classes are graded on the dreaded Gaussian distribution with the average grade set at B- or C+. I disagree with the philosophy that having students compete for a limited number of high grades on a curve is “motivational” in any positive or healthy way. In fact, this grade scarcity creates an atmosphere that is downright toxic. Why should one student’s success mean another’s failure? That’s my point. Now, the problem is, how to deal with comparisons between professors and consistency year over year when you have criterion-reference grading. I think even when you grade on a curve, pre-determining the grade distribution is not the best way to go. Too often, that is what instructors do.<br>I’m hoping that given Bryn Mawr’s honor code philosophy of not discussing grades and rankings among students, the college discourages professors from pitting students against each other in their grading policies. Anyway, thought someone might have firsthand knowledge and comment.<br><br>", "<b>Username: Springbird</b><br><br>@BobShaw<br>My daughter toured Smith, Wellesley, & Bryn Mawr several times each and was accepted to all of them (currently a Smithie), but Wellesley is the only place where grade deflation came up among the three.<br>Also, found this article in a Bryn Mawr/Haverford publication which doesn’t reference grade deflation in the traditional sense, but rather mentions frustration with the wide gap between a 3.3 and 3.7 on the 4.0 grading scale:  https://ehgazette.blogs.brynmawr.edu/2016/01/31/grading-our-grading-system/<br><br>", "<b>Username: BobShaw</b><br><br>@Springbird - Thank you for that information. That sounds like a general issue with distinguishing plus and minus grades on the grading scale. However, this reminds me of another matter: tell me if I’m wrong, but there should be no difference between a 12-point grading scale and a 4-point grading scale, correct? (Assuming plus and minus grades are treated the same way in both cases.) The Claremont colleges and Carleton use a 12-point scale whereas the Bi-Co schools use a 4-point scale. Using 12 points simply allows you to assign a whole number to each letter +/- grade. For example, 10.0 for a B+ rather than 3.3. Am I missing something?<br><br>", "<b>Username: MinnesotaDadof3</b><br><br>@BobShaw: Just to add my 2 cents – I do like the numerical GPA grade distinctions inherent in Carleton College’s grading system (where our daughter is a freshman).  For example, while a ‘B’ represents a numerical grade of 3.0, Carleton assigns a 3.33 to a ‘B+’ and a 2.67 to a ‘B-’.  This seems fair, as there is as much of a difference in academic performance between a 'B-\" and a ‘B+’ as there is between a ‘B’ and an ‘A-’. Yet some other grading system might well assign a 4.0 to an ‘A-’ while giving a 3.0 to a ‘B+’, thus falsely creating a large numerical gulf in GPA between those two rather small differences in academic performance.<br><br>", "<b>Username: Springbird</b><br><br>Wow!  I wasn’t aware that there were such a variety of grading systems!  That sounds like it could be an entirely new topic on its own.  <br>@BobShaw I got the sense that Bryn Mawr students work hard for their grades.  Not in the same sense as grade deflation like at Wellesley, but rather that Bryn Mawr classes are challenging and require a lot of effort.  That blog I cited above makes no mention of the traditional sense of grade deflation there, indicating that that is not a practice at Bryn Mawr.<br>Their post-bac program would seem to indicate that the school has a lot of experience with med school apps.  Is your daughter self-motivated?  Does she enjoy spending time doing problem sets and labs?  Is she one to go to professor office hours and chat with profs after class?  Will she reach out for help if she needs it?  If so, she will likely do very well in terms of GPA with all of the supports that a school like Bryn Mawr offers.<br>I second @doschicos that the feel for the school will likely be important.  If your daughter is happy at her school, she is more likely to do well.  What is she telling you?<br>@mom2collegekids is an expert on pre-med (her S went to Alabama on scholarship and then med school).  I believe she used to live in CA and is very familiar with the UCs and pre-med.  She might have some thoughts about Berkeley vs. Bryn Mawr as a pre-med.<br><br>", "<b>Username: exlibris97</b><br><br>Oberlin is a great college with an outstanding reputation. Very “progressive” (i.e. liberal), which is somewhat interesting given that it’s in Ohio. The college also has a famous music conservatory, which means there is a great cross-section of students. The drawback in my opinion is that it is relatively isolated. This contrasts with Smith. It’s a women’s college but part of the 5-college consortium, of which Amherst has a stellar reputation.I found Smith’s campus to be beautiful and everyone there to be very helpful. While my D. decided to go elsewhere, it was my first choice for her and its STEM program is extremely good.<br>If money is an issue, and travel is not only expensive but trying, you cannot go wrong with Scripps. I think hard before going elsewhere for this reason alone.<br><br>", "<b>Username: BobShaw</b><br><br>Okay, so the game just changed. Corrections to the CSS Profile that never made it to Carleton and Haverford, because you have to send them manually to your early list schools after the fact, were submitted to their respective financial aid directors with a letter of appeal from my D. Carleton’s NPC just came down to within a couple of thousand of the merit schools. Haverford (which also gave my D a late Magill-Rhoads Scholar designation) isn’t quite as good, although it is substantially better than the initial award. In any case, this suddenly makes my D’s #1 Dream School, Carleton, closer to reality. Given their trimester calendar, she would be able to come home to CA from Thanksgiving to New Year’s for a 6-week winter break, allowing for work or internships. Cost of flights between SFO and MSP are also a lot cheaper than to Philly (but more expensive than Claremont, of course).<br>As she finishes her “shopping trips” to Scripps, BMC, and Haverford over the next few days, she needs to think about where she thinks she’ll be happiest, primarily based on the people she has met. Any last input from Carls or Carleton parents?<br><br>", "<b>Username: MinnesotaDadof3</b><br><br>Only your daughter (and you) can arrive at the (probable) best conclusion as to which college should be the one. Neither I nor anyone else here on CC can do it for you.<br>The natural tendency is to overly intellectualize the decision-making process when comparing institutions that are academically comparable. It is good to slice and dice the all those minor nuances. But once you have exhausted that process – for us and probably for you – it comes down to what your gut tells you. Your gut lies closer to your heart than to your brain, to draw a bad analogy (heck, I was an English major and never studied physiology). We’ve gone through this same choice-process with our three kids. Your gut will also determine how happy your child will be once she is enrolled and handling the course work.<br>We visited Haverford, too. For our daughter, her gut and heart by February last year was telling her that Carleton was her best option. As the parents, we are happy to have only a three-hour drive to arrive at Northfield for a visit from our home. But we would gladly have supported whatever her choice was ultimately.<br>Your experience with the CSS Profile updates should serve as a fair warning to all parents. Updates/corrections need to be sent directly to each of the colleges. So happy for you that the finances have changed for you; sad that this makes the decision that much harder. It will end soon!<br><br>", "<b>Username: 24cranes</b><br><br>@BobShaw  I’m a current first year at Bryn Mawr, and traditions are the most special part of the school, and a wonderful way to bring the whole community together. It’s not sorority like at all! We even have a tradition that makes fun of sorority culture. In terms of the sciences, over 1/3 of the student body majors in a STEM field, and we’re probably the most science-y of the Seven Sisters (along with Smith, which has an engineering program).<br>@kol123 I’m not a Chem student, but I’ve heard wonderful things about Chemistry professors from friends. It’s a big department here, BMC is huge on STEM fields.<br><br>", "<b>Username: BobShaw</b><br><br>@24cranes - We just returned from Bryn Mawr in Focus, and my D LOVED IT. She knows exactly who she’ll room with too, if she ends up going there. She has one more visit this week, so it it will be down to the wire, but BMC is a finalist. Mawrtyrs are intelligent, well-spoken, and mature women. Your campus is like a painting. Your professors are awesome. Your resources are excellent. And your administration has done a good job with little things that can make a difference. I’m sure your SGA has something to do with it too. You should be proud! If my D doesn’t choose BMC, it will either be due to its location (if she doesn’t want to fly across the country) or because she chooses a co-ed college over women’s. Regardless, Bryn Mawr will have a special place in her heart. And she made some good friends.<br><br>", "<b>Username: doschicos</b><br><br>@BobShaw Love  Bryn Mawr’s campus. One of the prettiest in my opinion. Speaking of co-ed, did you get a chance to pop over to Haverford to check it out a little (and see guys  )?<br><br>", "<b>Username: momcinco</b><br><br>Be sure to let us know the final decision!  So glad that your family has such great options.<br><br>", "<b>Username: WISdad23</b><br><br>Just an FYI about a California person going to Carleton - and nothing against Carleton or Minnesota - but she might not understand how cold it is or how long winter is. In December and January the average highs and lows are 25 and 7 degrees. Those are averages and lows can be shocking to the uninitiated.<br>Just an FYI. Our neighbor goes to nearby St. Olaf’s and loves it.<br><br>", "<b>Username: BobShaw</b><br><br>@doschicos - Yes, she did the overnight etc. at Haverford the day before. However, she didn’t like Haverford as much this time around, compared to the first visit (when she interviewed and toured). I hate to criticize Haverford since it is a good college, and it may be a good fit for many students. But it’s important to share different perspectives on this forum for other parents and students to read. My D had some reservations about the social vibe at Haverford, which is surely a factor of the Fords she was grouped with. It just didn’t click for her. Also, while Haverford looks diverse on paper, it didn’t “feel” diverse to her, if that makes any sense. There were quite a few African Americans, but they didn’t seem to be mixing as much with the White and Asian students in the dining hall or walking around campus. She also heard from students that cliques form around “Customs” groups, and this can be good or bad depending on the individual who is put into such a group. You either feel like you belong or you don’t, and if you don’t (which happens to a lot of URMs, apparently), you will have a more difficult time making friends at the beginning of your first year. She had expected Haverford to be more inclusive. On the other hand, the faculty she met at the “academic fair”, especially in the Haverford Biology department (including the chair), were great. The Career and Professional Development advisors were also great. If she goes to Bryn Mawr, she will take classes at Haverford for sure (like everyone else). Less important: Fords (and Mawrtyrs) said that Bryn Mawr has the better food and dorms.<br>The Fords my D liked, she liked a lot. She met a few helpful Haverford students in Bryn Mawr classes who had nice things to say about Bryn Mawr as a college and Mawrtyrs as students. And there are students at Haverford who have an incredible amount of respect for Mawrtyrs, saying that they are some of the most intelligent and independent-minded women they know. These Fords also happened to be very helpful, kind, and friendly. They were honest about what is good and bad at Haverford. My D can see herself developing strong friendships with these students. These were the kind of people who attracted my D to Haverford in the first place. I also met and chatted with very intelligent and respectful Haverford students. It looked like students, in general, are serious about their studies.<br>Unfortunately, my D also met Fords – almost exclusively women – who badmouthed Mawrtyrs at every turn. They were obsessed with trying to prove how Haverford is Swarthmore’s equal and Bryn Mawr’s superior because of acceptance rates. They said things that hinted at jealousy of Mawrtyrs as “competition” for men at parties. This same group of women also happened to be trying to make out with men’s track and field athletes left and right. This group turned off my D in a major way. In contrast, at BMC, the only criticism she heard from any Mawrtyr about Haverford is that they didn’t feel Haverford is as inclusive or as diverse as BMC is nowadays. Any other prevailing attitudes about Haverford were well-hidden. Maybe Mawrtyrs are more careful about publicly criticizing their brethren down Lancaster Ave, or the amount of alcohol in your system makes a difference. Most Mawrtyrs she met didn’t seem to give a hoot about rankings and such, but they were extremely proud of their intellectual environment and quality of education, and the strong bonds they shared with the other Seven Sisters alumnae. My interpretation: Bryn Mawr doesn’t seem to have any insecurity about its standing as an institution. They are proud of their history and their mission as a women’s college, and they don’t care so much about comparisons to their Tri-Co partners.<br>Another contrast: the hosts at Bryn Mawr were strict about making sure visiting students didn’t linger outside the dorms too late. Even first year students acted like parents when it came to making sure the visitors were safe and stayed out of trouble. At Haverford, my D and others were taken to parties where students were getting hammered. Apparently, alcohol is huge on campus, and some interpret the honor code to mean they can do whatever they want (according to current students, mind you – I am not telling you my opinion, only what others said to my D). A byproduct of not having RAs (honor code): several women my D met had moved their beds out of their own rooms and into their boyfriends’ rooms, where they slept every night. And they bragged about their nightly “exploits”. This actually shocked me; I had never heard of moving beds around. Maybe it happens at other colleges, I don’t know. They’re consenting adults, so who am I to judge? But not my D’s cup of tea and totally unexpected.<br>The one thing Mawrtyrs did complain about: Bryn Mawr can sometimes feel too quiet and lonely. Not as much going on with respect to typical college social activities as they have at Haverford, according to Mawrtyrs my D spoke with. I’m sure if the program had happened on a Friday or Saturday, there would have been more social events planned. We saw this at Scripps too. Seems like at women’s colleges, at least those that are in close proximity to co-ed colleges, the women go off-campus to party while protecting the tranquility of their own territory. Not a bad thing for me, as a dad, I will admit. I want my D to have an environment where she can study for four years without too many distractions. For her, this was a mixed bag, although she doesn’t drink.<br>I found it interesting that Haverford chose to have their event on a Sunday, when there were no classes going on. All the planned events promoted school spirit. They were putting temporary tattoos of black squirrels on everyone. (Was funny to walk into Bryn Mawr with those tattoos on.) Class visits were not “officially” part of the Haverford program. This was a big contrast to Bryn Mawr’s Monday program, where students were assigned two classes according to their expressed interests on the registration form. Haverford seemed to emphasize the social aspects of college life while Bryn Mawr emphasized education and informal social bonding. BMC’s structure also allowed my D to bond more with her admitted class, resulting in new friendships. At Haverford, her interactions were primarily with existing students (which is not a bad thing, just a different experience).<br>At the end of the day, my D had to go with her gut feeling, and based on this, Haverford was crossed out from the list.<br><br>", "<b>Username: doschicos</b><br><br>Her experiences at Haverford don’t echo what I know about the school, but glad she got familiar with the campus as she’ll spend at least part of her time there as a Bryn Mawr student, which is what I was trying to glean. Glad your daughter found her fit at Bryn Mawr. It’s a great school! Plus the merit scholarship will save you a ton anyway, so count your blessings and your dollars that she didn’t prefer Haverford.  With her interests in music, CS, and the sciences, she’ll likely wind up taking advantage of Haverford’s offerings while availing herself of all the benefits of Bryn Mawr.<br>Although your daughter doesn’t drink alcohol now (given her age) don’t be surprised if that might change or even overnighting in a guy’s room or visa versa. Kids change a lot in their college years and such behavior isn’t unusual at any colleges (absent BYU and a few others), even women’s colleges. Went on back in my day, too. <br><br>", "<b>Username: BobShaw</b><br><br>@WISdad23 - Good advice, but did you drop a 1 by mistake? She’s going in with the assumption that it goes down to -17 deg F! Nothing a heavy coat, thermals, gloves, and a hat can’t solve. I explained to her why I like saying a poorly designed website is “slower than sap on a cold Wisconsin morning,” and that MN may actually be colder. She doesn’t mind the cold, likes rain, and loves snow. As a figure skater, she is excited about the tradition of turning the Bald Spot into a rink in the winter. You can’t do that in CA! And while Boston isn’t as cold, she trudged through the streets for an entire day in temperatures approaching 0 deg F one rare winter day. Right now, it’s going into the thirties at night, in Northfield. Last time we visited, it was only November and fairly chilly.  What is nice about Northfield is that it gets more sunny days than New England.<br>I think it’s important for her to experience something different during college. A small town in the frigid, rural Midwest is as different as it gets. But as she wrote in her essay for Carleton, the warmth of the people she met more than compensated for the cold weather. Besides, there must be a good reason why 9-10% of the student body (second largest group by state) choose to put up with the climate when they could have easily stayed in California. <br>Let’s see how the final visit to Carleton goes this week. Moment of truth.<br><br>", "<b>Username: BobShaw</b><br><br>@doschicos - Yeah, it’s just one person’s perspective and experience. Hard to generalize. As for extracurricular activities, well, we’ve done our best to raise her well. Now she’s on her own to lead her life as she pleases. Parenting!<br><br>", "<b>Username: prezbucky</b><br><br>I’m sure most Haverford kids are confident and self-assured, but there might be a reason for the defensiveness and insecurity of the kids who were so concerned about being Swat’s “equal”: apparently Swat kids have been known to refer to Haverford as their “safety school”. Now obviously that is ridiculous, as no school with Haverford’s admissions stats can ever be considered a safety, for anyone, but still… I can see how this teasing could grate one’s nerves and stir the cauldron of competition, insecurity and jealousy.<br>I think Haverford is awesome academically, myself.<br><br>", "<b>Username: doschicos</b><br><br>As a parent of a former Tri-Co student whose kid and friends of kid could care less about whether a fellow classmate was a Swattie, a Ford, or a Mawter, I think for many (most!) it is a nonissue. I just want to give a different perspective because I have never sensed any real rivalry or animosity amongst the different colleges, quite the opposite really. My kid had friends from different campuses, teammates, classmates, participated in shared ECs. I never heard any stereotyping or comments at all. Students were judged on what kind of people they were not what campus they resided on. I really don’t think it is an issue on any campuses more luck of the draw on who one might have met at an accepted student event. Given the overlap of majors and with many different clubs and such, students attending different cultural events on different campuses, it has always appeared to me to be quite a collaborative relationship.<br><br>", "<b>Username: BobShaw</b><br><br>Well, D got back from Carleton, and after spending a day trying to justify why NOT to go to Carleton (mainly the food), she chose Carleton. Was even better the second time around. No fanfare, just an ordinary day, but she was able to visit several classes, meet multiple professors, socialize with MANY students (some of whom took her to coffee or lunch), and meet with the pre-health advisor (who herself went to Smith and told her how great Bryn Mawr is, assuring her she would not make a wrong decision either way). She also met a parent who has one kid at Carleton and one at Bryn Mawr (and loved both). In the end, it boiled down to Midwestern charm. My wife, who wanted our D to stay close to home, thought the people they met at Carleton and in Northfield were the nicest people they had met at any college. A stroll through “The Arb” closed the deal. It also helps that we discovered a strong connection to the local alumni network through a friend. I think my D is going to start a campaign to fix the Asian cuisine at Carleton. Seriously, how hard is it to make teriyaki beef?  We need to supply some good recipes for Indian, Chinese, Thai, Vietnamese, Korean, and Japanese food to the dining services (Bon Appetit?).<br>Carleton was the last college she visited before applying, became her first choice at some point, and was the last college she visited before making a final decision. Like a good marriage, sometimes, when you know, you just know, and dating only confirms you were right the first time. Thank you, all, for all the valuable advice. I am so happy this is over.<br><br>", "<b>Username: collegemom3717</b><br><br>Well done to all of you, @BobShaw! once you come out the other side the path often seems so clear, but I think that there is a merit to the struggle to get there- I think they learn a lot about themselves as well as about trade-offs and the general complexity many adult decisions. Hope she has a wonderful adventure at Carleton!<br><br>", "<b>Username: BobShaw</b><br><br>Thanks, @collegemom3717 . Very true.<br><br>"]}