{"title": "olin vs georgia tech honors", "comments": ["<b>Username: helpless2017</b><br><br>I’m having a tough time to decide where to go to school, and I would really appreciate some input on this.<br>My two top choices are Olin College and Georgia Tech, and I would be studying ECE (probably on the computer engineering side) at both schools. Cost is just about the same (manageable amount of debt), though I live in the greater Boston area so GT would be significantly more travel. I’m probably independent enough to be fine with the distance, but the logistics would obviously be more complicated.<br>With ECE, I’m mainly interested in exploring research projects related to robotics and autonomous systems, and I (at least in high school) don’t really have issues with theory-based classes or a competitive environment. At the same time, I do enjoy project-based learning and don’t discount its value. However, many local engineers I have spoken to express concern over Olin’s nontraditional curriculum, and I personally worry about going to such a tiny school. I would definitely love to pursue technical jobs (internships, etc.) and would prefer for them to be in the Boston area.<br>Socially, I’m pretty extroverted but I’m not really into partying. At the same time, I would love to interact with a large and diverse group of people in college and work on interesting projects with them. Any advice would be appreciated.<br><br>", "<b>Username: Chardo</b><br><br>Olin is a tiny school with a hands on focus. Georgia Tech is a large world class research institution. There really is no comparison.  As far as jobs and internships in Boston, there’s not a single one that an Olin student would land easier than a qualified GT student.  If you want to interact with a large and diverse group of people, GT is the obvious choice.<br><br>", "<b>Username: NoVADad99</b><br><br>If after Olin Candidates Weekend you still have doubts about it, I suggest you give up your slot to someone who wants to be there more than you.<br><br>", "<b>Username: KLSD</b><br><br>First, congratulations!<br>We live in the Boston area and have searched for engineering schools with our 2 oldest children.  They both started their search investigating broad areas of concentration (biomedical and robotics engineering).  Their engineering parents held back our opinions but steered both to the conclusion that they needed to choose a traditional engineering discipline (mechanical, chemical, civil, electrical) and choosing an industry should be saved for a concentration or master’s/PHD program.  Four years of depth; not just breath.   That process worked well; one chose Chemical and Biomolecular and the second Mechanical.<br>We all learned that both children needed to be in an environment that feeds their interests.  In the case of the ChemE, a campus with a medical school researching in partnership with the ChemE department and a strong Biomedical program.  In the case of the ME, an incredible robotics department, a robust ECE department (there are not may of these and GT is on top), flexibility to add not just CS but EE coursework to an ME curriculum, creating a concentration in systems.  For your interests, GT has it all with many research facilities.  My husband has been hiring for 20+ years.  His managers interview MIT, WPI, Cornell,GT students; it’s really about the candidate not the particular school.  Our freshman is returning to New England to work in Pharma this summer.  Landing internships from afar can easily happen if you get research experience in college and actively pursue summer opportunities.<br>Olin will be diverse but likely in the eclectic way that MA suburban charter high schools attract a type of student.  If that is not your type of happy home for 4 years, take the leap to Atlanta.  I understand the anxiety especially since most MA students do not leave New England because there are so many private schools.  The distance may be greater, but Atlanta, Baltimore & Philly have easier access to home than a drive to Ithica or Rochester in the middle of the winter.<br><br>", "<b>Username: HeloDada</b><br><br>Those two schools are so different, to compare and contrast should be easy. Our child also had the choice of GT and Olin (among others) and the decision didn’t take very long. The feeling was that Olin beats GT (from our student’s perspective) in research opportunities, culture, and lifestyle. The last two are really subjective, but it is worth mentioning that Olin has a very cooperative atmosphere. From all reports I have seen, GT is more of a competitive (if not quite cut throat) scene. There are no frats at Olin – and it would be difficult to imagine any greek organization ever happening there (not just because of their size, also because of their culture). On the other hand, Geek organizations thrive. There are no varsity sports at Olin. While both schools have traditions, at Olin they are still making traditions (“you get to be a giant instead of standing on the shoulders of giants”). As far as research opportunities, Olin is undergraduate-only, First Year students are routinely involved in research. I’m sure GT undergraduates get research opportunities, but it is undoubtedly much more difficult to find the opportunities.<br><br>", "<b>Username: eyemgh</b><br><br>I have to strongly disagree with @Chardo. GT is not hands down “better” than Olin. It’s hands down different. At GT classes will be large, and much of the instruction will be by graduate students. There will be classes at GT that might be bigger than the entire Olin student body. Olin is TINY. They put a big emphasis on an well rounded, integrated process including entrepreneurship and liberal arts. It is definitely a love it or hate it environment. If it’s to your liking, it’s one of the coolest undergraduate programs in the nation. @colorado_mom can add light to the subject.<br><br>", "<b>Username: helpless2017</b><br><br>@KLSD Thank you for the detailed response. I was wondering what your husband thought of Olin - some local hiring managers are skeptical of Olin students in that they may lack the theoretical base that students from traditionally engineering schools.<br><br>", "<b>Username: helpless2017</b><br><br>@HeloDada Thank you for the response. If you don’t mind, did your child/their friends find it easy to publish their own papers/be second or third authors on papers? From CW, I definitely got a vibe that people spend so much time on their coursework and project teams that research is neglected.<br><br>", "<b>Username: NoVADad99</b><br><br>Companies come to Olin to hire because their students have already demonstrated the ability to start and complete a project to the end in their four years.  They have demonstrated their ability to work in teams, and to have actual project management experience from day one.  How many ‘traditional’ engineering school students can say they have overseen multiple product development projects by the time they graduate?  This is what companies want.  I dare say the lack of theoretical base has not hurt them one bit as they have done ‘real world’ engineering work for four years.  This is why companies like Microsoft and Google have been snapping up Olin graduates.<br><br>", "<b>Username: NoVADad99</b><br><br>@helpless2017 If your goal is to publish research, then GT is your school, not Olin.  Olin students have research internships, often with faculty members.  But I don’t think their work will result in their names on the research publication.  Olin’s emphasis is on practical hands on engineering and problem solving, not research.  If it’s research you want, then you want to go to a research university, which GT definitely is. Olin is a teaching college, not a research college.<br><br>", "<b>Username: Colorado_mom</b><br><br>Olin mom here.   It was a fantastic place for our son.   However, I often do warn that it is too teeny./limited (85 grads per hear) for most students.    If you want a more traditional college experience, GT may be better.   For completeness I will add more info about Olin too.<br>Olin grads do have decent prospects for internships and jobs.  The job fairs I think have more companies than annual graduates.   You may find this link helpful - http://www.olin.edu/collaborate/careers-graduate-studies/results/.    There will definitely be employers who have NOT heard of Olin, more so as you get further from Boston.   The various rankings can help mitigate that - http://www.olin.edu/about/rankings-awards/<br>Olin does have many projects, especially compared to my Engineering program in 1980s.    It also has intense academics, but not in the traditional course sequences.   Many Olin admits are highly qualified - some have turned down offers MIT, Stanford, Princeton etc.  So there is a presumption that they already have a lot of AP/IB knowledge under their belt.<br>Our son did do research at Olin (including the summer after Freshman year), but it was interwined with software engineering.  One project resulted in an award (with colleges that had more liberal arts kinds of CS than most STEM schools).  He also did poster presentation at a conference.  But these things were not due to intentional research focus - he intended to go to work, not grad school.<br>The first link above includes To grad schools s  (the qty may be out of  all grads to date - under 1000… and I think a minority apply to grad schools)<br>Harvard University  25<br>Stanford 21<br>MIT  20<br>Carnegie Mellon University 18<br>University of California Berkeley 15<br>Cornell 12<br>Olin students can also take classes at Babson (adjacent campus), Wellsley (campus loop bus), or Brandeis.<br>I think the approach to have an Olin Candidate’s Weekend  is wise.  (first cut of admits come to campus on one of 3 weekends) .    I was not able to attend, but DH (also an engineer) went. with DS… and after that, they both were smitten.<br>In Summary:  Olin can be a fine school if it is a good “fit”.    But it is a niche-fit, so students should careful study the pros/cons for their particular situation.<br><br>", "<b>Username: helpless2017</b><br><br>@colorado_mom Thank you so much for all of the information! I really appreciate it. Did your son enjoy the CS program at Olin/think it had enough depth for him? A few students I talked to at CW said that they found the course sequence to be pretty disappointing and that they were logistically unable to take courses at Wellesley.<br><br>", "<b>Username: Colorado_mom</b><br><br>Our son was an ECE major,.  I think his job now  is software engineer.    He took one course at Wellesley, but it was a math course he wanted to take (not a required course).    There can be logistics with cross-registration due to slightly different break schedules and timeslot alignment (many Olin courses only have one section).    He also did a semester abroad, but that needs to be planned carefully to ensure all the graduation requirements are met.<br><br>", "<b>Username: HeloDada</b><br><br>@helpless2017 I will ask my Oliner your question, but I have a feeling others here can answer it easily. I see @NoVADad99 already took a swing at it. FWIW, the project my son is working on is run by a student, so I assume the author of the work will be the student. Changing topics slightly, when you’re looking at statistics about graduate schools and Olin try to factor in that many Olin students do some time in the workforce and then head for graduate school. They have an office of “Post Graduate Planning,” that assists students with post Olin planning and strategy (http://www.olin.edu/collaborate/careers-graduate-studies/). Finally, definitely check out the way Olin has produced Fulbright scholars. It may be interesting to compare Olin and GT by Fulbright recipients (while taking Olin’s smaller size into consideration). I haven’t seen the comparison.<br><br>", "<b>Username: Chardo</b><br><br>@eyemgh someone disagreed with me?  That doesn’t happen often.  If you reread my post, I still believe it’s accurate.  I never said GT is hands down better than Olin.  I said it’s the obvious choice for this OP who stated he would “love to interact with a large and diverse group of people”.  Hard to do that at a tiny school.<br><br>", "<b>Username: eyemgh</b><br><br><br>\"\"<br>@Chardo said,<br>As far as jobs and internships in Boston, there’s not a single one that an Olin student would land easier than a qualified GT student.<br>\"\"<br><br>This is what I’m disagreeing with, if for nothing else, because Olin is in Boston’s back yard.<br>I disagree more so because of the previous qualifying sentence that Olin is a hands on program while GT is a “world class research institution.” No doubt the latter is true, but the question is…what does that have to do with the undergraduate learning experience?<br>Olin is a direct response to large, yes very successful, research institutions, that don’t put the maximum priority on undergraduate education to produce practicing engineers. The great research schools like Caltech, Berkeley, Stanford, etc. are also known to have very large classes, lots of TA instruction and a lack of principle application. Can they produce good bachelors level engineers? Sure. Does their status as a research institution help that? I’d argue that it’s a hindrance.<br><br>", "<b>Username: Chardo</b><br><br>I still stand by the statement.  Olin grads get hired easily, but so do GT grads, even in Boston.  And again, you need to go back to the OP.  His desire for “exploring research projects related to robotics and autonomous systems” points to the world class research institution, even for the undergrad learning experience.  Olin is great, for the right person, but to me this OP is better fit at GT.<br><br>", "<b>Username: helpless2017</b><br><br>@eyemgh talking to people at GT, they mention that all of their ECE classes are taught by professors (these are friends, some of whom are cynical about the school, not tour guides) and that the presence of grad students makes it easier to get experience and make connections in the professional world? Is this the case? I genuinely don’t know how it works and appreciate the input.<br><br>", "<b>Username: helpless2017</b><br><br>@Chardo I appreciate all of the input from you throughout this thread. Do you/anyone else know the value of the product development/user oriented design focus at Olin (as opposed to research)? While not as interesting as robots, that sounds interesting as well. I’m not sure if it’s actually valuable in business because it’s not as thorough as like getting an MBA.<br><br>", "<b>Username: i012575</b><br><br>I believe that the college experience should be used as a stepping-stone to the real world of a job/work life. This is more so in the case of being an Engineer and especially if you are a woman, unless you are in academia. The jump from a smaller, “more-cocooned” college makes this tougher in my opinion. The experience in smaller colleges and LACs is too much like an extended version of school life. Choose GTech !<br><br>", "<b>Username: Chardo</b><br><br>@helpless2017 I can’t speak to Olin specifically, but generally employers like well rounded applicants.  An engineering grad with project experience (and the leadership/teamwork/success/failure/etc that comes with it) is certainly desirable.  Keep in mind, though, that every engineering program includes a capstone project.  No matter what school you attend, you will graduate with project experience.  Research institutions are not just for research.  They can also turn out well rounded applicants.  As I said, Olin is great for the right person.  But it’s not the only great place out there.<br>I’ll give you a real world example of presence of grad students for connections.  My son happens to be at GT.  He recently applied for co-op with Coke, perhaps the most desirable co-op at GT.  His fraternity brother is now a grad student, who happened to have the exact co-op position last year.  Even had the same boss.  He coached my son through the whole interview prep, all the hot buttons to push, basically giving him the playbook to nail the interview.  Which he did, just last week.  Guy offered the job on the spot.<br><br>", "<b>Username: NoVADad99</b><br><br>I’ve heard President Miller give a variation this speech about a half dozen times. But if you’ve never heard him speak, he is a wonderful storyteller.<br>https://youtu.be/_bmVuMCoUC4<br><br>", "<b>Username: eyemgh</b><br><br>The bottom line is this, they both produce good engineers and are both well respected programs. To say however that one is better than the other is silly. This isn’t apples and oranges. It’s apples and zebras. It would be hard to find two more diametrically opposed programs. They operate in different spheres. The question is, which realm is right for you. Then, you’ll know which school is right for you. Have you visited? My son did, and although we all thought it was cool, he didn’t even apply. It just wasn’t a good fit for him. If you haven’t visited, that will likely solidify things for you.<br><br>", "<b>Username: NoVADad99</b><br><br>OP would have visited since he had to attend Candidate’s Weekend to have been accepted for admission.<br><br>", "<b>Username: RussianMom</b><br><br>Did you visit GaTech? Were you offered an Honors program spot there? You will be a part of smaller community, can sign up for classes earlier, their dorm is nice and Honors course selection is great (small groups there). My son is a CS Honors student at GaTech, doing semester abroad at HKUST. These two schools are so different. GT has a lot to offer, it is a large school with a lot of opportunities and a great network of alums.<br><br>", "<b>Username: nordicdad</b><br><br>My ME group at a popular bay area company has an intern from Olin right now and I know of at least one Olin grad here.  I probably know a few more GT grads, but not a significant difference.  Olin is definitely on the radar here.<br><br>", "<b>Username: Colorado_mom</b><br><br>“love to interact with a large and diverse group of people”  - That would be an excellent reason to pick GT (or any more traditional school) over Olin.<br>I would not rule out Olin due to job opportunities, especially if the student wants to eventually wants to settle in Boston (like my son did) or in Silicon Valley.<br>For the skimmers, I’ll add employer info from one of my links (similar to what I did for grad schools… but this time there is a heading so I know for sure the timeframe:  2006/first class thru 2016, fewer than  1000 grads)<br>OLIN - TOP EMPLOYERS<br>Google  31<br>Microsoft 30<br>athenahealth 24<br>Apple 11<br>Blue Origin 7<br>Ivani 7<br>Navy 7<br>Pivotal 7<br>Amazon 6<br>Raytheon 6<br>Rockwell Automation 6<br>Boeing 5<br>HubSpot 5<br>Synapse 5<br>Note - A few students have created their own start-ups.  My son had friends with a start-up that received $3 million in Venture Capital funding when they were  age 21 .<br>TOP SUMMER INTERN EMPLOYERS<br>Apple<br>athenahealth<br>Barrett Technology<br>Bose<br>GE<br>Google<br>IBM<br>Ivani<br>Microsoft<br>OnShape<br>Pivotal<br>Raytheon<br>Tesla<br>Top Summer Research Labs<br>Caltech<br>Harvard University<br>Johns Hopkins University<br>MIT<br>Olin<br>Of course  the above info is NOT reason for a student to pick Olin if it is not the right fit.  I only posted it  to give future readers confidence that it is possible for a new/teeny school to have an excellent reputation with employers and grad schools (even if, gasp… it us undergrad-only, with limited research opportunity)<br><br>", "<b>Username: helpless2017</b><br><br>@Chardo Congrats to your son! If you don’t mind, what department was your son involved with? When I visited GT, they really seemed to be pushing the project-based agenda, with the most visible (and symbolic) depiction being their destroying the huge ECE lecture hall to create a giant ECE Makerspace. For that reason, I was wondering how much of that is just admissions stretching the truth (though students I talked too said it wasn’t too exaggerated)<br><br>", "<b>Username: helpless2017</b><br><br>@eyemgh Thanks for the input. I have visited both, and while it was not really love at first sight for either (I mean, I really enjoyed GT, but it was also probably helped by the fact that I went from snow to 80 degree temperatures). With that, I worry that not loving Olin is dangerous - all of the students I met there either were obsessed with it or hated it, and I would hate to hate it. @NoVADad99 Is there any chance you have any information regarding whether my observation at CW is the case? Thank you so much.<br><br>", "<b>Username: helpless2017</b><br><br>@colorado_mom Thanks for the info. Does your son/his friends interact with and/or work with people outside of the Olin bubble often? I have contacts and friends at MIT, Wellesley, and Babson, and I could see myself visiting them, which would probably help, but I know my personality and that I love meeting new people and working with those who are different from me. At the same time, it seems logistically difficult to leave Olin that often; I would probably bring a car considering I live so close and Needham’s public transport doesn’t really go near Olin, but I’m not sure how well that would work out.<br><br>", "<b>Username: helpless2017</b><br><br>@RussianMom I was offered a spot in the Honors College at GT, and if I were to attend I would love to pursue that. Does your son still feel integrated with the entire GT community and the HP, or does it feel stratified? The HP does seem like a nice community among the huge school, and the HP alone is over double the size of the entire student body at Olin.<br><br>", "<b>Username: helpless2017</b><br><br>@i012575 I do agree that college should be tough and intimidating and all that, and Olin definitely feels too comfortable in that it’s 50/50 gender balanced, seems very nurturing (students and profs go by first name and do art together after school, lots of support academically, etc.), and is extremely close to home. At the same time, GT is a three hour flight away, huge and competitive, and the ECE department is significantly male-dominated. Do you have any insights on whether there’s a line between challenging and being thrown into the fire? Thanks<br><br>", "<b>Username: helpless2017</b><br><br>@nordicdad Are Olin students looked upon to have less technical knowledge? I had a technical job interview with a large engineering company last week, and they mentioned that while Olin students may make great managers and designers, they’re more skeptical of their technical abilities. Thanks for the input.<br><br>", "<b>Username: Chardo</b><br><br>@helpless2017 my son’s major is industrial and systems engineering.<br><br>", "<b>Username: Colorado_mom</b><br><br>Olin only has about 320 students … so sometimes I think of almost as a very large co-ed frat.   There is a tendency for students to stay on campus.   The academic and project load is intense (as it would be at GT too I’m sure), but the students seem to thrive on the challenge.   They are often on that Olin bubble, but liking it.   Having said that, my son did get off campus.  One of his research things was  joint project with Wellesly.    I’d guess he went to Boston about once a month.  He rode his bike and ran a lot too.   For him, most interests/ECs involved music, which he did on campus.   Oh yea, he also tutored some local kids and did a morning math(?) program at a local school.<br>“I love meeting new people and working with those who are different from me.” -   That definitely could be a concern regarding “fit”.    The Oliners have a wide variety of interests, more so than in many engineering programs.  But they are still all very STEM-focused.   To give an example, there is a Saturday night club called “Midnight Mathematicians”.   I kid you not… they meet at midnight and take turns presenting on math topics.<br><br>", "<b>Username: RussianMom</b><br><br>@helpless2017 GT Honors program is not the same and as exclusive, as Presidents Scholarship program (my son was interviewed for PS, but not selected). Several of his closest friends are from his freshman HP dorm, and it was nice to see him excited about some of the humanities courses he had a chance to take. I would say that he is pretty integrated into GT community now, especially into College of Computing community, where they do exceptional job with internships, co-ops, and many other things, including student support. All his summer internships, starting freshman year, were interesting and paid ones, and with well known companies. There are so many different activities to balance intense academic life. He is passionate about hackathons, so that kinda takes him everywhere now, and goes beyond GT community.<br>Congratulations, and good luck!<br><br>", "<b>Username: eyemgh</b><br><br>I’m beginning to get the picture that you feel better about GT, but have FOMO about Olin because it’s so different. If Olin doesn’t deeply resonate with you, I’d be wary. It’s a calling, almost like Deep Springs College. If you don’t feel that, you could be miserable. There’s higher risk at Olin. You will have to make your way more at GT than Olin, but there’s nothing wrong with that. It is, as many have pointed out, all about fit. Both are good schools.<br><br>", "<b>Username: i012575</b><br><br>Hello @helpless2017, I think it would be best if you visit and make a call. One suggestion… don’t get too carried away by the names of big/attractive employers that visit these campuses… jobs, internships/co-ops and research opportunities are plentiful. My D2 is a Junior now at GTech. Before she left for her first semester there I gave her one piece of advice/encouragement… enjoy college life and do well! It is not only a question of learning and preparing for the next stage of life but also making your best friends and savoring whatever your college has to offer beyond academic life. She has more than thrived at GTech and I am proud to say that she is ready for bigger challenges. Go Yellowjackets!<br><br>", "<b>Username: helpless2017</b><br><br>@RussianMom Does he benefit from the HP community in terms of his internships/hackathons? I was told by someone from WRT that HP will fund travel for hackathons and have separate career email lists, but I understand that these instances can be rare.<br><br>", "<b>Username: helpless2017</b><br><br>@colorado_mom In terms of the academic rigor, does your son have time for extracurriculars/jobs? I would probably want to work, even if it’s not a ton of hours, to help pay for immediate expenses and the overall cost of my education. At GT, almost all the students I met had time for 1 or 2 afterschool jobs, and it’s pretty rigorous there, so I’m wondering how tough the coursework is<br><br>", "<b>Username: helpless2017</b><br><br>@eyemgh I think you phrased it better than I ever could; I really loved GT when I visited, but I also liked Olin and am aware that it’s a rare and amazing opportunity; going to college is a privilege in and of itself, but attending a unique school with unique opportunities is probably worth something as well.<br><br>", "<b>Username: helpless2017</b><br><br>@i012575 I appreciate the encouragement, and am glad to hear your daughter is doing well!<br><br>", "<b>Username: Chardo</b><br><br><br>\"\"<br>At GT, almost all the students I met had time for 1 or 2 afterschool jobs, and it’s pretty rigorous there, so I’m wondering how tough the coursework is<br>\"\"<br><br>The coursework is voluminous and very difficult.  But the students are very smart and can handle it.  At orientation, the school stresses how hard it will be, and also stresses how none of you would be here if we didn’t know you can handle it.  But your point is true.  Many hold after school jobs, and nearly everyone participates in clubs and other activities, on top of seemingly endless hours of studying.  And they’re all better for it.  They very quickly learn time management, and naturally push themselves to excel at everything they do, as they’ve been doing their whole lives.  Employers know this.  When they hire GT grads, they’re getting someone very used to high workload and high performance.  This is true of many engineers, but especially prevalent at GT.<br>BTW, as example, my son works for a basketball analytics startup, is VP of the sports business club, plays for GT club volleyball, practices with women’s varsity, plays intramurals, goes to every basketball and football game, watches plenty of sports on TV, is active in fraternity with plenty of partying, and still finds time for all that studying.  His schedule amazes me, and he’s pretty much like everyone else there.<br><br>", "<b>Username: NoVADad99</b><br><br>I’ll let @colorado_mom speak for her kid at Olin.  My son has worked in the IT shop at Olin to earn extra money since his first semester.  He works probably about 15-20 hours a week, on top of his classes.  He is also in charge of the fundraising for the Baja Race Team this year, and will be going with the team to the annual SAE Baja Race event in Kansas this summer.  Last year he also did the Robotic Sail team but dropped it this year as the time commitment for it was too much.  He took a class at Wellesley last semeste.  He seems to be going to Boston or the neighboring area with classmates about every other week or so.  It all depends on the student and what passion he or she has and wants to pursue.  There is nothing at Olin to limit students if they want to truly do something outside of class.<br><br>", "<b>Username: helpless2017</b><br><br>Just to clarify, I meant how hard the classwork is at Olin, because if GT is hard and people have that much time, and Olin students are comparable in merit, there may be a difference in courseload.<br><br>", "<b>Username: helpless2017</b><br><br>@Chardo thanks for the comprehensive response; I appreciate it.<br><br>", "<b>Username: helpless2017</b><br><br>@Novadad99 Thanks for the response! Do you have any ideas about how the grading works at Olin? Does this affect how people make decisions about time commitments? Every time I asked anyone at CW (including the professors), they would just laugh. Obviously, the point of school is learning, but grades matter for internships, etc.<br><br>", "<b>Username: eyemgh</b><br><br>There isn’t a school where engineering is easy and everyone thinks their school is hard. In reality, the schools that ate notably harder than the test might boil down to one, Caltech. Their volume and pace are ridiculously high, and probably not to the benefit of the student (side note, two former Caltech profs told my son they wouldn’t recommend it for undergrad). Anyhow, back on track. Difficulty is not a metric that will meaningfully differentiate the two.<br>It’s true that Olin is a good school and unique. If you apply yourself and do well, you will have opportunities. What’s important to wrap your head around, is that statement is 100%, capital T true no matter where you go. To maximize your opportunity to thrive, fit then is the personal metric you should concern yourself with. If you’re a square peg, don’t pound yourself into a round hole. You won’t be happy.<br><br>", "<b>Username: helpless2017</b><br><br>@eyemgh I appreciate the honest feedback. I visited GT recently (like a week ago) and will be at Olin overnight soon as well; hopefully that will help make things more clear.<br><br>", "<b>Username: NoVADad99</b><br><br>My son doesn’t worry about ‘grades’ as probably most Olin students don’t obsess about them.  If they do the work they will get a good grade.  That’s it.  Olin expects their students to work and are capable of doing the work.  The students also help each other if someone needs help.  It’s a very collaborative and supportive environment, not a cut throat competitive one.<br><br>", "<b>Username: nordicdad</b><br><br>@helpless2017 We can hire people from any college we want.  We don’t think Olin students are lacking in technical knowledge.  They do tend to have a very hands on approach to problem solving.  There are schools that promote a more analytical approach.  We like to have a mix of analytical and hands on skills in our team.  Both approaches require significant technical knowledge.  I just remembered that this is our second year in a row with an Olin intern.<br><br>", "<b>Username: helpless2017</b><br><br>@NoVADad99 I really appreciate the information, thank you so much. If you don’t mind, is there any chance you could tell me how students distinguish themselves then? If everyone has project experience and everyone has similar grades, how do big companies, etc. decide who to hire? Are there one or two students/a “top of the class” that distinguishes itself, or is it more of a case-by-case thing? A lot of my high school success has come from being one of the very few who actively pursues opportunities, and while I know that GT/Olin will both be mostly made up of students who are similar, this level of ubiquity worries me. Thank you so much again.<br><br>", "<b>Username: helpless2017</b><br><br>@nordicdad the hands-on vs. analytical concept makes a lot of sense and definitely clarifies a lot about the differences between the two schools. Thank you so much!<br><br>", "<b>Username: NoVADad99</b><br><br>@helpless2017 For the past few years, there have been more companies hiring at Olin each Spring Career Fair than there were graduates.  Not to mention that many graduates head to graduate schools so they are not even in the hiring pool.  I am not sure there is even a student academic ranking or how they go about selecting a valedictorian.  I would think companies hire based on the specific skills and internship experiences an individual student had, and if their area of interest matches the companies, or maybe the connections the students have made with the companies over the course of his/her work, studies, and projects.<br><br>", "<b>Username: RussianMom</b><br><br>@helpless2017 I do not think HP has any direct impact on getting internships or opportunities at hackathons. It is more about close community you will be a part of your freshman year. Hackathon’s logistics/reimbursement is usually managed by organizers, but you can meet a lot of hiring companies reps during those events. At GT your college usually coordinates internship fairs, hiring events, but there are some campus-wide events too. However it is a good idea to add information about HP to your resume. Let us know what you decide to do. Good luck!<br><br>", "<b>Username: NoVADad99</b><br><br>@helpless2017 Looking back at your questions and concerns about Olin (about its ‘level of ubiquity’ and concerns about standing out among your classmates, and your desire for research opportunities), I really think you are not the right fit for the school.  You will do yourself a favor if you pick GT since it meets all the things you have concerning Olin’s culture.  Please don’t take this as criticism. As others have said, it is about fit and culture.  You are a much better fit at GT than you would be at Olin.<br><br>", "<b>Username: helpless2017</b><br><br>@NoVADad99 Thank you so much for the honest advice and comments. I’m doing an overnight extremely soon, which will hopefully provide context one way or another: is there any chance I could please ask more questions, if I have any, after that? Thank you so much again.<br><br>", "<b>Username: helpless2017</b><br><br>@RussianMom thank you for the advice! I have really enjoyed several high school hackathons, and am excited to pursue college ones in the future, regardless of where I go.<br><br>", "<b>Username: helpless2017</b><br><br>@NoVADad99 Also, just to clarify, I didn’t mean to portray myself as a cut-throat competitive person with no interest in collaboration - I was just worried about ensuring that I have an education that employers view as valid and having grading that makes sense in the context of where I attend. Thank you again for all of the advice throughout this thread.<br><br>", "<b>Username: Colorado_mom</b><br><br>Olin comment based on recent questions/discussions above:<br><br>[QUOTE=\"\"]<br>TIME/JOBS - My son did have some minor campus employment (interesting stuff, but he did not earn a lot of money).  During senior year he continued his summer gig, a few hours per week remotely (and then went to same place after graduation).  All four years he did A LOT of EC, even though the academic workload/projects were intense.  However he often sacrificed sleep, not uncommon at engineering schools.<br>GPA - There seems less focus than other schools, partly because there is high demand for graduates.   The good thing is that Olin (and MIT and Harvey Mudd and I think some other engineering schools) have pass/fail first semester.  That allows students to get accustomed to college. Also they can learn that collaborative learning is good (and real life!) without worrying about who gets the top grade.   You’d think it would make students lazy, but they work surprisingly hard even in the first semeser.<br>“hand-on” - Olin haslots more project work than my engineering program and more than most other programs today.  It is not a vocation-tech kind of thing, w/o mathematical analysis. The technical analysis is often paired with practical uses.   I assume there is less probably less problem set kind of learning than I had.<br>FIT - It is important for a student to be a good match at any school.  But it’s especially critical at teeny school, even more so at Olin since the work is so hard.   It works best if the student absolutely loves the environment and the learning approach.   I often encourage students to put Olin on “the list” to learn more about project-based learning and hone their education preferences.   But due to it’s low acceptance rate and the fact that it is a niche-fit, I never push hard on it.<br>[/QUOTE]<br><br>Another thing I should mention is that small schools have few majors, so  opportunity for switching is very limited.   If you evolve to a major not offered, you need to transfer.  Due to Olin’s non-traditional course sequences, it might be hard to transfer credits.  (Not sure - a very high percentage of students stay.)<br><br>", "<b>Username: fatherofsam</b><br><br>Though I don’t have any direct first hand experience at Olin or GT, my D faced a similar decision. She was waitlisted at Olin and accepted into the GT honors program. So her decision was between a gap year + Olin vs. GT honors so not quite the same.<br>I agree with the veterans on this forum that the “fit” is extremely important. My D did love the Olin culture and family feel, the unique approach to engineering education etc. Only you can decide if there is a good fit.  Both of these schools are outstanding and though GT has a more recognized brand, most who know both schools know they are excellent and consider them peers. (I’m an engineer myself).<br>My D decided on GT. The gap year definitely played a role but she also felt like she will get the best of both worlds at GT honors - a small community with some small honors classes but in a larger school in a large city that has more opportunities. She knows she will have to seek out many things that would come easier at Olin though, e.g. she will need to get her project experience from clubs, etc.<br>Good luck with your decision!<br><br>", "<b>Username: Colorado_mom</b><br><br>“she will get the best of both worlds at GT honors - a small community with some small honors classes but in a larger school in a large city that has more opportunities.” -  That’s a great combination.  Best of luck to her!<br><br>", "<b>Username: fatherofsam</b><br><br>Thanks @colorado_mom. She was initially upset by the Olin waitlist (there were plenty of tears) but I’m glad to see that she bounced back quickly and is really exited about GT! We ordered her GT swag and she is ready to go!<br><br>", "<b>Username: helpless2017</b><br><br>@NoVADad99 @colorado_mom I honestly went into my overnight visit ready to confirm my idea that I didn’t want to go and would be happier at GT, but I really enjoyed the community, and I now see why grades aren’t relevant here (students told me there were so many offers, diversity of skills, and the power of Olin in that they didn’t even need to put their gpa on their resume to get jobs). Many students heavily vested in technical research spoke to me and made me feel hopeful about that whole concept. Thank you so much for all the insight throughout this thread. I was wondering if you could share (if your children are older) the extent to which students become cynical and jaded about Olin: I know that happens at all schools, but I could see it being extreme in small schools<br><br>", "<b>Username: NoVADad99</b><br><br>My son has not become jaded at all.  He knew since first year of HS he wanted to be at Olin and was happy to have his gap year to get in.  He has some very close friends with whom he goes out all over the area with, and the 50-50 gender ratio also helps in the social life.  He spent his gap year at a very large state flagship university and did all the traditional college things there so he can easily compare the differences, and he still chose Olin after that year.<br><br>", "<b>Username: NoVADad99</b><br><br>@helpless2017 Let us know what you decide in the end.<br><br>", "<b>Username: HeloDada</b><br><br>Jaded? Since my Oliner is a first year I can’t be authoritative on what will happen later. But I have already seen some healthy skepticism about some Olin things (in other words he hasn’t completely drank the Kool-Aid). And when I have seen him hanging with Olin friends they all seem to have a good sense of humor about Olin’s uniqueness. This is not to say they don’t love the culture, it is just that they are self-aware and mature about it. My guess is that for the first couple of years Oliners think and talk about the culture a whole bunch. But by years three and four it is just part of them. I’m not sure if this at all answers what is a very good question.<br><br>", "<b>Username: fatherofsam</b><br><br>@NoVADad99 - Just wanted to add that my D would have likely considered a gap year at another school but Olin no longer permits that as an option…  You can’t enroll part time either but you can take a summer class or something similar.  I suspect that they have lost a few gap year kids since they get attached to their school and don’t want to leave.<br><br>", "<b>Username: HeloDada</b><br><br>@fatherofsam I don’t think a fear of “losing” students is why Olin discourages signing up as a matriculating student at another school during gap year. It is an ethical issue because the other school thinks they have a new student – but really doesn’t.  Besides taking a spot from another student, it has a negative impact on the other school’s stats. I could be wrong, but my understanding is that Olin doesn’t have a problem with wait list students taking classes during their gap year – it is just that they don’t want them accepting an admission offer from another school.<br><br>", "<b>Username: fatherofsam</b><br><br>@HeloDada - I would understand that if Olin permitted part-time enrollment at another university, which they don’t. I wouldn’t think it is an ethical issue to take a few classes in the fall and spring of your gap year as a part time student. I’m taking this thread off topic though, so I apologize for that.<br><br>", "<b>Username: eyemgh</b><br><br>Cynicism is natural and not necessarily a measure of reality. My son goes to Cal Poly. It’s the only program he knows. He takes for granted the class experiences he gets as typical of everywhere, but they aren’t. His school has a lab for every engineering class. They have 5 wind tunnels in their fluids lab, a rotational dynamics and vibrations lab, all in all over 80 dedicated engineering only labs. It’s their unique thing. Olin has it’s unique thing. At the end of the day, they will all mint new engineers who can talk the talk and work the work. How you personally get there is a matter of choice. Just remember, if a student gets jaded about the their program, they probably haven’t been at another to know how special their situation is.<br><br>", "<b>Username: HeloDada</b><br><br>@fatherofsam I’m not sure why you think Olin doesn’t “allow” students to take classes during their gap year. My understanding is they do allow it, and even if they didn’t they couldn’t police it anyway. And here’s a link to a gap year blog on the Olin site that talks specifically about taking classes: http://www.olin.edu/blog/olin-admission/post/gap-year-part-2-time-flying/ And I share in being sorry for the thread hijack, but I couldn’t leave the bad info up there.<br><br>", "<b>Username: NoVADad99</b><br><br>@Helodada @fatherofsam  I was at CW1 this year and the Dean of Admissions said at one of the presentations that they don’t want to have gap year students enroll at another college before starting at Olin.  I took that to mean full time enrollment like my son was able to do.  I think this was a change in policy that was just announced for this class.  I am not sure though of their position on part time classes.  I would direct you to call the admissions office if you are really interested in an answer for that.  Good luck to your daughter at GT.<br><br>", "<b>Username: fatherofsam</b><br><br>I love it when people jump in when they don’t have all the facts. For 2017, Olin does NOT permit part-time enrollment, which is what I stated above. This may have been different in year’s past. This is directly from Olin:<br>Are there any restrictions on what I can do during my gap year?<br>You may spend your gap year traveling, working, volunteering or studying (and that’s just to name a few ideas!). While you may take a course at another university, you may not enroll as a part-time or full-time student.<br>Again, I’m not bashing Olin - it is a fabulous school that my D would have very likely attended if not waitlisted. But I wanted to state the facts.<br><br>", "<b>Username: helpless2017</b><br><br>@HeloDada @NoVADad99 Thank you for all of the insights throughout this thread; you, as well as many of the students at my overnight, changed my entire understanding and perception of Olin culture: I frankly did not realize how genuine everyone was (or at least seemed). I’ll definitely let this thread know what I decide.<br><br>", "<b>Username: helpless2017</b><br><br>And in terms of the gap year comment @fatherofsam @NoVADad99<br>Emily Roper-Doten specifically said, at least during CW1, that you couldn’t formally enroll as a student at any other school: she said it was because she didn’t want students to start at another school and then leave that unfinished, though surely losing students is part of it too. You could probably get away with one class as part-time enrollment (at least around here) requires 2 classes.<br><br>", "<b>Username: Colorado_mom</b><br><br>My Oliner was never jaded (heck he still has Olin roommates, even though graduated). But it he did appreciate the opportunity to do semester abroad junior year for a change of pace.   However, I can see how most students would prefer a larger and more varied campus.<br><br>", "<b>Username: jeffgordon</b><br><br>A traditional gap year at this academic stage is getting admitted, asking for a year’s deferral, and taking a gap year. There’s another kind of gap year at Olin. Waitlisted students are told they might get in for the coming fall semester but, if not, they are guaranteed admission the following fall - after a full academic year. This is still called a “gap year” but it’s clearly different. I don’t think Olin is worried about losing these students to other colleges. They wish them the best. If some of them end up at another school, well, Olin has many other students available to fill a freshman class.  My waitlisted son knew he wanted to attend Olin. During his gap year he took manufacturing technology courses at a local community college and brushed up on math and Spanish at a local 4-year school.  The community college courses especially helped him realize he’s more passionate about mechanical engineering than computer science and software engineering. He also worked and lived at home. Not what he or we would have chosen but, looking back, an ideal year in his and our lives. It would have been less-ideal without taking those classes.<br><br>", "<b>Username: helpless2017</b><br><br>After some serious soul-searching, I’m excited to say I have decided to enroll at Olin! Thank you so much to everyone in this thread for advice and for helping me understand what I wanted in a school.<br><br>", "<b>Username: HeloDada</b><br><br>Congrats.  And clearly you’re not helpless at all!<br><br>", "<b>Username: MuggleMom</b><br><br>Congrats OP on making a decision. For some students, the decision to go to Olin is really hard, for others, its as if no other school could possibly be what they wanted.<br>I know that I’m late in the game, but I did have some comments.<br>In comment 32 you said “I had a technical job interview with a large engineering company last week, and they mentioned that while Olin students may make great managers and designers, they’re more skeptical of their technical abilities.”<br>Everyone at Olin has heard stories about how Oliners come out on top, no matter the situation. This blog is a good one that I think reflects one possible situation.<br>http://olin.edu/blog/career-and-graduate-stories/post/what-happens-when-you-don%E2%80%99t-mind-if-you%E2%80%99re-not-smart/<br>I feel that the blogs give a good insight into the culture and student body of the school. If you haven’t spent time looking at them, it would be time well spent.<br>My D had a hard time deciding between a well established school and Olin. (not GT, but similarly established and respected) She literally could not decide. Her heart wanted Olin and her brain felt that the well established school would give her more research and job opportunities. The truth is, there is no right or wrong choice. I know that she would have done great at either school. For her, it came down to what made her happy. The people at Olin made her happy. They still do. She is clearly having the time of her life. As a first year, she has a corporate internship set up for the summer.<br>When you get to Olin, you’ll realize that your experience is what you make of it. Take the opportunities. Step outside your comfort zone. Ask your questions. You never know what the answers are going to be.<br>Best of luck.<br><br>"]}