{"title": "pitt bsmd guaranteed admission program vs yale close to full ride", "comments": ["<b>Username: Deming</b><br><br>My son had his GAP interview at Pitt’s School of Medicine yesterday and it went pretty well. He’s very confident that he’s gonna get admitted into the program, but at the same time is struggling in deciding if he should be attending as he has an offer from Yale with a financial-aid package close to full-ride.<br>His ultimate goal is going medicine. Going with the Pitt’s GAP is obviously the way to achieve his goal in one-step shot in a top-10 med school, however, he is looking at about 20k/yr for four under graduate years (he’s awarded 20k scholarship but we have to pay the out-state tuition since we are from California), vs Yale offered a total package with only 5k EFC. The other thing bothers my son is that for the GAP you have to maintain a 3.75 for each semester (both overall and BCPM), which means if you miss one, you will be out from the guaranteed medical school admission and end up with a Pitt undergrad education for roughly a cost of 80k in four years, where with Yale you will earn a Ivy undergra education with far less cost and may still get to a decent med school down to the road.<br>It will be a hard decision for sure, and we don’t know how to give advice to our kid. Anyone who experienced the same before can you please share your thoughts/experiences to help us?<br>Many thanks!<br><br>", "<b>Username: PurpleTitan</b><br><br>Yale would open up more opportunities.<br>Considering that it would cost less and the Pitt auto-admit requires an insanely high GPA (if he gets that GPA, other med school’s are likely as well, so the auto-admit is of little benefit), this is a no-brainer.<br>How many people actually know what they really want to do with their life at 18, anyway? Wouldn’t it suck if he realized that he didn’t actually want to be a doctor after all but he went down the Pitt path?<br><br>", "<b>Username: RoundGenius</b><br><br>Between the cost and the name recognition, Yale is hard to beat.<br><br>", "<b>Username: MedSciBud</b><br><br>Please consider that in GAP, your S does not need to fight again 4 years from now for a med school admission with 2-3% acceptance rate!<br><br>", "<b>Username: trackmbe3</b><br><br>@Deming  In addition to weighing cost, prestige and fit, if your goal is med school, you should go to the school where you think you have the best shot at a high gpa. And where you can get the most opportunity to do research and intermships. Pitt is known for excellent sciences and has the Universy of Pittsburgh medical center right on campus for easy opportunity and access to gain experience through shadowing, research or internships. Yale students are generally brilliant so the question is if your competition are geniuses will you be able to do as well in the premed coursework there as at Pitt? And compete with them for internships, research opportunities?  This is not at all to belittle the quality of students at Pitt, which are of excellent quality too, but you can’t compare the selective admissions process of Yale vs Pittsburgh. I hear anecdotally that the premed curriculum at Pitt is very rigorous and achieving high grades there will be difficult as well. You should try and speak to some premed students at both schools and find out how good are the premed professors at each school and how are the grading practices is each. Sometimes the grading at the more selective school, such as Yale,  is higher than at a less competitive school, particularly a state school where professors seek to weed out a majority of the class.  This could help you make the decison. Med schools don’t care so much what undergrad school you go to as much as how you do in the sciences and what experience you obtain, showing a demonstrated interest in medicine. However if you decide to switch out of premed then Yale would provide more opportunity in my opinion. Also ask yourself if you thrive better as a big fish in a little pond (I.e., at Pitt)  or not?<br><br>", "<b>Username: PurpleTitan</b><br><br>^ If he maintains the insanely high GPA and still wants to be a doctor.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> Deming:<br>\"\"<br>The other thing bothers my son is that for the GAP you have to maintain a 3.75 for each semester (both overall and BCPM),<br>\"\"<br><br>That very high GPA requirement significantly devalues the GAP at Pitt, since it is likely that most students (including many who could get into medical school the usual way) fail to meet it.  Meanwhile, a student who does meet that GPA, and gets a good MCAT score, has a good chance of medical school admission, though s/he will have to go through the application process.  See https://www.aamc.org/download/321508/data/factstablea23.pdf .<br><br>", "<b>Username: trackmbe3</b><br><br>I agree it will be difficult to maintain such a high gpa at Pitt.<br><br>", "<b>Username: Deming</b><br><br>Thanks to you all for very helpful points/thoughts. This discussion touches right on our painpoints in terms of making a decision. One voice is telling us this is the great opportunity if my son’s long-term goal is going into medicine and this is his chance to his goal locked at this early stage without going through that hard selection process again he just went through (may be even tougher considering the depth of the requirements like MCAT vs SAT, GPAs for high school courses vs college courses, etc.). But on the other hand (mainly from our parents’ perspectives), what if he fails to maintain the 3.75 GPA at one point? you are talking about giving up the close to full-ride opportunity at an Ivy university vs you pay 80k for a second tier undergrad and ended up going nowhere in medicine. It’s very hard to us to justify this especially given our low financial status. Which way is really worth to go with? But certainly we don’t want to put this pressure over our son just because of financial number. It’s just like the decision whether you would let your kid do medicine or not. At the interview day, the Pitt med school gave our parents a budget projection in terms of how much debt the student is looking at after four years medical sudy, $320K! That’s more than our house value or our life time saving, and it’s all after tax out of the pocket. I worked hard for the last 20+ years and am still struggling for my mortgages and daily living. With that cash, you could be early-retired to some extend. So at the end of the day, where that equation is? Yale might be a safer way or at least you secure a decent education with less cost at the front while still leave the doors open for next steps in Medicine. But again, if we give this advice to the kid, we really don’t want to see some day he comes back to us without getting into the medical school and feel regret. I don’t know. We will obviously have a very tough decision to make…<br><br>", "<b>Username: MedSciBud</b><br><br>@Deming - tough but good situation to be in - considering so many of us who are still waiting for one good admit!<br>Did your S get in Yale EA? Do you mind sharing stats?<br><br>", "<b>Username: i012575</b><br><br>@Deming, I have first hand experience of this as a parent. My D1 was a GAP admit a few years back, she had acceptances from Harvard, UPenn and other top schools for undergrad. In her case though, she did not receive any scholarships from either Harvard or UPenn, EFC too high as well.<br>She is at Pitt Med now. She graduated from Pitt with close to a perfect GPA and an MCAT score of 36 and did not even bother applying to other Med schools. She has had a fantastic experience at Pitt, both academically and socially. She has done a volunteer gig last summer in an Argentinian community hospital and has lined up a couple more for next summer. Recently, she and her team were given a sizable grant (from a private drug company) to implement a drug distribution model alongside their Pitt Pharmacy folks in rural China. As a proud parent, I am happy to see her blossom into a terrific young lady. I am very sure the environment at Pitt played quite a big role in this.<br><br>", "<b>Username: Deming</b><br><br>Thank you, i012575. I know Pitt GAP is a very good program and there are tons of opportunities there for the kids. I am just not that so confident that my son can keep up good work in all four years (actually you need to perform well every semester as if your GPA fall off 3.75 one semester you are out). And not like the girls, the boys tend to be less self-disciplined when parents are not watching them. Parties, drinks, you know, all those college fun can easily make them forget their primary focus. I am just so worried.<br>If we don’t have other choices then it’s a straight call. But talking about giving up other good opportunities, like yesterday he just got another offer with close to $6k EFC from JHU studying in BME, it will be a really tough call for us to make…<br><br>", "<b>Username: PurpleTitan</b><br><br>Honestly, Yale (or JHU) is actually the more responsible choice here.<br>You talk about the regret he’d feel if he went to Yale and didn’t get in to med school.<br>What about the regret he’d feel if he goes to Pitt and doesn’t manage to stay in the GAP program?<br>In the first case, he’d at least have a Yale degree for almost free.<br>And I don’t think trying to maintain 3.75 GPA is less pressure than going through the regular med school process.<br><br>", "<b>Username: actsatmed</b><br><br>First off my hearty congratulations to your son for securing both places. Though tough place to be, it is a more happier situation to be in. If I was in such a situation in, I will go for Yale. But if he can maintain a High GPA in high school, I would not worry about maintaining more than 3.75 in college. Can you plesae post what was his SAT ACT GPA scores for me to aim for next year.<br><br>", "<b>Username: JustGraduate</b><br><br>Is there a GPA requirement for continuing to receive any of the Yale aid?<br><br>", "<b>Username: sgopal2</b><br><br>Couple of things to keep in mind<br><br><br>3.75 GPA is not insanely high. In fact getting into any med school (let alone Pitt) with a GPA less than 3.8 is a struggle. So this sounds to me like it wouldn’t be too hard to get<br><br><br>Medical school admittance rates are considerably lower than Ivy league schools. I’m not sure what Pitt Med’s acceptance rate it, but it is probably a lot harder to get into than Yale college<br><br><br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> actsatmed:<br>\"\"<br>But if he can maintain a High GPA in high school, I would not worry about maintaining more than 3.75 in college.<br>\"\"<br><br>Earning a 3.75 GPA in college is a lot harder than earning a 3.75 GPA in high school.<br>Also, a student who earns a 3.75 GPA has a decent chance of getting into medical school the usual way.<br><br>", "<b>Username: PurpleTitan</b><br><br>@actsatmed & @sgopal2:<br>Maintaining a 3.75 at a decent college or better on the pre-med track is considerably harder than getting close to a 4.0 at a regular HS.<br>Yes, you need a high college GPA to have a good chance at med school. That’s why most undergrads who start out thinking they will become a doctor don’t actually manage to get in to med school.<br><br>", "<b>Username: ventana10</b><br><br>My cousin is in her second year at Duke Med; she graduated with a 3.9 but had to work a year and retake the MCAT.<br>She received a nice aid package and will graduate with less than 50k in loans. Pitt would be a bad financial choice.<br><br>", "<b>Username: grtd2010</b><br><br>@Deming  If your DS, can get into Yale, he can surely meet 3.75 GPA at Pitts. Yale would not be any easier  to maintain a high GPA to get into regular medical school process.<br><br>", "<b>Username: PurpleTitan</b><br><br>@grtd2010: On what experience are you basing that assertion on? What adcoms look for in HS students (a variety of things) and what a high GPA in a pre-med track requires may be pretty different.<br>Yale would not be any easier, but Yale presents better fallback options in case someone can’t or doesn’t want to go to med school.<br><br>", "<b>Username: i012575</b><br><br>Pitt Med acceptance rate<br>https://oafa.pitt.edu/explore/guaranteed-admissions-programs/medicine-gap/<br>Q: How many Pitt undergraduates, with or without the GAP, are admitted to Pitt’s School of Medicine?<br>A: For the fall of 2015, 5,371 students applied for admission to the University of Pittsburgh School of Medicine and 390 were offered admission. Nine percent (9%) of the applicants accepted completed their undergraduate work at the University of Pittsburgh. In the same year, the first year class consisted of 148 students. Fourteen percent (14%) of the first year class completed their undergraduate work at the University of Pittsburgh.<br>**<br>Based on my D1’s class of GAP admits, she would say around 50% joined her at Pitt Med, rest either did not qualify or left for other opportunities. And yes, getting a 3.75 cGPA for Science subjects, even for the smartest of students, is not a cakewalk.<br><br>", "<b>Username: Zinhead</b><br><br><br>\"\"<br>Based on my D1’s class of GAP admits, she would say around 50% joined her at Pitt Med, rest either did not qualify or left for other opportunities. And yes, getting a 3.75 cGPA for Science subjects, even for the smartest of students, is not a cakewalk.<br>\"\"<br><br>Pitts requirements for the program include a minimum ACT/SAT of 34/1490 and they must maintain a 3.75 overall and science GPA. No MCAT is required. Given that there is a still a 50 percent drop-out rate with no MCAT, I would save the money and go to Yale.<br>http://www.medadmissions.pitt.edu/admissions-requirements/guaranteed-admissions.php<br><br>", "<b>Username: grtd2010</b><br><br>@PurpleTitan  For pre-med Science GPA is important (Physics,Chemistry,Biology,Math). I hope your son is good at these subject and can get A’s. There are very smart kids in Yale to compete for A’s too. Other BS/MD programs have similar requirements like 3.6 GPA. Average GPA for entering MD class is around 3.7 in most schools.<br><br>", "<b>Username: PurpleTitan</b><br><br>@grtd2010: Indeed. I was responding to your assertion: “If your DS, can get into Yale, he can surely meet 3.75 GPA at Pitts.”<br>I daresay not every Yale admit can pull a 3.75 GPA at Pitt.<br>And as I mentioned, Yale would provide more options if med school is not wanted or possible. Not to mentioned cheaper as well.<br><br>", "<b>Username: grtd2010</b><br><br>@PurpleTitan Yes, you should consider other backup plans in case med school is not desirable/feasible. There is an element of risk in any choice. It depends on your DS and you to feel comfortable with the level of risk. It is the uncertainty what one fears the most.<br><br>", "<b>Username: 2sunny</b><br><br>@Deming Congratulations on the dream offer from Yale! <br><br>", "<b>Username: mom2collegekids</b><br><br>This is a tough call. They each have their pluses and minuses.<br>As awesome as JHU is, it has a rep of being a grind for premeds.  JHU for med or residency.  Not so great for undergrads.<br>Yale is tough on premeds as well.  I’ve told this story before.  When my son was a college freshman premed I ran into an old friend whose son was a freshman premed at Yale.  Her son was determined to go to med school and they were confident Yale would pave the way. The friend was aghast that my son was attending a mid-tier flagship and she voiced a lot of doubt about whether he’d get into a med school.  Fast forward a few years, her son’s GPA was not med-school worthy.  My son will be graduating from med school in May.<br>Don’t believe the hype about Yale inflation and that everyone gets A’s in their classes.  Maybe it’s that way for other paths, but the premed prereqs are still weeder classes at Yale.  Like every other college in the nation, they must reduce the number of their premeds.<br>As for UPitt @ucbalumnus is exactly right.  College is much harder than high school when in a serious major.  Adding premed path into the mix makes things even more difficult.  I have two premed parent forums and every fall parents are posting that their child-who’s-never-received-a-B-in-his-life is now struggling to bring his mid-semester C average in Gen Chem or Bio up to please-be-at-least-a-B.  These are kids who took the most rigorous high school schedules, took the zero period class, and were top 1-5% of their class.<br>I’m a little shocked that the 3.75 GPA req’t is “per semester” and not evaluated at the end of the year.  Bio, chem, and physics classes are usually 4-5 credits per class and a B in one of them can sink a semester’s BCPM GPA even if the student gets A’s in the other BCPM courses he takes that semester.<br>Considering that the Pitt program only takes the cream of the high school crop (poaching from Ivys), and 50% don’t make it thru, there’s reason to be concerned.<br>Of course a Pitt student who gets booted from the program can still proceed as a premed, get GPA where it needs to be and apply to other med schools later.  BUT…the $20k per year EFC may be an issue to the family.  Is it?<br><br>[QUOTE=\"\"]<br>\"\"<br>\"\"<br>...may still get into a decent med school down the road.<br>\"\"<br>\"\"<br>[/QUOTE]<br><br>Lol…I can’t let that sentence pass.  We don’t have any “decent” med schools in the US.  All of our med schools are excellent.  There are about 145 med schools in the USA.  They all teach the same things; the education is flat. Any premed should be thrilled to get into any of them.  No one is too good for any of them.<br>My vote is for Yale. Cost-wise it’s better.  The Yale name will help if his career path changes.  Just remind him NOT to believe the Yale-hype about 90% of students get A’s.  That doesn’t apply to premed prereqs.  He’ll have to be self-disciplined.  Freshman have so many distractions and it’s their first time away from mom and dad.<br>If he gets at least a 3.7 GPA at Yale and scores well on the MCAT (sounds like he’s a strong test taker anyway), and has medically related ECs and some research experiences, he’ll likely get into a med school.  As a Calif resident, he’ll need to apply broadly and include some Midwest privates since getting into a Calif med school is crazy difficult.<br><br>[QUOTE=\"\"]<br>\"\"<br>\"\"<br>His ultimate goal is going medicine. Going with the Pitt's GAP is obviously the way to achieve his goal in one-step shot in a top-10 med school, however, he is looking at about 20k/yr for four under graduate years (he's awarded 20k scholarship but we have to pay the out-state tuition since we are from California), vs Yale offered a total package with only 5k EFC. The other thing bothers my son is that for the GAP you have to maintain a 3.75 for each semester (both overall and BCPM), which means if you miss one, you will be out from the guaranteed medical school admission and end up with a Pitt undergrad education for roughly a cost of 80k in four years, where with Yale you will earn a Ivy undergra education with far less cost and may still get to a decent med school down to the road.<br>\"\"<br>\"\"<br>\"\"<br>\"\"<br>[/QUOTE]<br><br><br>", "<b>Username: srk2017</b><br><br>@Deming - I will also vote for Yale given that it’s almost full-tide. Right now we are debating between BU SMED (no aid) vs Vanderbilt full-tuition. We are also from CA and wondering if we should give up the choice of UC medical schools by going to BU (7 yr program). With Pitt, you have an option to apply out though.<br><br>", "<b>Username: Zinhead</b><br><br>@Deming - Vandy’s med-school placement rate is not that healthy compared to its peers.<br>As for BU SMED, they do require the MCAT, although the required score is not as onerous as some other combined programs, and the GPA requirement of a 3.2 is relatively low.<br><br>\"\"<br>Seven-year medical students entering the program after May 2013, although admitted to the School of Medicine, are required to take the Medical College Admissions Test (MCAT) no later than January of the third year in the program. Students must achieve a combined score at or above the 80th percentile on the four numerically scored sections of the MCAT. The results of the MCAT are considered by the Promotions Committee when it makes the final decision as to whether to promote a student to the medical curriculum.<br>\"\"<br><br><br>", "<b>Username: srk2017</b><br><br>@Zinhead - Yes, BU requirements are not stringent. I thought Vandy’s placement record is decent. Do you have any additional info?<br><br>", "<b>Username: Zinhead</b><br><br>See attached.<br>https://as.vanderbilt.edu/hpao/documents/2014_Annual_Report.pdf<br><br>", "<b>Username: mom2collegekids</b><br><br>My post above should say:  Don’t believe the hype about Yale’s grade inflation<br>&lt;&lt;&lt;<br>Vandy’s med-school placement rate is not that healthy compared to its peers.<br><br>[QUOTE=\"\"]<br>\"\"<br>\"\"<br>@Zinhead <br>\"\"<br>\"\"<br>[/QUOTE]<br><br>Take reported numbers with a grain of salt.  These numbers are often manipulated.  Vandy is uniquely VERY forthcoming about their details, even putting them on their website.  Other schools are purposely more vague (more loosey goosey.<br>Also, we don’t know if other schools more actively limit who can/should apply to med school.<br>BTW…JHU admits to having acceptance rate issues, but rightly explains them by saying that they don’t limit who applies and some students/parents ignore their wise advise and either apply to too many reaches or apply when their stats aren’t med school worthy.<br><br>", "<b>Username: Zinhead</b><br><br>@mom2collegekids  - I think we discussed this on another thread, but Vandy’s acceptance rate and med school placement in terms of total number of kids accepted was low compared to its peer private universities. This is especially surprising since Vandy places significant emphasis on test scores on the undergraduate level and these kids should score well on the MCAT. The fact that other similarly ranked private schools have more kids enrolled in med school leads me to believe something is off about Vandy’s pre-med program. To spend $200,000 on tuition one would expect a higher placement rate than 66 percent especially since most of Vandy’s pre-med’s would have qualified for AU’s free tuition and 55 percent placement rate.<br><br>", "<b>Username: mom2collegekids</b><br><br>@Zinhead do you remember in what thread we discussed this?<br>How do we know how accurate the other schools’ numbers are?<br><br>", "<b>Username: Zinhead</b><br><br>@mom2collegekids - Sorry, I can’t remember. It was probably one of the College Search and Selection Threads.<br>The only real numbers one has to to work with is the AAMC application data which you are familiar with as well as the size of the freshman class. The other numbers like % of pre-meds is sourced from the schools and should be taken with a grain of salt.<br><br>", "<b>Username: mom2collegekids</b><br><br>So are you assuming that the peer schools should have similar numbers applying (proportional to frosh class size)?<br><br>", "<b>Username: mom2collegekids</b><br><br>@Zinhead this thread?<br>http://talk.collegeconfidential.com/discussion/comment/20313792/#Comment_20313792<br><br>", "<b>Username: Zinhead</b><br><br>@mom2collegekids - That thread was one of them.<br><br>", "<b>Username: 2sunny</b><br><br>Yale offer is amazing! Many doors will open up… :))<br><br>", "<b>Username: pittorv</b><br><br>How to you guys compare the Pitt BSMD to Vandy’s premed? If you are admitted to both, will you be taking the Pitt BSMD for a price tag of $25,000/year, or going to Vandy with a close to nothing cost?<br><br>", "<b>Username: 2sunny</b><br><br>@pittorv  I like the Vandy option, in your example!  <br><br>", "<b>Username: Arwen1</b><br><br>Banking on getting 3.75 GPA every SEMESTER is not…a great option. Yearly GPA? OK, but semesterly?<br>If everything goes smoothly for your child, then yes, it works out. But what if it doesn’t? 3.75 means the student would have to pull an average of slightly above A- in all his/her classes.<br>What if the student has a rough semester? Gets ill? Somehow mismanages an exam and does more poorly than expected? Then that guarantee goes away, and you’re stuck paying more money.<br>Yale at that low EFC is a great price and has more flexibility.<br><br>", "<b>Username: pittorv</b><br><br>True, the 3.75GPA thing bothers me a lot. But on the other hand, if you want to get into a med school like Pitt Med, you need to achieve a 3.86 and above GPA not to mention the MCAT and all other stuff. Giving up a Pitt GAP opportunity would be real hard decision. But again, a close to 100k loan will not be easy for most of the working class families.<br><br>", "<b>Username: PurpleTitan</b><br><br>@pittorv: Yes, but if the OP’s kid fails to pull that high GPA, at Yale, they’d still get a Yale degree. At Pitt a Pitt degree.<br>Slight difference.<br><br>", "<b>Username: MYOS1634</b><br><br>Don’t take a 100k loan for Pitt GAP when your kid can go to Yale for almost free and have equally good outcomes.<br>A kid who can maintain that GPA at Pitt can maintain that GPA at Yale and get into med school without GAP,  and costs would be incredibly lower. (anyone who thinks skipping the MCAT is a deal-breaker doesn’t have what it takes to make it to med school. It’s a test,  your child is a good test taker, it won’t be easy but it’s easier than maintaining a 3.75 GPA each semester as a premed and it certainly is not the difference between getting into med school at Pitt vs.not at Yale.)<br>In fact,  considering half GAP students drop out vs. a minuscule number at Yale,  I’d say Yale is the safer route to med school at this point. And a Yale degree will open doors.<br><br>", "<b>Username: Zinhead</b><br><br><br>\"\"<br>How to you guys compare the Pitt BSMD to Vandy’s premed? If you are admitted to both, will you be taking the Pitt BSMD for a price tag of $25,000/year, or going to Vandy with a close to nothing cost?<br>\"\"<br><br>I would go with Vandy. It may not make much a difference in terms of getting into med school, but the non-med school opportunities are better and the money saved can be used to good effect later on.<br><br>", "<b>Username: srk2017</b><br><br>@Deming - I heard Pitt GAP decisions are out, did your S get it?<br><br>", "<b>Username: pittorv</b><br><br>@Arwen1 It was stated on the acceptance letter that the 3.75 GPA is by the end of the Junior year, not each semester.<br><br>"]}