{"title": "cornell vs umich ross", "comments": ["<b>Username: soymilk23</b><br><br>Hey guys,<br>Based on the colleges I got into this year I have narrowed my decision down to two choices: Cornell University’s college of arts and sciences and University of Michigan’s Ross business school. My interests are mathematics, computer science, and finance, and I hope to maybe become a quantitative analyst one day.<br>At Cornell I would probably major in mathematics with a concentration in operations research, while at Ross I would get a bachelor’s in business administration with maybe a minor in mathematics. I was wondering which school would have better placement on Wall Street, but I also was wondering which college would have the more enjoyable experience.<br>Any help would be appreciated.<br><br>", "<b>Username: Penn95</b><br><br>@soymilk23 If it was any other ivy i would say the ivy without thinking about it, but I would take a moment to think more about Cornell vs Ross. in the end i would still say Cornell though. Cornell has extremely good placement on Wall-Street and it is more of a target school than UMich Ross. Also you will probably get a better overall education. UMich is a phenomenal school but I wouldn’t really choose it over the ivies for your areas interest.  Unless of course there is a substantial financial aid difference or sth major like that, in which case UMich is an excellent choice over any ivy.<br><br>", "<b>Username: soymilk23</b><br><br>@Penn95 Thanks for your input. I haven’t received my financial aid from Cornell yet, but I got absolutely nothing except for a couple thousand dollars in loans from Michigan since I’m out of state. Since Cornell says they meet financial need I would expect to get a decent amount.<br><br>", "<b>Username: happy1</b><br><br>Wait for the financial package from Cornell to come in – it may make the answer obvious.<br><br>", "<b>Username: soymilk23</b><br><br>Does anyone have any input on aspects of social life at either university? A big reason why I’m still considering Michigan is because of the reputation of Ann Arbor as a great college town and Michigan’s amazing sports culture.<br><br>", "<b>Username: Penn95</b><br><br>That is true. Ann Arbor is a great college town and UMich has a great social culture. Cornell is one of the more social ivies, and the campus is gorgeous. I would say Ann Arbor is a nicer town than Ithaca.<br><br>", "<b>Username: Hogwarts2021</b><br><br>Hi @soymilk23, I can’t speak to the social life at Cornell, but I can tell you alllll about Ann Arbor. I don’t go to UM (yet?), but I live in A2, and yes, it is everything it is cracked up to be. UM is integrated seamlessly into the town, so you’re really becoming part of both communities when you go to UM. The sports are pretty epic, and that makes students very proud of their school. I would say that UM offers a very well-rounded college experience, if that’s what you’re looking for. However, I know pretty much nothing about Cornell, so I can’t compare.<br><br>", "<b>Username: rjkofnovi</b><br><br>Ross over Cornell A&S.<br><br>", "<b>Username: PurpleTitan</b><br><br>Both can get you where you want to go, so it really comes down to finances and fit.<br>If there isn’t a big monetary difference, try to visit both if you can.<br><br>", "<b>Username: soymilk23</b><br><br>@rjkofnovi Can you give me some reasons why you think so?<br><br>", "<b>Username: Alexandre</b><br><br>I am an alumnus of both Cornell and Michigan. They are identical in terms of quality, prestige, professional placement opportunities, resources etc…When it comes to those two schools go for the cheaper option if cost is a concern, otherwise go with your gut.<br>I cannot imagine a better combination than a dual degree in Business from Ross and Mathematics  or Computer Science from LSA.<br><br>", "<b>Username: soymilk23</b><br><br>@Alexandre Do you think that a double major would be manageable? I was thinking about doing that but I don’t want to be overwhelmed with work.<br><br>", "<b>Username: Alexandre</b><br><br>It is manageable, but depending in how many AP credits Michigan grants you, it could require (1) extra effort on your part and/or (2) an extra semester to graduate.<br><br>", "<b>Username: harvard_and_berkeley</b><br><br>Wait until you get the financial aid offers… if one is substantially cheaper, go there.<br>If they are comparable in cost, go visit and go with your gut.<br>I don’t think either will unlock more doors than the other for your future career (and dispute the notion that somehow Cornell is more sought on Wall Street than Michigan.)<br><br>", "<b>Username: yorkie97</b><br><br>ross has amazing computer science programs and opportunities, paired with ross BBA and an amazing college experience in ann arbor? take umich.<br><br>", "<b>Username: yorkie97</b><br><br>sorry meant to say umich** has great CS programs<br><br>", "<b>Username: Much2learn</b><br><br>@soymilk23 Either one can get you to Wall Street. I agree that cheaper is better, but I would lean toward Cornell. I like the Mathematics and Ops research though.<br>I would take at least a couple CS courses if you can fit it in. You don’t need a minor, but a couple courses will help.<br><br>", "<b>Username: rjkofnovi</b><br><br>Did the OP get into Dyson?  Wouldn’t  Ross have better connections to Wall Street than the liberal arts college at Cornell?<br><br>", "<b>Username: Coloradomama</b><br><br>soymilk27  a math major is different by far than a business major. Worry a lot more about do you really want a mathematics major at Cornell, and why not at Michigan?  Mathematics majors will require you to work hard. An undergraduate business degree is less valuable down the road,  in comparison,  unless you are taking a lot of quantitative classes.   At Michigan I take it you would take a lot of math though.       Do you want an MBA? Then the harder major of mathematics will go a long way if its paired with a great job option in NYC later, for a few years and then your application to Wharton etc.  Cornell is very tied to New York city and opening a new campus on Roosevelt Island , Cornell Tech.  Look into Cornell Tech on Roosevelt Island. Its located at Google in NYC right now.    Its pretty far from the Ithaca campus, but looks interesting to me:<br>https://tech.cornell.edu/<br><br>", "<b>Username: brantly</b><br><br>I am very familiar with both schools, as I am an alum of one and I have a child at the other. Cornell Arts & Sciences and Michigan Ross will be VERY different experiences academically. Ross is very preprofessional. It’s almost like an employee training program with some academics sprinkled in. If you double major with math, which is in LSA, you actually would be doing a dual degree, meaning that you would be graduating with a BBA from Ross and a BA (or BS?) in math.<br>At Cornell Arts & Sciences you’d be taking a more traditional course of study. It also has a lot of distribution requirements.  My recommendation is to make a spread sheet of the exact classes you’d have to take (or requirements you’d have to fulfill) every year at each college. Which looks more interesting? Which one gets you more excited? That will make the decision for you (outside of the financial aspect).<br>Of course you can always go to Michigan and major in math there. You can minor in business at Ross if you want. There will be plenty of Wall St. opportunities with an undergrad math major.<br><br>", "<b>Username: PurpleTitan</b><br><br>It would be easy to switch majors within CAS at Cornell. You likely can take any CAS major at UMich as well. Both are recruited.<br><br>", "<b>Username: blevine</b><br><br>Most important goal from OP “I hope to maybe become a quantitative analyst one day.”<br>Hands down, math and comp science over ANY b-school.<br>Finance degree from Ross would help you for other careers on wall street but NOT to be a true quant.<br>Quant teams hire math degrees, (and CS is pretty much like a math major), physics, engineers, operations research. Finance is a plus but not a substitute unless it’s a quant focused degree as some b-schools have (not sure about Ross).<br>Also note, I have worked for 3 decades on the street.  My current employer’s President and many execs are Cornell grads.   A past employer was founded by a Cornell grad (who was also a board member at Cornell). There was a comment at the top of the thread about “if it was any other ivy”… Ridiculous comment.<br>Cornell is VERY HEAVILY REPRESENTED on wall street in many many roles with many different types of degrees. That is totally incorrect the ivy comment.   In fact I have yet to meet a Brown graduate in my 3 decades on Wall Street.   Lots of Harvard and Penn, but honestly in a quant role people are most impressed by MIT and NONE of the ivies     Also note while there are MIch grads on wall street, there are far more Cornell grads in NYC and better<br>networking opportunities as a result.<br>A typical b-school degree will lead to very different career options than a math/cs focus regardless of the schools selected, so that should be the major deciding factor.   Ithaca is a wonderful college town, I doubt Ann Arbor has anything better to offer in day to day lifestyle than Ithaca, it is often voted one of the BEST college towns.<br>Full disclosure, I do have a son at Cornell and less familiar with Michigan, but I know the difference<br>between b-school and math/comp sci ( I studied comp sci/math/engineering myself and took some b-school classes as electives).  I worked in the quant and IT area of some of the largest best known banks and fund managers. I am a hiring manager and I would take the math/cs/ops research etc grad over any b-school grad in a quant role. If you wanted a different career path you can always later go get an MBA at a top b-school.<br><br>", "<b>Username: Alexandre</b><br><br>“Hands down, math and comp science over ANY b-school. Finance degree from Ross would help you for other careers on wall street but NOT to be a true quant.”<br>blevine, Ross requires 55 credits for the completion of the major. Students can take their remaining 65 credits in LSA, and double majoring in Pure Mathematics and Business is definitely possible. If the OP wishes to pursue a career in Quantitative Analysis, a double degree from LSA (Mathematics) and Ross (Business) would serve him/her well.<br>“Also note while there are MIch grads on wall street, there are far more Cornell grads in NYC and better<br>networking opportunities as a result.”<br>I don’t know about “far more”. Obviously, Cornell is a NY institution, and 35% of its alumni are NY residents, so naturally, more of them will be working in NY. But Michigan is very well represented on Wall Street. I would definitely say that when it comes to IBanking placement, Ross matches Cornell.<br>“Ithaca is a wonderful college town, I doubt Ann Arbor has anything better to offer in day to day lifestyle than Ithaca, it is often voted one of the BEST college towns.”<br>Did you actually visit Ann Arbor? I am an alum of both Cornell and Michigan. I lived in Ithaca for 2 years and Ann Arbor for 4 years. Ann Arbor has more to offer than Ithaca. Not just the city itself, but the surrounding areas as well.<br><br>", "<b>Username: monydad</b><br><br>@blevine, if you look closely you’ll find that those rankings you’ve seen are for college towns less than a certain population. Ann Arbor is larger so not part of that particular comparison.<br>I’ve visited Ann Arbor a few times recently. And will be going there a few more times yet.<br>Ann Arbor’s downtown is bigger than Ithaca’s. and it is easier to walk to, because there is no huge hill separating it from the campus. To me it feels more suburban, whereas Ithaca is more hippy-ish. Ann Arbor is very convenient to the Detroit suburbs, if you live there. And to Detroit. I imagine students do get some value from Detroit, but to me large swathes of it look to be in shambles. Literally.<br>Ithaca is surrounded by fantastic state parks, and has a very “chill” vibe to it that is hard to match, IMO. The campus is also beautiful. I personally love it there. I take vacations there. Nearly every year. It is clearly more isolated, but most students find there is enough to do right there, most of the time. To get the most out of your time there, it is best to have a car during the upperclassman years. Or have a friend who has a car. That is not required, but it enables one to more fully experience Ithaca and the surrounding areas far from the campus. If you want to get away for a weekend,there are daily buses from campus to NYC, and boatloads of students who are from the area traveling in the vicinity all the time. But NYC is 4+ hours away.<br>The person I am visiting in Ann Arbor wanted met o go to a football game. Because it is such a big deal there. The irony is that this person hates sports and wouldn’t apply to Cornell because it had too much sports.<br>There are certainly people at Cornell who go to all the football games. And, at least when I was there, were rabid about hockey. However a lot of people who attend Cornell would feel that this amount of obsession about sports is frankly retarded.So perhaps that’s a point of campus culture distinction.<br>It’s true that Cornell has a large alumni presence in and around NYC. The alumni club there is particularly active. Much moreso than those of our other alma maters. I’ve attended a number of interesting lectures they’ve sponsored.<br>I’m far removed from Wall Street by now, but at least based on my framework in antiquity I would agree with @blevine’s description. Except that, from what I saw, those quant jobs did not often go to people out of undergrad. Heck, the trading firm I worked for hired physics PhDs for those jobs. There’s a lot of money involved they weren’t messing around. Most of the undergrad hires I saw were  liberal arts majors from top schools.( Including Brown, BTW. Cornell too.)  And grads of business programs such as Wharton, NYU  and Ross. And also Cornell, even though at that time AEM was “Ag Ec” and didn’t have the reputation it has now.<br>Either way, to get a Wall Street job, in my day at least one would need to be exceptional. And “fit”. I suggest do not make your whole decision based on that. Besides after a year you might get turned on by psychology, or whatever, and completely change your objectives.<br>The new tech center in NYC is for grad programs. It is still in its infancy but I would not bank on it doing much for you, if I were you.<br><br>", "<b>Username: blevine</b><br><br>There was some assertion that somehow Cornell is a lesser ivy on Wall street.<br>Nothing to do with Michigan.   Cornell is very heavily represented at all levels,<br>buy side, sell side and many types of roles.<br>As far as only having PhDs, yes a dept head and other highly paid researchers would be PhDs. But they do hire undergrads to do their rather high end gruntwork.   From there with experience, yes one might want to go back to grad school for mba or PhD depending on longer term aspirations.  Those PhDs will hire stem majors over b-school. Yes if you dbl major in a stem field, even better, and either college would allow study of bus and stem.  I have also seen people with undergrad only, move to portfolio management, prop trading out from reseach.   Point is stem is the better foot in the door for an undergrad.  If you excel, maybe PhD is the next step.  If less so, maybe work experience then MBA.   STEM undergrad degrees are more rigorous than undergrad business, and that would open many more  doors.   I have heard from Penn Engineers that they take Wharton undergrad classes, as easy electives, compared to their engineering courses.<br>There was an assertion that Ithaca is not a good college town.  Yes it’s small and isolated I agree, but a “college town” is small by definition.  Is Boston a “college town” ?   But there are many college students.   Not detracting from Michigan, but don’t knock Ithaca, many LOVE it. Personal preference.  If you want big, you can’t beat Boston as a college town, would take that over either.   But if you want an intimate college town, and love nature, hard to beat Ithaca.   Ann Arbor may be wonderful, but neither extreme.  Maybe a happy medium that would satisfy most.<br><br>", "<b>Username: Alexandre</b><br><br>I agree 100% blevine. Cornell is extremely under appreciated on CC. There is no such thing as a “lesser Ivy”. It is a contradiction in terms. All Ivies are excellent. But I object to the insinuation that Cornell is better than Michigan. Cornell was co-founded by a Michigan professor, and 7 of its 14 presidents were either Michigan alumni or Michigan faculty, including the incoming president, Martha Pollack, who is awesome by the way! The two universities are virtually identical when it comes to academic prowess, reputation, student quality, resources, etc…<br>With regards to college towns, I do not deny Ithaca’s charm. It is quaint, charming, safe, intellectual etc…At no time did I mock…or knock it. Ann Arbor is just a more complete college town. Small enough to be intimate, quaint and charming, but large enough to accommodate most types. The Detroit suburbs have much to offer as well, and having a large international airport 20 miles away makes life easier, especially for international students. I agree that for outdoorsy types, Ithaca is hard to beat though, but it is tiny, not easily accessible on foot, isolated, and very easily outgrown.<br><br>", "<b>Username: monydad</b><br><br>I didn’t see Alexandre ( who, BTW is the most Super of Super Moderators; I believe he wears a cape, and a utility belt) assert that “Ithaca is not a good college town”. And I certainly did not intend that either.<br>It’s just that he clearly prefers Ann Arbor. Which he only pointed out in reaction to your post on the topic.  Having visited, I can understand why.<br>However I will continue to vacation in Ithaca, Not Ann Arbor. Someone forget to send me the “easily outgrown” memo, because I still love Ithaca.<br>We all tend to identify mostly with our undergrad alma maters, anyway.<br>Not everybody loves Ithaca as much as I do, but most people find it at least “good enough”, as a backdrop for their college years. There may be differences,  but f I were OP I would not let one of these college towns vs. the other drive his decision.<br><br>", "<b>Username: Coloradomama</b><br><br>Cornell Traditions, surrounding the arrival of Spring<br>Slope Day<br>http://slopeday.cornell.edu/about/<br>Dragon Day in March:<br>https://aap.cornell.edu/academics/architecture/about/dragon-day<br>Sailing is phenomenal:<br>http://sailing.athletics.cornell.edu/<br>Natural beauty and hiking:<br>http://www.visitithaca.com/attractions/waterfalls<br><br>", "<b>Username: monydad</b><br><br>…And if someone wants to see more they can see my  old “Some Pictures” thread on the Cornell subforum. Although all the links may be dead by now.<br>But I imagine they have their traditions & stuff at Michigan too, so…<br><br>", "<b>Username: Alexandre</b><br><br>As a steak lover, I have to say that Ann Arbor has no answer to Ithaca’s John Thomas’ porterhouse!<br><br>", "<b>Username: monydad</b><br><br>Yes but in order to justify going back there we would have to adopt someone to take to another graduation dinner there.<br>And I don’t see it happening.<br><br>", "<b>Username: Alexandre</b><br><br>Yes, adoption rules are so stringent in the US! <br><br>", "<b>Username: blevine</b><br><br>@Alexandre You are confusing comparisons in general with comparison for someone who wants to work in the industry  (and sub specialty) where I have worked for 30 years.    On that basis, in my own anecdotal experience, Cornell is a very highly represented school, above most colleges in general, Michigan and many other top schools.  Part of that is simply location and perpetuation through alumni networking.   Many of the quantitative reseach jobs are in NYC, and Harvard, Yale, Cornell, Columbia, Penn and others have an advantage in that respect.   Nobody would turn away a Michigan applicant who really wants to be in this industry, but we see less applicants.<br>Same could be said for Caltech.  We see more MIT applicants, does not mean Caltech is a lesser school than MIT.<br><br>", "<b>Username: billcsho</b><br><br>CalTech has far less graduates that MIT though.<br><br>", "<b>Username: 11bawb</b><br><br>Agree with posters advising you strongly consider whether BBA or math is where you’d be happier majoring (even with opportunities to 2nd major/minor). Both schools will serve you similarly well job searching. Personal town/experience preference, AA.<br><br>", "<b>Username: soymilk23</b><br><br>Thanks for the advice everyone! Sorry I haven’t been replying to your comments, I actually forgot I created this thread. Anyways, after I visited both schools, I have decided to attend Cornell this Fall! If anyone is in a similar situation as I was in and has yet to make their college decision, feel free to ask me any questions.<br><br>", "<b>Username: Much2learn</b><br><br>Congratulations! Go Big Red!<br><br>", "<b>Username: JAMCAFE</b><br><br>@soymilk23 My D visited this week too.  What convinced you to choose Cornell?<br><br>", "<b>Username: Much2learn</b><br><br>I think one very noticeable difference is that as you walk around both campuses and talk with people, Michigan is one of the least diverse elite campuses I have ever been on.<br>Most students are from the State of Michigan, there are not many International students, there are not many African Americans, there are not many Latinos. Compared to Cornell it is noticeable even to the casual observer.<br><br>", "<b>Username: rjkofnovi</b><br><br>^^^^I’m sorry, but you are clueless.<br><br>", "<b>Username: soymilk23</b><br><br>@JAMCAFE I had never visited Cornell before, so obviously the first thing that jumped out at me was how beautiful the campus was. I also happened to talk with a lot of students and learn about their experiences. Everyone was extremely nice and enjoyed their time at Cornell. It seemed that the students were very passionate about their academics, but they also liked to have fun. I got to experience both sides of this because I sat in on a math class and also got a look at my friend’s fraternity.<br>Of course another important factor in my decision was attending a business school vs. being math major in a liberal arts school. I figured that a math degree would be more enjoyable for me, while also allowing the most flexibility in whatever career I wanted to choose.<br><br>", "<b>Username: gmfreedom</b><br><br>Students are happier at University of Michigan than at Cornell.  Cornell was ranked as 3rd in US with the most stressed out student body.<br><br>", "<b>Username: Much2learn</b><br><br>\"I think one very noticeable difference is that as you walk around both campuses and talk with people, Michigan is one of the least diverse elite campuses I have ever been on.<br>Most students are from the State of Michigan, there are not many International students, there are not many African Americans, there are not many Latinos. Compared to Cornell it is noticeable even to the casual observer.\"<br>@rjkofnovi “I’m sorry, but you are clueless.”<br>You think I am wrong that Michigan is a noticeably less diverse than Cornell? Can you be more specific about what you are disagreeing with? I thought it was obvious. I am surprised you are disagreeing with that.<br><br>", "<b>Username: Coloradomama</b><br><br>Here are the diversity stats for U of Michigan.  The latest class was 65% white 15% Asian 6% Latino 5% African American.     I think that is typical of midwestern universities by the way.  Case Western is similar.<br>Most US midwestern college campuses have a lower percentage of  African American students  compared to the populations in their respective states, such as Ohio or Michigan.<br>Notice Michigan is 14% African American residents, 4% Asian and 78% white.<br>https://suburbanstats.org/population/how-many-people-live-in-michigan<br>Cornell has a lot more financial aid  money offer students I believe, so they can attract a wider range of students, although Michigan ought to be able to offer more seats to African Americans from Michigan, I would question that but it may come down to scholarship availability, I do not know.<br>U of Michigan data on race:<br>http://ro.umich.edu/enrollment/ethnicity.php<br>https://admissions.umich.edu/apply/freshmen-applicants/student-profile<br><br>", "<b>Username: Alexandre</b><br><br>Much2Learn, I have said before, and I will say again, Cornell’s student body is indistinguishable from Michigan’s, and while it is true that in terms of exact percentages, Cornell is indeed more diverse than Michigan, the degree to which it is isn’t significant or noteworthy, except for the Hispanic American student population, where Cornell is indeed more diverse.<br>The first thing to remember when considering diversity is the regional student population. That is important because 50%-75% of all universities draw their undergraduate student bodies regionally. 35% of Cornell undergraduate students are from New York, and another 20% are from New Jersey, Pennsylvania, Connecticut and Massachusetts. Admittedly, the states of New York and New Jersey are going to be more diverse than the state of Michigan, and as such, it is only reasonable to expect Cornell to be slightly more diverse. But if you look at the actual numbers, they aren’t glaring. I have taken the liberty of including the student bodies of other similar universities:<br>IN-STATE STUDENTS:<br>Cornell: 35%<br>Michigan: 55%<br>Northwestern: 35%<br>Penn: 20%<br>REGIONAL STUDENTS (from 300 mile radius)<br>Cornell: 55%<br>Michigan: 65%<br>Northwestern: 50%<br>Penn: 50%<br>AFRICAN AMERICAN STUDENTS:<br>Cornell: 6%<br>Michigan: 5%<br>Northwestern: 6%<br>Penn: 7%<br>ASIAN AMERICAN STUDENTS:<br>Cornell: 18%<br>Michigan: 14%<br>Northwestern: 18%<br>Penn: 20%<br>HISPANIC AMERICAN STUDENTS:<br>Cornell: 12%<br>Michigan: 4%<br>Northwestern: 11%<br>Penn: 10%<br>MULTICULTURAL:<br>Cornell: 4%<br>Michigan: 4%<br>Northwestern: 5%<br>Penn: 4%<br>INTERNATIONAL STUDENTS:<br>Cornell: 10%<br>Michigan: 7%<br>Northwestern: 9%<br>Penn: 12%<br>PELL GRANT STUDENTS (all four universities are in the shallow end of the pool in this department. They all have a lot of room for improvement when it comes to socioeconomic diversity):<br>Cornell: 16%<br>Michigan: 16%<br>Northwestern: 15%<br>Penn: 17%<br>Like I said, Michigan is not noticeably less diverse than Cornell, or other peer institutions located in the Midwest or the East Coast.<br><br>", "<b>Username: Alexandre</b><br><br>To soymild23, you made a great decision. Not that Michigan would be any less great, but between those two, you cannot go wrong, and if finances are not a concern, you should go with your gut…which you have.<br><br>", "<b>Username: rjkofnovi</b><br><br>Congrats on your decision soymild23.   Best of luck at Cornell.<br><br>", "<b>Username: Much2learn</b><br><br>@alexandre<br>I guess it depends on your perspective and powers of observation. Combining African American, Latino, Asian, and International students, Cornell has a total of 46%, while Michigan is only at 30%.<br>It is definitely noticeable to me on campus that Cornell has over 50% more students in these groups than Michigan does. It may not seem to be that significant in individual categories, but Michigan is at the low end of the range in each category, and it adds up.<br>I think Michigan does a great job for a midwestern state flagship, but Michigan is viewed more as an elite national university than a state flagship, and by that standard, they are close to the bottom of the barrel in this category.<br><br>"]}