{"title": "bates vs hamilton", "comments": ["<b>Username: hopeful1660</b><br><br>First post! I have been admitted to Bates and Hamilton and I was looking for any insight on either college. I’m looking for an inclusive, friendly, down to earth community with students who intermingle with different groups. I do not like clique-y schools, and I also do not like Greek life. I know that Hamilton does have fraternities and sororities, and also that those are non-residential groups. However, I’m still concerned that even the presence of Greek life would create an overall preppier and maybe more snobby student body. I am also concerned that at either school a divide may exist between varsity athletes and non varisty athletes. From an academic perspective, I very much want to be in a non-competitive environment. I really appreciate being around people who are intelligent, but balanced. With Hamilton, I am most worried about it not being the better fit for me. With Bates, I am concerned that the low endowment would somehow affect my experience there and also that that is an indicator of alumni involvement and the strength of that network. Also, as ridiculous as I realize this sounds, I am worried about Bates’ reputation. It seems to me that Hamilton is more highly regarded and while I know that Bates is a great school, I’m worried that a Bates degree may not pull as much weight.<br>I visited both about a year ago, and went to the Bates admitted students day this past Friday. I’ll be going to Hamilton’s next week. Thanks for any help!<br><br>", "<b>Username: preppedparent</b><br><br>Within the NESCACs: Amherst College, Bates, Bowdoin, Colby, Conn, Hamilton, Middlebury, Trinity, Tufts, Wesleyan and Williams, I’d say Bates and Hamilton are pretty evenly matched.  They’re both sort of in the boonies. They are both academically sound. If you are that worried about greek life separating students, I’d go with Bates. But really, I think the Hamilton campus is more beautiful. With its Science Center it’s a cross between Middlebury and Amherst with its quad appointed with adirondak chairs. Hamilton has the focus on writing, and its quite the manicured campus. You can see immediately where your money is going. I think it also has a better town. Lewiston–kind of run down. My choice would be Hamilton.<br><br>", "<b>Username: wisteria100</b><br><br>Congrats on 2 great choices. At both you will find friendly, inclusive kids. Yes, there is Greek life at Hamilton, but it is not the raucous in your face frats you may find at other schools.  And the participation rate is not all that high. It’s like splitting hairs to find measurable differences, but Hamilton does have a more open curriculum and may have a slightly more intellectual vibe. Bates more sporty, but not jocky, if that makes sense. Hamilton may have a more diverse student body, Bates may be more community service oriented.<br><br>", "<b>Username: doschicos</b><br><br>Both are great schools. I wouldn’t let the difference in endowment play into your decision as I don’t think it will affect your experience and education.<br>Despite Lewiston itself, I’d give a location edge to Bates. Easy access to mountains and ocean, and the city of Portland is really cool and only 40 minutes away.<br>You can’t go wrong. Both are great schools. Go with where you think you’ll be happier and have a better fit.<br><br>", "<b>Username: Chembiodad</b><br><br>OP, agree both are great choices to have. My DD’s were accepted at several NESCAC, as well as similar Midwest schools, and will be at both upcoming accepted students day - one’s a student athlete so that does play into the mix for her.<br><br>", "<b>Username: preppedparent</b><br><br>And Hamilton has the black and white cookie bakery near by…just sayin <br><br>", "<b>Username: Chembiodad</b><br><br>@preppedparent, true  <br><br>", "<b>Username: lookingforward</b><br><br>The kids I know who went to Ham were happy, challenged, and are now doing well<br>Lewiston isn’t so bad and the campus is active. Lots of community engagement opps, including as part of academics and/or service, which I hope OP learned about. The kids I know who went there found it inclusive.  The endowment didn’t affect things in any noticeable way.  Both of mine went there,  made great friends, were highly educated, and are doing well. The alum network is as strong as you make it.<br><br>", "<b>Username: apple23</b><br><br>Hamilton seems to use some of its financial resources to make the campus a really interesting environment. As an example, they have four distinct places at which students can eat lunch on the meal plan. Over the course of your time there, you might come to appreciate these larger-school type amenities that Hamilton offers in disproportion to its enrollment.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>I don’t want to split hairs – they are both wonderful schools.  But on the multiple dining options at Hamilton perhaps being a reflection of greater financial resources, I don’t think that is a finances thing.  On our Bates visit, I recall hearing that there was a concerted effort to consider whether to build additional dining options around campus, and with student support, the decision was it was an important part of campus culture that the community came together in a single dining hall throughout the day.<br><br>", "<b>Username: merc81</b><br><br>Hamilton’s multiple dining options reflect the history and culture of the school, and therefore seem like an organic complement to its nature. Beyond that, Hamilton, at 1350 acres, may effectively need multiple options. Whether this spatial luxuriance relates to financial resources may be an open question, but the inherent variety of Hamilton seems desirable in any event.<br><br>", "<b>Username: chemusic</b><br><br>What major are you considering?  Take a look at the required and elective classes.  I know someone who went to Bartes but wished she chose Hamilton.  Hamilton has stronger music and it is easier to double major there. I think you will know when you visit where you belong.<br><br>", "<b>Username: hopeful1660</b><br><br>Thanks for all the thoughtful answers!<br>@preppedparent Yes, Greek life is a huge turn off for me and for that reason I’m leaning toward Bates. Though, I’m still trying to keep an open mind. Campus aesthetic is only important to me up to a certain point. Wesleyan was my first choice and I applied there EDI despite its, in my opinion, average looks. I think it’s the people that really make a place <br>@wisteria100 Thank you! Your characterizations are great. I don’t mind sporty and I don’t mind a lack of diversity as long as that doesn’t mean students who feed off of each other’s privilege. I also like Hamilton’s open curriculum and the intellectual vibe. Would you say that Hamilton is more pre-professional?<br>I agree that after some time multiple dining options would be a draw. At the same time, it’s nice to have a physical manifestation of the community engagement focus at Bates. I can appreciate both for their different benefits.<br>@chemusic I do play an instrument, but I’m not in an any sort of ensemble and don’t plan on being in one in college. I also don’t plan on studying music. I’m not positive about my major (or double major) but it will probably be psychology and/or economics and/or politics. I do have potential plans to pursue a masters. Either an MBA or a JD.<br><br>", "<b>Username: merc81</b><br><br>With respect to your major or post-graduate plans, these resources could be useful:<br>https://www.collegetransitions.com/wp-content/uploads/2016/04/Top-Producers-Lawyers-Infographic-e1459562437296.png<br>https://www.collegetransitions.com/infographics/top-feeders-mba-programs<br>https://ideas.repec.org/top/top.uslacecon.html<br>In terms of your interest in politics, Hamilton offers a semester in D.C. program that might be open to you whether you attend Hamilton or Bates.<br><br>", "<b>Username: prezbucky</b><br><br>I think right now Hamilton has a bit of an upper hand in overall academic rep, but these are both old NESCAC schools: you don’t have to worry about academic quality at either. They both offer an excellent education.<br>One academic thing you should think about is the differing curricula of the schools: Hamilton with the open curriculum; Bates with the more traditional distribution requirements.<br>Check out lists of majors and courses to see which school carries more things that interest you.<br>Compare study abroad programs if that interests you.<br>See what they are doing research-wise if you think you might like to get involved in research at some point.<br>Other fit variables include their environments/settings – Maine vs. Upstate NY, Lewiston vs. Clinton); social vibe (the two sides of Hamilton, the students at both schools and their party and club scenes, Greek life since you mentioned its importance, etc.); and dorms and food. You do have to eat and sleep there for most of four years.<br>And, obviously, cost is a variable.<br><br>", "<b>Username: Corbett</b><br><br><br>\"\"<br>With Bates, I am concerned that the low endowment would somehow affect my experience there and also that that is an indicator of alumni involvement and the strength of that network<br>\"\"<br><br>Bates does has a relatively low endowment by NESCAC standards, but I wouldn’t necessarily assume that this is “an indicator of alumni involvement”. I’ve heard that it relates, at least in part, to historical factors – specifically Bates’ attitude towards coeducation.<br>Bates has been coed since the mid-1800s, while most other NESCACs were all-male until around 1970. So Bates had a good 100-year head start on coeducation. Unfortunately, women didn’t generally have great career opportunities or earning power during the late 1800s and early 1900s. So for most of its history, Bates was at a significant disadvantage relative to the all-male NESCACs in terms of alumni fundraising.<br><br>", "<b>Username: hopeful1660</b><br><br>Does anyone know what the party scenes are like at Hamilton and Bates?<br><br>", "<b>Username: wisteria100</b><br><br>@hopeful1660<br>To answer your question, neither school would be considered pre professional. Both solidly traditional liberal arts schools. Hamilton may be closer to Wesleyan if that was your first choice.<br><br>", "<b>Username: hopeful1660</b><br><br>@Lindagaf I’ve read a lot of your posts and I know your daughter is currently a freshman at Bates. Could you tell me anything about her experience there socially as a non athlete? Was it hard for her to break into different groups?<br><br>", "<b>Username: hopeful1660</b><br><br>@wisteria100 In what ways are they similar? I always thought of Hamilton as kind of preppy and Wesleyan as very liberal and non-conformist<br><br>", "<b>Username: hopeful1660</b><br><br>Also, though I loved Wes and still do, in retrospect I’ve realized that it may not have been the best fit for me. I am liberal but not political and I do believe Wesleyan is quite politically active.<br><br>", "<b>Username: gardenstategal</b><br><br>They are both great schools and you can’t go wrong.   I  hope your revisits make it easier for you to decide. It sounds from your post that you deep down prefer Bates.  Go for it!  At both, the athlete divide will be about the same.<br><br>", "<b>Username: wisteria100</b><br><br>My comparison to Wes is more academic in nature vs social. Wes and Ham are both strong in writing and Ham may be perceived as a bit more creative than Bates. Again, splitting hairs here. I think once you revisit Hamilton you will have clarity.<br><br>", "<b>Username: chemusic</b><br><br>After reading more, I think you would be happy at either.  You will know better when you visit Hamilton this week.  Be sure to eat in the cafeteria and talk to students.  Maybe attend an event on campus. Have fun.Two great choices!<br><br>", "<b>Username: Lindagaf</b><br><br>Hmmm, interesting, @wisteria100 . I don’t think of Hamilton as being more creative than Bates. In fact, I am impressed with how strong the arts do seem to be at Bates. There’s an actual Art museum on campus. But, you know my preferences, of course:-)<br>Bates is unquestionably liberal. I would not describe it as activist. My daughter likes that. There was a “get out the vote” effort during the election. I know people did attend the Women’s March in various cities. But no, not activist. My D thought Hamilton was preppy and that was a reason she decided not to apply there. There are preppy kids at Bates too, but I would describe most of the stduent body as leaning a little more urban, or a little more outdoorsy, mixed with geeks, athletes, and hippies. (D’s roommate is a total hippy.) Last year, Bates admitted 40 first-gen to college students. It works hard to increase diversity. That is one of the reasons why it went test-optional decades ago.<br>Great question about non-athletes, @hopeful1660 . D has found them, no problem. She has been with several groups of people from the start, and has now definitely found her people. None are athletes, though a couple of them are into ultimate Frisbee, which is apparently pretty popular. She seems to now have an ever-expanding group of non-athlete friends. The college puts on fairly regular campus-wide events and everyone comes and everyone enjoys them.<br>There is partying. Bates made Princeton Review’s list again for Beer drinking. My D says she doesn’t know why. She isn’t a big partier, and though parties happen, it’s not in your face. Or maybe she is hanging out with the wrong people! I seem to recall that she did say the lacrosse team has a lot of parties. Maybe the atheltes take the place of Greek Life?<br>I am not sure about your concern for the reputation. I would say that Bates and Hamilton are both highly regarded. They have nearly identical acceptance rates. I cannot imagine that any employer would ever consider one better than the other. Bates has a very active alumni network. There are many internships and jobs offered by Bates alumni. The new president, Clayton Spencer, has raised over $120 million for the college in just four years. It has beautifully modernized buildings, and some gorgeous brand new dorms that are a thousand times nicer than the ones I saw at Hamilton, but perhaps Hamilton’s dorms have been spruced up. There is, as far as I know, only one from that isn’t gorgeous, but even it was given a facelift last summer. It at least has large rooms. I do not think Bates’ endowment is an issue at all. Not sure if you have visited yet, but the campus and its buildings are beautiful.<br>Bates does have another big advantage, and that is its proximity to civilization. The college puts on free shuttles regularly to Freeport, which is a fun town with AMAZING shopping and restaurants. You will regularly run into kids from Bowdoin and Colby there. Also, free shuttles to Portland, which is a very cool small city. Once or twice a month, you can go to Boston for $20 for,the whole day. It’s only two hours away. Lewsiton is a modest town, but there are plenty of places to eat within walking distance and the kids go out. The countryside is very beautiful there, and there is a lovely wide river where the rowing team practices. Next to campus is a bird sanctuary where kids run, and it appears, have bonfires.<br>So you can tell I think it’s a great school. The retention rates between the two are very similar. You can’t go wrong with either, but after reading what you are looking for, you seem like a Bobcat to me:-)<br><br>", "<b>Username: lookingforward</b><br><br>Bates’s rep may be outdoorsy and liberal,  but there are lots of types, many conservatives, and D1 was involved in activism (the constructive sort. ) Both were involved in the community.  Both of mine, and many friends, were Bonner Leaders.  It’s all there. My impression was how friendly kids are. Confident. Open. Directed,  but not primarily pre-professional.  Clearly, some places where Linda’s and my observations don’t overlap shows this variety.<br>“Urban” is an interesting word- in the sense that many have a comfort in various situations, have experiences to bring. But I think you’d find that at Ham, too. It’s a quality of the more selective NE LACs.<br>The heavy campus party scene may have diminished somewhat, as the new president announced she’d clamp down. My phrase, when mine were there was, “Work hard, party hard.” (Though D2 spent plenty of weekend evenings in the library. And D1 joked, Sun am, everyone is back to work.) At the same time, there’s a hard reason Ham made the frats non-res, parties in public areas.<br>Athletes were no divide, for mine.<br>Take a look at club and activity offerings. Also, we haven’t even gotten to things like study abroad opps or how short term can be used.<br><br>", "<b>Username: hopeful1660</b><br><br>@Lindagaf Thanks for all your help! Is your daughter athletic? Part of what I’m looking for is not only non-athlete groups, but sports teams who don’t isolate themselves and exclude others. I play sports right now but wasn’t recruited and wouldn’t be a walk on even if that were an option. I am athletic but definitely wouldn’t describe myself as an athlete. Similarly, I am somewhat artistic but not an artist. In all honesty I’m a mix of a lot of things and because of that I fear that it would be hard for me to really fit in any group because I’m not predominantly any ‘type.’ At small schools like the NESCACs I imagine kids may get pigeonholed and being the inbetween-er that I feel I am I’m worried all of the pigeonholes would miss me and I’d be stuck on the outside. I agree that Hamilton is preppier but not to the degree that I feel Colby and Colgate are. A moderate amount of preppy doesn’t bother me. It’s the characteristics that, in my experience at a preppy high school, sometimes accompany prep–entitlement, snobbiness, hauteur–that bother me. I have visited Bates and those new dorms are really gorgeous. It was hard to get a read on the student body because they kept us with other accepted students. The whole thing was a bit of a slighlty disorganized dog and pony show. A good one nonetheless, but still a show that I’m having a hard time translating into what a more authentic experience might be like. Again, thanks everyone for the kind words!<br><br>", "<b>Username: Lindagaf</b><br><br>Sorry, I saw that you did visit Bates last week. What did you think? Did you check out Gomes Chapel? I LOVE that building. They host all kinds of events there, not just religious services. I think the stained glass windows are very special, because they feature great thinkers from history, rather than Christian iconography. Overall, Bates is inclusive. It’s prides itself on inclusivity, and if you read its history, you will see why.<br>@lookingforward , yes, there are conservatives, and the NY Times managed to find a Trump voter during the election, which made me smile. Clayton Spencer has been true to her word, the paryting has been diminished. Trick or Drink is relegated to history. I think a lot of it has been due to improving relations with Lewiston. I know that a lot of Bates kids volunteer in the schools, not sure how recent that is.<br>Poor D didn’t even go out this weekend. She has three essays and two exams in the next few days. She is looking forward to playing with puppies and getting free massages so that she can chill out a little during finals week!<br>@hopeful1660 , just saw your post. No, D is not an athlete and has zero interest. Bates has about 40% athletes, I believe. Atheltics are very important to the school, and I suspectbits to keep the alumni happy in large part. D was worried about athletes. Her concerns were unfounded. She would say that everyone just gets along. No competitiveness, definitrly no slacking though. D mades the Dean’s list, which 25% of students achieve. She loves it. She likes being around other smart, motivated kids.<br>@Chembiodad Bates has an extremely high rate of grad school acceptance. It is number 5 in producing Fulbright Scholars. Cornell produced 15, Bates had 13 last year. Given its size, that’s a heck of an achievement. I think Bates doesn’t care too much about USNWR. It does things the way it wants to, and always has.<br><br>", "<b>Username: Chembiodad</b><br><br>As a parent of DD’s that are both heavily considering Bates and Hamilton, aside from the controversial USNWR rankings I continue to read that while Hamilton isn’t considered at top 4-6 LAC it has for decades been in the next tranche as compared to Bates which seems to be a notch lower - not certain why though. Understanding that both are wonderful schools, what is the reputation of both regarding neuroscience/CS job placement (think an Artificial Intelligence job in a biotech or tech co) and law school admissions as these are the directions my DD’s would be headed after undergraduate?<br><br>", "<b>Username: lookingforward</b><br><br>Like you, I love Bates. My girls were 2 diff sorts,  both happy there,  both impressively educated  (which is more than grades. )  D1 had many athlete friends, D2 was into the music. D1’s friends ran the gamut, D2’s happened to be more artsy,  sensitive NYC kids.  Both had some extraordinary abroad opps, esp D1.<br><br>", "<b>Username: Lindagaf</b><br><br>As far as rankings go, @Corbett is correct. In addition, Bates has a long association with the African-American community, and goes to great lengths to recruit first-gen students. Along with being one of the first test-optional schools, it’s probably fair to say that all those groups were not traditionally associated with high-paying careers. It’s not so much the case now, of course.<br>This is from a NY Times 2015 article, discussing a study on the effect of test scores on GPA:<br>The study “found no significant difference between nonsubmitters and submitters in graduation rates (0.6 percent lower for nonsubmitters) or cumulative G.P.A. (2.83 for nonsubmitters, 2.88 with test scores).” Furthermore,<br>“Data also showed that nonsubmitters are more likely than submitters to be first-generation-to-college enrollees, underrepresented minorities, women, Pell Grant recipients and students with learning differences.” Again, traditionally groups of people that would be expected to earn less. Yet, it’s apparent that educational quality is not suffering.<br>I wasn’t going to make this long, however, I had to look. Bates and Hamilton have both produced 5 Rhodes Scholars. Yet, Bates is #5 in Fulbright Scholars, whereas Hamilton is #15. So it’s pretty clear that Bates is not a sub-par educational institution. It’s also clear that its student body might not typically be from as high-earning a background as Hamilton, which affects endowments, which affects USNWR rankings. Bates has a now-long history of being test-optional, whereas Hamilton does not, though it has modified its test requirements over the years.<br>Re the distribution requirements, that is something my D has found surprising. The requirements are soooo loose. D was given full credit for four of her AP classes. So she has already met some of the requirements, and said to me when choosing her courses for next year, that it feels like there are no requirements. She pretty much is just taking classes she is interested in.<br>At any rate, the whole rankings thing is clearly misleading, and a different thread. A different publication’s ranking will tell a different story. Anyway, OP, good luck with your decision. Either school is a great choice.<br><br>", "<b>Username: hopeful1660</b><br><br>@Lindagaf I liked it a lot. Even though I was felt fairly uncomfortable and awkward for most of my time there because of the way the day was set up, kids seemed happy and relaxed. They also seemed ambitious but not power hungry or competitive and I don’t take that for granted. I always thought students at Bates partied a little more moderately than is perhaps the case at other colleges. Your daughter’s experience seems to support that idea(?). It’s also great to hear that “everyone just gets along.” Is there any benefit to making the Dean’s list besides the pride that I’m sure comes with such an achievement? Also which AP classes was she able to get credit for? How is she spending her short term? Sorry for all the questions…<br><br>", "<b>Username: Lindagaf</b><br><br>The excessive partying my D was worried about hasn’t materialized, though she knows people do party. Like I mentioned, I do think the current president has tempered the partying and there a lot of evening events.<br>Re Deans list, just pride. When you go to a school with kids that are already pretty great students, it’s nice to be in the top:-) I am hoping she might apply to be a Fulbright scholar. That would be awesome.<br>D had seven scores of four or five, but they will give credit for a max of four. I think she got credit for French, Stats, English Lang, and Enviromental Sci. Not sure. She could have placed out of Intro Psych because she had AP psych, but chose to take it anyway.<br>She is doing an Oscar Wilde seminar for short term. No idea why she chose that. There are more interesting offerings, IMO. I would have chosen roller coaster physics or gone away somewhere, myself!<br>Re accepted students days, my D never cared for them. They are always a little artificial, no matter what school you visit. Her best visits were not at those events.<br><br>", "<b>Username: Corbett</b><br><br><br>\"\"<br>Bates does has a relatively low endowment by NESCAC standards, but I wouldn’t necessarily assume that this is “an indicator of alumni involvement”. I’ve heard that it relates, at least in part, to historical factors – specifically Bates’ attitude towards coeducation.<br>\"\"<br><br>To reinforce the point about “alumni involvement”, check out the alumni giving rate in the latest USN&WR ranking. Bates has a 42% alumni giving rate, which is an impressive number – slightly higher than Hamilton (40%) or Colby (41%). USN&WR currently rates Bates at #14 among National LACs for alumni giving rate.<br>Furthermore, Bates has a higher alumni giving rate than any university ranked by USN&WR, except for two (Princeton and Dartmouth).<br><br>", "<b>Username: doschicos</b><br><br>Discussion on differences between Bates and Hamilton on academic quality, alumni support, reputation, job outlooks, etc. is truly splitting hairs. Just go where you think you’d be happiest and don’t look back. There is no wrong decision here.<br><br>", "<b>Username: lookingforward</b><br><br>That.  And if you have to split hairs, maybe you missed some of the basics about what each does offer, the context, strengths and opps in her/his major, etc.<br>I also think OP has gotten feedback from adults on this thread and perhaps should ask these questions on the college specific forums, try to get feedback from current students.<br><br>", "<b>Username: merc81</b><br><br>@hopeful1660: You seem drawn to Bates. For this reason I’d recommend the school for you. However, you have had a much fresher experience there, and may be susceptible to some degree of confirmation bias as you assimilate new information. I’d suggest you keep an open mind through your upcoming visit to Hamilton. At that point you can make a fair choice. To close a door now, though, because of the seemingly rapidly impending decision you must make, would be premature – you have come too far for that.<br><br>", "<b>Username: hopeful1660</b><br><br>@doschicos @lookingforward Good point and good idea. Rationally I do know that the differences are essentially negligible, but after four years of hard work the rankings can be hard to ignore. I do think it’s more about fit at this point, which is why I’ve mainly been focusing on the social climates at each school. I’ll be posting new threads on the Hamilton and Bates forums shortly <br>@merc81 You’re 100% correct about the confirmation bias. What I don’t know is whether or not that bias is more than just bias. And I know that’s something only I can answer for myself. I am definitely trying to keep an open mind until I’ve seen Hamilton and am in a more informed position to make my final decision.<br>The other part of this story is that I only decided to apply to Hamilton after receiving my ED1/ED2 decisions from Wes and Vassar, respectively, the latter of which was an upfront rejection and the former a deferral that led to a rejection. I knew before the ED1 deadline that I would be applying to Bates regular decision. Because of that, I toured early on in the process, I requested an alumni interview, I spoke to the Bates rep at my school’s college fair, and generally did all of the things I was supposed to do not only to demonstrate interest, but also to learn more about the school. Though I also visited Hamilton before the ED1 deadline, it didn’t make the original cut. I didn’t interview. I didn’t really demonstrate interest, and I didn’t know as much about it. But I was also looking for something different then than I am now. I was more attracted to the artsy, non-conformist, uber liberal vibes that Wesleyan and Vassar both have. Now, as I’ve mentioned, I’d like something more balanced and more “mainstream,” and that’s why it’s back on the table. I also know more about Hamilton now, having gotten my acceptance and done some research. However, the fact still stands that I’ve liked Bates longer than I’ve liked Hamilton and that’s probably/definitely affecting how I’m feeling<br><br>", "<b>Username: merc81</b><br><br><br><br><br> hopeful1660:<br>\"\"<br>What I don’t know is whether or not that bias is more than just bias.<br>\"\"<br><br>Your awareness of the possibility will serve you well though.<br><br>\"\"<br>Rationally, I do know that the [academic] differences are essentially negligible<br>\"\"<br><br>Though you may have simply been making a concession to the thread with the above statement, you can find academically related factors that may indicate significant differences between your choices. Since this will be your decision, made with your priorities, you should feel free to consider the statistical attributes of these schools should this be of importance to you. For example, by 25th percentile ACT and SAT scores, Hamilton’s student profile appears closer to that of Harvard or Stanford than to that of Bates. Should this be of importance? Not necessarily, but maybe.<br>In any event, during your Hamilton visit, I’d recommend you take a self-guided tour of their first-year housing options, particularly Wertimer, Wallace Johnson, South, North, Keehn and Major, even if this might mean separating yourself for a time from more structured events, @hopeful1660.<br><br>", "<b>Username: lookingforward</b><br><br>Both schools draw top kids who don’t get into a top ten sort.<br><br>", "<b>Username: hopeful1660</b><br><br>@merc81 You make an interesting point about standardized test scores. I do believe that tests can indicate a certain type of ability, but only to an extent. Of course, it’s easy for me to say that because testing has never been very difficult for me and I fall around or above the 75th percentile at every school that I applied to. But really, is there much of a difference between a 2100 and a 2400? A 2100 is still the 96th percentile (according to 2015 data). Is that a significant difference from the 99th? There’s also the correlation between performance on those tests and family income to keep in mind. I see what you’re saying, though, and I appreciate your comment for making me consider Bates and Hamilton from a different angle.<br>@lookingforward Agree<br><br>", "<b>Username: wisteria100</b><br><br><br>\"\"<br>I am somewhat artistic but not an artist. In all honesty I’m a mix of a lot of things and because of that I fear that it would be hard for me to really fit in any group because I’m not predominantly any ‘type.’<br>\"\"<br><br>You sound perfectly normal and well rounded and I think you’ll find your tribe at either school.  I actually think at smaller schools, like Bates & Hamilton, there can be less cliques because you end up knowing a greater % of the student body and can move more fluidly through and with groups. You’ll walk into the cafeteria or library and even if you don’t immediately know people, you will recognize people and invariably they will nod and smile vs being closed off into some kind of do not enter group.  At least that is how my D who is at a different LAC says it works!<br>You mention the prep factor at Hamilton.  When I toured with my D, she wasn’t feeling the prep, but that could have been because our tour guide was a bit boho/intellectual.  But she knows multiple kids at both schools, who would be considered kind of like urban/prep, but again that’s a small sample size and there will be outdoorsy and artsy kids at both schools as well.<br><br>", "<b>Username: merc81</b><br><br>@hopeful1660: If you are asking me in more than a rhetorical way, I’d say that Yes the difference between a 25th percentile ACT score of 28 (Bates) and a one of 31 (Hamilton) might effect the classroom experiences at these schools.<br>http://www.compassprep.com/college-profiles-new-sat/<br>However, my intent was not to emphasize standardized testing, but rather to simply point it out as one of the differences between your choices. I avoid placing colleges within any hiercharchy (and don’t understand what the number ten has to do with anything), but prefer to appreciate them for their singular attributes, where they exist.<br>Bates: Admirally founded by early abolitionists under severe regional opposition. Current administration seems committed to providing an inclusive, welcoming environment for all students. Compact campus on the edge of Lewiston.<br>Hamilton: Benefits from the curricular, architectural, spatial and, to some extent, cultural legacy of having been two colleges of different characteristics and attributes. A balanced curriculum, but also a writers’ college. Former fraternity houses are now beautiful residence halls.<br><br>", "<b>Username: doschicos</b><br><br>Higher test scores at Hamilton can also just be an indicator that high test scores are important to Hamilton. Doesn’t make the student body “better” or more interesting. Different schools chose to weight different criteria when deciding on who to accept. Bates’ very long term policy of being test optional shows it is not a factor they weight as heavily as Hamilton. The test optional policy at Bates isn’t some recent attempt to game the ratings game. My guess is they find little correlation between test scores and academic and career success.<br>Bottomline, you can parse data for weeks and, given the fairly even standing of both schools on many levels, it won’t matter as much in the long term as picking a school where you feel comfortable and supported. Could be either school or both.<br>I would spend some time looking through the course catalog. I’ve found big differences between LACs on course offerings. Even among similar schools, some schools have tons of courses that would interest me while others have ones that sound dry and boring, as much as one can go by course descriptions. Look at what might appeal to you in different areas of study. If you are interested in dabbling in some art classes, also check out how easy it is to get into a class as a non-art major.<br><br>", "<b>Username: merc81</b><br><br>^^ sp: admirably.<br><br>", "<b>Username: Chembiodad</b><br><br>@hopeful1660, it’s a great choice to have! My DD’s are going through the same decision making process; the good news is that there is never a best choice for everyone - just the best one for you…<br><br>", "<b>Username: CrewDad</b><br><br><br>\"\"<br>My guess is they [Bates] find little correlation between test scores and academic and career success.<br>\"\"<br><br>You guessed correctly.<br><br>\"\"<br>In a milestone 20-year study of its well-known policy for optional SATs for admission, Bates College has found no differences in academic performance or graduation rates between submitters and non-submitters.<br>\"\"<br><br>http://www.bates.edu/news/2005/10/01/sat-study/<br><br>", "<b>Username: prezbucky</b><br><br>Well… but who’s to say the non-submitters didn’t score as highly, or wouldn’t have, for those who didn’t take the test?<br>This doesn’t prove anything regarding test scores, since we don’t know what the non-submitters’ scores were or would have been.<br>I think we can fairly say that a higher test score means, per se, that you know more right now than a kid who scores lower than you. It does not, of course, mean that you are smarter or more capable; maybe you’ve just had better teachers or a broader curriculum, or more practice, or the test was more important to you.<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>My guess is they [Bates] find little correlation between test scores and academic and career success.<br>\"\"<br><br>However, the broader social sciences suggest a different conclusion (italics added):<br><br>\"\"<br>Cumulative high school G.P.A. and ACT composite scores do correlate with a student’s success in college<br>\"\"<br><br>https://mobile.nytimes.com/2017/03/18/opinion/sunday/how-colleges-can-admit-better-students.html<br>As general points, I’d say that 1) the information standardized testing indicates about an individual differs considerably from that which it may indicate about a group and 2) colleges with strong academic reputations often report correspondingly high standardized scoring profiles.<br><br>", "<b>Username: doschicos</b><br><br>“I think we can fairly say that a higher test score means, per se, that you know more right now than a kid who scores lower than you.”<br>I’m not sure you can even draw that conclusion. Some people are just bad at certain test formats that have nothing to do with knowledge. I have one of each in my kids. One kid has always been good at standardized tests, another not so much. The one who isn’t will often know the material but just doesn’t respond well to the testing conditions and format.<br><br>", "<b>Username: prezbucky</b><br><br>OK, insert “probably” then.<br>Some of those kids who score higher also might not be great test-takers. So if we have a kid with a 32 and a kid with a 30… maybe neither one is great at standardized tests. We probably shouldn’t assume it’s only the kid with the lower score who has issues with tests.<br>Proving intelligence in one person isn’t easy. Proving the difference between two or more people… ugh. hehe<br><br>", "<b>Username: doschicos</b><br><br>Some colleges, Bowdoin is one I believe, request test scores for matriculating students after the fact. I think they track these things and know it makes little difference. I don’t think many non-submitters are passing on test taking completely, they are just choosing not to report.<br>I’ll leave the discussion on testing now as it really isn’t the point of the OP’s thread. But I stand by my previous statement that at some point all this hashing out of stats is splitting hairs between two schools of this caliber.<br><br>", "<b>Username: prezbucky</b><br><br>^ Yep.<br>Bates and Hamilton are pretty darn even overall. I’ve learned, through this thread, some of the history that defines their campuses, their admissions philosophy, their overall vibes. So, per the uzhe:<br>Fit, fit, fit…<br><br>", "<b>Username: lookingforward</b><br><br>No, instead of, “you know more right now than a kid who scores lower than you,” it really just means one tested higher on that specific material, that test format. That may reflect more prep  or native luck,  but not “know more.”<br><br>", "<b>Username: CrewDad</b><br><br><br>\"\"<br>Cumulative high school G.P.A. and ACT composite scores do correlate with a student’s success in college<br>\"\"<br><br>No one is arguing that a high ACT  score, along with a similar gpa, doesn’t have a correlation to success in college. The point is that students are equality successful with lower ACT scores. Twenty percent of enrolled Hamilton students didn’t submit ACT or SAT scores. I believe they’re doing just fine. <br><br>", "<b>Username: Sue22</b><br><br>Not to beat the SAT question to death, but Bates reports all students’ scores, even those of non-reporters. US News assesses a huge penalty to schools that report scores for less than a certain threshold of students. I’m sure there are a few students who don’t have scores to report, but overall one would expect Bates to have lower test scores than schools where everyone is submitting scores as a regular part of the application. The non-submitters have high high school GPA’s so they’ve demonstrated that they’re strong students.<br><br>", "<b>Username: lookingforward</b><br><br>We’ve skipped the fact some don’t report with their apps because one score is lopsided.  The fact the 75th percentile is nearly the same for both schools is telling. And remember, top colleges that don’t demand scores are still vetting thoroughly. How you perform in hs, related to your possible major or interests, the rigor, the nature of your activities, how you write, etc, show drives, thinking,  potential. Not just SAT or ACT.<br>The reports on hs performance vs “college success” often fall back on quantitative - eg, soph college grades. That’s not always an effective comparison, especially not at a ‘highly competitive,’ where the great mass of students are highly educated through high school, intellectually alert, have ideas about their futures.<br>Odd that one link used some WV college and Houston Baptist as examples.  Not the same league as we’re talking.<br><br>", "<b>Username: apple23</b><br><br>Since the figures haven’t been posted:<br>SAT Middle Ranges (From US News)<br>Bates: 1190-1416<br>Hamilton: 1300-1470<br>ACT Middle Ranges (From CDS)<br>Bates: 28-32<br>Hamilton: 31-33<br>http://www.bates.edu/admission/optional-testing/<br>Indicates 51.5% at Bates do not submit scores.<br>https://www.hamilton.edu/admission/apply/standardized-testing-distribution-of-scores<br>Indicates 19% at Hamilton do not report SAT 1 or ACT scores. All report standardized scoring in some form.<br>The OP, and readers of this thread, can reach their own conclusions as to whether the standardized scoring profiles of these schools are materially similar.<br><br>", "<b>Username: doschicos</b><br><br>The 19% and 51.5% numbers thrown out above are really comparing apples to oranges. Different reporting requirements so they can’t really be compared to each other.<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>thrown out<br>\"\"<br><br>Really?<br>The only apparent non-homogenous factor in @apple23 's post relates to the different cohorts.<br>By Applicant Cohort<br>Bates: 51.5% do not submit traditional standardized scoring<br>Hamilton: 20.5% do not report traditional standardized scoring<br><br>", "<b>Username: lookingforward</b><br><br>In their own words, “Hamilton is SAT optional, but not test optional.”  We all know Bates is fully test optional. So, sure, only 20.5% at Hamilton may have used traditional standardized scoring.  But beats me how one then makes assumptions about which pool is brighter, more inclusive, or more apt to be the experience OP seeks.<br>I get that you’re trying to suggest the  lower scoring students at Bates are\"weaker\" than at Ham. But, so what?  Bates isn’t scraping the bottom of the barrel; they’re looking at other than scores, in the first place. It’s common on CC for some to assume kids are hiding their scores, are truly weaker, if they don’t submit.  But that’s “the Kool-Aid.”  If one really knew these two colleges, they wouldn’t be trying to imply anything about Bates being lesser.<br>Bates is a little different in that community partnerships are popular. Not just service, if one chooses, but the opportunity, eg, to work with different sorts of local, state, or regional groups in hybrid participation, service and academic ways- sometimes on-going, sometimes for the senior project.  There are other contextual differences.  To try to boil this down to a projection that there’s a huge quality gap based on scores around the 25th percentile being lower is, IMO, futile.  It misses the point.<br><br>", "<b>Username: hopeful1660</b><br><br>I didn’t take any tests besides the old SAT, so I can only speak to that experience. But I am sure that on all tests—subject tests, SATs, and ACTs—the success of many students is based on how much and how well they prepare and not necessarily how talented they are or how much they know. I did well on the SAT, but I am privileged and was lucky enough to be given a tutor with whom I spent hours every weekend. Pre-tutor I got a 2120 and a 29 on the one practice ACT I took. Certainly nothing special for an unhooked applicant, which I am. Post-tutor I got a 2310. This score was only achieved after a lot of time and money was spent. Not everyone is lucky enough to have those resources. I’m grateful that I do.<br><br>", "<b>Username: CrewDad</b><br><br>^^<br>Thank you!<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>So, sure, only 20.5% at Hamilton may have used traditional standardized scoring.<br>\"\"<br><br>This reflects the complementary (and incorrect) figure. For the class of 2020, 79.5% of Hamilton  applicants, and 81% of those enrolled, submitted traditional scoring. For the class of 2019, which corresponds to the ranges posted by Apple 23, 83% arrived after having submitted traditional scoring. (For those who are interested in statistics, note that the posted SAT scores, though, would be widened by an additional ~31 points based on these schools’ respective reporting percentages.)<br>That said, Based on what the OP has indicated so far, and as I stated up-thread, I think Bates might be the better fit for her/him. Actually, I’m pretty sure of this. However, @hopeful1660 has yet to revisit Hamilton, and perhaps will have different comparative impressions after that time.<br><br>", "<b>Username: lookingforward</b><br><br>It was a typo. “…may not have.”<br>Sorry.<br><br>", "<b>Username: hopeful1660</b><br><br>@merc81 You also made a statement about how Hamilton’s 25th percentile is closer to Harvard/Stanford’s 25th than Bates’ is. In my mind the implication of that, whether it was intentional or not, is that other schools should strive to have their test score data resemble Harvard/Stanford’s data (and maybe H/S’s other metrics, as well). To be clear, I don’t think you meant that Hamilton is a wannabe ivy. But since we are/were talking about fit, I thought I’d mention that I didn’t apply to any of the ivies because that’s not the kind of experience I’m looking for. My goal was never HYPS. And while I did say that I want to be around intelligent people, and I do, I believe that there are other marks of intelligence that can be just as telling, like how a person expresses themselves or the quality and depth of their thoughts.<br><br>", "<b>Username: merc81</b><br><br>@hopeful1660 : I have little interest in Harvard other than with respect to its significant international academic reputation. I used that example, an uncommon one for me, along with Stanford, out of convenience. Earlier I’d thought you may have sincerely asked for opinions as to whether you will find meaningful academic differences between your choices (based on rankings or other factors). As to whether standardized scoring profiles, as an indicator, may reflect the actual classroom experience, my own response was “Maybe.” I meant that quite literally, as in I really don’t know, simultaneously, how the students at both Hamilton and Bates engage with their academics.<br><br>", "<b>Username: merc81</b><br><br><br>\"\"<br>In my mind the implication of that, whether it was intentional or not, is that other schools should strive to have their test score data resemble Harvard/Stanford’s data<br>\"\"<br><br>Regarding this point, the direction of this runs decidedly against my indended meaning. If in the process of selecting a class based on broad and deep factors, the result returns a high scoring group, this indicates a different set of priorities then that which would be entailed in selecting for high scoring students.<br><br>", "<b>Username: hopeful1660</b><br><br>@merc81 My post was meant to highlight my priorities, not to disrespect or disregard your contributions to the thread. Truly, I apologize if I offended you and I am sincerely asking for opinions. I think qualitative assessments of the environments at both schools will be more helpful to my decision making than, as doschicos put it, “parsing data.” <br><br>", "<b>Username: lookingforward</b><br><br>OP, the more you reveal, it seems you’re bright and confident enough to make either school work.<br>But we don’t know much about you, what possible major, how active you are or want to be, particular strengths or interests, outside academics. Anything you want to share?<br>D1 had several hs friends who went to Ham, they were as happy there as she was at Bates.  But the final ‘fit and thrive’ is individual.<br><br>", "<b>Username: Chembiodad</b><br><br>Any insight regarding the relative strength of the political science and international relations programs at each?<br><br>", "<b>Username: hopeful1660</b><br><br>@lookingforward I’m interested in pretty common majors like econ, psych, politics and the social sciences in general. Because of the overall quality of Bates and Hamilton I assumed that all three majors (econ, psych, politics) are well developed and strong and thus haven’t been too worried about that aspect, but please anyone correct me if I’m wrong. Also, I am interested in politics because I am considering going into law, and that seems like the liberal arts equivalent of pre-law. Again, please correct me if I’m wrong.<br>Socially, I’d like to have some friends with whom I can go on casual runs or to the gym to stay in shape. I think I’d equally enjoy watching sports games and concerts/musical performances. I also think doing day trips to nearby cities/things to do sounds really fun. I know that Lewiston is close enough to Portland and potentially Boston to be able to do day trips. Is Clinton close to anything? I would prefer if I had more recreational options besides on-campus events and outdoorsy activities (e.g. hiking).<br>It’s important to me that the school I go to emphasizes teaching and learning more than just academics, grades, and things you can read in a book. One of the reasons I want to go to a small LAC is because I hope to find more focus on personal growth. The Purposeful Work initiative at Bates is the kind of thing I’m talking about. Does Hamilton have their own initiatives? Even if they don’t, is the community such that purpose/character is a priority, anyway?<br><br>", "<b>Username: hopeful1660</b><br><br>I’d also be interested in anyone’s answer to @Chembiodad’s question<br><br>", "<b>Username: EyeVeee</b><br><br>@hopeful1660 I would suggest that attempting to analyze the curriculum differences and notoriety of individual programs for two schools so similar is pointless.  You could look up professor ratings, recent graduate placements, etc., but in the end it will be more about what you do when you’re there than what others have done or think.  If you’re down to a few schools…go where you feel like you belong.  If you are engaged with the professors and other students, you’ll be well positioned when you’re ready to leave.  Don’t over think it.<br><br>", "<b>Username: hopeful1660</b><br><br>@EyeVeee That’s actually what I was trying to say about the different majors: I’m not worried about the curriculum. Thank you though for reminding me that it’s really about what I do there and not to overthink it (as I’m prone to do). Kids can forget that pretty easily<br><br>", "<b>Username: wisteria100</b><br><br>Regarding location, Clinton has a very cute little downtown area, but don’t think it is in walking distance of the college. At Bates, Lewiston is not as cute, but you can easily walk to places from campus. Hamilton is about 10 miles from Utica and 40 miles from Syracuse.<br>I think you will get better answers to your questions regarding locale, activities nearby, and community service, by asking Hamilton students when you visit next week.<br><br>", "<b>Username: TheGreyKing</b><br><br>Hamilton seems to bring the world to their students since the campus is remote. Derek Jeter and Hillary Clinton were among recent speakers, and they bring in performers as well. The town of Clinton is charming, albeit remote, but most of the action is on campus. I do not know if Lewistown would be much more exciting. Hamilton students might go to Syracuse and Bates students to Portland?<br>Hamilton seems a very intellectual environment, with learning for the joy of learning. It also seems warm and casual, with a great balance of athletes, artists, etc., so you would get your opportunity for both games and concerts. I have not visited Bates yet, but it sounds like it will be similar.<br>There was something very special about Hamilton…<br><br>", "<b>Username: Sue22</b><br><br>I have to put in a good word for Bates’ Short Term. This is a mini-term after the end of the two traditional terms (a 4-4-1 academic schedule) that offers teachers and students the opportunity to do something a little out of the norm. Students are required to do two but many students do three because they’re generally fun and interesting. Some are taught as traditional on-campus courses which are often in areas where faculty members have a special interest but which might not be appropriate to teach every year. Others are practitioner-taught courses (examples below) or travel Short Terms with financial aid available.<br>The advantage of doing this in the spring, as opposed to the winter when many schools do it, is that spring is a good time for field work and a ST can lead straight into summer work or travel, for instance going from a ST in China to traveling the country on one’s  own. In the year(s) a student doesn’t do a Short Term they’re out of school a bit earlier than their peers so they can get a jump on internships or summer jobs.<br>Some traditional Short Terms<br>-Tokyo Central: The Modern Metropolis in Literature, Film, and Culture<br>-The Natural Science of Honeybees<br>-Tour, Teach, Perform<br>-Mathematical Image Processing<br>-Pulp Magazines and the Filmmakers Who Loved Them: The Birth of American Genres<br>-Wilde Times: Scandal, Celebrity, and the Law<br>-Politics of Race, Gender, and Sexuality in Brazil<br>-Orchestration<br>-Redesign of Introduction to Neuroscience<br>-Feminisms of the 1970s and 1980s<br>Some travel Short Terms:<br>AS/CI s13: Literature and Culture of China<br>BIOs32: The Ecology and Evolutionary Biology of the Galapagos Archipelago<br>ES/EU s28: Green City Germany: Experiments in Sustainable Urbanism<br>GEO s39: Geology of the Maine Coast by Sea Kayak<br>THEA s33: Central European Theater and Film<br>Some practitioner-taught Short Terms:<br>-Business of The Arts, led by Sara Juli, founder and director of Surala Consulting<br>-Digital Marketing: Changing the Art and Science of Marketing, led by Ashley Hart ’91, digital marketing consultant, founder of Ashley Hart Marketing<br>-Practicum in Healthcare Administration, led by Shannon Banks ’85, veteran healthcare administrator and Principal of BanksBellwether Strategy & Organization Development<br>-Practicum in Mediation and Restorative Justice,  led by: Barbara Blazej P’96, M.Ed., and Margaret Micolichek, M.A, -Restorative Practices Collaborative of Maine; and Elaine Bourne, J.D., Community Mediation Services Program of Volunteers of America, Northern New England<br>-Practicum in Project Management: From Zero to Sixty: Project Management Bootcamp, led by John Stadler, serial entrepreneur in non-profit and for-profit projects, angel investor, school founder.<br>-Brand Culture Building, led by brand consultant Peter Bysshe ’93, Bysshetank and Hitchcock Partners.<br>-Consulting for Strategy Development, led by consultant Fisher Qua ’06, advising the Bates Residential Life team on a new peer health program. Using successful consulting techniques you can carry with you anywhere.<br>-Filmmaking, The Creative Process, led by Wiebke von Carolsfeld, writer, director editor of feature films, including The Saver (2016),  STAY (2013) and Marion Bridge (2002) See the students’ final videos and screenplays here!<br>-Journalism in an Age of Media Explosion, led by editor and writer Peter Moore ’78, most recently Editor of MensHealth Magazine, author of many articles and books, with guest speakers from every corner of the industry. See their news site Batezfeed!<br>-Music Production, Recording and Mixing, led by producer Jonathan Wyman ’97, This Sounds Good production company. more…<br><br>", "<b>Username: Chembiodad</b><br><br>@Sue22, thx so much - I will make sure my DD sees this before we head up to accepted students day on the 24th!<br><br>", "<b>Username: lookingforward</b><br><br>@Sue22 , we had the opportunity to sit in on a meeting in which various Bates faculty members spoke of their short term courses, how it allowed them to take their affection for their work outside the usual bounds of the classroom.  Or, come up with new ideas that intrigued them.  Such excitement from them.<br>Your post is what I meant, much earlier on this thread, about digging deeper.  Yes, FA is available for various travel experiences, depending on one’s circumstances.  There are also semester abroad opps, some at no additional cost over the usual, plus a spending stipend.<br>Bates is one of those that “does what it does very well.”  And there’s really nothing wrong with Lewiston, which has evolved/continues to, by leaps.<br><br>", "<b>Username: Sue22</b><br><br>The Bates Purposeful Work program is really interesting. Bates is being very thoughtful about helping students to think about how they want to live beyond college.<br>I was talking to a Tufts economics professor recently about his students and how they approach the job market. He said one thing he warns his students about is barriers to entry. He explained it this way. A student applies for a bunch of internships as a freshman. The summer before sophomore year they get an internship in finance. The next year, because they have finance experience they are more attractive to companies hiring in that field. At graduation, never having done real thinking about whether finance is the field they want to pursue, they end up in finance because it’s the path of least resistance. Had they done some deep digging as freshmen they might have discovered they’re much better suited to consulting, or academia, or business and might have pursued those fields instead.<br>While the Purposeful Work program helps students to develop a resume, network, practice interview skills, and obtain internships and/or jobs, lots of colleges’ career services do that. Where the Bates program differs is in doing that deeper work I mentioned. The program includes everything from “How to Adult” seminars, free one-hour lunch workshops held on multiple topics, for instance how to negotiate your first salary, or how to shop for and cook healthy meals (taught by Bates’s Executive Chef) to internships, to a guest speaker series, to the Purposeful Work Infusion Project which “exposes Bates students to worlds of work, questions of identity and purpose, and reflection on decision-making about work through curricular and co-curricular infusions.” Bates even has a Short Term program where they have students help redesign courses taught during the regular academic year. The idea is to help students figure out what they want to do with their lives and develop real life and work skills that will lead them toward those goals instead of simply gathering lines for their resume.<br>http://www.bates.edu/purposeful-work/programs/<br><br>", "<b>Username: hopeful1660</b><br><br>Update: today was Hamilton’s open house.<br>It is very, very, very rural, but the campus is beautiful. In my opinion, nicer than Bates’. Most of the people I met were incredibly nice. It was preppier than Bates. I saw a lot of Vineyard Vines, although I also saw more crunchy looking kids than I expected to see. The address made by the Dean of Admissions had a focus on how accomplished the admitted students were and there was a section carved out to talk about test scores. This didn’t bother me and I completely understand why they highlighted their high stats, but it was definitely a different focus than Bates’ marketing pitch. The whole day was very well organized. They had kids all over to help you find where you needed to go. It was a very well run event. On the tour they mentioned their Greek life and they talked about how only 30% of people are involved and how its presence is very limited, which makes me feel like it’s not limited since the school is trying to emphasize that point. I also got to sit in on a Calc 1 class. I found that the professor brought a lot of energy to the class, but the kids weren’t all returning that energy and that gave me the impression that they felt like they were entitled to his effort. I did have the chance to speak with the professor later and he said that that class was an anomaly and he didn’t seem like he was trying to market the school because he’s only been teaching there for a short amount of time. I met a lot of great prospective families and current students, just like I did at Bates. Overall, I had a really nice visit and unfortunately it didn’t make my decision as clear as I was hoping.<br><br>", "<b>Username: momcinco</b><br><br>Thanks for the update. OP. Please keep us posted.  I am interested in hearing which you decide on.<br><br>", "<b>Username: keiekei</b><br><br>I’m surprised nobody has mentioned that an entire insider book has been written about Hamilton admissions, offering a good deal of insight into the school’s culture. The book is called Creating a Class: College Admissions and the Education of Elites, by Mitchell Stevens. Hamilton isn’t named in the book (a stipulation for the author’s access), but it came out later that “the College” was Hamilton.<br>Re: Lewiston, I would research the Somali refugee situation a bit.<br>Re: Bates, one of the things that popped out at me looking their CDS is that they take a huge number of transfer students. I suspect there could be a noticeable difference in average student caliber, with the nod going to Hamilton, and I would take the reported SAT figures for any test-optional school with a block of salt.<br><br>", "<b>Username: wisteria100</b><br><br>You may have to resort to flipping a coin!<br>Have your parents visited the two schools? Perhaps they can ‘see’ you at one school vs the other. Or could your counselor or a fav teacher weigh in? Perhaps an objective opinion from someone who knows you well would be helpful.<br><br>", "<b>Username: TheGreyKing</b><br><br>I would imagine that having refugees in town would provide students with lots of opportunities for meaningful community service and for learning about a different culture.<br>I have not seen Bates yet, though I hope to visit by October. As for Hamilton-- their students and staff seemed warm, friendly, intellectually curious and engaged.<br><br>", "<b>Username: merc81</b><br><br>Re #83, Bates recently enrolled only five transfer students.<br><br>", "<b>Username: keiekei</b><br><br>Ok, my bad on the transfer students (I must have just looked at the applicant numbers, not enrollees). I still consider their “20yr study” of test submitters vs non-submitters to have a lot of holes in it, especially relative to what they want to actually prove (the kooky multiple intelligence theory).<br><br>", "<b>Username: Sue22</b><br><br>Multiple intelligence theory isn’t what most people think it is.<br><br>", "<b>Username: lookingforward</b><br><br>I don’t think OP is asking for a quantitative review, no matter how tempting it is to try to parse this.<br><br>", "<b>Username: doschicos</b><br><br>@keiekei I’d be interested to hear more about why you made this comment: “Re: Lewiston, I would research the Somali refugee situation a bit.”<br><br>", "<b>Username: lookingforward</b><br><br>Recent article in Yankee, @doschicos. Touching.<br><br>", "<b>Username: doschicos</b><br><br>Yes, the Somalis have add a positive element and newfound growth to the local community. Great story from a year or so ago about the high school soccer team: https://vimeo.com/145582582<br>Here’s the article @lookingforward references: https://newengland.com/yankee-magazine/living/city-of-hope-lewiston-maine-immigrants/<br><br>", "<b>Username: lookingforward</b><br><br>Yup. And another about how they’ve been lent unused farmland to allow their traditional crops. That may have been the Boston Globe.<br>My girls worked with the kids at Tree Street and another org,  plus in the schools.<br><br>", "<b>Username: doschicos</b><br><br>One of my sibling’s kids has been involved teaching ESL and the learning process has definitely been a rewarding, two-way experience. <br><br>", "<b>Username: lookingforward</b><br><br>Dos, very much so.<br>No bright, open minded kid should take a superficial view that the presence of these kids and families is oopsie scary,  lol.<br>There are cultural differences, of course.  But that’s true of many areas and can be enlightening.<br><br>", "<b>Username: Chembiodad</b><br><br>@hopeful1660, our DD’s also attend the Accepted Students Day today at Hamilton. Both have been on campus 4-5 times as over the last 2 years and both came away today impressed by the way the event was run and by the faculty they interacted with.<br>Probably most importantly for them, they have never met an unfriendly or unhelpful kid; it seems the school does a great job of assembling a very diverse group of kids with big hearts, which to me means community and purpose focused - the new president emphasized this in his presentation and as leadership needs to come from the top it was good to hear.<br>One DD left as a committed student athlete who felt like it is home, and the other, while still waiting on a couple of waitlist schools, felt like it could be the same for next four years and ultimately a lifetime.<br><br>", "<b>Username: hopeful1660</b><br><br>@Chembiodad it was a really impressively organized event and the school did a fantastic job selling themselves. Bates didn’t market themselves as well; you kind of had to market Bates to yourself. I hope, if your daughters are still planning on visiting, that their day is better orchestrated than mine was.<br><br>", "<b>Username: PetitManan</b><br><br>@doschicos Thank you for the Yankee article!  (Interesting comments on the article as well.)  I’m a Bates alum and my son is headed there as a freshman in the fall.  Lewiston is such an interesting city, full of surprises!  When I was there, many people spoke French - a vestige of the days when French-Canadian immigrants came to work in the mills.<br>Here’s an article about how the French language is bringing the different communities together (Franco-American and Francophone African).  Note the comments by Mary Rice-DeFosse, French Professor at Bates. http://www.npr.org/2017/03/27/521648929/in-maine-a-common-language-connects-french-canadians-african-immigrants<br>I can’t comment on Hamilton since I’ve never been there.  I just know it’s got a great reputation.  OP should go with his/her gut and not overanalyze!  Good luck!<br><br>", "<b>Username: lookingforward</b><br><br>@PetitManan here’s the other article. https://www.bostonglobe.com/metro/2015/08/16/somali-refugees-find-farming-oasis-maine/Q8LwE2N7eKRD1ytgmtlU2I/story.html<br>There’s a lot of affection for Bates and what Lewiston has done, among those in the know.<br><br>", "<b>Username: prezbucky</b><br><br>If you are still conflicted, OP, and COA is about equal… this may seem silly, but have you thought about going to games at the schools? If so, do you see yourself more easily as a Bobcat in garnet or as a Continental in blue & buff?<br>It’s part of the social vibe at a school – did either school seem more rah-rah and what are your thoughts? If equal, are you a Bobcat or a Continental?<br>Here are some photos from their most recent football meeting:<br>http://athletics.bates.edu/sports/fball/2016-17/photos/0005/index<br><br>", "<b>Username: PetitManan</b><br><br>@lookingforward  Thank you!  So interesting…<br><br>", "<b>Username: hopeful1660</b><br><br>I will be going to Hamilton next year.<br>Hamilton impressed me when I didn’t want to be impressed. I started my visit eager to go home so I could commit to Bates, and I left doubting what I thought I was sure about. It was far more diverse than I was expecting and this was striking to me because Bates seemed somewhat homogeneous. Hamilton felt vibrant, whereas Bates felt somewhat temperate and very safe. Nothing against Bates, of course. Bates is and always will be a lovely school, and it was bittersweet to send in my declination.<br>Thank you to everyone who has contributed to this thread and for the kindness and encouragement you’ve offered along the way. I appreciate it.<br><br>", "<b>Username: wisteria100</b><br><br>Congrats and all the best to you!<br><br>", "<b>Username: lookingforward</b><br><br>Thanks for letting us know.  XX<br>Best to you.<br>But still, for my Batesie fellow posters: go Bobcats.<br><br>", "<b>Username: momcinco</b><br><br>Thanks for letting us know.  Sending best wishes for a happy four years.<br><br>", "<b>Username: merc81</b><br><br>Toward the end of your journey to this point, you ultimately weren’t afraid of having two great choices. That, perhaps, was your personal victory here.<br>Good luck at Hamilton, @hopeful1660 (H '21), you will be an asset to your new community!<br><br>", "<b>Username: Chembiodad</b><br><br>@hopeful1660, congrats. Our DD1 went through the same struggle, but Hamilton won her over as soon as she stepped back on campus on Accepted Students Day; then seeing all her future teammates again sealed it for her.<br>Both are great choices and you were so lucky to have it.<br><br>", "<b>Username: apple23</b><br><br>Congratulations @hopeful1660!<br>This says it all:<br>“Hamilton impressed me when I didn’t want to be impressed.”<br>I believe your genuine effort to consider all salient aspects and find the right fit will be rewarded with four transformative years in Clinton. I wish you well on College Hill!<br><br>"]}