{"title": "umich vs uc berkeley", "comments": ["<b>Username: solkiz</b><br><br>I live in NY so all OOS tuition rates apply.<br><br>", "<b>Username: ForeverAlone</b><br><br>Personally, I'd go with UCB since they're in the bay area, better weather, plus higher ranked in all of those majors you're considering, however, Michigan is still within the top 15 of all of those subjects.<br><br>But from what I've heard UCB is almost a deadzone in terms of social life, at least what Iv'e heard from engineering<br><br>At Michigan LSA, you're free to major in Computer Science and Economics without any difficulty. And transferring to COE is not a hassle.<br><br>Did you get a decent amount of aid from each school? Michigan's financial aid system is sometimes weird since I know people who attended here from Pennsylvania where it was cheaper than in-state Penn State<br><br>", "<b>Username: Alexandre</b><br><br>With the exception of CS, and that is assuming solkiz is intent on living in the Bay area and working in Silicon Valley when he is done with college, I do not think Cal offers any advantage over Michigan. In fact, Michigan's flexible and non-restricted path to any major other than Ross makes it a safer option for the OP, who is still uncertain as to his major.<br><br>Cal obviously rules the West Coast, but in the East Coast, Michigan is just as potent. If cost is not an issue, I would recommend the OP continue researching Cal and Michigan and choose the university/campus/town he thinks he would be happier at.<br><br>", "<b>Username: ASAPtransfer</b><br><br>I'm at Cal now, but I was deciding between Michigan and Cal when I was choosing a college. I would honestly choose Michigan now if I could go back and change my decision. I visited Michigan several times and it seems way more social and fun. I think the fact that Berkeley is ranked higher than Michigan is overrated. Michigan will provide you with a great undergraduate education just as Berkeley will too.<br><br>", "<b>Username: Rintu</b><br><br>If you are looking forward to a good balance between academic rigor and college/campus life, then Michigan will be a better choice.<br><br>", "<b>Username: rjkofnovi</b><br><br>Don't let the rankings fool you solkiz. Berkeley is a fantastic school, but then again so is Michigan. The main differences between the two universitues, IMHO, are the towns they are located in and the overall school spirit. That is where I feel Michigan has a decided edge over Berkeley for the undergraduate student.<br><br>", "<b>Username: solkiz</b><br><br>Thanks everyone for the feedback!<br>Although I was leaning towards UCB for its academics, I'm wobdering whether I'd be happier at UofM just because the courseload might be easier<br>/better GPA inflation, for a similar academic prestige. Is that a good reason to choose Umich? Even though I've never visited?<br><br>", "<b>Username: rjkofnovi</b><br><br>Michigan is not known for grade inflation. Please don't be fooled into thinking that U-M is going to be a cakewalk compared to other top schools. You should stop basing this most important decision strictly on academics. As has been stated multiple times, there isn't that much of a difference. FIT, FIT, FIT in your case. Go to where you think you'd be happiest.<br><br>", "<b>Username: Alexandre</b><br><br>solkiz, Cal and Michigan are academic equals. There is no reason to think that choosing Cal over Michigan is the right thing to do for academic purposes. Do not over-think this. There is no difference academically. That is why they are ranked within 8 or 9 spots of each other overall and in any field of study out of 3,000 universities. Even universities ranked within 20 spots of each other are identical in terms of quality.<br><br>You should be evaluating the respective campus environments and your preferred college experience. As all those who have been giving you advice have been saying, go for fit. Cal and Michigan are similar in many ways, so you will not exactly love one and hate the other, but there are subtle differences that should make one of the two schools a better option for you.<br><br>", "<b>Username: ab2013</b><br><br>Michigan has a strong reputation in all of the fields that you listed. I remember when I was deciding to come here, someone told me that this school is \"remedial.\" Rankings can lie. I can tell you from experience that some of the engineering classes--math and econ included--have very brutal curves. Some classes set the average to a B-/C+.<br><br>If both schools are comparable in cost, please consider visiting both schools so you can see which seems like a better fit. For starters, it seems that Michigan has the benefit of relative proximity compared to Berkeley.<br><br>One note: Engineering is a college. Not a major.<br><br>", "<b>Username: ab2013</b><br><br>Also note: Lots of Michigan CS students end up on the West Coast. Cisco (San Jose) likes hiring Michigan students, as well as other smaller companies. (Google, Apple, and Facebook are a bit more selective but people do get in) I believe Michigan is in the Top 3 schools at Microsoft.<br><br>I was lucky enough to spend the summer (at an internship) in the Bay Area sophomore year, but I didn't like the lifestyle there.<br><br>", "<b>Username: Pat1120</b><br><br>This may seem a bit backhanded, but, you could potentially commit to both, visit Michigan, and then decide. You'd lose a few hundred bucks... but I think it may be worthwhile to visit Michigan. You may fall in love with it, you may decide that Berkeley is the better option. I'm not really sure of the drawbacks to this option, but just food for thought.<br><br>", "<b>Username: solkiz</b><br><br>Thanks everyone for the replies!<br>@Pat1120, do you mean double depositing at the two schools? I've been trying to find virtual tours and stuff, but I know that's not nearly as good as visiting for real. Losing the hundred bucks or so shouldn't be a problem if it buys me time to visit Michigan, but could I potentially have my decision rescinded from either school if I'm caught?<br><br>", "<b>Username: BlueWorks</b><br><br>UCB has an academic edge over UMich. Unless you're paying instate tuition, going to the Honors college or are receiving more financial aid I'd pick UCB<br><br>", "<b>Username: rjkofnovi</b><br><br>^^^The OP has already indicated that he/she has been admitted to the honors program at Michigan. Michigan has the academic edge over a lot of schools rated higher than it at USNWR, so that isn't always the most important factor when selecting a college. It's not like your comparing Cal with some run of the mill state controlled school in this country. Michigan is also a world class institution and bests Berkeley in quite a few academic areas. Very few universities can say that, public or private.<br><br>", "<b>Username: ForeverAlone</b><br><br><a href=\"http://www.youtube.com/watch?v=tS9Qstl4iU4\" rel=\"nofollow\">Student Focus: Internships in Computer Science - YouTube</a><br>^Video of undergradate seniors who have done Michigan CS-LSA.<br>I've been to each of their discussion sections for my EECS 183 first semester.<br><br>Microsoft, Google, Boomberg-LP, and Yelp aren't bad companies to work for.<br><br>", "<b>Username: solkiz</b><br><br>I really appreciate all the feedback on this thread, thanks to everyone who posted!<br>Also, a bit off track, I know both schools are public and therefore not \"handholding\", aka you're basically on your own. However, which one is generally more helpful in advising and guiding their students throughout college?<br><br>", "<b>Username: solkiz</b><br><br>And I ask this because although I know it's good for me to learn to be independent, I still might need just a little guidance to get me on my way there lol.<br><br>", "<b>Username: TheBanker</b><br><br>If I recall, UC Berkeley surpasses UMich in all of those majors. It is generally accepted as the #1 public university in America and overall ahead in UMich in academics. In fact, UC Berkeley is one of the top 5 schools in the world in international rankings. It's definitely worth going there considering that you are paying the same amount of money. Berkeley and UMich are pretty similar (tough academics, college town, ect.) but things at Berkeley seem more academically intense and the location is more gritty. Still. Not only do you have the better location and geography (being next to Silicon Valley and all), but Berkeley has a lot of credibility with tech companies, finance/consulting firms, grad schools, ect.<br><br>", "<b>Username: Alexandre</b><br><br>TheBanker, in any ranking, Cal will usually be ranked #1 or #2 among public universities while Michigan will be ranked between #1 and #4. According to the main three international rankings (ARWU, QS and Times), Cal is ranked 4, 22, and 9 respectively while Michigan is ranked 22, 17 and 20 respectively. The difference is hardly worth nothing as there are literally over 5,000 universities around the world.<br><br><a href=\"http://www.shanghairanking.com/ARWU2012.html\" rel=\"nofollow\">Academic Ranking of World Universities - 2012| Top 500 universities | Shanghai Ranking - 2012 | World University Ranking - 2012</a><br><br><a href=\"http://www.topuniversities.com/university-rankings/world-university-rankings/2012\" rel=\"nofollow\">QS World University Rankings - 2012 | Top Universities</a><br><br><a href=\"http://www.timeshighereducation.co.uk/world-university-rankings/2012-13/world-ranking\" rel=\"nofollow\">World University Rankings 2012-2013 - Times Higher Education</a><br><br>I agree that Cal is slightly stronger than Michigan academically, but the difference is not noteworthy. Among US universities, Cal is generally regarded as the #1 public university while Michigan is usually regarded as the #2 or #3 public university. Overall, Cal is usually regarded as being one of the top 10 and Michigan one of the top 20. Either way, those are two elite universities, and if choosing between them, academic ratings will not be a determining factor.<br><br>\"Not only do you have the better location and geography (being next to Silicon Valley and all), but Berkeley has a lot of credibility with tech companies, finance/consulting firms, grad schools, etc.\"<br><br>While I agree that the Bay area is a great location, it is not for everybody. The OP has indicated that he wishes to return to the NE when he is done with college. As far as the NE is concerned, Cal will not offer an advantage over Michigan. In fact, as far as Finance and Consulting firms are concerned, Michigan actually trumps Cal just as Cal trumps Michigan for Tech jobs. In all these cases, the two universities are very highly respected, but each has its niche.<br><br>", "<b>Username: Alexandre</b><br><br>\"Also, a bit off track, I know both schools are public and therefore not \"handholding\", aka you're basically on your own. However, which one is generally more helpful in advising and guiding their students throughout college?\"<br><br>I do not think either university is known for advising. I think both will have resources available for students, but they will not be apparent. You will have to be proactive and seek them out. In the domain of advising, major research universities, and this is not restricted only to public, but also to major private research universities, advising will be lacking.<br><br>", "<b>Username: rjkofnovi</b><br><br>\"Berkeley and UMich are pretty similar (tough academics, college town, ect.) but things at Berkeley seem more academically intense and the location is more gritty.\"<br><br>The above statement would not be a ringing endoresement to attend Cal for the average 18 year old.<br><br>", "<b>Username: JH8888</b><br><br>I would like to bring one piece of information into this discussion.<br><br>My friend who lives in the Bay area told me last month she will not send her kids to UCB because most of her friends' kids took 5 years to greduate. The reason was they could not register the classes they wanted before they were full. It's a big problem talked often among Asian parents.<br><br>You might want to consider the financial impact of greduating one year later. It could be in the 6 figures.<br><br>", "<b>Username: rjkofnovi</b><br><br>^^^Very good point.<br><br>", "<b>Username: jason311</b><br><br>The 4 year graduation rates for both Umich and Cal are very close (~70%). So, dont mislead.<br><br>", "<b>Username: rjkofnovi</b><br><br>It's not misleading jason. California has been having a budget crunch and its schools are not as well funded as Michigan, since their endowment is far smaller. This could very well be a problem.<br><br>", "<b>Username: jason311</b><br><br>I dont talk about financial crisis, I talk about 4 year graduation rates. The fact is both Cal and umich have the highest 4 year graduation rates among the public universities. Actually, I know most of Asian kids in Cal graduated in 4 years. Please see the link:<br><url>http://opa.berkeley.edu/statistics/DashboardUnderGradGraduationRates.html</url><br><br>", "<b>Username: rjkofnovi</b><br><br>^^^That link is semi-worthless Jason. It is at least 5 years old. The reality of what might be going on in the past couple of years is not indicated by that chart.<br><br>", "<b>Username: jason311</b><br><br>FYI: rjkofnovi<br><br>In 2011, the average time to graduate was 3.98 years, according to the campuss undergraduate profile. This is a decrease from 2003, when the average time for freshmen to complete an undergraduate degree was 4.2 years, according data from the UC Office of the President.<br><br><a href=\"http://www.dailycal.org/2012/10/03/berkeley-places-ninth-in-world-university-rankings/\" rel=\"nofollow\">Berkeley places ninth in World University Rankings - The Daily Californian</a><br><br>", "<b>Username: TheBanker</b><br><br>\"\"rjkofnovi wrote: The above statement would not be a ringing endoresement to attend Cal for the average 18 year old.\"\"<br><br>Just trying to be as objective as possible. I don't have any personal affiliation with either, though I have visited Berkeley before.<br><br>Since OP wants to go back to NE (didn't see this part), UMich is better. I just assumed those interested in engineering/CS would want to go to Silicon Valley as a first choice. I'd recommend taking a second look though.<br><br>The impact of the financial crisis in the UC system has been exaggerated, but it's really frustrating still. Few Californians now trust the state to manage the UC/CSU system well. Getting an ideal schedule is tough if you don't meticulously plan everything out beforehand with backup classes, and classes are huge and you don't get much attention. It's definitely not as bad as at UMich, I imagine, but UMich is still kind of similar to Cal in this regard. On the other hand, you will almost definitely graduate in 4 years from Cal; it seems many who take longer do so voluntarily because of a double major or a master's degree.<br><br>", "<b>Username: MichorPlan2</b><br><br>I had also heard anecdotally that graduation is taking longer at the UC schools due to the huge budget crunch they are in, that allegedly got much worse this year. I don't know about the numbers cited in the article by Jason, they seem very fishy to me. The article states:<br>\"The percentage of the entering freshman class in 2004 that had graduated by 2010 was 91 percent . . . and the percentage of students who entered in 2004 and had graduated by 2008 was 69 percent.\"<br><br>With just over 2/3 graduating in 4 (or 4.5) years and another 22% needing up to 6 years to graduate, it is hard to imagine how the average time to graduation would be under 4 years. I suppose it could work out if a lot of the 2/3 are graduating in 3 or 3.5 years, but that seems unlikely. In addition, by stating that 69% of the 2004 class graduated by 2008, that would include students who took 4.5 years to graduate (Dec. 2010). Like I said, these numbers look fishy.<br><br>", "<b>Username: MichorPlan2</b><br><br>BTW, D is just finishing her sophomore year and is well on-target to graduate in 4 years at Michigan with dual majors of history and economics. So, whatever the situation at UCB, it is easily doable to graduate in 4 years from UM.<br><br>", "<b>Username: rondholm</b><br><br>Son was deliberating between Michigan and Berkeley... until today when he committed to Michigan. We spent four days at UC Berkeley and four days at Michigan last week to gather information. Berkeley admissions told us that they did research into their four-year graduation rate and determined that study abroad and dual majors are the most common reason for delayed graduation. They also said that students tell their parents that they can't get required classes to graduate in four years, but their research showed that the class was available but not during the preferred times of 10 a.m. to 2 p.m. Berkeley is looking at classes which start at 8 a.m. for possible rescheduling because most students simply won't register for those classes, even if the course is needed to graduate.<br><br>", "<b>Username: Bigdoglover</b><br><br>Yeah for rondholm's son! Good choice!<br><br>", "<b>Username: seaslipper</b><br><br>I faced this exact choice in 1979, went to Michigan, and have followed both schools ever since. My thoughts:<br><br>Very similar kinds of schools: large, prestigious state universities with world-wide reputations as elite schools, based in great college towns. Price for OOS is similar at this point; although Berkeley has much higher cost of living.<br><br>UCB has a garden like campus with more exotic natural beauty. Hilly. Faces the bay. Redwoods on campus. California look.<br>UM has more classic college buildings (some are just incredible) and lots of trees that look fabulous in the autumn. Landscape is flat with some small hills. Classic Eastern college look. Verdict: Tie<br><br>UM does more for undergraduates. Living learning communities, honors program, resident college, undergrad. research opp. program, writing programs, mentorship. UCB doesn't appear to have any or much of that. Verdict: UM<br><br>UCB has an edge in the reputation department due to the Nobel prizes and Academy of Science memberships. In most areas it does slightly better but both are tops more perhaps than any schools other than Stanford and Harvard. But UCB has an edge over Ivy League schools too. UM is fully in that class and is highly respected in the professional world and academia. Verdict: UCB<br><br>Ann Arbor might be the best college town in the country. Pretty with all kinds of Victorian buildings, safe, fun, full of culture. Parks everywhere. Berkeley is also a great college town but gritty and unsafe in parts. The city of Berkeley has its own identity apart from the university (which you might prefer) and often the two clash. Verdict: UM<br><br>Berkeley is next to San Francisco. Ann Arbor is 40 minutes from Detroit. Verdict: UCB<br><br>Both are in beautiful states. People associate Michigan with auto plants but most of the state is rural. It boarders three great lakes and has more coastline than Florida. Northern California is lovely Northern California but the East Bay Area is overly congested. And this pushes right up against campus. Area around Ann Arbor is more rural and not congested.Verdict: Tie<br><br>UCB is more urban, UM more suburban. Verdict: Depends on your preferences. Verdict: Tie<br><br>Both are strong in sports but the UM sports tradition is much stronger. You might like this and you might not like it. For those who do, theres nothing that beats it. Verdict: UM<br><br>UM has far more student housing and is in the middle of a major housing building endeavor. They pour hundreds of millions into this and have many classic dorms. UCB has a terrible shortage and apartments are kind of beat. Verdict: UM<br><br>UM has a medical school, one of the best in the world. Thats a big thing for a U not to have, in the case of UCB. But UCSF is across the bay. Verdict: UM<br><br>UM has a more vibrant alumni association and school identity. Verdict: UM<br><br>UM offers more practical majors for students: eg BA in Education or Public Policy. Verdict: UM<br><br>UCB uses grading curves in the sciences and prides itself on having a competitive environment. Read their website, every fourth word is competitive. Maybe youll thrive in this. I find it tedious and stressful. Verdict: UM<br><br>UM is more folksy and friendly. The Midwestern values and politeness come through. I was there a few months ago and more than a few people walked me towards my destination after I asked for directions. I doubt this will happen at UCB; although Californians are more laid back and probably a little more fun. Verdict: UM<br><br>UM has incredible graduate social sciences degrees offered through the Rackham school. Fully funded joint majors. Probably the better school for social sciences. Verdict: UM<br><br>UM is a major player in computer science and played a big role in the creation of the Internet. But UCB, which Silicon Valley nearby, is legendary in this regard. Verdict: UCB<br><br>UM is in better financial shape, having privatized years ago. UCB hung on to the state U vision longer, which is admirable, but they suffered for it. Verdict: UM<br><br>UCB has pleasant weather year round but its a bit monotonous. UM has four seasons, three of which are lovely. Autumn is amazing. Winter can be charming too but its too long. UM has grey skies in winter, not good for sufferers of SAD. UCB is very sunny. Verdict: UCB<br><br>UM has better museums. Verdict: UM<br><br>UM has more out of staters. Verdict: UM<br><br>So there you have it. All depends on you. I would be very tempted by the honors program. I dont think UCB has one. Thats pretty cool, graduate of UM honors program. It's an elite program within an elite school and likely intellectually stimulating. But you have to weigh all the factors as you value them. You may only care about two or three of the factors here and that will determine your choice.<br><br>", "<b>Username: rjkofnovi</b><br><br>Nice comparison analysis seaslipper. Just one thing, Michigan touches four of the Great Lakes. :-)<br><br>", "<b>Username: UCBChemEGrad</b><br><br>\"\"Computer Science*<br>Economics*<br>Appled math<br>Statistics<br>Engineering**\"\"<br><br>Computer Science: Berkeley #1, Michigan #13<br>Economics: Berkeley #5, Michigan #13<br>Applied Math: Berkeley#8, Michigan #15<br>Statistics: Berkeley #2, Michigan #12<br>Engineering: Berkeley #3, Michigan #7<br><br>The difference is there and is not really negligible, IMO.<br><br><br><br>Berkeley's 6-Year Graduation Rates:<br><url>http://sitemaker.umich.edu/obpinfo/common_data_set</url><br>2012-13: 90%<br>2011-12: 90%<br>2010-11: 90%<br>2009-10: 89%<br>2008-09: 88%<br>\"\"I would be very tempted by the honors program. I dont think UCB has one.\"\"<br>Everyone is honors at Berkeley.<br><br>", "<b>Username: rjkofnovi</b><br><br>\"Computer Science: Berkeley #1, Michigan #13<br>Economics: Berkeley #5, Michigan #13<br>Applied Math: Berkeley#8, Michigan #15<br>Statistics: Berkeley #2, Michigan #12<br>Engineering: Berkeley #3, Michigan #7<br><br>The difference is there and is not really negligible, IMO.\"<br><br>I agree UCB. However, the difference is not significant. Not enough IMHO to be the deciding factor in attending one school over the other.<br><br>Also, what is the four year graduation rate for Cal?<br><br>", "<b>Username: MichorPlan2</b><br><br>\"Everyone is honors at Berkeley.\" And you can give everyone a participation trophy in soccer if you want to, but that just means the trophy has no meaning. Anyway, the admission credentials at UCB are virtually identical to UM. According to the CDS, the 25% ACT at UCB is 1 point lower than UM and the 75% is 1 point higher (27-33 UCB, 28-32 UM). Thus, while UCB chooses not to recognize its top 10% with honors, UM does.<br><br>Finally, on the four year graduation rate (you have to do the math), but four year grad rate at UM is slightly better 72.0% v. 70.9%. But that is for the 2010 class (in the case of UCB) and anecdotally the claim is that it is getting much harder to get classes now at UCB than in previous years. If that is true, it seems likely that soon the four year grad rate at UCB will be down in 60's%.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>71% according to USNews. Michigan is 73%. Keep in mind Berkeley enrolls far more Pell Grant recipients...a lot likely work part-time.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>West Coast uses SAT far more than ACT.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Go over to the Berkeley thread. No one is having trouble getting required classes to graduate. They may be put on a wait list or need to select another section, but I've yet to see threads with kids complaining they aren't graduating on time.<br><br>The budget cuts have been around awhile. State funding stabilized with passage of Proposition 30 back in November. Recent stock market increases have created tax surplus. Jerry Browns budget proposal restores all education funding.<br><br>", "<b>Username: MichorPlan2</b><br><br>SAT scores are similar. I just didn't want to post two numbers. Low end of Math is lower at UCB 630 v. 650. High end higher at UCB 770 v. 750. UCB is slightly higher on reading though: 20 on the low end, 30 on the high.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Berkeley is also generous with AP credits allowing students to bypass some lower division requirements. A lot of students graduate in 3-3.5 years.<br><br>", "<b>Username: MichorPlan2</b><br><br>\"State funding stabilized with passage of Proposition 30 back in November. Recent stock market increases have created tax surplus. Jerry Browns budget proposal restores all education funding.\"<br><br>You do make a fair point, I do think CA is trying to make sure they don't destroy UCB's well-earned reputation as a top public school. Maybe things won't get worse.<br><br>", "<b>Username: seaslipper</b><br><br>The department rankings are earned mostly through faculty publishing, an effort which generally robs undergrads of instruction. All research institutions have to prove that they pay attention to undergrads because many do not. UM does a better job taking care of undergrads than UCB, I believe.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>^ seaslipper, that is pure conjecture.<br><br>Both Berkeley and Michigan rate highly on USNWR's Dedication to Undergrad Teaching survey.<br><url>http://colleges.usnews.rankingsandreviews.com/best-colleges/rankings/national-universities/undergraduate-teaching#</url><br><br>Berkeley and Michigan are both large research universities. Both faculties have same goals. Berkeley does better because it has a more distinguished faculty. Faculty distinction drives academic distinction.<br><br>Recently, the prestigious American Academy of Arts and Sciences and the National Academy of Science inducted new faculty members. Berkeley inducted 10 members into AAAS and 3 into the NAE. Michigan (which has a larger faculty and medical school) inducted 1.5 members and 0 members, respectively. That is terrible for a research university the caliber of Michigan.<br><br><url>http://talk.collegeconfidential.com/college-search-selection/1497211-faculty-strength.html</url><br><br><url>http://talk.collegeconfidential.com/princeton-university/1497766-american-academy-arts-sciences-announces-new-2013-members-news-item.html</url><br><br><url>http://www.nasonline.org/news-and-multimedia/news/2013_04_30_NAS_Election.html?utm_source=feedburner&amp;utm_medium=feed&amp;utm_campaign=Feed%3A%20nationalacademies%2Fna%20%28News%20from%20the%20National%20Academies%29</url><br><br><url>http://www.amacad.org/news/alphalist2013.pdf</url><br><br>", "<b>Username: rjkofnovi</b><br><br><a href=\"http://www.myscience.us/wire/u_m_leads_nation_with_19_aaas_fellows-2012-umich\" rel=\"nofollow\">U-M leads nation with 19 AAAS fellows - myScience / science wire</a><br><br>I guess they're doing something right.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>^That's a different AAAS, rjk.<br><br>", "<b>Username: billcsho</b><br><br>FYI. I have the official 2012 admission data from UMich. For ACT 25-75%, it is 29-33 (27-33 for UCB). For SAT, it is 1990-2230 (1840-2230 &amp; avg 2068 for UCB). Average GPA is 3.83 (3.89 for UCB). They are very close.<br><br>", "<b>Username: rjkofnovi</b><br><br>\"That's a different AAAS\"<br><br>They have been around since 1848. They should sue for copyright infringement! LOL<br><br>", "<b>Username: UCBChemEGrad</b><br><br>American Academy of Arts &amp; Sciences has been around since 1780...<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Admission data means little. It's the enrolled data that's important.<br>But I agree both are close in undergrad student strength.<br><br>", "<b>Username: rjkofnovi</b><br><br>\"American Academy of Arts &amp; Sciences has been around since 1780\"<br><br>Like I said, \"They should sue for copyright infringement!\"<br><br>", "<b>Username: 2prepMom</b><br><br>Ann Arbor is a fantastic college town. Jump on a cheap bus and visit for a weekend. Great school spirit. Very well respected school.<br><br>Then do as your heart dictates. You can't go wrong with either school.<br><br>", "<b>Username: MichorPlan2</b><br><br>Agreed. You can't go wrong at either school. But you can go more right at Michigan. :)<br><br>", "<b>Username: seaslipper</b><br><br>You see UCBChemEGrad, you talk like a typical Berkeley person. Rankings, elitism, competitiveness. It rings hallow to me, particularly when you are splitting hairs. UM is outstanding in its research and its rankings. It brings in more research dollars than UCB. More importantly, would you tell a kid not to go to Darmouth or Cornell? UCB beats out all places except Harvard when it comes to Nobel prizes and American Academy of Arts &amp; Sciences memberships. Does that translate to a good undergraduate education? I know many people who got ignored and lost at Berkeley, and some at Michigan too. It's sad that education has become a numbers game. Congratulations you win. You are #1. La di da. Carry home your trophy. Now let's figure out where 18 years olds can get a good education and start their lives off right. Your whole approach is an argument against going to Berkeley.<br><br>I don't say this from insecurity. I was admitted twice to Berkeley, once as an undergrad. and again as a grad.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Michigan brings in more research money because it has a medical school. Cal+UCSF+LBNL...Then you have apples to apples comparison.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>The faculty difference is not splitting hairs. That is the biggest difference between Michigan and Cal. It's important to me...it could be important to a potential undergrad. For someone with the OP's academic interests, Berkeley is the clear choice in my opinion. Especially since costs are same.<br><br>", "<b>Username: seaslipper</b><br><br>I feared you might mention med school research. But isn't that to UM's credit? They have a med. school. UCSF is not Berkeley. Hey, what kind of major research U doesn't have a medical school? LBNL I might consider Berkeley as it's right on the premises.<br><br>Maybe a brilliant grad. student should go to the more distinguished faculty, that is if they have the slightest interest in mentoring, which many geniuses do not. Even then, I'd to go the place where their exact interests are mine.<br><br>But for an 18 year old who just wants to be introduced to his subject. I'd go to the place where I'd be happy, engaged and where I matter. I don't need Einstein to teach me physics 101. In fact he might do a terrible job. So he gets to be famous and I feel like a failure. Wonderful.<br><br>You need to separate the ego gratification of being loosely associated with the elite of the elite with what's good for kids.<br><br>I say again, your approach is an argument against undergrad work at Berkeley. Listening to you, I'd run the other way. You reveal the whole obsession they have they with department rankings that often run counter to teaching. You can't research and teach at the same time. One suffers for the other. This is widely known.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>I'm not exactly grasping to your argument either...which is Michigan teachers somehow as a whole \"care\" about undergrads more. That is very fuzzy and nebulous to confirm.<br><br>I say both faculties are large. You're going to have some bad profs in both places. You need to show me some proof that Michigan profs care more.<br><br>The OP hasn't visited Michigan's campus and says he can't. I wouldn't want to commit somewhere I haven't visited.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Who cares if campuses are separate? At least Cal's engineering campus is contiguous and not a bus ride away...like Michigan.<br><br>", "<b>Username: rjkofnovi</b><br><br>\"At least Cal's engineering campus is contiguous and not a bus ride away...like Michigan.\"<br><br>You could walk it.......<br><br>", "<b>Username: Alexandre</b><br><br>UCBChemEGrad, Michigan and Cal have very similar faculties. The main difference is that Michigan does a bad job of retaining senior faculty (those that win awards). However, the number of young stars on the Michigan faculty is staggering. Unfortunately, due mainly to its pay structure, once those young stars prove themselves and are on their way to winning a major award, they end up leaving to either Cal, Harvard, MIT, Princeton, Stanford or Yale among others. By the time those professors make it to that level, they typically lose their appetite for teaching undergrads and rest of their past glories...those that they acquired and perfected as faculty members at Michigan.<br><br>That being said, in most departments, Michigan's faculty, even at the senior level, will match Cal's nicely. From a career point of view, the only program at Cal that will give the OP an edge academically or professionally is Computer Science. In all the other departments he listed, Michigan will offer as robust an education and equally good professional placement opportunities.<br><br>", "<b>Username: rjkofnovi</b><br><br>\"Unfortunately, due mainly to its pay structure, once those young stars prove themselves and are on their way to winning a major award, they end up leaving to either Cal, Harvard, MIT, Princeton, Stanford or Yale among others.\"<br><br>I've always felt that although A2 is a wonderful town, it is disadvantaged by not being closer to a world class city like those other towns listed above.<br><br>", "<b>Username: seaslipper</b><br><br>I spoke today to a neighbor who went to UCB. I asked, \"Did you have much interaction with your professors?\" He said, \"Next to none. They totally ignored us. All we saw were TAs.\" I have heard this from others too.<br><br>What Michigan has in place are more programs that produce interaction with professors: UROP, mentorship, Residential College, living learning communities, Honors program. Cal doesn't have this sort of thing. I can't promise that students don't get ignored at UM too, but the school does more to prevent this.<br><br>As for top faculty, as rjkofnovi explained, this costs money. NYU over recent years spent 100s of millions on this. It comes at the cost of student programs. Berkeley spends this money too. Mich spends more on the students. Again, I don't need Einstein to teach me physics. This is the whole problem with the Berkeley model. The real geniuses go to Cal. Tech, Harvard, and MIT. The Cal undergrad. population is very talented and motivated but they don't need to learn Chem 101 from a National Academy of Sciences member who likely has no time for them.<br><br>The purpose of colleges is not to win awards, it's to make a better society by educating young people and by producing research. Well Mich does plenty of research, second only to Johns Hopkins. And if you subtract the military research from JH, then Mich does the most.<br><br>You are talking disrespectfully about what is truly a wonder of a place in every regard as far as academia goes. It reminds me of how Mich. people often talk about MSU - disrespectfully of what also is a very impressive and important place. Let's just appreciate these schools and not make a contest out of it. They each have their place. Question is for young people making decisions, which place is best for them?<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Alexandre, if your assertion was true, how come Michigan doesn't have any profs winning the Nobel Prize after their time at Michigan? They list quite a few winners who went to Michigan after the award:<br><br><a href=\"http://en.m.wikipedia.org/wiki/List_of_Nobel_laureates_by_university_affiliation\" rel=\"nofollow\">List of Nobel laureates by university affiliation - Wikipedia, the free encyclopedia</a><br><br>", "<b>Username: Alexandre</b><br><br>seaslipper, your neighbor's experience is similar to that of any undergrad at a major research university, private or public, large or small, elite or not. My friends who went to schools like Columbia and Stanford also hardly ever interacted with faculty they freshman and sophomore years. Only when they took advanced classes within their major did they get the chance to interact with professors in any significant measure. In this respect, I suspect Cal and Michigan are identical.<br><br>I agree, however, that Michigan offers more unique programs aimed at getting underclassmen involved at an interactive level. Programs such as UROP and MRC, Residential College, Honors and the Living Learning Communities in general are excellent at that.<br><br>", "<b>Username: Alexandre</b><br><br>UCBChemEGrad, the link from Wiki is not accurate. Most faculty listed in that link you provided taught at Michigan before winning the prize. You can even check the links yourself.<br><br>For example, Lawrence Klein (Economics) started his career at Michigan in the 1940s and early 50s and developed most of his models that won him the nobel prize in Ann Arbor. He was denied tenure at Michigan and had to leave the US to the UK during the McCarthy years (in the mid 50s), and when he returned to the US in the late 50s, he join the Penn faculty, where he remained until he won the Nobel Prize in the 1970s.<br><br>Joseph Drodsky (Literature) also taught at Michigan when he first moved to the US in the 1970s, and he won the Nobel in the 80s.<br><br>Donald Glaser (Physics) taught at Michigan in the 1950s, where like Klein, he did most of the work that won him the Nobel Prize in 1960.<br><br>Charles Huggins (Medicine) was an instructor of surgery at Michigan in the mid 1920s and won the prize in the 1960s.<br><br>Martin Perl (Physics) was a professor at Michigan in the mid 50s until the early 60s and did not win the prize until the mid 1990s. He did much of his early work with Glaser.<br><br>Peyton Rous (Medicine) was an instructor of Pathology at Michigan in the early 1900s and won the prize with Huggins in the mid 1960s.<br><br>Hamilton O Smith (Medicine) was a professor in the school of Medicine in the early-mid 1960s and won the prize in the lat 1970s.<br><br>Martinus Veltman (Physics) taught at Michigan throughout the 80s and 90s, and won the Nobel in 1999.<br><br>", "<b>Username: seaslipper</b><br><br>Somebody is not getting it. We don't care about the Nobel Prizes. This is the College Confidential website. It is geared towards young people, mostly high school students, who are considering college. What's the best place for their time and money? It's not meant for the Guinness Book of World Records to find new material. School with most Nobel Prizes. Some people are so hooked into the prestige that they have lost any concept of education.<br><br>By the way, I went to Columbia U for grad school in Economics. Talk about getting ignored by professors. Even in grad. school they didn't know we existed. When I tell people I went there, they always say, oh good school. I say, what does that mean?<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Seaslipper, I'm just posting information that counter claims that Michigan and Cal's faculty are nearly identical.<br><br>I've yet to see any data or info posted for your claims that Michigan cares about undergrads more.<br><br>", "<b>Username: Alexandre</b><br><br>UCBChemEGrad, I think that claiming that Cal's faculty is vastly superior to Michigan's, or that undergrads would actually feel a difference in the caliber of the faculty is overstating facts. Michigan's faculty is universally counted among the top 10 in the US. Cal's is among the top 3. Is there a difference in quality? Yes. Is it significant? Not under any reasonable definition of the term. Do undergrads benefit in any way from that insignificant difference in the quality of the faculty? Highly unlikely.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Here is a listing of Berkeley's faculty achievements:<br><a href=\"http://www.berkeley.edu/about/honors.shtml\" rel=\"nofollow\">Awards held by faculty - UC Berkeley</a><br><br>I don't see anything comparable on Michigan's website. I very much doubt it's Top 10. UCLA and UCSD even have stronger faculties than Michigan.<br><br>", "<b>Username: Alexandre</b><br><br>UCBChemEGrad, you are looking at awards won by faculty only. Those faculty members number in the hundreds, while the total faculty numbers in the thousands. Even if UCLA and UCSD have more award winners, the vast majority of their faculty is unaccounted for. So what if the top 100 faculty at UCLA and UCSD are stronger than the top 100 faculty at Michigan (unlikely mind you)? What about the remaining 6,400 professors at Michigan? Can UCLA and UCSD (which have fewer than 4,500 faculty each) keep up?<br><br>I am surprised that you so confidently claim that UCSD and UCLA have stronger faculties than Michigan. If that were the case, they would have stronger departments across the board. In truth, Michigan is consistently as strong, if not stronger, across all disciplines. Below is how universities rank in various fields according to the latest USNWR:<br><br>HUMANITIES AND SOCIAL SCIENCES (average rating out of 5.0)<br>#1 Stanford University 4.77<br>#1 University of California-Berkeley 4.77<br>#3 Harvard University 4.75<br>#3 Princeton University 4.75<br>#5 Yale University 4.56<br>#6 University of Chicago 4.50<br>#6 University of Michigan-Ann Arbor 4.50<br>#8 Columbia University 4.42<br>#9 University of California-Los Angeles 4.38<br>#10 University of Pennsylvania 4.27<br>#10 University of Wisconsin-Madison 4.27<br>UCSD is not among the top 20<br><br>HARD SCIENCES<br>#1 Massachusetts Institute of Technology 4.93<br>#2 University of California-Berkeley 4.87<br>#3 Stanford University 4.85<br>#4 California Institute of Technology 4.72<br>#5 Harvard University 4.58<br>#6 Princeton University 4.47<br>#7 Cornell University 4.37<br>#8 University of Illinois-Urbana Champaign 4.28<br>#9 Columbia University 4.27<br>#10 University of Michigan-Ann Arbor 4.18<br>#11 University of Chicago 4.17<br>#11 University of Texas-Austin 4.17<br>#11 Yale University 4.17<br>#14 University of Wisconsin-Madison 4.15<br>#15 University of California-Los Angeles 4.05<br>#16 University of Pennsylvania 4.00<br>#16 University of Washington 4.00<br>#18 University of California-San Diego 3.98<br><br>As you can see, Michigan is #6 when you combine the 12 traditional disciplines, which speaks directly to the strength of the Michigan faculty. UCLA is roughly equal but UCSD is not as consistently strong. If you add Engineering and Medicine to the equation, Michigan<br><br>ENGINEERING (Peer Assessment Score)<br>#1 Massachusetts Institute of Technology 4.9<br>#2 Stanford University 4.8<br>#2 University of California-Berkeley 4.8<br>#4 California Institute of Technology 4.7<br>#5 Georgia Institute of Technology 4.5<br>#5 University of Illinois-Urbana Champaign 4.5<br>#7 University of Michigan-Ann Arbor 4.4<br>#8 Carnegie Mellon University 4.3<br>#8 Cornell University 4.3<br>#10 Princeton University 4.2<br>#10 Purdue University-West Lafayette 4.2<br>#10 University of Texas-Austin 4.2<br>#13 Northwestern University 4.0<br>#14 Johns Hopkins University 3.9<br>#14 University of Wisconsin-Madison 3.9<br>#16 Texas A&amp;M University 3.8<br>#16 University of California-San Diego 3.8<br>#16 Virginia Tech 3.8<br>#19 Columbia University 3.7<br>#19 Harvard University 3.7<br>#19 Pennsylvania State University-University Park 3.7<br>#19 Rice University 3.7<br>#19 University of California-Los Angeles 3.7<br>#19 University of Maryland-College Park 3.7<br>#19 University of Minnesota-Twin Cities 3.7<br>#19 University of Southern California 3.7<br><br>MEDICINE (Peer Assessment Score)<br>#1 Harvard University 4.8<br>#2 Johns Hopkins University 4.7<br>#2 Stanford University 4.7<br>#2 University of California-San Diego 4.7<br>#5 University of Pennsylvania 4.6<br>#6 Washington University-St Louis 4.5<br>#7 Duke University 4.4<br>#7 University of Michigan-Ann Arbor 4.4<br>#9 Columbia University 4.3<br>#9 University of Washington 4.3<br>#9 Vanderbilt University 4.3<br>#9 Yale University 4.3<br>#13 Cornell University 4.1<br>#13 University of California-Los Angeles 4.1<br>#13 University of California-San Diego 4.1<br>#13 University of Pittsburgh 4.1<br><br>In terms of overall faculty strength, I think Cal (top 3) has the edge over Michigan (top 10) and Michigan has the edge over UCLA (top 15) and UCSD (top 20). All four universities have excellent faculties though.<br><br>", "<b>Username: rjkofnovi</b><br><br>MEDICINE (Peer Assessment Score)<br>#1 Harvard University 4.8<br>#2 Johns Hopkins University 4.7<br>#2 Stanford University 4.7<br>#2 University of California-San Francisco 4.7<br>#5 University of Pennsylvania 4.6<br>#6 Washington University-St Louis 4.5<br>#7 Duke University 4.4<br>#7 University of Michigan-Ann Arbor 4.4<br>#9 Columbia University 4.3<br>#9 University of Washington 4.3<br>#9 Vanderbilt University 4.3<br>#9 Yale University 4.3<br>#13 Cornell University 4.1<br>#13 University of California-Los Angeles 4.1<br>#13 University of California-San Diego 4.1<br>#13 University of Pittsburgh 4.1<br><br>Corrected #2 to Berkeley's De facto medical school. :-)<br><br>", "<b>Username: UCBChemEGrad</b><br><br>You can add up NAE, NAS and Institute of Medicine members for each. I would say UCSD and UCLA have more members than Michigan. Pretty sad the supposed #2 flagship public trails Cal's extension campuses. ;) This thread from 2005 could be updated:<br><url>http://talk.collegeconfidential.com/college-search-selection/86111-universities-most-distinguished-faculty.html</url><br><br>Michigan has a weak faculty compared to comparable universities, especially in the sciences...even with an in-house medical school. You've acknowledged this issue in the \"Is Michigan Weak\" thread.<br><br>", "<b>Username: rjkofnovi</b><br><br>Berkeley>San Francisco<br><br>UCLA>>>Los Angeles<br><br>UCSD>>>San Diego<br><br>Michigan>Detroit<br><br><br>Hmmmm. Which university has the weakest location? Lets face it, most of the leading research universities in this country are located either in major liveable cities or nearby.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>That's a good point. San Diego is kinda boring though.<br><br>", "<b>Username: rjkofnovi</b><br><br>^^^^Compare San Diego and Detroit. There is no comparison.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>I'm curious where the OP decided to attend. I think I've digressed enough. ;)<br><br>", "<b>Username: Alexandre</b><br><br>\"You can add up NAE, NAS and Institute of Medicine members for each. I would say UCSD and UCLA have more members than Michigan... Michigan has a weak faculty compared to comparable universities, especially in the sciences...even with an in-house medical school.\"<br><br>UCBChemEGrad, you cannot assume that a faculty is weak if it lacks NAE, NAS and Institute of Medicine members. For example, Princeton's Mathematics department has 14 members of the NAS. Cal only has 6. Is Princeton's Mathematics department that much better than Cal's? Chicago only has 2, while Columbia and Cornell each have 1. Those 4 mathematics departments are also stellar. By the way, Michigan has 4, UCLA has 3 and UCSD has 2.<br><br>For Engineering, Michigan has 26 members of the NAE. Only MIT, Stanford, Cal, UIUC and Caltech have more. Michigan is 6th, tied with CMU and Georgia Tech. UCSD has an impressive 23 and UCLA has 19.<br><br>The fact of the matter is, while a university may have 100, 200 or even 300 members of major Academies, those are still merely a tiny fraction of the overall faculty. In many instances, those members do not teach undergraduate students. But regardless, a faculty's overal strength will be determined by the strength of its departments across the board, not by the number of members it has. From that point of view, I would rate Cal's faculty between #1 and #3 and Michigan's between #5 and #7. The strengths of Michigan's departments and programs support the fact that it has a top 10 (arguably top 5) faculty.<br><br>", "<b>Username: goldenboy8784</b><br><br>Peer Assessment scores only measure perception and don't always represent reality. If Michigan was truly world-renowned, Michigan would have more NAS and NAE members on their faculty. The perception of Michigan in a lot of key areas of academic study seems to be overrated.<br><br>", "<b>Username: rjkofnovi</b><br><br>You do realize goldenboy that Duke is FAR worse than Michigan in the number of NAS and NAE members, yet somehow is miraculously ranked as a top ten school. Talk about completely overrated. If Duke WERE truly world-renowned...........<br><br>", "<b>Username: Alexandre</b><br><br>goldenboy, Michigan trails Cal, Harvard, MIT, Princeton, Stanford and Yale. That is not surprising considering that they have strong PA scores. Michigan does not trail its own peers, schools like Chicago, Columbia, Cornell and Penn do not have more NAS and NAE members.<br><br>Brown, Dartmouth, Duke and Vanderbilt trail Michigan in this count. I have only looked at Mathematics/Physics/Chemistry (NAS) and Engineering (NAE) and Michigan leads Duke 33 to 8. That's not even close. Surprisingly, Michigan even beats Duke in the number of Institute of Medicine members, 125 to 90.<br><br>I would say that Michigan's PA is spot on. Michigan is neither over, nor underrated by academe. Those guys actually know their business. Without a doubt, Michigan's peer assessment ratings usually ranges between #5 and #7, and that is where it belongs.<br><br>", "<b>Username: rjkofnovi</b><br><br>I am not sure about the voting processes for these academies, but I have a feeling one already has to be a member to get a vote. If that is the case, schools that have large amounts of inductees are more likely to be voting for their colleagues who they see on a daily basis than those on other faculties. I know there are strict quotas on new memberships per year, so I would imagine a bit of partisonship plays a major role in who gets accepted.<br><br>", "<b>Username: goldenboy8784</b><br><br>\"\"Alexandre wrote: goldenboy, Michigan trails Cal, Harvard, MIT, Princeton, Stanford and Yale. That is not surprising considering that they have strong PA scores. Michigan does not trail its own peers, schools like Chicago, Columbia, Cornell and Penn do not have more NAS and NAE members.<br><br>Brown, Dartmouth, Duke and Vanderbilt trail Michigan in this count. I have only looked at Mathematics/Physics/Chemistry (NAS) and Engineering (NAE) and Michigan leads Duke 33 to 8. That's not even close. Surprisingly, Michigan even beats Duke in the number of Institute of Medicine members, 125 to 90.\"\"<br>Alex, that's because Chicago doesn't have an Engineering school and Penn/Duke don't have comprehensive engineering departments like Michigan. How can you expect a school that doesn't offer ChemE, Nuclear Engineering, Aerospace, Industrial/Operations Engineering, Naval Architecture/Marine Engineering like Duke to be competitive with Michigan in NAE membership?<br><br>I don't make fun of Princeton because it doesn't have a Business, Law, and Medical school. Not every school aspires to be a jack of all trades like Michigan. ;)<br><br>Penn has more NAS members than Michigan and Duke is the only school on your list of \"peers\" that trails Michigan by a bit (24 vs. 22).<br><br><b>National Academy of Sciences Membership</b><br><a href=\"http://nas.nasonline.org/site/Dir?sid=1011&amp;view=basic&amp;pg=srch\" rel=\"nofollow\">National Academy of Sciences</a><br><br>University of California, Berkeley:127<br>....<br>....<br>....<br>Columbia U.: 48<br>University of Washington: 47<br>University of Chicago: 40<br>University of California, Los Angeles: 40<br>University of Wisconsin: 37<br>Cornell: 35<br>University of Pennsylvania: 28<br>Johns Hopkins University: 26<br>University of Michigan-Ann Arbor: 24<br>Duke U.: 22<br>Northwestern U.: 20<br>UT Austin: 17<br>UNC Chapel Hill: 11<br>Brown U.: 9<br>Vanderbilt U.: 7<br>University of Virginia: 3<br>Dartmouth U.: 2<br><br>", "<b>Username: rjkofnovi</b><br><br>\"How can you expect a school that doesn't offer ChemE, Nuclear Engineering, Aerospace, Industrial/Operations Engineering, Naval Architecture/Marine Engineering like Duke to be competitive with Michigan.........\"<br><br>You can't. Your only purpose to come to this board is to disparage the University of Michigan. Please just go away.......<br><br>", "<b>Username: UCBChemEGrad</b><br><br>\"\"How can you expect a school that doesn't offer ChemE, Nuclear Engineering, Aerospace, Industrial/Operations Engineering, Naval Architecture/Marine Engineering like Duke to be competitive with Michigan in NAE membership?\"\"<br><br>Doesn't stop Harvard from being competitive.<br><br>NAE Membership:<br>Michigan: 26<br>Harvard: 19<br>Duke: 5<br><br>", "<b>Username: goldenboy8784</b><br><br>I have no explanation for that UCBChemEGrad except for the fact that I think some researchers are willing to accept a Faculty position at Harvard even if its weak in their discipline just to brag to their relatives that they teach at Harvard.<br><br>Harvard is always the exception to every rule.<br><br>", "<b>Username: Alexandre</b><br><br>Even just looking at the NAS, which is admittedly Michigan's weakest area as far as faculty awards are concerned, Michigan holds its own against several of its peers, including Chicago, Cornell, Duke, JHU, Northwestern, Penn, Texas-Austin, UCLA, UNC and Wisconsin-Madison.<br><br>As for the NAE and Institute of Medicine count, Michigan is #7 in both:<br><br>#1 Massachusetts Institute of Technology 111<br>#2 Stanford University 95<br>#3 University of California-Berkeley 75<br>#4 California Institute of Technology 33<br>#5 Princeton University 30<br>#5 University of Illinois-Urbana Champaign 30<br>#7 Carnegie Mellon University 26<br>#7 University of Michigan-Ann Arbor 26<br>#9 Cornell University 25<br>#9 Georgia Institute of Technology 25<br>#9 University of California-Santa Barbara 25<br>#9 University of Southern California 25<br>#13 University of California-San Diego 23<br>#14 University of Wisconsin-Madison 21<br>#15 Harvard University 19<br>#15 Northwestern University 19<br>#15 Purdue University-West Lafayette 19<br>#15 University of California-Los Angeles 19<br>#19 Columbia University 18<br>#20 University of Washington 17<br><br>Institute of Medicine<br>#1 Johns Hopkins University 178<br>#2 Harvard University 149<br>#3 University of California-San Francisco 147<br>#4 Stanford University 142<br>#5 University of Washington 133<br>#6 Columbia University 131<br>#7 University of Michigan-Ann Arbor 125<br>#8 University of Pennsylvania 120<br>#9 University of California-Los Angeles 92<br>#10 Yale University 91<br>#11 Duke University 90<br>#12 Cornell University 77<br>#13 University of Pittsburgh 71<br>#14 University of California-San Diego 65<br>#15 University of Chicago 58<br>#16 Vanderbilt University 54<br>#17 Washington University-St Louis 52<br><br>"]}