{"title": "skidmore vs penn state", "comments": ["<b>Username: jackwang0703</b><br><br>Greetings everyone,<br>I just got accepted by Skidmore and it’s one of my two safety schools. The other one is Penn State. Since they’re the only offers I have now, I kinda want to compare them. What are some pros and cons of these two schools? I mean obviously they are essentially pretty different since one is a small private LAC and the other one is a huge public university with the biggest alumni network.<br>I appreciate any comments. Thank you!<br><br>", "<b>Username: jackwang0703</b><br><br>I kinda prefer Skidmore due to their size, faculty, location, and residential life (dorm and food). Penn State, however, has worldwide reputation and incredible alumni network.<br><br>", "<b>Username: happy1</b><br><br>First there is no reason to make a choice between your safety schools.  Wait until you have all your decisions.<br>Second, the two schools you noted are so different that IMO it is a matter of what type of environment you want to spend the next 4 yeras at.  If you want smaller classes, a close knit community etc. then Skidmore – if you want a huge school with big time sports, Greek Life, larger lectures etc. then Penn State.<br>Third, if you are undecided between schools after you get all your decisions in, then try to re-visit your top choices.  For my S going to the accepted student days of his top choices made his final decision much more clear.<br><br>", "<b>Username: jackwang0703</b><br><br>Yeah you’re right. I was kinda waiting for Wustl last night and Skidmore’s email popped up…<br>It’s my first RD decision and I truly hope I will have more better offers.<br><br>", "<b>Username: happy1</b><br><br>You already have two fine choices so you are in good shape.  Good luck with the rest of your decisions.<br><br>", "<b>Username: jackwang0703</b><br><br>@happy1 Thank you very much! It’s all gonna be unveiled in the next two weeks or so.<br><br>", "<b>Username: jackwang0703</b><br><br>Does anybody know about how many international students normally apply to both schools and how many get accepted?<br><br>", "<b>Username: jackwang0703</b><br><br>Rejected by Wustl… not too surprised<br><br>", "<b>Username: MYOS1634</b><br><br>Did you get into Schreyer?<br><br>", "<b>Username: jackwang0703</b><br><br>@MYOS1634 No<br><br>", "<b>Username: MYOS1634</b><br><br>Did you get into any Honors College?<br>(That’d make it easier to decide…  )<br><br>", "<b>Username: jackwang0703</b><br><br>No. I’m still waiting for other schools.<br><br>", "<b>Username: jackwang0703</b><br><br>Got into BU<br><br>", "<b>Username: MYOS1634</b><br><br>Congratulations. <br>When do you get our financial aid package?<br><br>", "<b>Username: jackwang0703</b><br><br>Thank you!<br>I didn’t apply for any financial aid because I’m international and applying for financial aid significantly decreases the chance of getting accepted anywhere.<br><br>", "<b>Username: MYOS1634</b><br><br>Can you afford any place?<br><br>", "<b>Username: jackwang0703</b><br><br>Yes. They are definitely very exorbitant though.<br><br>", "<b>Username: WilliamNYC</b><br><br>@jackwang0703 “applying for financial aid significantly decreases the chance of getting accepted anywhere”. That is not an accurate statement. Applying with Financial Aid request is a great idea when applying to top tier colleges and it doesn’t impact your chances. I respect the decision you took not to apply for FA but I wanted to respond for others reading this.<br><br>", "<b>Username: WilliamNYC</b><br><br>@jackwang0703 also congrats on your acceptances! My D got into BU also with a nice aid package. BU is a nice school in a great city.<br><br>", "<b>Username: jackwang0703</b><br><br>@WilliamNYC When I’m an international student from China who is not a top top applicant. It does.<br><br>", "<b>Username: MYOS1634</b><br><br>@williamNYC: for internationals, applying for financial aid divides the odds of acceptance by two or three.<br><br>", "<b>Username: jackwang0703</b><br><br>No idea when W&M, Vassar, and Wesleyan will release decisions<br><br>", "<b>Username: jackwang0703</b><br><br>Accepted to Richmond!<br><br>", "<b>Username: MYOS1634</b><br><br>Congratulations!<br><br>", "<b>Username: jackwang0703</b><br><br>BU vs Richmond?<br><br>", "<b>Username: happy1</b><br><br>Personal preference assuming they are equally affordable.  What experience do you want over the next 4 years?  BU is a huge school in Boston without a traditional campus.  Richmond is a LAC in a smaller city in VA with a traditional campus.  I know people who are very happy at both schools.<br><br>", "<b>Username: jackwang0703</b><br><br>I like the fact that Richmond’s size is big enough in terms of an LAC, but also small enough to be in a close-knit community with fellow students and professors which might mean more attention and opportunities.<br>I’ve visited BU and I am not fond of their very urban campus. Plus it’s exorbitant to live in Boston. U of Richmond is not that rural. I prefer suburban schools even though I’m from Shanghai.<br>In terms of academics and undergraduate education quality, which one would be slightly better or are the about the same?<br>I read online that the quality of life at Richmond is fairly high. I know BU probably is too.<br><br>", "<b>Username: jackwang0703</b><br><br>Accepted to Brandeis and W&M! Waitlisted by Emory…<br><br>", "<b>Username: MYOS1634</b><br><br>Wow, great choices!<br>Can you list net price?<br><br>", "<b>Username: jackwang0703</b><br><br>Thanks!<br>Well that’s just gonna be whatever their 17-18 full cost of attendance is. So they are all between roughly $55000 to $65000, which is a lot.<br><br>", "<b>Username: jackwang0703</b><br><br>BU actually costs more than $70000 per year.<br><br>", "<b>Username: jackwang0703</b><br><br>Only 2 schools left. Wesleyan tomorrow and Vassar on the 28th.<br><br>", "<b>Username: jackwang0703</b><br><br>Accepted to Wesleyan! Now my decision is getting more complicated…<br><br>", "<b>Username: happy1</b><br><br>A good problem to have!  Congrats.<br><br>", "<b>Username: jackwang0703</b><br><br>@happy1 Thank you! Do you have any thoughts on Wes compared to UR or W&M?<br><br>", "<b>Username: happy1</b><br><br>I know people who have been happy at all three schools – but I have no first-hand information.  Perhaps pose it as a new question on this page.  If you can get your hands on some good college guide books (ex. Fiske, Insiders Guide, Princeton Review) they may help you to get a better sense of each school.<br><br>", "<b>Username: happy1</b><br><br>^^or wait until you hear from Vassar and then put the question up.<br><br>", "<b>Username: jackwang0703</b><br><br>Do you think Wes is one of the most prestigious schools in the US?<br><br>", "<b>Username: MYOS1634</b><br><br>People don’t pick Wes because of prestige,  but because they love the bohemian spirit, politics,  and sense of community. You need to do an overnight. You have three excellent choices so far,  but very different in environment and vibe.<br><br>", "<b>Username: jackwang0703</b><br><br>I have visited Wesleyan and didn’t find anything wrong. The campus is pretty nice and I like its suburban location. I did an on-campus interview when I visited and I got to know that it’s a very liberal and diverse place and open to any political views and nationalities or races.<br><br>", "<b>Username: MYOS1634</b><br><br>Surely you’ve picked up on a different vibe compared to URichmond?<br><br>", "<b>Username: circuitrider</b><br><br>In certain parts of New York City, Boston, and Los Angeles Wesleyan is considered very prestigious.<br><br>", "<b>Username: jackwang0703</b><br><br>I’m not sure yet. What type of students belong to UR? And isn’t Wes stronger academically? I read on CC that Wes is strong in almost every discipline.<br><br>", "<b>Username: TheGreyKing</b><br><br>Wesleyan is extraordinary in terms of both prestige and academic environment/ opportunities. So is Vassar, if you should happen to be admitted.<br>But you have some other nice options, too, so where do you think you will be happiest? What campus environment suits you? Wesleyan and Skidmore are very different from Penn State and Richmond in culture! Penn State is gigantic, William and Mary is midsized, Skidmore/Wesleyan/Vassar are small.<br><br>", "<b>Username: jackwang0703</b><br><br>Wes’s size is large in terms of LACs, which is a good thing to me. Brandeis’s undergraduate population is very small in terms of research universities. I wanna consider academics/opportunities/education/prestige first, and then quality of life.<br><br>", "<b>Username: jackwang0703</b><br><br>Rejected by Vassar<br><br>"]}