{"title": "university of southern california vs alabama cbh vs ucla", "comments": ["<b>Username: lukebenoit4</b><br><br>Hello there,<br>I am trying to decide between these three schools. I intend on becoming an Electrical Engineer and I am very fascinated with Virtual Reality and Flexible Electronics. I am looking for the school that will give me the greatest opportunities to do research in these areas and also ones that focus some on entrepreneurship inside engineering as well.<br>As of now, I feel USC fits the criteria. However, I met with a recruiter from Alabama and they made me absolutely fall in love with the school, especially the CBH program. UCLA is well… UCLA (an amazing, prestigious University). So, finances all aside, which university are you taking?<br><br>", "<b>Username: ucbalumnus</b><br><br>Net price at each?<br>You are in the EE major at each?<br>Have you checked the offerings (within EE and outside of EE) to see how well they match your interests?<br><br>", "<b>Username: lukebenoit4</b><br><br>@ucbalumnus ,<br>Yes I have. Net prices are… USC: 16k UA: 5k (scores qualified)  UCLA: 20k. In terms of the offerings, it seems USC offers more based off of multimedia, but UCLA is ranked high for research as well. Alabama would allow me to do my own research at an undergraduate level, which is HUGE for me. I would say I want to go out to LA since I have relatives out there, but the UA program grabbed my attention so much. The CBH program is quite prestigious too from what I hear but not sure.<br>Thanks for your response!<br><br>", "<b>Username: lukebenoit4</b><br><br>I received an internship this summer at Virtual Reality company here in Missouri, so I will be able to meet some people in the workforce and ask them. I will also be going to VRLA soon, so I can always ask companies their take  as well!<br><br>", "<b>Username: menloparkmom</b><br><br>USC will allow you to do research as an UG.<br>In fact, they encourage it. And will help pay for it.<br>https://research.usc.edu/students/<br>http://undergrad.usc.edu/experience/research/<br>https://viterbi.usc.edu/students/undergrad/research/<br>check out this link!! its just what you’'re looking for!<br>http://viterbiundergrad.usc.edu/fab-lab/#<br><br>", "<b>Username: lukebenoit4</b><br><br>Thank you @menloparkmom ! Great resources! I absolutely love USC but I just want to make sure it will be the right fit for me.<br>Adding to this thread, I am still waiting on Stanford right now. However, I don’t exactly feel that Stanford is a fit right now. Thoughts?<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@lukebenoit4 Are you a sr who has already received your FA packages? Were you accepted into CBH?  What scholarship did you receive as an OOS student at UCLA that brought your total cost of attendance down to $20,000? That would be an extremely rare OOS cost.<br>Are you a NMF? Are your costs for UA based on their NM package combined with their engineering scholarship?  Did you already receive notification of getting the full tuition from USC?<br>Clarification will help you receive better answers.<br><br>", "<b>Username: menloparkmom</b><br><br>^^ sounds like the OP has been offered  a Trustee [ full tuition] scholarship at USC, based on what he said he would have to pay, which is essentially only R&B.<br>The Trustee scholarships are only offered to exceptional students.<br><br>", "<b>Username: menloparkmom</b><br><br>OP, IF you are offered a Trustee Scholarship - and Stanford’s tuition ends up costing you a LOT more each year-<br>TAKE the trustee scholarship!<br>USC treats their trustee scholars like gold.<br><br>", "<b>Username: CrewDad</b><br><br>Luke, listen to Menloparkmom. As usual, she’s correct.<br>My daughter is a software engineer at a household name Calif. tech company. She has been involved with VR and Oculas. I can almost guarantee that she too will agree with Menloparkmom.<br>Also, should you become interested in game design, USC is preeminent for their programs in game design and development.<br>Enjoy the VRLA expo. <br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek ,<br>I would be more than willing to clarify for you. The answer is yes to all your questions. Alabama is offering a NMF scholarship. USC is also allowing a trustee because of grades and connections. I am not sure about Stanford right now, but I come from a very low income family that, for their financial aid coverage, would cover full tuition (possibly?). Both USC and Stanford say they cover “100 percent of financial need”. Hope this helps.<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@lukebenoit4 If you are a very low income, are you able to afford $16,000/yr? Do you know exactly how you will finance that amt?  What are your housing options for all 4 yrs at USC?  Is housing guaranteed ?  If not, what is the cost of housing off campus?<br>Were you accepted to CBH? Did you receive a CBH scholarship? (Some CBHers do, and some don’t. I don’t remember when they let the kids know.) Bama does not guarantee housing for all 4 yrs.  Our ds has found off-campus housing significantly cheaper than on-campus.<br>For our family, costs drive decisions.  Our ds at Bama had similar options and chose Bama and CBH (which has been awesome for him). Our 12th grader has similar options as well and will be attending the other USC(arolina) on full scholarship.<br>Stanford might be very low cost.  Only you can determine if it is the type of environment you want.<br>Just make sure you have a plan in place now for meeting costs every yr.<br><br>", "<b>Username: ucbalumnus</b><br><br><br><br><br> lukebenoit4:<br>\"\"<br>Both USC and Stanford say they cover “100 percent of financial need”. Hope this helps.<br>\"\"<br><br>Stanford need-based financial aid is usually better than that of USC, but Stanford does not offer merit scholarships, unlike USC.<br>If you are really curious, you can check Stanford’s net price calculator for an estimate:<br>https://financialaid.stanford.edu/undergrad/how/calculator/<br><br>", "<b>Username: menloparkmom</b><br><br>the OP hasnt’ heard from Stanford yet.<br>so there is time for him to do research regarding all the “what if” scenarios.<br>The new USC university village, I believe, offers new students the option of living there all 4 years.<br><br>", "<b>Username: lukebenoit4</b><br><br>@ucbalumnus thanks for the website! So I did the price calculator for Stanford and the projection for what I would contribute is 2.2k! What a great price! I have decided, based on the responses and long thought, to drop out UCLA and Alabama, as it doesn’t seem like the right fit. Now it all comes down to Stanford and USC. For those who might contribute to this answer, please let me answer what I am looking for. Between USC and Stanford, I want the best one for Electrical Engineering, but it doesn’t have to be the highest ranked. See, they are very close in ranking, but I want to go to the program that allows me to do the best research, collaborate with companies and partners, and really big for me, make my own projects. If I can have the resources to build, that would be awesome! The areas I am interested in pertain to Virtual Reality and Flexible Electronics. I would love to do some research in those areas. Lastly, I want a college that is a blast. I want to be able to go to sporting events (huge sports fan btw), hang out with some great, social people, and really find a home where I am at. My family is from Louisiana, so I would love to have the LSU Tigers fun to it but with amazing academics <br><br>", "<b>Username: lukebenoit4</b><br><br>UPDATE: USC has dropped to approximately 4k.<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@lukebenoit4 That is putting the cart before the horse.  You need to be accepted to Stanford before you start trying to decide between the 2.  Wait for a week and then if it is an option, ask people to help you discern.<br>You didn’t answer the question about the $11,000 gap.  Do you have a plan for paying that?<br>ETA: saw your update. Did you receive an updated FA package with $4000 total cost with no loans?<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek  my apologies. I just want to prepare for if I am accepted which one should I go with. My family and I do have a plan in order to afford SC if it comes down to it. My brother is willing to work with me and we are going to communicate about pricing.<br><br>", "<b>Username: youcee</b><br><br>@menloparkmom I haven’t seen that about new students living in USC Village all 4 years. Can you confirm that info? Their website only shows a 2 year guarantee in the general housing section.<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@lukebenoit4  Since you are eliminating Bama as a choice, would you mind sharing what you thought of it when you visited campus?  It might help other students facing similar decisions if you could share what you did and didn’t like about the school when you saw it in person.<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek First off, there’s nothing to not like about Alabama. The campus is beautiful, and the people are amazing. However, when I went to USC, it seems like USC is the future school while Alabama seems to be a good school. In other words, it didn’t seem very entrepreneurial and the university isnt as “connected” to companies like Stanford and USC are. With that said, saying no to Alabama was extremely hard. When I first met the counselors, I had never felt so wanted and so happy to talk to a school. It blew me out of the water. They especially got my mother’s attention too when they mentioned having the biggest Starbucks in the nation <br>Anyways, I just think if Alabama wants to become part of the “prestige” category, they are going to need more companies around them and more advance research.<br>Hope that helps<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@lukebenoit4 Clueless about the Starbucks.  Never heard that before.  But I find your perspective interesting. Your OP asks about discerning about CBH, yet the only mention of CBH is about talking to a recruiter about the program.  There is no mention about CBH itself, CBHers, CBH UG research, the engineering facilities, or mentoring faculty.<br>Not sure why anyone who is interested in prestige would apply to Bama.  But, considering they just spent $300 million building new engineering facilities, it is hard to fathom them not focused on the future.<br>But, no, Bama is not Stanford. Nor is it USC.  And USC doesn’t just drop $12,000 overnight for everyone.  That is a huge blessing. So there is no question that for $4000 you should choose USC.  You shouldn’t even need your brother’s help.  You can just take out your federal student loans.<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek  yes! When the recruiters came to my school, the CBH program was what they were really selling me on. But when I went to campus, it seemed like it wasn’t that big of a deal which is strange. As far as the engineering facilities, they are nice, but I thought USC had the nicer buildings believe it or not. Even better than Stanford in my opinion. And thank you! I sent a very encouraging email a while back telling them a little more about my personal side and USC has been very helpful. The awesome thing is, before I even have started, I have met some amazing professors. The CEO of the company I am interning with is good friends with Robert Hernandez. He’s a very prestigious professor over there at SC so I look forward to seeing him in person this April!<br><br>", "<b>Username: lukebenoit4</b><br><br>My grandfather is a very devoted Texas man and he has been pushing me for UT Austin and Texas A and M for a while. He is now telling me that I should do USC as well,. And that’s pretty amazing if you know any die hard Texans to tell you to go out of Texas <br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@lukebenoit4 Good luck.  It seems like you have great connections, and USC is the obvious choice.<br>You don’t just visit campus for CBH. It isn’t discussed in general bc the freshman class is approx 7000 and only 40 kids are accepted.<br>And, wow, I am so impressed with your parents.  You managed to visit a lot of schools a long way away for a very low income student.  That must have been hard on their budget.<br><br>", "<b>Username: lukebenoit4</b><br><br>Decision is coming April 2nd! I would love to hear more!<br><br>", "<b>Username: simba9</b><br><br><br>\"\"<br>@menloparkmom I haven’t seen that about new students living in USC Village all 4 years. Can you confirm that info? Their website only shows a 2 year guarantee in the general housing section.<br>\"\"<br><br>Somewhere on CC, maybe the USC forum or Parents forum, a mother of a USC junior said her daughter couldn’t get into housing at the USC Village.  USC has about 19,000 undergraduates, and even with the added capacity of the USC Village, there still will only be enough room for about 9,000 undergraduates to live on campus.<br><br>", "<b>Username: swim4school</b><br><br>I have a daughter in CBH at UA.  If you are in the Honors College building, CBH has its own space, its own lab, its own staff.  The Dean of the Honors College teaches sophomore to senior CBH, knows each student individually and assists them with life advice, internships and job placements.  Will you have access to an influential Dean at the other schools?  The opportunities for CBH’ers are rich–research with pharma, joining investment banking firms like Goldman Sachs and Barclays, interning at Google and Facebook—the world is their oyster.  The money that is being spent at UA in buildings, research, and student scholarships is second to none in the US.   Does this mean prestige?  No.  Does this mean opportunities that are hard to find at other schools?  Absolutely.  However, if you want to live on the West Coast, and stay on the West Coast for your career, select USC or UCLA.  I will tell you, however, that with my two kids at UA…every single promise made to them by the Honors College has been fulfilled–and more.<br><br>", "<b>Username: MYOS1634</b><br><br>Usc sounds like the right university for you.  If you get into Stanford,  you’ll likely be invited for a fly-in, and all people on this thread will be happy to revisit your choices <br><br>", "<b>Username: lukebenoit4</b><br><br>@swim4school Thanks for the info! The CBH program is great. Do you know if it has a strong presence in the Silicon Valley area?<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@swim4school  I agree.<br>@lukebenoit4 https://www.ua.edu/events/event/21610 Were you informed you were a finalist?  You are woefully informed about CBH. (Not answering your question directly, but the paths are not singular.)<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek  I am not sure what you mean. I’ve felt the exact same way about the CBH program. I told you that. The program is amazing and does not disappoint, but I felt like if I wanted to work out in California I should go to USC, UCLA, or Stanford. That’s why I posted this whole thread to hear how the CBH program might compare to these schools. I’ve loved everything about the CBH, but I want to make sure I have the opportunities to work with big tech companies, or even create my own.<br><br>", "<b>Username: lukebenoit4</b><br><br>Does anyone else have any insight on CBH? I would love to hear it! UCLA?<br><br>", "<b>Username: menloparkmom</b><br><br>“but I felt like if I wanted to work out in California I should go to USC, UCLA, or Stanford.”<br>listen to your gut.<br>Despite what others may say, the more prestigious the name of the college - the better for you with  the people doing the interviewing at west coast tech companies, or the VC’s that financially support startups here.<br>So go to USC, UCLA or Stanford if you want to have the best access to them.<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@lukebenoit4 I apologize.  I am not attcking you, but your posts are confusing and make no sense. You asked about choosing UA bc of CBH, but your posts about CBH do not sound like CBH is an actual option. It is why I have asked if you were accepted as a finalist. You said that when you visited campus, it didn’t seem like CBH was a big deal, and “I am also very busy with my studies and finishing up on this year, so I might not know everything about the programs except what I hear from counselors or what is on their main websites. I hope you understand what I am saying.”<br>If CBH were an option, you would have been flown in for a special finalist weekend where about 50 kids are brought in for 40 spots.  You would have spent 3 days on campus interviewing, meeting other candidates and current CBHers, meeting with faculty mentors, and hearing presentations about what CBH offers and what grads from CBH are currently doing.  It would not be information from counselor’s or their website.<br>It sounds like a USC is your best option at this point. If Stanford is an option, then you will have that option to weigh as well.<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek ,<br>Oh I am so sorry about the confusion! Let me explain myself a little more so you’ll understand.<br>I am currently not a senior right now. I am actually a sophomore right now, but I have a 32 on my ACT and a 1450 on my SAT and applied for these schools and got an offer from SC and Stanford. Ive met some people at these schools and they told me I should apply to get an offer and boom! Still waiting on Stanford (April 1st)<br>Ok so here’s the thing about Alabama. I met with some people at Alabama and they told me about the CBH program but I did not get to see everything about it. So that’s why I am asking if it should even be an option right now. I was told by Alabama counselors that I would have a VERY HIGH chance of getting accepted based on my resume.<br>Yes, I am a sophomore. I have been taking junior and  senior level classes and I actually could graduate early believe it or not cause of everything I have. So I want to get ahead and be ready to go.<br>I am so sorry if it got confused or said something wrong. I am just looking for advice!<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek  I did not want to mention I was a sophomore because I thought I would either get laughed at or told not to worry right now but I am ready for the next step. I wanted to be taken as a senior but I want you to understand my perspective so we are on the same page.<br><br>", "<b>Username: menloparkmom</b><br><br>OP.<br>there is only way to be accepted at USC if you are not currently a Sr.<br>so tell us the name of the program and<br>we can continue this conversation.<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@lukebenoit4 Thank you for finally explaining.  I suspected you were not a sr and that you had not been accepted into CBH. It is why I kept trying to get you to clarify.<br>In terms of believing you could graduate as a sophomore, you should not underestimate posters on CC. My ds at Bama did not graduate early bc we don’t believe in early graduation.  But he was advanced enough that he took a 400 level electromagnetic wave theory class his freshman yr at Bama. So, parents on here know that advanced kids exist.<br>Other parts of your posts demonstrate equal lack of understanding of the process as the CBH comments. (No, you cannot just show them your resume and get accepted into the program.)<br>I would recommend you post the wording of your actual offers so people can help you determine if your understanding of the offers are the same as what you have actually received. You don’t want to find out that you are confused about what you have. UCLA costs as an OOS student, for example.<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek @menloparkmom I am not saying I am graduating now. I want to finish out my junior and senior year with a bunch of college level classes. For example, one of my friends is doing an online program at Stanford because she’s finished out math like I will this year. I am hoping to see if I could do a dual enrollment of calculus classes at USC since they said Calculus is key (I’ll have Calc I and II done this year). Also, I got an offer from USC and UCLA for my achievements and scores. People can get offered all the time. My best friend, who is currently a sophomore, got offered to Vandy before I got offered and he’s already committed to Vanderbilt. That’s what I would love to have… A commitment<br><br>", "<b>Username: lukebenoit4</b><br><br>And by the way @menloparkmom , this program at USC that would allow me to start classes is called the resident program. I’ve applied to it so I can get started right away. I have my offer, but I want to start taking classes now.<br><br>", "<b>Username: grtd2010</b><br><br>Why do not you post any offers you have in writing for real.<br><br>", "<b>Username: lukebenoit4</b><br><br>Ok this is getting ridiculous. I give up. I just wanted to know which one was better and this has been so discouraging. Thank you very much.<br><br>", "<b>Username: menloparkmom</b><br><br>\"I’ve applied to it so I can get started right away. I have my offer, but I want to start taking classes now.<br>huh?<br>NO ONE can start taking classes at USC right away.  all newly accepted students start classes in Aug. And it’s NOT called the \"resident program. \"<br>\" I got an offer from USC and UCLA for my achievements and scores. People can get offered all the time. \"<br>An offer of what, exactly??<br>If you have an acceptance letter, from USC , please scan it , copy it and paste it here .<br>Otherwise check back with us in 2 years… as I am call BS on your claim of acceptance at USC as a Sophomore.<br>btw, I have NEVER hear of a Sophomore , with only a 1450 SAT score , being accepted, [   I’ve been on CC for 13 years, my DS was a USC trustee scholar, and I also have an ongoing email correspondence with the Dean of admissions at USC, and easliy can ask if any exceptional Sophomores were accepted to USC this year. ]<br><br>", "<b>Username: grtd2010</b><br><br>There is no value in spending any energy/time here.<br><br>", "<b>Username: menloparkmom</b><br><br>\"Also, I got an offer from USC and UCLA for my achievements and scores. \"<br>OMG. Another student who believes that because a marketing company, working for the colleges, sends a n email, pamphlet, or book or some other sort of correspondence ENCOURAGING you to APPLY to USC, UCLA, etc etc, because of your PSAT scores, that means you think it means you will be ACCEPTED there??<br>NO. its just a misleading marketing ploy, meant SOLELY to increase the number of college applicants.<br>sorry to burst your bubble sonny.<br><br>", "<b>Username: lukebenoit4</b><br><br>@menloparkmom ok well thank you… Sorry about everything.<br><br>", "<b>Username: lukebenoit4</b><br><br>@menloparkmom by the way… A 1450 on the NEW SAT is not low… A 1600 is the highest.<br><br>", "<b>Username: lukebenoit4</b><br><br>Despite the confusion about the papers and even getting an email about financial situations, I still plan to try and attend USC. I absolutely love it out there and I think it is the right place for me. I am waiting for the residential program to see though if I could possibly do some math classes at my school online for USC. I think this would really get me ready for SC and not only that, I would get some college credit. Now that’s real. I apologize to everyone for the confusion about the papers I received. I did receive an email, however, from USC that they were glad I applied and I should definitely consider the residential program. So that’s the only credible thing I have now I guess… I thought I had more.<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@lukebenoit4 A 1450 is low for what you were posting as being offered.  Competition is tough and national and international top students.  It is unlikely those scores would get you the results you were stating you received.<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek well I have this summer and a couple more years left… I am going to do some more Test Prep Gurus this summer so maybe I could post a better score :).<br>But what made me stand out and be told by people from SC I should go there were my unique projects I do… So it’s not just about test scores.<br><br>", "<b>Username: lukebenoit4</b><br><br>@menloparkmom I am interested in your resources and I feel that maybe you could help me understand this process a little better (especially about USC)… Would you mind shooting me a private message so we could talk? I would really appreciate it! I know you probably think I am dumb right not, but I am very passionate about USC so I would love to talk. Thanks.<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@lukebenoit4 You misrepresented yourself and lied to people who were taking their time to answer you questions. By misrepresenting yourself, the logical response to you now is to come back in a yr and ask when you have grown up. I knew you were lying bc nothing fit true application outcome scenarios.   (No one has a convenient drop in costs  of $11,000 overnight. UCs are pretty much unaffordable to all OOS students.  Visiting colleges on the other side of the country is expensive and very low income families really struggle with being able to afford visits.)<br>Fwiw, you lack a solid grasp on the college admissions process.  People telling you should apply and actually being accepted with large scholarships and/or into extremely competitive programs are 2 completely different things.  Don’t think that bc recruiters tell you to apply or you get spammed mailings telling you that they want you to apply means that they are telling you you are an ideal candidate for their school and you will be accepted and at a price you can afford.  They tell the same thing to 1000s of unqualified kids every yr. It raises their application #s and lowers their acceptance rates.  Win-win for them.<br>You sound like a pretty avg applicant for top schools.  Come back in a yr when you can post honest inquiries and then if you provide honest information, people will be able to provide you proper feedback.  Btw, make sure you really understand your financial situation bc it will more than likely be what influences where you attend.<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek thanks but it was not overnight. I had gotten mail and I did email the colleges. I emailed SC a week ago and they told me based on my income, I can get it dropped to 4k the other day.  I did not lie to anyone. I simply misunderstood what information I had and I am sorry that I am human. Every single opinion I had on the colleges was true, me being interested in EE was true, and the people I met at the colleges are all true. All I wanted to know were the thoughts of others and I provided everything I knew. I read these posts because I think it is great to hear the opinions of others and simply just ask questions to meet new people. That’s why I did this. I did not lie, and I did not say anything I would take back.<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>You do not have any offers. You are not a sr. You have not been accepted to any school.  You have not been awarded the Trustee scholarship at USC. You are not in CBH. You are not a NMF. Everything you have posted is false.  The fact that you would not retract your posts, well, that is obviously up to you.<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek ok this is seriously getting ridiculous. 1. I told you I misunderstood the offers and I NEVER said once in my thread I was accepted. I told you in my second post that my scores qualified but that did not mean I was accepted what so ever. 2. I NEVER said I was in CBH. I told you I met with Alabama counselors and they recommended me to the CBH program. My family was right there! We had a college fair and when I showed them what I was doing they told me if I kept it up, I could do the CBH program because it’s a great fit for me. So what if she tells other people that? I even said before Alabama is great at recruiting and convinced me about the CBH program. If I knew everything about it, I would be accepted. 3. I NEVER once said that I was a trustee scholar. Someone else did and I did not answer that question. What I will tell you is that I plan on doing a residential scholarship at USC so I could begin to do some classes at USC since I am bored at school right now. And yes I am a finalist for NMF! My scores qualified, as I said a long time ago.<br>I wish you the best of luck.<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek by NMF, you mean National Merit, correct?<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>“Alabama is offering a NMF scholarship. USC is also allowing a trustee because of grades and connections.”<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek I am sorry and I should have worded that better. I was told on an email from USC that I should do a trustee my senior year since i have the grades and connections and I would have a good chance of getting in. Also, my NMF was presented when Alabama visited and that’s when they said I should do CBH based off of interests and scores. You’re right, I worded that wrong and I should have done better. I will next time I promise<br><br>", "<b>Username: lukebenoit4</b><br><br>Thank you<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@lukebenoit4 It is impossible that you were “presented” with NMF for multiple reasons. First you are a 10th grader.  NMF  is based on 11th grade PSAT scores. Second, cut-offs are determined by the National Merit Corp by state based on the students taking the test that yr.  You won’t know if you qualify for NMSF until Dec of your jr yr and won’t know if you progress to NMF until your sr yr.  UA has nothing to do with the designation. If you receive it and if they are still offering the same scholarship in 2 yrs time, THEN and only then will you know that you have received the NMF scholarship.<br>You are taking people’s comments about possibilities as if they are factual offers…  It does not work that way and you are spinning fairy tales about what you “have.” It is all fiction until you have it confirmed in writing from the school along with an acceptance and the financial aid package. Asnof right now, you have nothing but a couple of test scores.<br><br>", "<b>Username: JenJenJenJen</b><br><br>@Mom2aphysicsgeek I applaud your patience.<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek then what did I receive? IM going to talk to my academic counselor tomorrow. This has all brought my confidence down and I am confused on where I stand.<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@JenJenJenJen I think we have found the poster child for all of the UChicago mailings and why they worked in increasing their selectivity.<br><br>", "<b>Username: lukebenoit4</b><br><br>@Mom2aphysicsgeek sorry I am new to all this. That’s why I am asking for your help.<br><br>", "<b>Username: grtd2010</b><br><br>FYI, Not all NMSF/NMFs  are  automatically admitted to USC. The bar for admission is different than NMSC’s standard for NMF selection. You can not have many grades with B’s and C’s during high school. DD is a NMF and has been admitted to USC.<br><br>", "<b>Username: lukebenoit4</b><br><br>@grtd2010 There is not a single grade, as of now, with an A- on my transcript. I have perfect grades. If I knew how to post a picture, I would definitely show that.<br><br>", "<b>Username: lukebenoit4</b><br><br>I would like to end this thread please. I want to message some of you questions I have, and I will be doing that. I apologize for the inconvenience. Thank you.<br><br>", "<b>Username: psywar</b><br><br>@lukebenoit4<br><br>\"\"<br>Yes, I am a sophomore. I have been taking junior and senior level classes and I actually could graduate early believe it or not cause of everything I have. So I want to get ahead and be ready to go.<br>I am so sorry if it got confused or said something wrong. I am just looking for advice!<br>\"\"<br><br>My advice is to consider dropping this account and get yourself a new CC account and start over. You are clearly an intelligent, but very young person that got very excited and misrepresented your situation.<br>Once you have your new account, I’d practice active listening and talking less. The smartest people I know listen far more than they talk. Your desire for information on these schools and programs is a wonderful thing, but you have burned through people’s patience and harmed your credibility.<br>Schools…<br>My son looked at the schools and programs. He, like you, was very impressed with USC’s equipment and buildings, but less so with some of the professors who were too research and outward focused in his option, he wanted professors that wanted to teach too.<br>If you get into Stanford, the brand and opportunities (for what your interests are) would be too good to pass up IMO. Having grown up 10 min from Stanford’s gorgeous campus, I can tell the weather is just about perfect.<br>Also, let me put in a good word for UA’s CBH. I was incredibly impressed by the quality of professors my son met, who are devoted to teaching / guiding / mentoring the CBH kid. The money / support / dorms / access / labs the CBH kids have rival USC. Living in Austin (with good in-state tuition schools like UT), it would be hard for us to justify sending our kids to UA, but if one of our kids got a CBH offer, I wouldn’t hesitate for a second.<br>In the end, my son chose Princeton’s undergraduate-focused program (he got in SCEA), so he had to turn down the offer to fly out for the CBH finalist weekend, and attend USC’s Trustee interview at Explore. He was waitlisted at Stanford.<br>Good luck,<br>Psy<br><br>", "<b>Username: lukebenoit4</b><br><br>Wow @psywar , thank you so much! I really appreciate your encouraging post.<br><br>", "<b>Username: menloparkmom</b><br><br>then what did I receive?<br>\"only marketing material to encourage you to apply to USC. just like tens of thousands of students with PSAT scores like yours.<br>period.<br>full stop.<br>Its actually good for you that your eyes have been opened  to the truth so early in the admissions “game”<br>you’re welcome.<br>now go back to work and continue to get great grades, high standardized  tests scores, and continue your EC’s and come back here to CC late next year with your  PSAT score. from your Jr year.<br><br>", "<b>Username: lukebenoit4</b><br><br>@menloparkmom not going to lie, it’s an evil game. Haha. I will for sure and I will make sure I make a new account as well for a “start over”. Despite it being sort of discouraging, I appreciate you and @Mom2aphysicsgeek opening my eyes a little bit. It hurts, but it’s a good hurt cause I will work harder than ever before. I look forward to talking to you soon!<br><br>", "<b>Username: skieurope</b><br><br>Closed at OP’s request.<br><br>"]}