{"title": "decision ohio state vs university of alabama", "comments": ["<b>Username: d012939</b><br><br>I was accepted by both schools into my major of mechanical engineering, both have accepted me into their honors programs, and I have received my merit scholarship information from both. At UA, I got the Presidential, full tuition scholarship (plus a small engineering scholarship). At OSU, I received the National Buckeye out of state scholarship + Maximus. I live in Illinois, so both are out of state, but UA would cost me around $11k per year and OSU would be like $22k per year.<br>My stats (for reference):<br>34 ACT<br>4.58 GPA<br>Mostly AP/honors<br>My school doesn’t class rank, but the OSU regional recruiter said she thought I’m probably top 1%.<br>Academics: Now, OSU’s engineering program is ranked like 27, but UA is like 105.  That is a big difference, but I realize rankings aren’t everything, and UA was one of the first five colleges to offer engineering, so they have a pretty solid program. I just don’t know if OSU’s more prestigious program is worth the extra money. The hard part is, I know for a fact that I’m the type of student who will do whatever I need to do to be successful no matter where I go,<br>Opportunities: OSU has more of the clubs/extracurriculars that I’m looking for and it has a bigger alumni network. I’m in the honors program at both. I’m waiting to hear back from the Eminence Fellows program at OSU which is unbeatable. Meanwhile, I was rejected from University Fellows at Bama, but I am a finalist for Computer Based Honors Program. To me, CBHP would be awesome if I went to Bama, but it’s not a deciding factor.<br>Location: OSU is an urban campus, which I prefer, and I like Columbus and all the internship opportunities and benefits that come with it.  It’s also a 6 hour drive, whereas UA is a 12 hour drive. I do like the warm Alabama, but it’s definitely a college-town.<br>Ambiance/vibes: I feel my personality and studious-emphasis fits in much better at OSU. I’m don’t drink and I’m not a huge partner, so I don’t plan on joining a frat, but Bama is so Greek-heavy that I feel like I’d be an outlier. Also, not saying that the students at Bama aren’t smart, but it’s just much easier to get in with lower stats, and I feel like being surrounded by others more similar to me is a big benefit of OSU, especially on my social life.<br>I’m still waiting to hear back on the super competitive full tuition and full ride scholarships I applied for at OSU, but if I got either of those, I’m definitely going to be a Buckeye. But, I can’t rely on those whatsoever, so I’m just trying to decide if I should suck it up and save some money by going to Bama (and graduate WITHOUT DEBT–I know, unheard of!) or if it’s worth it to cough up the cash for the better academic and social opportunities at OSU.<br>Any and all input is appreciated, because there may be something I haven’t considered. I know it’s my decision, but it’s really tough (even though I’m leaning towards OSU) and I like hearing others’ opinions. Thanks!<br><br>", "<b>Username: d012939</b><br><br>Oh! I forgot to mention that Bama’s priority housing deadline is Feb 1, but I cant submit a housing depost without enrolling… OSU doesnt have a priority deadline, but they do it in the order enrollment and housing deposits were received. Thus, idk if I should submit my deposits to Bama. And, since both require enrollment before housing, I cant submit both<br><br>", "<b>Username: eopjd9898</b><br><br>Based on everything you’ve mentioned, I think Ohio State is the way to go for you. Although it may be more expensive, the experience and overall academic prestige will be worth it in the long run, not to mention the fact that OSU is located in a big city, Columbus, which is one of the fastest-growing cities in the country and GREAT for job/internship opportunities. Go Bucks!<br><br>", "<b>Username: d012939</b><br><br>Thanks for sharing your opinion! Now I’d be interested to hear from a Bama parent or someone with a UA favorable opinion. Always gotta consider both sides!<br>Keep opinions coming please <br><br>", "<b>Username: LBad96</b><br><br>All things equal, including Honors College at both, Ohio State would be a better choice by quite a bit.<br><br>", "<b>Username: d012939</b><br><br>Thanks for your opinion! @LBad96 @eopjd9898<br>Waiting for a big Bama supporter/parent to argue the other way haha ( @mom2collegekids ?)<br><br>", "<b>Username: merething</b><br><br>It’d probably depend on how much debt you’d be going into in order to attend OSU. There’s only a certain amount you can borrow each year without your parents cosigning the loan.<br><br>", "<b>Username: d012939</b><br><br>@merething Ill pm you<br><br>", "<b>Username: AlbionGirl</b><br><br>LBad96 is consistently negative about Bama for reasons that escape me since he has never been there.  It is not hard at all to find friends who aren’t in a fraternity, and you won’t have trouble finding academically able people to hang out with.  More than 40% of the incoming class last year had an ACT score of 30 or higher. UA engineering is accredited just like the program at OSU.<br>I understand the appeal of having a university in a larger town with the internship possibilities being closer by, but only you know if it is worth the extra money.<br><br>", "<b>Username: d012939</b><br><br>@AlbionGirl respect. Thanks!<br><br>", "<b>Username: Wien2NC</b><br><br>@d012939<br>your situation and stats sound eerily similar to ours.  with Pell and choosing a cheaper dorm, UA will be about $4K for us after the presidential + Engineering scholarships, plus we are waiting to hear about the Crimson. OSU with Buckeye + Maximus will still be about $20K and out of reach for us, unless he bags the Eminence.  we are also shooting for the Michigan State Alumni Distinguished Scholarship, the Kentucky Singletary, and the South Carolina McNair.  my best guess is when the dust settles the best affordable option will likely be NC State (our in-state)<br>if all of these one were magically equally affordable for us, I would pick OSU.  if you can swing it financially without too much hardship i would say OSU, but those debts can add up and if money is tight, i would strongly consider Alabama.<br><br>", "<b>Username: d012939</b><br><br>Thanks @Wien2NC ! Good luck with your decision<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@d012939 I have a son who is a chemE who graduated from a small public university (ranked regionally, not nationally) as well as a son who is in CBH and majoring in physics and math.  Here is my perspective fwiw.<br>My chemE ds co-oped alongside students from NCSU, GT, and VA Tech.  At graduation he had multiple job offers from different regions of the country.  He chose to work for a top global chemical company.  He works alongside grads form the engineering powerhouses (UM, UT, UF, GT, etc).  His career has not been determined by his school name.  New hires all start at the same level and pay and promotions are based on job performance, not school name.<br>My ds at Bama is a top student.  He graduated from high school having completed 5 of his in-major physics core classes as well diffEQ, linear alg, and multivariable cal.  He would in no way suggest that Bama is “beneath him.”  He loves it there. CBH has been awesome and he has been participating in research since his freshman yr.  Last yr he applied to 6 extremely competitive summer REUs for the summer between soph and jr yr.  He was accepted by 3.  (In case you aren’t familiar with REUs, that is a great outcome.) At his REU, other students were from MIT, ND, UPenn, Rice, Case, etc.  Obviously, his being from Bama did not keep him from being accepted.  <br>Anyway, we are a family whose kids are strong students but attendance is based on finances.  They attend and run with every opportunity they are offered.  Our current high school sr has been invited to some pretty amazing interview opportunities.  She is every bit as advanced as her brother and yet the schools are all pretty on par with Bama in rank.  Zero qualms. She’ll be every bit as successful as her siblings bc it college outcomes have a lot to do with what the student does while they are there. Be a student who matters,<br>If you go to CBH weekend, look for the tall physics geek…he’ll tell you just how awesome Bama is, not bc he has to but bc he absolutely has experienced it.<br><br>", "<b>Username: d012939</b><br><br>@Mom2aphysicsgeek Thanks for your thorough response! Now we have a real discussion on our hands! haha. I am attending the CBHP interview weekend, and I will definitely look for your son to speak with him<br><br>", "<b>Username: LBad96</b><br><br>@AlbionGirl lol. I’m stating facts. Don’t know why people always feel compelled to call me out when I haven’t even said anything negative about Bama at all rolls eyes<br><br>", "<b>Username: soyunchico</b><br><br>I’ve told you my opinion, but i think you’ll find your niche at either. P.S. Go Bucks!<br><br>", "<b>Username: momofsmartdancer</b><br><br>I am a graduate of OSU and took the higher level math/ science courses before changing my major.  My husband got his BS and MS at OSU.  Additionally, we did extensive research and visited Alabama since my daughter was NMF and eligible for nearly full-ride.<br>My opinion is you should go with Alabama.  My husband works for fortune 500 company and says no one cares where you went to college; job performance is key for promotions.  Engineering courses are really difficult at OSU.  He told me it was not unusual for the high score on an exam to be a 39%.  It is also difficult due to the high number of foreign TAs (hard to understand with their accent) that teach very large undergraduate courses.  I think you would have a higher GPA at Alabama while still getting a quality education.  Also of note is that engineers salaries tend to plateau and when I researched mid-career salary, there was virtually no difference in earnings associated with university choice. Avoiding college debt would definitely be goo for your long-term success.  I understand that Alabama also has great internship opportunities.  When we lived in Columbus, I don’t think there were that many great opportunities and the school did not put as much effort in helping students find internships as they did at other schools. While researching Alabama, we also learned of a program they have where you can get BS engineering + MBA in only 5 years.<br>“mom2collegekids” is the resident expert on Alabama and I think her boys were engineering majors.  So you might want to research her posts and maybe send her a message if you have additional questions.<br><br>", "<b>Username: d012939</b><br><br>@momofsmartdancer great response! Thanks <br><br>", "<b>Username: Chardo</b><br><br>Is the higher cost of OSU affordable for you?<br><br>", "<b>Username: d012939</b><br><br>@Chardo it’s hard to know what “afforable” is these days. But I’d definitely have some debt. Nothing that I’d be stuck paying off my whole life or anything like that<br><br>", "<b>Username: TooOld4School</b><br><br>Bama is full of high achieving scholarship students. At Bama a lot of ChemE’s go on to medical school, and the $44K+ savings over OSU will pay for almost a year of tuition. The engineering program is very impressive and the facilities are world class. His friends who go to Bama have had a great experience. Bama is very undergrad focused and the Campus is gorgeous. People are a lot friendlier and don’t get so crazy as OSU. Socially, the M/F ratio at Bama is  45/55 while OSU is 52/48. And don’t get me started about the BBQ.<br>The undergrad focus at Bama is both good and bad. The good is that they do an excellent job teaching and most engineering classes are taught by professors. The bad is that there are not as many research opportunities. That may be an issue for your med school applications.<br>My son is currently a ChemE (likely) major at Michigan and we came down to the same choice (MI vs Bama). But Michigan is a lot higher ranked and travel costs are minimal for us. So if you are 100% certain you will go to med school, Alabama is a better choice (they also have an excellent med school)  but if you are less certain, OSU makes more sense. You will need every penny to pay for your medical education.<br><br>", "<b>Username: momofsmartdancer</b><br><br>TooOld4school  has some good points- especially the remark about Alabama being focused on undergraduate education.  I think this focus makes it easier for undergrads to do well.<br>Having paid attention to who has top spots at the company where my engineering husband works, it appears absolutely necessary to have a graduate degree. Many of the higher-ups have more than one MS or Phd.  Minimum requirement would be a MBA.<br>So, in my opinion, it is not just about higher cost or more debt- it is about being able to afford to continue your education past the BS level if you want to move up.  It seems going to Alabama would leave you more funds to allow you to pursue post-grad work.  You might want to inquire at OSU about how many undergrads go on to graduate school there and how many of them receive funding for their education.  I think Dow Corning sponsored the research my husband did at OSU for his MS.  He currently does research- but I think he is the only one at his company doing research that only has an MS.<br>My neighbor has BS mechanical and MBA. He has great people skills and is also very intelligent in engineering field. He was promoted to plant manager (oversees about 700 employees) after about 12 years experience.  He makes a lot of $, but works very long hours and has a lot of headaches where personnel type stuff is concerned.<br>However, if you decide on grad school for engineering, I think OSU would be a great choice.  OSU is all about research and treats grad students very well.  They have a very friendly, team-like environment.  Although, again- it can be challenging.  Of the 8 students who had my husband’s adviser for his MS, only 5 were awarded that degree.  I think one dropped out because he did not maintain the required GPA in grad level courses and two were not successful at defending their thesis.  Of course, if you were interested in MBA, Alabama would be a good choice. Or, maybe just do that anywhere while working in your field.<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>The OP is a finalist for CBH.  If he is accepted into CBH, he is guaranteed UG research.  It is incorrect that the engineering dept will not have research opportunities.  As a matter of fact, student(s) from the engineering dept have won a Goldwater every yr for multiple yrs.  Below are just 3 yrs worth.<br>http://uanews.ua.edu/2015/04/four-ua-students-named-goldwater-scholars/<br>http://uanews.ua.edu/2016/04/2-ua-students-named-goldwater-scholars/<br>http://uanews.ua.edu/2013/04/ua-students-receive-goldwater-scholarships/<br>If you scroll through this list you will see some of the research being done by CBH students. You’ll see numerous engineering research projects listed.<br>https://live.cbhp.ua.edu/schedule.php<br><br>", "<b>Username: frankie38</b><br><br>My DS has similar stats as OP and was in a similar situation deciding between the many ME programs that he was accepted to.  We visited tOSU and it was the presumptive choice initially. DS ultimately decided to attend UA majoring in ME with Pres Scholarship and Engineering Scholarship over tOSU and other top ME program such as Cal Poly-SLO. He decided against tOSU due to the fact that acceptance to tOSU is competitive and not guaranteed.  Visit UA at T Town and open your mind to the wonderful opportunities!  Schedule your visit thrugh Honors College.<br>DS is enjoying the Bama experience, Theta Tau brotherhood (co-ed engineering fraternity) and is working at the Mercedes Benz Co op.<br>Roll Tide<br><br>", "<b>Username: Chardo</b><br><br>Did op say med school was a goal?<br><br>", "<b>Username: Chardo</b><br><br>If you’re a high end student from any accredited engineering school, you will probably have multiple offers from companies that will pay for your masters.  If you intend to go into industry, don’t let “need” for a masters impact your financial decision.<br><br>", "<b>Username: d012939</b><br><br>@Chardo nope, not going to med school! @TooOld4School @momofsmartdancer I get your points about grad school, but I pretty much don’t plan on going to grad school unless an employer wants to pay for me to do so. Or, of course, if it is inhibiting me later on.<br><br>", "<b>Username: MYOS1634</b><br><br>I think it’ll depend on soft factors, personal to you. Which campus do you like best? Where do you feel 'at home '? TOSU will have better academics outside of Honors,  UA will have better weather. Both will offer a strong honors college, great football, a good college town.  It’ll probably be easier to use the Midwest alumni network from tOSU and UA’s for the South, so where do you wish to live after college?<br><br>", "<b>Username: d012939</b><br><br>@MYOS1634 personal factors are definitely a pull to OSU. Plus, I dont really plan on living in the south…<br>Leaning towarsds OSU!<br><br>", "<b>Username: Mom2aphysicsgeek</b><br><br>@d012939 Are your parents helping you pay the $44,000 or the $88,000? You say how much each will cost but not how you will pay.  If they aren’t going to pay for it, are they willing to cosign? Also, have you run amoritzation calculators to understand what you payments are going to look like? (You can try this one: http://www.bankrate.com/calculators/college-planning/loan-calculator.aspx )<br><br>", "<b>Username: TempeMom</b><br><br>As others have essentially said above, can your parents pay for OSU without too much difficulty/borrowing?  Every dollar that goes into your college choice is a dollar that they don’t have for something else like their retirement or an education for your sibs if that applies.<br><br>", "<b>Username: SouthFloridaMom9</b><br><br>If the $44K difference would materialize out of thin air, tOSU would be the obvious choice imho.  My hunch is that you are a midwestern (urban-seeking) student, wanting to stay in that zone, and tOSU has a very good engineering reputation.  Normally I advocate for southern schools because I am biased toward them.  But your post just rings out tOSU to me (I went to school in the midwest so I understand).<br>That being said, $44K is a large amount of money to many people, and if you have to go very far into debt for it - it’s not worth it imho.<br>You could definitely be a bigger ‘fish’ at Alabama, but certainly not too far so.  There are many talented students in engineering, CBH, etc.  I would give Alabama a very close look when you go for CBH weekend (congrats on that btw). When my son was close to going there, one of his roommate prospects was from Illinois.  There are many OOS students at 'Bama, and it seems like Illinois is one of the states represented well.<br>Wishing you luck.  Keep an open mind and start framing what a $44K payment looks like after graduation (though your parents would have to co-sign it sounds like).<br><br>", "<b>Username: insanedreamer</b><br><br>Since you’ll be graduating in engineering from a college with an excellent reputation in that field (OSU), your job prospects are good and so I wouldn’t necessarily let the $45K debt be the deciding factor as it shouldn’t be too difficult to pay off. It sounds like you’d prefer to go to OSU, and it is purported to be the better school for engineering, has the opportunities you want, alumni network, etc.<br><br>", "<b>Username: d012939</b><br><br>@TempeMom @Mom2aphysicsgeek basically, my parents are paying $x per year no matter where I go, and I have to pay the rest. I am in a very fortunate situation where once I run out of money my parents are willing to temporarily cover as much of the additional costs that they can until I can pay them back so that I can avoid the interest rates and such of student loans.<br><br>", "<b>Username: novicemom23kids</b><br><br>^ Have you run the debt calculators for $45K of debt I think it will be about $425-$450  a month - every month for 10 years.  That is not nothing… While working you would have taxes taken out of that generous young engineer salary, work expenses, rent/mortgage, car expenses, living expenses, insurance expenses, etc… To service a $450 month loan payment – for 10 years –  may be difficult to pay off.  Not so sure that above advice is very good.<br>I understand that fit is important and $45K is not the staggering debt numbers that others have but I would suggest sitting down with some working adults and logically look at their budgets - could they afford an extra $450 a month over an extended time of a decade?<br>If there are college savings set aside or working parents willing to pay for the gap between UA and tOSU or an inheritance sitting out there then $45K might not be a deal breaker - but to think that paying off that amount while trying to launch an adult life seems short sighted. If the money is really not an issue - as in someone will help you to pay for a better fit, then it seems like tOSU is better suited for what you are looking for.  If you are thinking about starting your career in the financial hole, you may start to resent little things at tOSU that are giving you pause right now.  JMHO<br><br>", "<b>Username: d012939</b><br><br>Alright this is gonna sound stupid and its too hard to explain on here but here’s the simplified, general version.  I know if I go to either school, I’m gonna be successful. However, going to OSU gives me the chance to “test run” my dream job (this is what’s too hard to explain) with a unique club they have, and this club would increase my chances of landing my extremely-rare, almost-unrealistic dream job.  I probably wont be able to get this job, but at least I could somewhat artificially live out this dream bc of OSU’s club.<br>So the question is, is it worth it to pay $45k extra for this once-in-a-lifetime opportunity to artifically live out my dream and increase my chances of doing it for real? Or do I save some money, go to Bama, still be successful, but have an even lower chance of achieving my dream?<br>I know this is super vague, but just philisophically what are your opinions?<br><br>", "<b>Username: d012939</b><br><br>By the way, @Mom2aphysicsgeek @TempeMom  @novicemom23kids I ran the numbers, and I’m looking at a monthly payment in the $300s for 10 years as an estimate. That’s just based on my limited knowledge of finances and using that bankrate calculator<br><br>", "<b>Username: blueguy99</b><br><br>OSU is a bit more expensive but in the long run it’s definitely worth it over Bama. 22k a year to attend a great school? Sounds awesome. Bama is decent but not up to par of OSU engineering<br><br>", "<b>Username: Chardo</b><br><br>^ There are many recent Bama grads at top of the line jobs alongside OSU grads who would laugh at that assessment.<br><br>", "<b>Username: Chardo</b><br><br>I may have missed it, but have you visited each campus?<br><br>", "<b>Username: Chardo</b><br><br>As for your question about the extremely rare, almost unrealistic dream job, without knowing a lot more, the short answer is no.  That’s a poor reason to choose a school.<br><br>", "<b>Username: d012939</b><br><br>@Chardo yeah I visited and really liked both. And what I meant about the dream job is I know how unlikely it is, but OSU has a club that would basically allow me to live out my dream during college.  That’s the major draw bc it’s an opportunity I cant find anywhere else and won’t be able to find later in life (unless by some work of God I did get my dream job).<br><br>", "<b>Username: mamaedefamilia</b><br><br>It is clear that you have a strong preference for Ohio State.  For me, the most compelling reason is that you want to stay in the Midwest and the regional connections you will make “might” be worth the upcharge.  It is also possible that through paid summer internships, you might be able to minimize your debt as you go (true in both places).<br>Both schools have strong reputations and excellent honors programs.  They are both large enough that you will find your niche.  I am sure that you will make the most of the opportunities before you, wherever you end up, even if it’s not your first choice.<br>Good luck to you!<br><br>", "<b>Username: d012939</b><br><br>@mamaedefamilia thanks!<br><br>", "<b>Username: MYOS1634</b><br><br>It really sounds like you want tOSU.<br>Next step : dealing with costs.<br>You get a 5.5k loan,  whatever you can save from your job (if you don’t have one,  get one), and your parents ’ contribution. Does it add up?<br><br>", "<b>Username: themathrunner</b><br><br>please delete this post<br><br>", "<b>Username: momofsmartdancer</b><br><br>I think you need to run the numbers and compare them.  Of course once you get your financial aid packet from both schools that would be easy to do. It sounds like you really want to determine that now and make a decision.<br>Would you be able to borrow enough money to attend OSU?  I think people on CC here have posted the maximum you can borrow each year.  If you are not able to borrow enough to cover the costs, are your parents willing to take out loans to help you? Looking at cost and financing might answer your question about which university to attend.<br><br>", "<b>Username: AlbionGirl</b><br><br><br>\"\"<br>However, going to OSU gives me the chance to “test run” my dream job (this is what’s too hard to explain) with a unique club they have, and this club would increase my chances of landing my extremely-rare, almost-unrealistic dream job. I probably wont be able to get this job, but at least I could somewhat artificially live out this dream bc of OSU’s club.<br>\"\"<br><br>How sure are you that UA doesn’t have a similar club?<br><br>", "<b>Username: d012939</b><br><br>@AlbionGirl 100% sure. OSU is one of only like 5 schools to have it<br><br>", "<b>Username: ScreenNameoriginal</b><br><br>Why not start the club you want at UA?<br><br>", "<b>Username: juillet</b><br><br><br>\"\"<br>I ran the numbers, and I’m looking at a monthly payment in the $300s for 10 years as an estimate. That’s just based on my limited knowledge of finances and using that bankrate calculator<br>\"\"<br><br>I’m not sure what you did, but that’s not accurate. I have less debt than that and my student loan payment is around $400/month.<br>StudentAid.ed.gov has a repayment calculator. Under standard repayment, with a $45,000 loan balance you’d be paying $518 a month. You may be eligible for income-based repayment depending on how much you make - I entered a single student making $65,000 a year, and that student was eligible for PAYE and IRB (both of which would have him paying $393/month at least to start out).<br>Personally, especially in engineering I don’t see the point of borrowing the extra $45K when you can graduate debt-free from UA Honors. It does sound like you prefer Ohio State a lot.<br>But quite frankly, I gotta say - as someone nearly 10 years out from undergrad now, but who just started repaying her loans last year due to graduate school - I’m willing to bet that 2-3 years from graduation, you would rather have the extra $500 in your pocket every month than the warm, fuzzy memories of OSU and the club. $500. A. Month. That’s $6,000 a year. That’s a car down payment - a nice car. That’s a healthy savings account every year. That’s starting to save towards a down payment. Or security deposit in an expensive city. And that’s every month for 10 years…you’ll be in your early 30s when you finally stop paying it off, assuming nothing interrupts you.<br>If you mentioned what the club was - or even alluded to it - people might be able to point you to an equivalent resource or a way to get into it from UA.<br><br>", "<b>Username: d012939</b><br><br>@ScreenNameoriginal I did consider that but the club, Theme Park Engineering Group, would take a few years to really get well established and there might not be enough interest at UA and/or the university might not support it. The club at OSU has been around for a bit and hfs the advantage of being near many awesome amusement parks (cedar point). They’ve even had many people get internships in the industry!<br><br>", "<b>Username: d012939</b><br><br>@juillet I appreciate your analysis. The numbers I’m getting are bc the amount I can afford every year is a bit more that the cost of UA. Thus, my debt would be less than the difference of costs between the 2 schools. I definitely inderstand what you’re saying, even with my debt as less than your example. We’ll see what I decide!<br><br>", "<b>Username: ClarinetDad16</b><br><br>Did you look at / apply to UCF?  You have all theme parks right there and they have a solid placement record with Disney and the Imagineer program.<br>Sometimes a big merit offer from a school, like Bama, is flattering.  Can be exciting.  Outcomes are important as you are investing 4 years of your time.  Launching into specific programs / industries can be enhanced at schools with strong relationships into those employers / programs.<br>Do your homework and you will make the right decision.<br><br>", "<b>Username: JustGraduate</b><br><br>IF the OSU theme parks club really does help get students internships/jobs in the industry, I think it could definitely be worth some premium for attending OSU.  Wish I had a buck for every student I’ve heard say they wanted to work on theme park rides - would have paid for a good chunk of my son’s education lol!  It’s a very difficult field to enter, and if that’s what you really want I would think this could be a big help in getting there - or finding out it’s not something you want to do after all.<br><br>", "<b>Username: ClarinetDad16</b><br><br>Here is the club at UCF, would seem it helps there.  So if OSU has connections too… https://ucf.collegiatelink.net/organization/TEAatUCF/calendar/details/934197<br><br>", "<b>Username: sevmom</b><br><br>Ah, Cedar Point!  Met my husband there when when we were working there summers during college. We just drove through Columbus last summer and thought the city and campus were very nice. This is a tough one because of the money aspect. Good luck with your decision!<br><br>", "<b>Username: STEM2017</b><br><br>You should also run a calculator on the opportunity cost of foregoing a $300-500 monthly contribution (even higher pre-tax) to a 401k or an IRA for 10 years. I don’t have a calculator in front of me (if someone would be so kind as to run the numbers) but I’m certain that the end result will be astonishing.<br><br>", "<b>Username: sevmom</b><br><br>$22,000 a year seems pretty reasonable to attend a preferred OOS public school, at or even less cost that what many instate publics cost these days. And your parents are willing to help (#33), so that is positive.  If you work some during school and get good internships during the summer that can help.<br><br>", "<b>Username: d012939</b><br><br>@ClarinetDad16 I’m looking at their scholarships but it doesnt say the deadlines, requirements, or award amounts …<br><br>", "<b>Username: 2sunny</b><br><br>@d012939  just sent you PM<br><br>"]}