{"title": "ivy league vs northwestern", "comments": ["<b>Username: swagnation234</b><br><br>I have the potential to have a full ride to Northwestern plus a stipend but I have the option of going Ivy League as well with the tuition being less than 5,000 dollars. What should I do ? I understand that these are all amazing schools.<br><br>", "<b>Username: Jpgranier</b><br><br>So pay like 20k a year including room and board or be paid to go to school?<br>I think the answer’s simple.<br><br>", "<b>Username: marvin100</b><br><br>Which Ivy, @swagnation234 ?<br><br>", "<b>Username: happy1</b><br><br>Do you have a strong preference for one school over the other?<br><br>", "<b>Username: PurpleTitan</b><br><br>How would you have offers to both NU and an Ivy already?<br><br>", "<b>Username: mom2collegekids</b><br><br>Are you saying:<br>Northwestern would be totally free?  Tuition, room, board, books, etc, all free???<br>Ivy school would be:  $5k for tuition and maybe $15k for room board and books?  (About $20k per year?)<br>Well, I can’t imagine what an ivy could do for you that NU couldn’t also do.  What are your parents saying?  Will THEY pay the $20k per year for the ivy?  Or will they/you be borrowing that $80k total?<br><br>", "<b>Username: austinmshauri</b><br><br>You have the “potential.” Does this mean you’re talking about Net Price Calculator results or do you have actual offers?<br><br>", "<b>Username: Penn95</b><br><br>@swagnation234  for that is worth, every year there is quite a handful of transfer students from Northwester transferring to Penn. I m guessing that is the case for many other ivies too, since it is for Penn.<br>I think it also depends on which Ivy. Personally, if it is Harvard,Princeton, Yale, Penn or Columbia I d definitely choose the Ivy. If it is Dartmouth, Brown or Cornell it would be more of a toss up but I d probably still choose the ivy given that the cost difference is small. would u have to take out a loan for the 5k tuition?<br>Lastly keep in mind that the ivies are not all the same. There are substantial differences in terms of campus vibe, atmosphere, academic philosophy etc.<br><br>", "<b>Username: PurpleTitan</b><br><br>@Penn95, there are some of us on here who remember when Penn was the easiest Ivy to get in to (go back a little further, and Columbia had a 40% admit rate and was almost bankrupt), and honestly, the characteristics and relative positions of the various Ivies really haven’t changed that much over the past few decades.<br><br>", "<b>Username: ClarinetDad16</b><br><br>How do you have a “full ride” plus stipend from Northwestern?<br><br>", "<b>Username: Penn95</b><br><br>@PurpleTitan  And the point is? Penn (along with Cornell) was the easiest ivy to get into back in the 1980s. It has been 30-35+ years since then. Also at that time Stanford was an afterthought to HYP. Look where it is now, vying for top spot with Harvard. Things do change over the decades. if you had looked at say 1920s-30s things would also be different compared to the 80s.  Penn improved tremendously starting at the late 80s and throughout the 1990s. And so did Columbia. Of course the characteristics and relative positions have changed.<br>Just being objective here. HYP still remains the top of the ivies but Columbia and Penn have made grater progress than Dartmouth, Brown, Cornell and for the past 15-20 years they have been consistently seen as stronger universities than Dartmouth, Brown, Cornell. All the rankings (domestic, international, college, research) and metrics support that.<br>Just one example,  Penn and Columbia had 50-51% RD yield rates for the class of 2020 while Brown had 43%-44%, Cornell 41% and Dartmouth 38%-39%<br><br>", "<b>Username: PurpleTitan</b><br><br>@Penn95, by the metrics I look at (alumni achievements), there’s just not that much change (and of the non-HYP Ivies, it’s actually Brown in front). Even by the '80’s, Stanford was already in HYPM’s league (even if perception on the East Coast hadn’t caught up to reality yet).<br>And yield rates reflect the preferences of HS kids. I’m of the opinion that achievements are what matter.<br><br>", "<b>Username: swagnation234</b><br><br>The Ivy League schools im looking at are upenn, Columbia and Dartmouth and the total fee that I would have to pay is less that 5,000. This includes books, food, tuition and room and board<br><br>", "<b>Username: ClarinetDad16</b><br><br>Are you a junior?<br><br>", "<b>Username: swagnation234</b><br><br>Senior<br><br>", "<b>Username: swagnation234</b><br><br>also northwestern does not include the stipend, I made a mistake. My apologies.<br><br>", "<b>Username: IWannaHelp</b><br><br>What field? What are you looking for? NU is on par with quite a few Ivies and is even better in some areas. You need to give more details.<br><br>", "<b>Username: marvin100</b><br><br>How do you have offers from all these schools already? That doesn’t seem realistic–are you speculating or asking about a hoped-for future dilemma?<br><br>", "<b>Username: ThankYouforHelp</b><br><br>I question your story, or at least think there must be more to it.<br>However, assuming it is true, and if the question is whether to choose Northwestern for free or several of the mid tier Ivies for 5k per year, I would not let money be the deciding factor.  That amount of money/debt is too small to matter.  I would go to the one you like the best, or that has the best program for whatever it is you want to study.<br>There really is zero practical difference between Northwestern, Penn,and Dartmouth for purposes of prestige/opportunities, and the difference with Columbia is small at best.  But the atmosphere of Columbia or Dartmouth will be very different than Northwestern (Penn will be the closest in atmosphere to Northwestern).<br>If you were talking HYP, my advice might be different.  Or maybe not.  I could see turning down HYP for Northwestern if I wanted to study journalism, music or theater.<br>Anyhow, if your story is true, go where you feel the best fit.<br><br>", "<b>Username: PurpleTitan</b><br><br>@ThankYouforHelp: If the details given by the OP are correct, the $5K is only for tuition and room & board isn’t covered at the Ivies. $20K a year may be a lot of money depending on circumstances.<br>In any case, is this a hypothetical? What offers do you have and how?<br><br>", "<b>Username: PurpleTitan</b><br><br>In any case, my take is that the Ivy League is a sports league. The colleges you are considering are pretty different in character. Unless you are an athlete, what sports league your school belongs to just won’t be a big determinant in your life, but fit does matter. In terms of alumni achievements and opportunities, Northwestern is on par with the Ivies you listed (and they are with each other as well):<br>http://talk.collegeconfidential.com/college-search-selection/1893105-ivy-equivalents-ranking-based-on-alumni-outcomes-take-2-1-p1.html<br><br>", "<b>Username: moscott</b><br><br>@PurpleTitan    You and a lot of others try to quantify the Ivy league as just a sports league…which is an injustice. The reason people say they are looking at Ivy league schools and Stanford, MIT etc… are simply incorporating all 8 schools into 1 category(which is all top 15) as top colleges. Instead of listing each college by name one by one, it is much more efficient to simply say Ivy league schools. Is the Ivy league a sports league…absolutely…but no other sports league(or non) encompasses every school into the top 15 academically. Thus when people are saying they are looking into Ivy league schools they simply mean top 15 colleges. Now I realize each Ivy school is unique and different but there is a reason people use the term.<br><br>", "<b>Username: Jpgranier</b><br><br>@moscott that may be true, but not in the OPs case. He’s strictly differentiating Northwestern (a top 15 school) from the 8 physical Ivy League schools.<br><br>", "<b>Username: PurpleTitan</b><br><br>@moscott: @Jpgranier covered it, and in any case, if you want to refer to the top 16 or so, it’s more accurate to use the term “Ivies/equivalents” or\"Ivies+\".<br>Stanford, MIT, UChicago, Northwestern, Duke, Rice, Georgetown, and Caltech aren’t any lesser merely because they don’t all play in the same sports league, and it’s inaccurate to refer to them all as Ivies.<br><br>", "<b>Username: moscott</b><br><br>The title says Ivy league vs Northwestern…people then try to say “well Ivy league is just a sports league”. So what exactly do you mean Ivy league is a sports league when you know full well what they mean?<br><br>", "<b>Username: PurpleTitan</b><br><br>@moscott: That the Ivy League is just a sports league.<br>What do you think they meant?<br>What point are you trying to make?<br><br>", "<b>Username: moscott</b><br><br>So not correct…it isn’t simply a sports league obviously. You are minimizing the term. I told you what they mean…8 colleges ranked in the top 15 academically. My point is when kids come on and use the term apply to Ivy schools they are simply encompassing top schools into 1 word without listing them one by one. Then people respond with…oh the Ivy league is just a sports league knowing the student isn’t looking at them in regards to sports.<br><br>", "<b>Username: Jpgranier</b><br><br>@moscott Almost everyone knows that Ivy League is practically synonymous for elite school.<br>@PurpleTitan Ivy League also refers to a sports league.<br>Y’all are both right.<br><br>\"\"<br>My point is when kids come on and use the term apply to Ivy schools they are simply encompassing top schools into 1 word without listing them one by one.<br>\"\"<br><br>I don’t see what you’re arguing. Are you arguing that Northwestern isn’t a top school? Why did the OP not say in his title “Ivy League vs Ivy League” when talking about Northwestern?<br><br>", "<b>Username: Jpgranier</b><br><br>@swagnation234 I take back my previous post saying NU is a no brainer because I thought it was 20k debt per year.<br>5k/yr is completely manageable, and you shouldn’t let that amount hold you back from going to the school you like the most. For us to help you, we need some more info.<br><br>What is your intended major?<br>Have you actually been accepted to these schools? I'm not sure if admissions decisions for RD applicants are even out yet...<br>Which school do YOU like the most? Don't let the 20k total in loans scare you off.<br>How did you receive a full ride to NU but not the Ivy League schools you mentioned? Was this all needs-based aid? <br><br><br>", "<b>Username: moscott</b><br><br>Yes the Ivy league is a sports league…so is the ACC, SEC etc. When kids go on CC and use the term Ivy league schools they are referring to them as top academic institutions not sports teams. So instead of listing every college one by one the term Ivy league covers all 8. They will also add Stanford, MIT etc…many times as well but since they aren’t in the Ivy you have to list them by name. Of course Northwestern is a top school. The original title is Ivy vs Northwestern which is much more efficient than saying Dartmouth, Brown, UPENN, Cornell, Harvard, Princeton, Yale, Columbia vs Northwestern.<br><br>", "<b>Username: Alexandre</b><br><br>Northwestern, Cornell and Penn are peers. Brown, Dartmouth are not better, but they are different. If admitted into all 5 of those amazing universities, go for the school that you can most easily afford, and if cost of attendance is not a concern, go for fit. None of those schools has more to offer than any of the others, although they will each have their own unique programs and special resources.<br><br>", "<b>Username: merc81</b><br><br><br><br><br> moscott:<br>\"\"<br>I told you what they mean…8 colleges ranked in the top 15 academically.<br>\"\"<br><br>They’d seem to be in the ~top 28:<br>http://www.businessinsider.com/the-50-smartest-colleges-in-america-2016-10<br><br>", "<b>Username: Sam-I-Am</b><br><br>@swagnation234.  $5,000 per year is not enough of a difference to base your decision on.  Figure out where you prefer to study, Evanston/Chicago, NYC, New Hampshire or Philadelphia.  And what you want to study.  Which school has academic strength in the area you want to study and which overall atmosphere you prefer.  Since you asked for advice, I’ll tell you that I personally would prefer Evanston/Chicago over the other cities.  Evanston and the Northwestern campus are beautiful and an easy, short train ride via CTA or Metra to Chicago.  But I also love Hanover, NH and Dartmouth, which is rural so has a different feel.  I would choose between those two.  If you are into USNWR rankings and you can stand NYC (I can’t), then choose Columbia if they have a strength in the area you want to study.  I would not consider UPenn unless you were in love with Phili.  It is overrated and I’d choose Northwestern or Dartmouth over it by a large margin.  Congratulations and good luck making your decision!<br><br>", "<b>Username: PurpleTitan</b><br><br>@moscott, if you read through the thread, you would have seen that he meant specific Ivies. Considering that almost everyone differentiates between the Ivies (as seen on this thread) and that the main difference between the Ivies and Northwestern are the sports leagues they belong to (and the region they are in), then<br><br>Yes, in this case, the Ivies are just a sports league.<br>Yes, it would have made more sense for the OP to title it “Northwestern vs. UPenn/Dartmouth/Columbia”.<br><br><br>", "<b>Username: moscott</b><br><br>@merc81    Ugh…seriously. USNWR.<br><br>", "<b>Username: moscott</b><br><br>@PurpleTitan<br>There is NOTHING in this entire thread having to do with sports or sport conferences. It’s a lazy way to describe what kids are intending as top academic schools encompassed in one word(Ivy) where you and others espouse oh it’s simply a sports league. Nowhere near the context of the conversation unless in the athletic recruits forum.<br><br>", "<b>Username: moscott</b><br><br>To put it in simple terms, IF one of the Ivy schools weren’t in the top 100 academically you wouldn’t see kids using the universal term as Ivy league in regards to top schools. Same for why they don’t for any other league be it Pac 12 or Patriot league. In those cases they specifically label Stanford, UCL, USC or William & Mary by name.<br><br>", "<b>Username: Penn95</b><br><br>@PurpleTitan What alumni achievements are you looking at? Also HYP was still king in the 80s. Stanford was almost on the same league, but HYP still had the edge.  So you are saying revealed preference has no significance at all? it is not like HS kids make a random decision on their own. They and their parents weigh their options based on the information available. Also are you saying that none of the many rankings out there matter?<br><br>", "<b>Username: Zinhead</b><br><br>Some thoughts:<br>1 - The OP clearly said that the question was hypothetical. People should stop questioning the OP for that.<br>2 - Take a good look as to where you want to live in the future. There was a survey recently of Ivy graduates that showed that 75 percent of them lived in the MidAtlantic or Northeast. At the same time, most NU grads live in the midwest.<br>3 - Academically, NU is on par with the “middle” Ivy’s of Penn and Columbia. All of these schools have excellent reputations and placement.<br>4 - Our HS sends alot of kids to NU, and the more time I spend talking to their parents, the more impressed I am with the school. All of these kids had the opportunity to attend a flagship Big 10 school for less money, but the parents believed that NU, despite the higher tuition, offered a significant ROI. Most of the students from our HS who attend NU are very serious, pre-professional students who have a firm idea of what they want to do in their four years on campus and where they want to be when they graduate. In comparison, some kids from our HS who chase an Ivy acceptance seem to be chasing prestige or external validation of their academic success rather than looking at fit or professional goals.<br><br>", "<b>Username: PurpleTitan</b><br><br>@Penn95: I do believe that many rankings, while OK in general terms, don’t tell you much about schools that are within 10 or so places of each other. Also, I look at PhD rates, prestigious scholarships earned, “American leaders”, and placement in to top professional schools. Penn does very well in the last 2 categories. Not at HYPSM levels in the first 2.<br>@moscott: The OP was comparing NU with Ivies. What, besides the sports conference (and region) differentiates the two (bearing in mind that differences between different Ivies are often greater)?<br>If the OP was using “Ivy” to mean “elite private” (as you seem to think he is) instead of a sports conference, then does not comparing NU to “Ivies” make zero sense, considering that NU is also an elite private? Does that then not lead one to conclude that he was referring to the Ivy League sports conference?<br><br>", "<b>Username: fbsdreams</b><br><br>@swagnation234  Recruited Athlete ?<br>Answer would really depend on your prospective major. Example : If economics I would pick Northwestern over majority of the Ivy’s.<br>So many variables, have you been accepted at these schools ? Location should come into play as well.<br>Edit: Would you pay $20k or $5k for Penn?<br><br>", "<b>Username: IsaacTheFuture</b><br><br>So going to school for free at one of the world’s best colleges vs having to pay thousands at a school that is marginally, if at all, better?<br>This isn’t even a question.<br>OF COURSE, if you REALLY like the Ivy League school better, talk with your parents. However, for me this decision would be a no brainer.<br><br>", "<b>Username: IsaacTheFuture</b><br><br>yeah at @PurpleTitan , This smells a little fishy…<br><br>", "<b>Username: Mastadon</b><br><br><br>\"\"<br>It’s a lazy way to describe what kids are intending as top academic schools encompassed in one word(Ivy)<br>\"\"<br><br>Are you suggesting that kids who are interested in “Ivy League” schools tend to be lazy ???<br><br>", "<b>Username: PurpleTitan</b><br><br>I sometimes wonder how well those posters who use “Ivy” as a term for Ivy+ or elite privates do in admissions to Ivy+ schools compared to people who are accurate in their usage (as the OP was).<br><br>", "<b>Username: Much2learn</b><br><br>@swagnation234<br>Among those 4 schools, the significant majority of students are going to choose Penn or Columbia (spit about 50%/50%). A few will choose Dartmouth and only occasionally will someone choose Northwestern.<br>The choice between Columbia and Penn may depend on a student’s preference for Columbia’s impressive, but rigid, core curriculum vs. Penn’s much more flexible, customizable curriculum. Dartmouth is a lot smaller and in a remote area no where near a major city, and beer pong is required.<br>The typical Northwestern student has academics and test scores that are comparable to the other three schools, but is often missing that something extra that would be needed for admission to the Ivies.<br><br>", "<b>Username: PurpleTitan</b><br><br>@Much2learn: I don’t know what you’re basing your assessment on, but that “something extra” that you think is there, if it exists, doesn’t seem to lead to a different distribution of  alumni achievements (when comparing NU with the lower Ivies).<br><br>", "<b>Username: skieurope</b><br><br>MODERATOR’S NOTE<br>The 2 person conversation about what is the Ivy League serves nothing to answer the original poster’s question. Move on please. The point/counterpoints have been left, but the last 6 “beating a dead horse” posts have been deleted.<br><br>", "<b>Username: Zinhead</b><br><br><br>\"\"<br>The typical Northwestern student has academics and test scores that are comparable to the other three schools, but is often missing that something extra that would be needed for admission to the Ivies.<br>\"\"<br><br>The missing something is an elevated sense of pretension and snobbery.<br><br>", "<b>Username: IsaacTheFuture</b><br><br>@Much2learn So we are just introducing baseless “intangibles” into discussion now? lol<br><br>", "<b>Username: Much2learn</b><br><br>“The missing something is an elevated sense of pretension and snobbery.”<br>The missing something is not a “baseless intangible” it is whatever it takes to get accepted by Penn or Columbia admissions. A lot of students from our high school with strong grades and test scores but lacking impressive ECs end up at Northwestern after getting rejected at Ivies. Maybe it was a state or national award, or a research project. Most often demonstrating a propensity to get involved and achieve something significant.<br>Again, theses are not big differences, and the specific major and fit may be important factors.<br><br>", "<b>Username: PurpleTitan</b><br><br>@Much2learn: Ah, now I know the problem. You are drawing unfounded conclusions from a small regional sample size of anecdotal evidence. Penn (metro), Northwestern (metro), Cornell (specific in-state feeder HS’s), WashU (metro), Duke (state), UChicago (city), and even Harvard (city) have home city/state/metro biases. Penn and many others give a strong lift to legacies who apply ED (or just legacies; or just ED apps) as well. Under holistic admissions, there’s no level playing field anywhere. Go to the Philly burbs, and you’ll likely discover that not every Penn admit has impressive EC’s or done something significant. But you saw the little bit that you saw and then extrapolated that out.<br>The fact remains that when it comes to alumni achievements, NU is right there with the lower Ivies, so either the student bodies are comparable or whatever extra stuff adcoms select for don’t actually matter in the real world.<br><br>", "<b>Username: PennCAS2014</b><br><br>So this really comes down to your own personal preferences. Despite what some of the people on this thread would have you believe, Penn and Columbia are indeed usually considered a notch above Northwestern and Dartmouth. But contrary to what a lot of 17 year olds think, that notch won’t really mean all that much at the end of your time there. Here’s where it will matter:<br><br>If you MIGHT want to go into business, there is no better school to attend than Penn. Because of Penn's one university policy, students across Penn's four undergraduate colleges (The College, Wharton, Nursing, and Engineering) all have access to the same exact career services and thus have access to all of the best recruiters and opportunities in business. Top employers come to Penn as a consequence of Penn's preeminent business school and they end up recruiting at all four of Penn's undergrad schools. And it doesn't hurt that you can take classes, join clubs, and do research across Penn's four undergraduate schools and its numerous graduate and professional schools, allowing you to add experience at Wharton or Penn Law to your resume, bolstering your chances even more. This is important because some firms only recruit at Penn, Harvard, Yale, Princeton and Stanford. (http://www.chronicle.com/blogs/percolator/brown-and-cornell-are-second-tier/27565) The research from that study actually came from a scholar at Northwestern ironically enough. Thus, attending Penn gives you access to recruiters that won't even look at a northwestern grad. And I can speak from personal experience on this matter- because I was a student in Penn's College of arts & sciences who was recruited to work at an organization that only recruited in a meaningful way at Harvard, Penn, Yale, Stanford, Columbia, and Princeton (there are others here to be sure, just not in any significant numbers).<br><br>From the article: “They meet hundreds of applicants at career fairs. Rather than scrutinizing anyone’s resume it’s easier just to limit the pool to the top three or four universities. Do you really want to pore over the transcript of that kid from the University of Michigan? Wouldn’t it be easier just to call the Harvard grad? In essence, what they’re assuming is that the admissions offices at the super-elite schools have already picked the best of the best. Why second guess them?”<br>Also from the article-- “Here’s what a top consultant had to say about M.I.T.: You will find it when you go to like career fairs or something and you know someone will show up and say, you know, “Hey, I didn’t go to HBS [Harvard Business School] but, you know, I am an engineer at M.I.T. and I heard about this fair and I wanted to come meet you in New York.” God bless him for the effort but, you know, it’s just not going to work.”<br>For the most elite circles of business, pedigree matters (whether or not that’s fair), and Penn has the connections, regardless of whether you’re an engineer or a whartonite, etc., to connect you to the most exclusive opportunities. And Penn publishes comprehensive career services data to back that up-- you can easily compare it to any other school willing to make their data public.<br><br>Networking- People on college confidential just love being reductionist about the ivy league. At the end of the day, it's not just a sports conference, it's a networking opportunity. While you're still an undergrad, you will have a lot of interaction with the other Ivies by virtue of the fact that we kind of do everything together. Sure, our sports teams play one another and that's fun. But our student councils meet to discuss how they can work together. There is an Ivy League Latino conference. There is an ivy league inter-faith conference. There is a conference of first generation college students in the Ivy League. And the list goes on... Our student newspapers report on significant events at the other 7 schools. We participate in coordinated community service events. We host debate tournaments that are only for other ivy leaguers. Our literary societies host one another for intellectual discussions. Our secret societies and senior societies host mixers with each other. We go to each other's parties and spring flings. Our girlfriends and boyfriends and brothers and sisters and gender nonconforming family and friends all go to other ivies and broaden our networks so that when we leave college, we don't just know the kids we graduated with but we have a dense network of other HIGHLY motivated, accomplished and successful peers. It means that I can walk into any room of elite professionals in an American city (and many international ones) and be confident that I'll find someone there who went to Dartmouth or Princeton with whom I can bond over our shared ivy experience. It also means that any time I need an introduction to another professional, I am never more than one degree of separation from the person I'd like to meet because the network is so tight. And we don't stop building it after we graduate. Instead, the Ivy alumni clubs all have club houses within a few blocks of each other in Manhattan and they hold Inter-club events all the time (they do this in all of America's major cities as well and many international ones too- especially London). There are ivy-only career fairs and ivy only social mixers. There are even ivy-only speed dating opportunities. Your affiliation with the Ivy League opens doors that just can't be opened elsewhere. Going to any amazing college (like northwestern or georgetown) will open more doors than you can ever have time in your life to take advantage of; Going to an ivy opens those same doors and more. <br><br>In all honesty, an undergraduate education at Yale will be pretty similar in terms of quality to an undergraduate education at Vanderbilt. Your undergrad years and your success afterwards will genuinely be crafted almost exclusively by the effort you put into learning what you want to learn and doing what you want to do. But going to an Ivy (especially Penn, Princeton, Harvard, Columbia and Yale) will make your entrance into some of the most notoriously elitist and closed sectors of professional and social life that much easier. But if you don’t care about those things… well, then the significance of the ivy league ceases to matter when comparing them to Northwestern.<br><br>", "<b>Username: Boothie007</b><br><br>I mostly agree with Alexandre’s assessment<br>Notch above:  HYP, Columbia, Penn - Wharton<br>Same, but different:  Dartmouth, Brown<br>Basically the same:  Penn - Other, Northwestern, Cornell<br><br>", "<b>Username: prezbucky</b><br><br>Northwestern is an academic powerhouse on par with (at least) Penn, Brown, Cornell and Dartmouth in terms of overall undergraduate academic strength – and in STEM they’re probably stronger than mighty Yale and Columbia (whose most impressive strengths lie elsewhere).<br>So yes, academically, Northwestern is quite comparable to the Ivies.<br>With that bit of Big Ten chest-thumping out of the way, I think that while it sounds like there will be about a $20k advantage for Northwestern over four years, if your family is comfortable paying the extra money for an Ivy – and if you feel that you are a better fit for one than you are for Northwestern – then by all means, choose the better fit. (that’s my standard advice when cost isn’t really a factor)<br><br>", "<b>Username: IWannaHelp</b><br><br>Much2lean,<br>Whatever “intangible” you think Penn admits have seem to disappear in the college years; Penn students are no better than NU students in terms of winning external scholarships such as Fulbright or Goldwater. You have much to learn indeed.<br><br>", "<b>Username: skieurope</b><br><br>MODERATOR’S NOTE:<br>And for some reason, the side conversations that have nothing to do with the OP continue. Since the OP seems to have left the building, closing thread.<br><br>"]}