{"title": "full ride at upitt vs full tuition at vanderbilt", "comments": ["<b>Username: ChilliLL</b><br><br>Hello,<br>I need some help deciding which college I should pick. Back in December, I was awarded a full ride covering tuition, room and board, etc as well as a $500 book award and $2000 study abroad grant. Because of this, Pitt has been my top choice ever since and I couldn’t imagine any of the elite schools giving me money off. However, yesterday, I received a letter saying I was a Chancellor’s scholar at Vanderbilt giving me full tuition and $5000 to study abroad. I was thrilled but my decision has become a lot harder. I would still have to pay another $15000 for room and board at vanderbilt, but I like the idea of going to vanderbilt more. I am visiting both schools soon so I don’t have that experience yet. Any perpectives/comments are appreciated!<br><br>", "<b>Username: mom2collegekids</b><br><br>What is your major and career goal?<br>What are your parents saying about THEM paying for the $15k at Vandy?<br><br>", "<b>Username: ChilliLL</b><br><br>@mom2collegekids I’m majoring in biology with the goal to become a physician. I’m sure my parents would have no problem financially paying for vandy, it’s just that I would feel bad making my parents pay for vandy when they could have paid nothing for pitt. Do you think paying the extra money for vandy is worth it. Thanks<br><br>", "<b>Username: mom2collegekids</b><br><br>For bio premed?  No, not worth the extra money.   that is $60k you could put towards med school.<br>Visit both and then decide for sure.<br>&lt;&lt;&lt;<br>Hello<br>I’m currently a Senior in High school and am currently applying to colleges.<br>Rank: 6/305<br>GPA UW: 3.89<br>GPA W: 4.4844<br>new PSAT: 1400/99th percentile<br>Ethnicity: African American/Male<br>Freshman year classes: Math 2 Honors, US History Honors, Science Honors, English Honors, Spanish 2, Computer programming w/ visual basic, gym/health, band<br>Sophomore year: AP Chem (year 1), AP Macro/Microeconomics, AP World History, Math 3 Honors, Spanish 3, Biology Honors, English Honors, gym, Health<br>Junior Year: AP US History, AP Chemistry (year 2), AP Physics B1, AP Stats, AP Psychology, AP Language and Composition, Math 4 Honors, Spanish 4 Honors<br>Senior Year: AP Physics B2, AP Environmental Science, AP Biology, AP US Government, AP Literature, AP Calculus BC, News Writing, Entrepreneurship<br>AP Tests scores: AP Macroecon: 5, AP MIcroecon: 5, AP World History: 4, AP US History: 4, AP Physics B1: 4, AP Stats: 5, AP Psychology: 5, AP Language and Composition: 5, AP Chemistry: 3  (National AP Scholar)<br>Sat ii: Math 2: 750 (too lazy to study during summer<br>Sat: 1420 without studying at all, taking it again october 1st, have been studying for a while, expecting 1520+<br>ACT: 34 Composite<br>EC: Math Club, Key Club, Science Olympiad (numerous medals), Model UN, World Affairs Club, P.R.I.D.E. Club, TED Club, Peace Core,Waiter at restaurant, National Honor Society, Spanish club, Sing Hymns at Church, Camp Counselor at church, Varsity Soccer, volunteer soccer coach for 5th graders, soccer referee, captain of freshman and JV Soccer team, tutor, Marching Band, volunteered at Junior Ambassador Program for 2 previous summers at the Cleveland Clinic, did research at the Cleveland Clinic last summer regarding chronic pain, tutor, volunteered at science showcases, published my story in school paper, research published in medical paper<br>250+ volunteer Hours<br>Top Choice: Wash U in St. Louis, have plenty of safeties though<br>Chances of getting in/receiving full ride to any of the 4 colleges in header?? All comments appreciated. Thanks!!<br>Yea, not surprised, its unfortunate though. My parents just got finished paying two siblings undergrad and pharm+med school, so i was hoping to alleviate the payload on them and get a scholarship. We are comfortable economically (doctor) but I haven’t had any tutors, etc, I just use the textbooks and internet given to me and learn the material. Thanks for the response!!<br>&lt;&lt;&lt;<br><br>", "<b>Username: ChilliLL</b><br><br>@mom2collegekids Thanks for your help!<br><br>", "<b>Username: mom2collegekids</b><br><br>Visit both and decide…and hey, if you end up liking Vandy better, then tell them that they’re your first choice but you have this full ride which makes UPill more affordable…and see if they’ll increase their offer.<br><br>", "<b>Username: blueskies2day</b><br><br>If your parents can afford it (and it seems they can) go to Vanderbilt- private education for 15K, I would jump on that. You don’t have to short change yourself because you are younger. (You sound like the youngest they always carry the burden of financial guilt after seeing all that is spent on the older siblings.) Parents like to be fair, I bet they are thrilled to have that little to pay for your college. And for Vanderbilt, that is an incredible deal. Congrats to you!<br><br>", "<b>Username: TooOld4School</b><br><br>I normally bow to the wisdom of @mom2collegekids , but Vanderbilt is definitely worth the extra $15K/yr, as long as you do not cause financial hardship for your family. Your just gave your parents a huge gift with your scholarship. Well done! Go 'Dores! This is a complete no-brainer : SEC sports, great academics, and Nashville. What more could you ask for?<br><br>", "<b>Username: ChilliLL</b><br><br>Thanks for your inputs @TooOld4School @blueskies2day ! Yeah, my parents can certainly afford it, and I’m hoping to earn a few outside scholarships to even further reduce the cost. I would love to go to vandy, but like @mom2collegekids said, I think once i visit, I’ll know for sure. Who knows, maybe I end up liking pitt better<br><br>", "<b>Username: SincererLove</b><br><br>Definitely go to Mosaic weekend. D is also Chancellor scholar. She is leaning Vandy vs. U Chicago full pay. It is very individual decision. And you probably have more decisions coming April 1st? Best of luck!!<br><br>", "<b>Username: ChilliLL</b><br><br>Congrats to your daughter! Both those schools are amazing. I plan to attend Mosaic, but I’m not sure if my parents should come or not? Yup, I’m waiting on WashU and Duke and best of luck to you and your daughter!<br><br>", "<b>Username: mom2collegekids</b><br><br>When I first said that Vandy isn’t worth the extra money, I was basing that on what I had earlier read about him wanting a free ride, so I thought money was a big concern and he might be borrowing.<br>But later I saw that his family is well-off (parent physician) and suggested that he visit both…  If he likes Vandy better then certainly see if Vandy will increase.  If not, then Vandy is still affordable for parents, so go.<br>This student appears to be a “hot commodity” and if he does well as an undergrad, he’ll likely get med school merit offers as well.<br><br>", "<b>Username: happy1</b><br><br>Congrats at having 2 great options.  Vandy would be a bargain at 15k/year. If you prefer it and your parents can afford it, go there.  Visit both and then decide.<br><br>", "<b>Username: mommdc</b><br><br>Did you get the Stamps Leadership scholarship at Pitt? Or another full ride? Because Chancellor scholars haven’t been announced yet I believe.<br>Pitt would be a great choice with the UPMC system of hospitals close by.<br>Did you get the GAP for med school at Pitt?<br><br>", "<b>Username: Trisherella</b><br><br>Average ACT score at Vandy is 33, while average ACT at Pitt is 29.<br>I’d give some consideration to where you might have an easier time earning the high GPA you will need for medical school. There will be some REALLY bright students you’ll be competing against at Vandy. Just food for thought.<br><br>", "<b>Username: SincererLove</b><br><br>D wants me to go to Mosaic with her to see the school…especially if this is the school she is ultimately going to…DH and son in out of town tournament. She is reluctantly giving up her robotics regional for the visit and as a nice girl, she realized I might not have a lot organized activities to go to and she is ok if she goes there herself. I told her I will be fine, playing tourist.<br><br>", "<b>Username: ChilliLL</b><br><br>@mommdc I actually received the helen faison scholarship at Pitt.I did not apply for the GAP program however<br>@Trisherella That’s actually a factor I was considering. I figure it would be easier at Pitt but when I visit both schools, I’m gonna ask students how hard it actually is. Thanks for the advice!<br><br>", "<b>Username: HRSMom</b><br><br>Wow!  Congrats!<br>Pitt and Vandy are good schools.  Do you know much about either program?  Is there grade deflation?  Significant weeding out (50% failure) courses?<br><br>", "<b>Username: mom2collegekids</b><br><br>&lt;&lt;&lt;<br>Significant weeding out (50% failure) courses?<br>&lt;&lt;&lt;<br>Significant weeding doesn’t require 50% failure courses.  Significant weeding can just mean that A’s and B’s are very limited, with many students getting by with Cs.<br>Vandy can be a grinder for premeds.  My nephew was premed there. He had been a top student at his prep school, but soon did not have a med-school-worthy GPA.  It’s been a frustration since his family was full pay and they thought that the Vandy name would somehow carry him to med school.<br>That said, I don’t think Pitt will be some cake-walk…lol.  I doubt that that avg ACT of premeds is a 29…likely much higher.<br><br>", "<b>Username: SouthFloridaMom9</b><br><br>^^have heard the same thing about Vandy (grinder for premeds).<br>Nevertheless, congrats OP!!!  Sounds like you have some great options - well done.<br><br>", "<b>Username: HRSMom</b><br><br>That’s good intel @mom2collegekids<br><br>", "<b>Username: mommdc</b><br><br>Check into AP credit policy for both schools. At Pitt you would get quite a few credits.<br>With your current AP scores you have possibly 30+ credits, and could get 40+ after this year.<br>https://oafa.pitt.edu/apply/ap-ib-credit/<br>There are some research focused bio lab options available to first semester freshman students at Pitt.<br>http://www.biology.pitt.edu/undergraduate/intro-research-courses<br>Congratulations on the Helen Faison Scholarship!<br><br>", "<b>Username: mommdc</b><br><br>Since your scholarship at Pitt covers room and board, find out if your housing deposit of $325 is waived, and if you have guaranteed housing on campus for 4 years.<br><br>", "<b>Username: itsgettingreal17</b><br><br>Yes to both.<br><br>", "<b>Username: Zinhead</b><br><br>Vandy’s premed acceptance rate is 66 percent. That is not encouraging for such a highly ranked private school. FWIW, ND and WashU, schools at Vandy’s level, claim an 80+ percent acceptance rate. .<br>https://as.vanderbilt.edu/hpao/documents/2014_Annual_Report.pdf<br>The counter argument is that the OP will probably not get to med school at either Pitt or Vandy, so Vandy might offer better non-med school opportunities than Pitt.<br><br>", "<b>Username: ClarinetDad16</b><br><br>OP you have already shown you can beat the odds, earning two great scholarships to two solid schools.<br>I am not sure what profession your parents are in or perhaps those helping advise you personally.  They should be your primary resources in this decision process,<br>Throughout life, your goal will not be to always minimize cost.  Sometimes things that cost more will provide a greater return.  That can include the college you attend.  All schools are not equal and some will fit you better and help provide a better outcome.<br>Perhaps also if cost is a concern you can agree with your parents to have skin in the game and take student loans for $26,000 over the four years, effectively covering half of the cost difference between schools.<br><br>", "<b>Username: carachel2</b><br><br>Congrats! You have some amazing opportunities. Word on the street is that Pitt goes out of their way to help you create some opportunities you may not get at other schools with research and such.<br>Will your parents be finding medical school also? If you took the full ride, how much do they say they would help for medical school?<br><br>", "<b>Username: ChilliLL</b><br><br>Appreciate all the suggestions and kind words. My father is a physician and he said he is willing to help fund my education.<br>@mommdc I was thinking that I don’t cash in many of my AP credits so I can retake the equivalent courses in college so I will have a rock solid understanding of the subject, be ahead in the class, and hopefully do well in these classes to help boost my GPA.<br><br>", "<b>Username: ChilliLL</b><br><br>@carachel2 I haven’t asked my parents specifically how much they will fund for medical school, but my brother is currently in medical school and my parents are only partially funding him, so he currently has some debt<br><br>", "<b>Username: carachel2</b><br><br>Hmmm. That would definitely be something I would bring up! If taking the full ride means they will fund more $$ of medical school and you would have less debt then that’s something to consider.<br><br>", "<b>Username: mommdc</b><br><br>Yes, it’s fine if you want to take Gen Chem 1 and 2 and Gen Bio 1 and 2. And med schools might expect you to take certain prerequisites in college, not from AP credit.<br>But you might still be able to use some of the other credits for English, Calc, History and Econ, and create some flexibility in your schedule, to study abroad, maybe pursue some additional interests.<br>Your advisor can help with that.<br><br>", "<b>Username: mom2collegekids</b><br><br>&lt;&lt;&lt;<br>Vandy’s premed acceptance rate is 66 percent. That is not encouraging for such a highly ranked private school. FWIW, ND and WashU, schools at Vandy’s level, claim an 80+ percent acceptance rate. .<br>&lt;&lt;&lt;<br>The devil is often in the details.  We don’t know if Vandy lets anyone apply and/or if WashU and ND strongly discourage some from applying.<br>And, really, the acceptance rate isn’t really that relevant.  Likely all of these schools have 3-4 times the number of frosh premeds than what actually end up applying to med schools.<br>the student needs to visit both and decide.<br><br>", "<b>Username: woodsmom</b><br><br>I’d definitely tour both because you have two very good schools at very affordable prices with your scholarships.  I’d also add as a Pitt parent that there are many research opportunities available at Pitt if that is important to you.  As well as  support and advising from the Honor’s College, including assistance if you decide to pursue competitive international internships.<br><br>", "<b>Username: Zinhead</b><br><br><br>\"\"<br>The devil is often in the details. We don’t know if Vandy lets anyone apply and/or if WashU and ND strongly discourage some from applying.<br>\"\"<br><br>That is an interesting question. You can pull the total number of applicants from the following table. Note that this includes re-applicants, which in Vanderbilt’s case increased the total of applicants from the 180 first-time applicants.<br>https://www.aamc.org/download/321458/data/factstablea2-7.pdf<br>Vanderbilt  - 280 applicants from an undergrad of 6,880 or 4.1%.<br>WashU - 393 applicants from an undergrad of 7,500 or 5.2%.<br>Notre Dame - 277 applicants from an undergrad of 8,450 or 3.3%.<br>Judging from the above and assuming that each schools starts out with the same percentage of premeds, ND seems to be restricting applicants the most, and WashU the least.<br>BTW, Pitt had 283 applicants, but I did not find anything about their success rate.<br><br>", "<b>Username: happy1</b><br><br>Agree with @mom2collegekids  From what I have gathered some colleges will recommend all interested students for med school (group 1) and other colleges will go through a pre-approval process and only recommend students who they feel have a solid chance at being accepted (group 2).  So while a school in group 1 may have a lower acceptance rate to med school, the college could actually have better overall results. Without knowing exactly what is in the numerator and denominator of any ratio the statistics and comparisons between schools are not all that valuable.<br>@Zinhead I don’t think I would judge it form the total undergrad population.  For example ND has quite a large business school   (over 2000 undergrads I believe) compared to 0 undergraduate business students at Vandy which may well mean that ND has a smaller percentage of undergraduates interested in med school.  IMO you would need to find out how many students start off pre-med and how may eventually go to med school (which I’m guessing would be an impossible task).<br><br>", "<b>Username: mom2collegekids</b><br><br>@Zinhead Thanks for the data…<br>I still don’t think that indicates anything “bad” about Vandy.<br>What are the links for the ND and Washu rates?<br>These published rates can be so confusing.  Some schools include DO schools in their reporting %'s.<br><br>", "<b>Username: Zinhead</b><br><br>@mom2collegekids - I don’t have links, but do remember that both schools claimed an 80+ percent acceptance rate when we visited.<br><br>", "<b>Username: akiddoc</b><br><br>I don’t know how this is even up for debate. Unless you hate the culture at Vandy - which is possible - go there. Med schools are much more likely to take kids from big name private schools. That’s just a fact. Premed admission rates are useless. You don’t know who is in the denominator. But I can tell you who is in the numerator.<br>When presented with a kid with a 3.9 from Pitt or a 3.6 from Vandy, who do you think med school admission comittees are inclined to take? The Vandy kid. I went to one of those big name private schools and I had a huge advantage in med school admissions. I had a ridiculous number of choices. It probably isn’t fair, but that is the way it is. I know a kid who recently got into a solid med school with a 3.15 from Stanford. Great published research, high MCAT, bad grades.<br>Most of the top end med schools are not impressed with Bio majors. They’re a dime a dozen. I double majored in Bio and Philosophy. The only thing my interviewers wanted to talk about was the Philosophy major. They know you have taken the premed courses. They know your grades in those courses. They are more interested in whether you can think outside the box. I shouldn’t have bothered finishing the Bio major. I should have studied abroad for a quarter instead.<br><br>", "<b>Username: mommdc</b><br><br>Never mind<br><br>", "<b>Username: hzhao2004</b><br><br>Personally, I believe Vandy is worth $15k over Pitt.<br><br>", "<b>Username: itsgettingreal17</b><br><br>@hzhao2004  Herein lies a big problem I have with such advice. Only in very rare circumstances is any school worth $X more than another as a blanket generalization. The answer is almost always it depends.  Earlier posters are giving the OP good advice on the various considerations for his particular situation.  Blanket statements like yours are not helpful to anyone, imo.<br><br>", "<b>Username: MYOS1634</b><br><br>Vandy for 15K is a fantastic deal. I wouldn’t be lured by a free ride since Vandy is affordable. The resources at your disposal will be much greater there, as will support and opportunities. Vandy is a resource-rich school, Pitt is a public university, they don’t have the same “budget” for their undergraduates.<br><br>", "<b>Username: splokey</b><br><br>It really depends on the context of your family’s financial situation.  To some families, $15 k per year is really just pennies, but to others it is a lot of money that makes a difference in what they have to sacrifice to pay it.  If the $15k doesn’t have much impact on your family’s lifestyle or cause them to make much sacrifice, I would go to Vandy – BUT ONLY IF UPON HAVING VISITED BOTH INCLUDING SAT IN ON AT LEAST ONE CLASS AT BOTH, you clearly feel you fit better and prefer Vandy.  If, on the other hand, it represents a financial impact that they will really feel, then I would go to Pitt.<br><br>", "<b>Username: hzhao2004</b><br><br>@itsgettingreal17 That’s why I qualified my statement by “personally”.  And I do feel that, unless you are from a family hovering around poverty line, most middle class people can afford $15k a year for college.<br><br>", "<b>Username: itsgettingreal17</b><br><br>@hzhao2004 My post totally went over your head.<br><br>", "<b>Username: DonnieDarko1911</b><br><br>@ChiliLL Touring will probably yield best results. If you got to Mosiac and determine that you like Vandy, then it’s probably worth going there. If you do get Full tuition at Washu, then you’ll probably want to go there. In the end, there isn’t much difference between Vandy and Washu premed to argue one or another. Either way, good luck with your choice.<br><br>", "<b>Username: mommdc</b><br><br>NIH research funding report for fiscal year 2017 lists $14 million for Vanderbilt and $50 million for Pitt.<br>https://report.nih.gov/award/index.cfm?ot=&fy=2017&state=TN&ic=&fm=&orgid=&distr=&rfa=&pid=#tab1<br>https://report.nih.gov/award/index.cfm?ot=&fy=2017&state=PA&ic=&fm=&orgid=&distr=&rfa=&pid=#tab2<br><br>", "<b>Username: mom2collegekids</b><br><br>Since the student has indicated that his family can afford the $15k per year at Vandy, then super.  If he visits and likes it more than UPitt then he’ll know where to enroll.<br>Earlier in the thread, we didn’t know what his situation was except that earlier he was looking for free rides, so it did appear that money was an issue.  Even if some here think that $15k per year for Vandy is THE way to go, if that had meant his family co-signing $60k of undergrad loans for him, then that wouldn’t have been best.<br>There’s really no argument here.  The OP will visit and decide.<br><br>"]}