{"title": "tulane vs alabama vs wisconsin madison", "comments": ["<b>Username: ead8795</b><br><br>I was recently accepted into these three schools with an intended major in Political Science. I have yet to visit any of the campuses, but they all look beautiful and seem to offer good programs within the Poli Sci major. I am very conflicted, though and have no idea where I would go from these three.<br>I would be in the honors college at Alabama with a full ride, got a $27,000 scholarship from Tulane (tuition would only be about $22,000), and no scholarship or honors at Wisconsin, which would be about $32,000, since I’m OOS.<br>Pros and Cons of each school? Which one is best for Poli Sci? If I want to go to grad or law school after, which one would “look best”? Any other things to keep in mind for the schools?<br><br>", "<b>Username: Jpgranier</b><br><br>Saving 36-45k a year for grad school would be an amazing option (the amount you’d save attending Alabama over others). Do you have a budget on either how much you can spend on your undergrad or law school?<br>Side note: how did you receive a “full ride” scholarship to Alabama? Alabama also has a top 30 law school, so if you finish your undergrad before your scholarship is up, you could use the remaining semesters of scholarship toward your law degree.<br><br>", "<b>Username: ead8795</b><br><br>@Jpgranier I scored a 32 on the ACT and have above a 3.5 GPA, so I was selected as a Presidential Scholar! I also don’t have a budget really, just trying to get the best deal I suppose, while also taking into account that I’ll likely pursue education beyond an undergrad degree<br><br>", "<b>Username: carachel2</b><br><br>@ead8795 --you don’t have a budget? So your parents have said they can easily pay for any of these schools without loans?<br>You got a full-tuition scholarship to Alabama. A full-ride would be an offer that includes room and board. You will still have to pay for room and board which most people estimate to be from 14-18K (depending on your dorm selection, etc.).<br><br>", "<b>Username: ead8795</b><br><br>@carachel2 sorry that’s what I meant! my bad! and by no budget I mean that the price isn’t a super huge factor for these schools, and I wanted to focus more on the academics and student life of each of the schools<br><br>", "<b>Username: Sportsman88</b><br><br>Have you visited the schools? Can’t speak for Wisconsin-Madison but Tulane and Bama are quite different schools.  Large sports oriented state university compared to much smaller private.  NOLA vs Tuscaloosa just as stark of a difference.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Biased, since I have a kid at UW, but – one advantage to consider with UW is the opportunity to intern in government during the school year since Madison is the state capital. While law school admissions looks first and primarily at gpa and LSAT scores, extra curriculars are relevant.<br>At the same time, someone serious about law school is likely looking at substantial law school loans, so minimizing undergrad debt is a priority.  Full tuition at Alabama is nothing to sneeze at. As a parent, I’d have a very hard time  paying almost $100,000 more for undergrad, especially if that money could be put towards law school tuition instead.<br><br>", "<b>Username: jym626</b><br><br>@ead8795 - your scholarship at UA is a full tuition scholarship, NOT a full ride. You will still have room/board/additional fees to pay.<br><br>", "<b>Username: jym626</b><br><br>Easy mathematical calculation. Take the full cost of attendance for each school, subtract the scholarship you were offered, and that will be the net price your family will have to pay. If you’re looking for the “best deal” that’s an easy way to calculate it<br><br>", "<b>Username: mom2collegekids</b><br><br><br>[QUOTE=\"\"]<br>\"\"<br>\"\"<br>would be in the honors college at Alabama with a full ride, got a $27,000 scholarship from Tulane (tuition would only be about $22,000), and no scholarship or honors at Wisconsin, which would be about $32,000, since I'm OOS.<br>&lt;&lt;&lt;<br>\"\"<br>\"\"<br>[/QUOTE]<br><br>You aren’t mentioning the room, board, fees, books, etc costs at any of these schools.<br>Alabama would cost you about $15k per year,…about $60k total<br>Tulane would cost you about $37k per year…about $155k total<br>Wisconsin would cost you about $47k per year…about $200k total<br>And then about $200k-250k for law school??<br>Unless your family is very affluent, choosing an extra $150-200k is kind of crazy, because law school will be another $200-275k<br>Alabama has a very fine Poly Sci program and an excellent law school.<br><br>", "<b>Username: homerdog</b><br><br>It sounds like the OP can afford any of the options. When is it about more than the cost? These three schools are vastly different from each other. The student has to live at school for four years. I’m not sure the same person could be equally happy at Tulane, Alabama, and Wisconsin. If visiting all three is an option, I would do so. Try to sit in on the Poli Sci classes while you’re there.<br><br>", "<b>Username: jym626</b><br><br>I think (will have to double check this) that the automatic merit scholarships at Tulane are fixed (eg you got $27k/yr) so even if tuition goes up, your merit award will stay the same over the 4 years. Maybe you’ll get a departmental scholarship to offset it, but keep this in mind, as it differs from schools (including Tulane) that offer full tuition scholarships that  typically then increase with any increase in tuition.<br>So, t a BIG school (with a smaller honors program within it) or a medium sized school? Did you get into the honors program at Tulane?<br>U Wisconsin is a great school, but the climate is quite different and have heard they have had some funding issues that could affect faculty, class size, etc.<br><br>", "<b>Username: mom2collegekids</b><br><br>&lt;&lt;&lt;<br>The student has to live at school for four years. I’m not sure the same person could be equally happy at Tulane, Alabama, and Wisconsin. If visiting all three is an option, I would do so. Try to sit in on the Poli Sci classes while you’re there.<br>&lt;&lt;&lt;<br>Could be true that a student wouldn’t be equally happy at any 3 different schools, even if they were on the same street. Lol<br>Yes, try to visit each school to get a feel and do sit in on some classes.<br>For Bama, contact the honors college and ask for them to set up your visit to classes and your campus tour/visit and see the dorms.  Susan.dendy@ua.edu jordanmhall@ua.edu. Send your email to both HC people…and give the dates you’ll be on campus, your major, your interest in sitting in PolySci classes your stats, and anything else you’d like to visit, including the law school if desired.<br><br>", "<b>Username: Chardo</b><br><br>Most kids think they have no budget…until the parents actually see the bill.<br>I have two kids that would have been equally happy at Tulane, Alabama, or Wisconsin.  Unless you have mentally pigeonholed yourself into a specific type, most kids will enjoy a variety of campuses.  A common theme from my experience is that students at Alabama and Tulane absolutely love being there.  I can’t speak to Wisconsin, but based on some friends of mine, I suspect it’s the same.<br><br>", "<b>Username: MYOS1634</b><br><br>Is your final cost at Tulane 22k Orbison that tuition only?<br>Can you speak 'budget’with your parents asap?<br><br>", "<b>Username: mom2collegekids</b><br><br>^^^^^^<br>That is his “tuition only” net cost.<br>None of his estimates included R&B and books,fees, etc.<br><br>", "<b>Username: EarlVanDorn</b><br><br>My son and I are trying to decide together between Alabama, Tulane, and Georgia, and he essentially has the same scholarships as you (Tulane gave him $32,000 instead of $27,000).<br>First, did you apply for the Paul Tulane or Dean’s Honor Scholarships? These are going to be announced in the next week or two. My guess is you need an ACT of 34 or higher to have a good chance on these, but they give full-tuition at Tulane. Another factor to consider is how much dual enrollment and/or AP credit you have. The Alabama scholarship is for eight semesters, both graduate and undergraduate. The Tulane is for undergraduate only. So if you are starting college with a lot of college credits, this could be important.<br>I would scratch Wisconsin from your list. I just don’t see it being worth the extra cost when compared to Tulane or Alabama.<br>The biggest pro for Alabama is that it is tuition free and the scholarship rolls over. They will also allow you to use the full amount of your scholarship for study abroad. So you can spend a summer or semester abroad and have $13,500 to spend towards expenses. Tulane also applies your scholarship to study abroad, but they charge full tuition and then they pay for the program. So you don’t get a “cheap” semester by studying abroad.<br>Alabama has a mission to educate the average folks from in state, so their 25-75 ACT scores are 23-31 (SAT R490-610, M490-620); in other words one-fourth of the student body is brilliant, the next quartile reasonably smart, and the bottom half just bumbles along (Ole Miss has a similar distribution, probably with fewer smart students). Princeton Review ranks it #3 as having the Least Accessible Professors. It’s a very big school, and I think it could be easy to get lost in the crowd. The dorms are extremely nice, and I think the food is supposed to be pretty good. In any given year you have a reasonable chance of playing for or being the national champion in football, if that’s something you like.<br>Tulane has a 25-75 ACT score range of 29-33 (SAT, R620-710, M630-710), so you’re dealing with a campus where everybody is pretty smart to brilliant. This can be good and bad when grubbing for grades. Princeton Review ranks Tulane #1 in the nation for community involvement; also #1 for hard liquor, #6 for best quality of life; #9 for party schools. Make of these what you will. As a practical matter, your chance of getting a minor in possession in New Orleans is virtually nil. It’s illegal for 18-year-olds to buy alcohol, but if they are in a house with a bunch of alcohol it’s perfectly legal for them to drink it. (So it’s against the law to sell or give it to them, but they have the right to possess it!). On the down side, New Orleans can be a dangerous city. The Tulane campus is safe, but it’s not necessarily wise to walk alone late at night, save perhaps to the streetcar stop. The dorms at Tulane are reportedly not as nice as those at Alabama, and I don’t think Tulane has student recreation and weight facilities that are as nice as those at Alabama. Alabama has a stronger Greek system than Tulane; Tulane has lots of Greeks, but their Greek affiliation is less important than at Alabama.<br>I’ve taken a lot of verbage to say all this, but if money is absolutely no object, I think I’d be inclined to think Tulane would be the better choice for a political science major. With that said, you really need to visit both of these campuses. They are very different places and you shouldn’t decide without visiting. My son still doesn’t know what he wants to do and will be visiting both for a second time in the next few weeks, plus making a trip to Georgia…<br><br>", "<b>Username: mom2collegekids</b><br><br>&lt;&lt;&lt;<br>So you can spend a summer or semester abroad and have $13,500 to spend towards expenses.<br>&lt;&lt;&lt;<br>this is huge…a wonderful deal.<br>I don’t think that there are any/many summer/semester abroad programs where that much money wouldn’t cover airfare, tuition, housing, and spending money while abroad.  The only one I can think of that would cost more is Semester at Sea, but that’s an unusual one.<br><br>", "<b>Username: jym626</b><br><br>If you hurry (deadline is very soon) you can apply to the Altman program at Tulane, A FABULOUS program for students interested in business and international relations… I believe there are 2 study abroad components, it offers fabulous opportunities and $$$$. Look into it. Its pretty selective, but you sound like a potentially good candidate (criteria ares strict though --you need to be fluent in 2 languages, have taken around 12 APs, etc). Also, if you are a poli sci major, you can apply to  take a class with James Carville.  And his wife  Mary Matalin has been reported to pop in.  BTW Tulane has cracked down on campus drinking.<br><br>", "<b>Username: jym626</b><br><br>And some of what EVD has said is not quite correct about Tulane.  The late FC’s daughter had the DHS scholarship (as did my son). FC’s daughter stayed an extra semester in part , IIRC, because she double majored and had the semester abroad and may have stayed on in Asia-- cant quite recall. Regardless, Tulane extended her DHS to cover tuition for the extra semester. She graduated in December (rather than May) and her tuition was covered all the way through.<br><br>", "<b>Username: jym626</b><br><br>Here is info onthe Altman program. http://www2.tulane.edu/altman/  It does provide study abroad funding-- and more…  It is an incredible opportunity.<br>If finances are not the final decision, IMO political science opportunities and the experiences you will have in NOLA are not going to be found anywhere else.  Yes there are some safety issues in son areas off campus, but that is true at lots of schools (Johns Hopkins, U chicago, Ga Tech, Clark, USC, etc.)<br><br>", "<b>Username: EarlVanDorn</b><br><br>@jym626 That is a very interesting program. I’ve got to say that I don’t think the program requires 12 AP classes, but rather 12 AP credits. So BC Calc with 8 credits and English with 4 credits would probably do the trick. Very few schools offer 12 AP classes.<br>My son will have 15 AP credits (Tulane doesn’t recognize World History!) and will select 15 dual enrollment credits from 39 that he has taken; so he would be a good candidate, as he has taken all the classes they want. But he chose not to take AP German this year after his National German Test score was one of the lowest in the class. I’m not sure he has much faith in his ability to learn a foreign language to full fluency. I’m going to tell him about the program anyway.<br><br>", "<b>Username: jym626</b><br><br>Your kid isnt looking at business/ Int’l relations, is he? I was suggesting this program to the OP.<br><br>", "<b>Username: jym626</b><br><br>I forget which scholarship your kiddo got at UGA, @EarlVanDorn , but IMO, short of the Foundation Fellows, if someone  was lucky enough to get into the Altman, they should take the opportunity.  Admit rate is about 15%. And While yes, the site says 12ish AP credits (not classes) the more the better to be competitive and able to manage the demands of this challenging curriculum/double major.<br><br>", "<b>Username: jym626</b><br><br>IIRC your kiddo plans to major in accounting? Thats not an option with the Altman- there is a finance major and an Econ major, but no accounting.<br><br>", "<b>Username: EarlVanDorn</b><br><br>@jym626 Tulane doesn’t offer an undergraduate degree in accounting. Students earn a business degree that includes accounting courses and then enroll in the Master’s of Accountancy program for their fifth year.<br>If my son goes to Alabama or Georgia, he is going to have a double major of accounting and something else. Obviously he can’t do that at Tulane. With the Altman program he could have an economics and finance major and then wrap it up with the accounting master’s, so it might work out well.<br>At Georgia my son merely got an OOS waiver plus $3,000. The Georgia accounting program is very good, but I’m not sure the “fit” as Georgia would be as good. He has not visited Georgia, and that’s coming up soon.<br><br>", "<b>Username: jym626</b><br><br>Is the UGA accounting program in the Terry college of business? There is not a direct admit to  Terry.<br><br>", "<b>Username: jym626</b><br><br>Yes, @earlvandorn- the undergrad business school at Tulane (known as “AB Free”) has finance. Would assume there is an option to apply for the MBA at tulane after the Altman but that would be a lot to take on.  The altman is pretty comprehensive, with summer programs, etc.<br><br>", "<b>Username: jym626</b><br><br>It does not look like you can do the joint BSM-MACCT program while also doing the Altman. The altman itself is a double major with a pretty packed schedule.  It might be possible, but not sure.  However, from their website:<br><br>\"\"<br>A. Among business majors, the accounting major is not possible because it is a five-year program, while the Altman students are expected to graduate in 4 years. At the current moment, only those Liberal Arts majors listed on our website are electable. Others offered by Tulane are not possible either because they do not fit the Altman Program’s curricular timeframe or do not have sufficient international focus<br>\"\"<br><br>Doesn’t mean the student couldnt take a 5th year to get the Masters, but only if all the necessary courses expected to be completed by year 4 were, and it may be too hard to get all those classes in.<br><br>", "<b>Username: obsessedwcollege</b><br><br>If you’re sure you have no budget, go with the school that’s the best fit for you. I’d say Tulane and Wisconsin are the stronger schools. Law school primarily looks at your GPA and LSAT, but if you change your mind and decide to do something else it might be nice to have a degree from a more prestigious school. If you’re set on law school, I’d say simply pick the school you like the best.<br><br>", "<b>Username: jym626</b><br><br>OP, what say you?<br><br>", "<b>Username: Booajo</b><br><br>My daughter loved Tulane last year, but when you add in the R&B plus assume the continued increasing tuition, decided the debt wasn’t worth it. Know Wisconsin well–different in many ways, although both schools score high on “party” lists! Don’t know Alabama well enough to comment.<br>If money is no issue, seems crazy not to visit all 3 places and see for yourself.<br><br>", "<b>Username: jym626</b><br><br>Crickets from the OP. @EarlVanDorn is your kiddo looking into the Altman? Would be curious to know if they’d allow it along with the combined BSM/MACCT program. It’s only a 4 yr program so don’t know if they’d allow it with someone wanting to do a 5 yr program.<br><br>", "<b>Username: juillet</b><br><br>At Alabama, does full ride to you mean full tuition or a truly full ride that covers room and board?<br>Either way, M2CK broke it down quite nicely. Alabama is a great school, and importantly, it’s going to save you tens of thousands of dollars over the course of 4 years. You still get a high-quality education. A fully covered summer of study abroad for a political science major is huge, too. Lots of students don’t have the option of studying abroad over the summer because it’s prohibitively expensive.<br>If you’d have to borrow the excess, this is a no-brainer - Alabama. Taking out $150K+ for undergrad is a losing proposition.<br>But even if your parents could cover the costs, unless they’re so wealthy that this would be a drop in the bucket for them each year, I still think you should select Alabama. The extra money could go towards other things, and Alabama is a great school.<br><br>", "<b>Username: EarlVanDorn</b><br><br>@jym626 My son is going to inquire about the Altman. He has three years of high school German. He did not take AP German because he is taking a very tough college course this year (intermediate accounting). I told him if he was selected I would let him go to Germany for three or four weeks this summer in hopes that he might pick up a bit, although picking up German really isn’t like picking up French or Spanish.<br>Anyway, I think he is going to enter Tulane with the maximum of 15 dual enrollment hours plus 15 or 18 AP hours, which turns the Master of Accountancy degree into a four-year plan.<br>@juillet People often mistype and refer to Alabama as offering a full ride when what it offers is automatic full tuition for anyone with a 32 ACT and 3.5 g.p.a. In rare instances Alabama gives additional scholarship money, but the free tuition is their thing and where they put all their money.<br>There are a lot of folks at Tulane who choose to pay half-tuition of about $25,000 rather than go to Alabama for free, so I wouldn’t say the choice is a “no-brainer.” My son was offered $32,000 at Tulane, and we’re giving serious thought to paying the $19,000 difference rather than take the free Alabama offer. We’re also going to carefully consider Georgia with an OOS tuition waiver at $9,000 per year. In my opinion the three schools offer very different potential experiences and opportunities, and I’m not out to just grab the lowest price – although that may very well be what we end up doing in the end.<br><br>", "<b>Username: jym626</b><br><br>Definitely worth checking out the Altman, @EarlVanDorn. One never knows who’s applying and what they are looking for each year. If he is pretty fluent in German he should be a viable candidate. If he gets in you owe me a drink <br>I also agree with you that Georgia and Alabama are quite different from Tulane.  A student  will get a very different experience at Tulane than they would at UGA or Bama. If a student is considering business, they will have to apply to the Terry school of business at UGA in their sophomore year and there is no absolute guarantee they will get in. In contrast admission to Tulane it’s an automatic admission to A.B. Free.<br>We are in state for Georgia but neither of my kids wanted a huge university experience and neither applied to UGA. Both were national merit finalists and Alabama called him and encouraged him to apply and take the full ride (not full tuition full ride) scholarship at Alabama. Again he wasn’t interested in a big university, and for religious reasons it was not a strong competitor at the time either. So there are a lot of factors that go into these decisions. Certainly finances are a huge one but fortunately for some families it may not have to be the deciding factor. My younger son thought he wanted to go into medicine and was certainly sensitive to financial factors. Fortunately for him he got a full tuition scholarship (The full ride scholarships were not available at that time) at Tulane and that, combined with his national merit scholarship money, made Tulane cost us just a bit LESS than it would have cost for us to send him in state to UGA. Older son got into Georgia Tech (back then it was his safety school LOL) but also chose a smaller environment that was a better fit for him. Also back then, he was interested in physics, wanting to pursue practical physics, but the department at Tech was more theoretical which wasn’t a good fit for him. Both of my sons ended up switching into engineering, and if younger son had been at UGA, back then they had no engineering so it would have been a bad fit, possibly requiring a transfer. So these are all important variables to consider when one makes the decision for the best option for themselves. So again these are all important factors in making decisions about the best school choices. Good luck to your son and his decision.<br>It seems the OP must have made their choice or taken a break. Would be curious about their thoughts. Agree with everyone that going into large debt (eg over 100k) is not a good idea for undergrad. But if families can allow their student  options that do not cause a financial pinch, so much the better.  And entering at the sophomore level (with AP/dual enrollment credits) helps with access to registration earlier, etc.as one registers with the class above them.<br>IIRC, Wisconsin is facing some financial issues these days. DH attended UW, so am familiar with it, though haven’t been up to Madison recently. But have been reading about the  financial concerns there.  For anyone in journalism, DH’s relative  endowed a journalism scholarship at UW <br><br>", "<b>Username: jym626</b><br><br>Oops too late to edit above. I  meant to give a lower # for debt. The old adage is if one has to take out loans, one should not have more college debt than they expect to earn their first year in the working world. The average student loan debt  at graduation last year was just over $37K. Thats not unreasonable for most people. Of course debt free is much better!<br>Also, the curriculum for the Altman is pretty structured, IIRC, so even with all the incoming credits, if they don’t fit easily into the program, the Masters degree might still be not doable in 4 years with the Altman.<br><br>", "<b>Username: EarlVanDorn</b><br><br>@jym626 You’re on for the drink.<br>As I said, my son will be coming in with at least 33 credits, maybe more. It sounds like they will accept more than 15 college credits if the credits aren’t included on the high school transcript; if so, my son could probably start with 45 credits, although I’m not sure all of them would be useful (if he goes to Alabama he will start with something like 67 credit hours).<br>For his first year his only required classes will be the Altman tides class and a language class; he will already have credit for the other classes, which should let him jump ahead. He’ll just have to ask.<br><br>", "<b>Username: jym626</b><br><br>The deadline for the early round of the Altman is soon. If possible, better to get that app in ASAP. He can apply and contact the program head simultaneously. Definitely better to be in the early read group, IMO. You can buy me that drink when you come through town to go check out UGA. As long as we do not talk politics.<br><br>", "<b>Username: juillet</b><br><br><br>\"\"<br>My son was offered $32,000 at Tulane, and we’re giving serious thought to paying the $19,000 difference rather than take the free Alabama offer. We’re also going to carefully consider Georgia with an OOS tuition waiver at $9,000 per year. In my opinion the three schools offer very different potential experiences and opportunities, and I’m not out to just grab the lowest price – although that may very well be what we end up doing in the end.<br>\"\"<br><br>I suppose that my question is - why?<br>I admit that my opinion is completely colored by my experiences and background; I come from a working-class background and high school where I and nearly all of my classmates were first-generation college students. Money was THE most important factor in choosing a college, and most of us chose the place where we got a scholarship or that was in-state affordable because we had no other options. We learned to look at and think about reputation and prestige very broadly, too. Even though I’m 30 now, and approaching my 10-year college reunion, I have yet to shake that upbringing. In fact, if anything, it’s strengthened - my high school friends have gone on to become doctors, lawyers, engineers, scientists, professors, and other great professions even though only one that I can remember off the top of my head went to a college in the top 50 (well, a large handful went to Georgia Tech, because I’m from Georgia).<br>I suppose if I came from a wealthier family and/or a family where one or both of my parents attended college, I might have a different outlook. I’m not saying that top colleges have no influence or experiences that might be worth more money - I went to Columbia for graduate school and worked with undergrads, so I saw the very stark differences in the resources they had access to (and that I had access to!) vs. what I had at my undergrad college (an excellent LAC in the top 100, but not top 50, of USNWR). There’s a certain amount more I’d be willing to pay for my own kids to attend a top college. I don’t know what that amount is because it’s all hypothetical because I have no kids, lol.<br>Still - $80-100K is a lot of money. And Alabama is an excellent school. I suppose I’m just wondering what outcomes such families might think are worth the extra $80-100K. I don’t necessarily think a Tulane graduate will earn $100K more over her lifetime than if she had gone to Alabama, or that there are $100K worth better career opportunities out of coming from Tulane. Even the fact that you have to apply for the business major isn’t that big of a sway to me, mostly because students can major in a variety of fields and go into business.<br>And I’m genuinely curious! I’ve learned a lot about this at CC over the years.<br><br>", "<b>Username: jym626</b><br><br>Your question was posed to @EarlVanDorn but we made a similar decision so am happy to answer your question. One quick question first- where did you go for undergrad @juillet? Just wanting to look at it from both perspectives.<br><br>", "<b>Username: mom2collegekids</b><br><br>@EarlVanDorn &gt;&gt;&gt;People often mistype and refer to Alabama as offering a full ride when what it offers is automatic full tuition for anyone with a 32 ACT and 3.5 g.p.a. In rare instances Alabama gives additional scholarship money, but the free tuition is their thing and where they put all their money.<br>&lt;&lt;&lt;<br>Rare instances?  Lol.  There are over 700 NMF students at Bama with much more than just free tuition.  And there are 1000s there with add’l dept awards stacking with their tuition awards.<br><br>[QUOTE=\"\"]<br>\"\"<br>\"\"<br>There are a lot of folks at Tulane who choose to pay half-tuition of about $25,000 rather than go to Alabama for free, so I wouldn't say the choice is a \"no-brainer.\" My son was offered $32,000 at Tulane, and we're giving serious thought to paying the $19,000 difference rather than take the free Alabama offer. We're also going to carefully consider Georgia with an OOS tuition waiver at $9,000 per year. In my opinion the three schools offer very different potential experiences and opportunities, and I'm not out to just grab the lowest price -- although that may very well be what we end up doing in the end.<br>\"\"<br>\"\"<br>[/QUOTE]<br><br>Sure, there may be some folks at Tulane doing that.  There are folks at Alabama paying full or near freight rather than grab their HOPE or Bright Futures awards for a Florida, GA or Tenn school.  It happens.  Usually due to student choice and affluent parents willing to spend the extra bucks.  It’s not really a statement on their cheaper schools.<br>$80k more for Tulane?  For Accountancy?  If you’re fine with than, then super!  Necessary for accountancy?  No, not at all.<br>Alabama’s Accountacy ranking:  Ranked 8th best Accounting program in the nation by the 2015 Public Accounting Report, Masters and Ph.D. are both ranked 9th<br><br>", "<b>Username: jym626</b><br><br>If a student is paying full or near full freight at Alabama and did not meet criteria for much or any automatic scholarship money at UA, they probably did  not meet the requirement for HOPE or Zell Miller at UGA or bright futures at UF.<br><br>", "<b>Username: jym626</b><br><br>That edited incorrectly above. Should say  a student not qualifying for automatic tuition discounts at UA probably didn’t qualify for the GA or FL in state merit awards.<br><br>", "<b>Username: mom2collegekids</b><br><br>I don’t think the Hope and BF awards (tuition discounts) require that high of stats (high enough to get 1/2-full OOS tuition awards at Bama).<br>I was talking to a FL mom whose child did qualify for BF (dont know which level), but only got half tuition at Bama.  So, her costs are much higher than if she had gone to a FL school.<br><br>", "<b>Username: mom2collegekids</b><br><br>Is this still true for the larger Zell?<br><br>[QUOTE=\"\"]<br>\"\"<br>\"\"<br>A Zell Miller Scholarship recipient must graduate from high school with a minimum 3.7 grade point average combined with a minimum SAT score of 1,200 on the math and reading portions or a minimum composite ACT score of 26 in single national test administration and maintain a minimum 3.3 cumulative postsecondary grade ...<br>\"\"<br>\"\"<br>[/QUOTE]<br><br>If so, then a GA student could get full tuition Zell and get nothing from Bama.<br>An OOS student needs at least an ACT 30 to essentially come close to rivaling what they’d net pay at their home school.<br><br>", "<b>Username: jym626</b><br><br>Yes, the Zell requires a 3.7 and a minimum SAT/GPA . So yes, scholarship money available for instate students is frequently a lower bar than for OOS students. At UA an instate student needs only an ACT of 24 or new SAT of 1160 (1090 on the old SAT) and GPA of 3.0 to be eligible for scholarship consideration.<br><br>", "<b>Username: mom2collegekids</b><br><br>Right…but we’re talking about GA, Tenn, FL students giving up their instate Zell, HOPE, Bright Futures to attend an OOS public that costs significantly more.<br>It’s surprising, but it happens a lot.<br><br>", "<b>Username: jym626</b><br><br>Does it happen as often in the reverse? Would think it likely happens both ways. Are there programs/majors offering tuition reciprocity?<br><br>", "<b>Username: MYOS1634</b><br><br>Bright Futures requires a 26 or a 29 on the ACT depending on coverage.<br><br>", "<b>Username: jym626</b><br><br>Right- exactly.  People give up discount instate tuition for higher priced oos or private school tuition all the time. Thst is the point.<br><br>", "<b>Username: EarlVanDorn</b><br><br>@mom2collegekids Mom2college is absolutely correct that Alabama has generous National Merit scholarships, and I failed to mention these. Alabama and Oklahoma compete to see who can get the most National Merit scholars, and both schools offer a very good package that substantially exceeds full tuition. I wasn’t thinking about that package when I made my comment. With that said, Alabama offers very few scholarships over and above the free tuition to non NMF students. Ole Miss, which attracts far fewer NMF but gives a similar NMF scholarship, ends up giving out a lot of academic scholarships over and above tuition to those who don’t reach NMF status, as do a number of other schools. This was not intended to criticize Alabama, which has an amazing number of merit scholars.<br>I agree with you that Alabama has a very good accounting school, as does Ole Miss and Georgia. But I do think it’s possible that Tulane might be worth $80,000 more than Alabama, or that Georgia might be worth $36,000 more than Alabama, or, if my son should get an Ole Miss full ride, that Alabama might be worth $40,000 than Ole Miss. There are some factors involved beyond just the accounting degree. We’re just going to visit every campus again and make up our mind before May comes around.<br><br>"]}