{"title": "mit vs stanford", "comments": ["<b>Username: gunsofbrixton</b><br><br>assuming you were accepted to both schools, where would you go and why?<br><br>", "<b>Username: texas137</b><br><br>my son had this choice and picked MIT because of the tech focus and a feeling that a higher percentage of his classmates would be smart in the same way he is. Assuming you are actually accepted at both places, you should definitely try to visit before you choose. The atmosphere is very different.<br><br>", "<b>Username: mekpeacenfood</b><br><br>Let's be honest, at all of the top 5 sciences schools, you can get the same education. Period. They are also very similar in terms of research opportunity. You really won't find a lack of funding at these places. Matters of personal motivation, drive, committment, and (frankly) ability contribute much more than the professors, and your peers will be the same at both institutions.<br><br>And to be blunt, Stanford is in sunny California, has a much broader range of undergrads, and a richer set of activities for you to enjoy--sports, language dorms, wine country...<br><br>Stanford also has a huge alumni base, and strong respect across the nation.<br><br>No-brainer.<br><br>", "<b>Username: 56forceout</b><br><br>Let's REALLY be blunt, MIT is in Cambridge, MA, spitting distance to Boston, the best college town in the world. Period. MIT has students from 62 different countries in the class of 2009 alone and for undergrad range, MIT has this short list of colleges within walking distance:<br>Bay State College<br>Berklee College of Music<br>The Boston Architectural Center<br>Boston College<br>Boston Conservatory<br>Boston University<br>Bunker Hill Community College<br>Cambridge College<br>Emerson College<br>Emmanuel College<br>Fisher College<br>Franklin Institute of Boston<br>Harvard<br>Katherine Gibbs School<br>Lesley College<br>Longy School of Music<br>Massachusetts College of Art<br>Massachusetts College of Pharmacy &amp; Health Sciences<br>MIT<br>New England College of Optometry<br>New England Conservatory<br>New England School of Law<br>Northeastern University<br>Roxbury Community College<br>Saint John's Seminary<br>School of The Museum of Fine Arts<br>Simmons College<br>Tufts University<br>Urban College of Boston<br>UMass Boston<br>Wentworth Institute of Technology<br>Wheelock College<br>Rich set of activities nearby, yeah, Boston has that too. Some of the Frats are in foul ball range of Fenway Park, New House Dorm has cultural houses and hey, you are close to maple syrup AND Lobster country.<br>Alumni? Yeah, MIT has some of those too, and there are a few folks out there who respect MIT too.<br><br>You're right - No Brainer.<br><br>", "<b>Username: molliebatmit</b><br><br>My feeling (after interviewing this week at Stanford for a PhD program) is that the decision would have to be made on the basis of environment.<br><br>Stanford is in Palo Alto, which is a very suburban part of the Bay area. There are few other college students with whom to interact, and it's difficult to get into the surrounding area unless you have the luxury of keeping a car on campus. A friend of mine who went to MIT for undergrad and is now a grad student at Stanford said it's been the biggest hassle to go to the grocery store, since it's not within walking distance.<br><br>MIT is just across the Harvard Bridge from Boston, and if one were so inclined, it would be possible to go into the city every day. There are lots of other college students in the area (as 56forceout pointed out), and it's easy to get around the city without having to keep a car. (I think it's better not to have a car -- Boston drivers are crazy!)<br><br>I don't buy the argument that MIT students aren't well-rounded. MIT students can be as well-rounded as they're inclined to be -- we can freely cross-register at Harvard, the School of the Museum of Fine Arts, and Wellesley. Moreover, there are a wide variety of humanities and social sciences classes on campus, plus an extensive menu of extracurricular arts and athletics activities. (Did you know we have the second-largest number of NCAA-recognized sports teams in the country?) Check out the <a href=\"http://sisapp.mit.edu:7013/asa/student_group_search.do?action=viewall\" rel=\"nofollow\">variety of student groups</a>.<br><br>I don't buy any of mekpeacenfood's arguments -- Stanford and MIT have about the same number of undergraduate students (~6000 for Stanford vs. ~4000 for MIT), so there shouldn't be a difference in the size of the alumni network. MIT has plenty of student activities and possibilities for cultural education (we do have language dorms too), and we're very highly respected. We might not have wine country, but we have Landsdowne Street! :)<br><br>All things being equal (which they never are!) I'd encourage the OP to go to the environment which is the least like what he/she experienced growing up. It's good for dedicated east/west coasters to experience life on the other coast.<br><br>", "<b>Username: texas137</b><br><br>\"\"I don't buy the argument that MIT students aren't well-rounded. MIT students can be as well-rounded as they're inclined to be\"\"<br>I hope you don't think that I was arguing that MIT students are not well rounded. I totally agree with you! I have been very impressed with the well-roundedness of MIT students. But MIT is overall techier than Stanford. You don't go to MIT if you don't like math and science.<br><br>", "<b>Username: mootmom</b><br><br>I absolutely agree with you, molliebatmit: going off to college is a great time to try a new environment. We live 20 min. from Stanford, and I am very happy my son chose MIT, if only so he could experience a new and different part of the country.<br><br>(PS: It rains here all winter, and it snowed this past week. (!!) Wine country is a two-hour drive away, assuming you have a car and are 21 or over. Wineries *WILL* card.)<br><br>", "<b>Username: molliebatmit</b><br><br>\"\"I hope you don't think that I was arguing that MIT students are not well rounded. I totally agree with you! I have been very impressed with the well-roundedness of MIT students. But MIT is overall techier than Stanford. You don't go to MIT if you don't like math and science.\"\"<br>Nope, I was just disagreeing with just the popularly-held stereotype that MIT students aren't well-rounded, which I inferred from mekpeacenfood saying \"[Stanford] has a much broader range of undergrads.\"<br><br>I think that personally, I'm no wheel, but I don't think I'm flattering myself to say that I'd roll down a hill. Maybe I'd need a small kick. :D<br><br>I totally agree that someone who's on the fence about science and engineering in general should wholeheartedly go to Stanford. You shouldn't choose MIT if you're not pretty set on science, engineering, or business.<br><br>", "<b>Username: JLP</b><br><br>Seeing as that was my choice last year, I would go to MIT.<br><br>", "<b>Username: texas137</b><br><br>Although individual MIT students are a lot more well-rounded than the stereotype, I also agree with mefenpeace than Stanford has \"a much broader range of undergrads\". Both schools will have students interested in theater, French literature, or sociology, but Stanford will have a lot more of them. And at MIT, students interested in those things also love and are good at math/science/engineering. At Stanford they may dislike or be pretty bad at those things.<br><br>MIT wins more cross admits than they lose to Stanford, for whatever that's worth. Their whole applicant pool is probably different. I still think the best thing is to visit both and see where <i>you</i> fit it.<br><br>", "<b>Username: asdf123</b><br><br>stanford has a lot more school spirit though! MIT students tend to be ostensibly unhappy a lot - that's part of the ihtfp culture, and it's not necessarily healthy. on the other hand, i probably wouldn't argue that stanford students are 100% happy-go-lucky and carefree.<br>also, most mit students don't really interact that much with people from other schools (except BU, especially if you live at a fraternity) although there are definitely exceptions. also, practically nobody actually crossregisters at wellesley. (harvard is considerably more popular)<br><br>just some additional things to think about :-)<br><br>", "<b>Username: molliebatmit</b><br><br>\"\"MIT students tend to be ostensibly unhappy a lot - that's part of the ihtfp culture\"\"<br>I also think that's partly due to the difference between the east and west coasts.<br><br>", "<b>Username: sran</b><br><br>You forgot iltfp...<br><br>Additionally, at MIT you have a whole new paradigm of fun.<br><br>", "<b>Username: texas137</b><br><br>\"\"MIT students tend to be ostensibly unhappy a lot - that's part of the ihtfp culture\"\"<br>\"\"I also think that's partly due to the difference between the east and west coasts.\"\"<br><br>I dunno. I found the \"culture of shared misery\" to be much stronger at Caltech than at MIT. I think a lot of MIT students are having the time of their lives (I know my son is).<br><br>", "<b>Username: Shark_bite</b><br><br>Do you really expect anyone to pick Stanford on the MIT boards? That being said, I'd pick Stan, man.<br><br>", "<b>Username: mootmom</b><br><br>The OP posted the same query on the Stanford boards, and presumably will read the responses and ponder.<br><br>", "<b>Username: tech_fan</b><br><br>\"\"I found the \"culture of shared misery\" to be much stronger at Caltech than at MIT\"\"<br><br>I think as far as complaining about the work, the ordering goes Caltech > MIT >> Stanford. I also think this varies in pretty exact proportion with how much hard math/science the <i>average</i> (i.e. median) undergrad does.<br><br>", "<b>Username: mootmom</b><br><br>\"\"You forgot iltfp...\"\"<br>What? Doesn't IHTFP stand for \"I Have Truly Found Paradise\"? Don't burst my bubble, here!<br><br>;)<br><br>", "<b>Username: texas137</b><br><br>\"\"I think as far as complaining about the work, the ordering goes Caltech > MIT >> Stanford. I also think this varies in pretty exact proportion with how much hard math/science the average (i.e. median) undergrad does.\"\"<br>that's probably true. Still, not an east coast/west coast thing.<br><br>", "<b>Username: bookworm</b><br><br>I think the Caltech &amp; MIT kids are fairly interchangeable. Many people apply to both. Differences emerge when someone has to chose betweeen Stanford, H, or P for engineering or math/sciences. Best way to decide is to spend at least one overnight at each school. atmosphere is soooo different<br><br>", "<b>Username: mikemac</b><br><br>\"\"Stanford is in Palo Alto, which is a very suburban part of the Bay area. There are few other college students with whom to interact, and it's difficult to get into the surrounding area unless you have the luxury of keeping a car on campus.\"\"<br>The main part of this, stanford being in the 'burbs, is the key to understanding the difference in settings. MIT is at the door of a city, stanford is set in sprawling suburbia. A car at stanford is useful for getting around, something I think is universally true in suburbs.<br><br>However it IS possible to get around without a car. Possible does not necessarily mean easy or convenient, but it can be done without an incredible amount of hassle. stanford, for one, has a free shuttle bus system that goes to a few shopping centers in Palo Alto. See <url>http://transportation.stanford.edu/marguerite/MargueriteShuttle.shtml</url> And right at the edge of campus is a caltrain station, which is about a 1 hour ride to San Francisco (40 minutes weekdays on express trains).<br><br>", "<b>Username: Dragon45</b><br><br>I live in snowy Michigan, and have lived here for many snowy, snowy years. I'm originally from unsnowy India... needless to say, I hate- nay, despise- the snow. If by some miracle I get into both unsnowy Stanford and snowy MIT, I'm going to Stanford because it's in unsnowy California (with palm trees!).<br><br><br>Did I mention that Stanford doesn't get much snow?<br><br>", "<b>Username: mootmom</b><br><br>Just curious: if you despise the snow, why did you apply to MIT?<br><br>(PS: I live 20 min. from Stanford, and we got snow last week. ;) )<br><br>", "<b>Username: Dragon45</b><br><br>The open information culture and the immense intellectual energy that is so prevalent and palpable at MIT is what appealed to me more than any other school on my list. The snow did not.<br><br>I do not believe that the culture at Stanford is as good a fit for me as the culture at MIT, but the climate at Stanford is a far better fit for me than the climate at MIT.<br><br><br><br>And comeon, the snow isn't that bad in Palo Alto. I'm used to the snow (shorts and tshirts are standard attire for me during the winter here in Michigan) and I would probably be in a bathing suit in Stanford's so-called \"snow\". ;)<br><br>", "<b>Username: mootmom</b><br><br>Oh, no question: I was teasing about the snow, although we *did* get some.<br><br>Your reasons for applying to MIT are good ones indeed. Best of luck!<br><br>", "<b>Username: DiamondT</b><br><br>If you want to be around more diverse, more rounded students, go to Stanford.<br><br>Dont listen to anyone who tells you otherwise. MIT is mainly for homogenous math/tech students.<br><br>", "<b>Username: mootmom</b><br><br>\"Homogenous\"? Never.<br><br>", "<b>Username: molliebatmit</b><br><br>If you want to be around a non-well-rounded group of people, you can certainly find those at MIT.<br><br>However, you can find <i>plenty</i> of extremely well-rounded students at MIT, no matter what over-generalists like to say with no evidence to back them up. Did you know that we have 41 NCAA-recognized varsity sports teams (not to mention 800 club sport athletes and about 670 intramural athletic teams)? We have a wide variety of performing arts groups, both curricular and extracurricular.<br><br>Socially, we have twelve awesome dormitories, all with very different cultures, and you get to pick which one you live in. If dorm life isn't your thing, there are something like 26 fraternities (I always forget exactly how many; 50% of male freshmen pledged this year) and 5 sororities (about 25% of women join sororities, which are primarily social). Do you really think all those frat boys are pocket-protector-wearing geeks?<br><br>Scholastically, we are required to take (and in many cases enjoy taking) about one-fourth of our classes in the humanities, arts, and social sciences. Say what you will about homogenous math/tech students, but we're certainly required to take more humanities classes than the average humanities major is required to take of science and engineering.<br><br>As for \"diverse\", MIT has one of the highest numbers of low-income Pell Grant recipients, one of the factors that led us to finish first in <a href=\"http://lazowska.cs.washington.edu/wm.guide.htm\" rel=\"nofollow\">The Washington Monthly college rankings</a>. (Stanford finished fifth.)<br><br>Yeah, MIT was once a school for homogenous math and tech students. In the 60s. Now it's a school for smart people who want to do cool stuff.<br><br>", "<b>Username: BirdloverFla</b><br><br>stanford is stunning but i heard there is little community there- more of a transient school- please explain this if this is true thanks.<br><br>", "<b>Username: mootmom</b><br><br>You might get a more relevant response to your query if you posed it on the Stanford discussion board.<br><br>", "<b>Username: 3togo</b><br><br>Two absolutely great schools and places to go to college ... and they couldn't be more different ... visit them both and your preference will be obvious in no time at all.<br><br>", "<b>Username: asdf123</b><br><br>haha not necessarily, sometimes the huge difference makes it harder to decide since they're so not comparable.<br><br>", "<b>Username: asdf123</b><br><br>well stanford has a more athletic culture in general; if you want big football games that the student body rallies around, they don't exist at MIT.<br>also, many MIT alums who graduated a long time ago probably don't feel as good about it, since only recently has it begun to focus on improving student life.<br><br>", "<b>Username: molliebatmit</b><br><br>But if you actually want to participate in varsity sports rather than just sit on the bleachers and watch, MIT offers that opportunity where Stanford likely wouldn't. We're division III, so often anyone who wants to participate is able.<br><br>I've met many older alums (who are now professors at other schools) on my grad school interviews, and they all recall their MIT years fondly.<br><br>", "<b>Username: sakky</b><br><br>GracieLegend, it's one thing to disagree with somebody. It's quite another thing to engage in personal insults. Flinging around terms like \"fool\" and \"moronic\" are not illuminating to anybody.<br><br>", "<b>Username: Mikalye</b><br><br>I think that was the thing that tipped me to MIT. MIT has a culture of trying things out. The whole \"Mind and Hands\" ethos is very strong. Completely apart from the range of Intercollegiate sports, the intramural program is incredibly strong at MIT.<br><br>As a High School senior, I was concerned about MIT, as I would rank my primary academic interests at the time as Computing and Theatre, and I was sorely tempted to go to a \"more balanced\" school, and I am so, so glad that I didn't. While I got my MIT degree (in Applied math in the end), I participated regularly in on-campus theatre. I did several tours, including touring northern California my Junior year over IAP (16 stops in 3 weeks if memory serves including 3 shows at Stamford). I performed Shakespeare in a prison. I was encouraged to explore the limits of what I could do.<br><br>When I got out of MIT, I got my Actors Equity card and worked for a time in the professional theatre. Today, I'm an IT executive. The opportunities that I had at MIT, are not opportunities I would have had at most other schools. Not that other schools wouldn't have had touring productions, they possibly would have had more, but by and large, these would have been reserved for the theatre majors. Indeed, when I looked at some of the more \"balanced\" liberal arts schools, they did not have more well rounded students, they just had a wider variety of narrowly focused students.<br><br>Again, its all about the culture, the atmosphere, the MATCH of the school, but for me MIT was the optimal choice.<br><br>", "<b>Username: molliebatmit</b><br><br>\"\"Indeed, when I looked at some of the more \"balanced\" liberal arts schools, they did not have more well rounded students, they just had a wider variety of narrowly focused students.\"\"<br>I think this sentence deserves to be highlighted. How very insightful -- I never thought of it that way.<br><br>", "<b>Username: pebbles</b><br><br>\"\"Not that other schools wouldn't have had touring productions, they possibly would have had more, but by and large, these would have been reserved for the theatre majors.\"\"<br><br>and indeed that is EXACTLY the biggest common complaint of all my friends at Harvard. Is that all the activities/teams/ensembles are taken up by kids whose HOOK to get into harvard was talent in that particular area. So if you're not some national superstar at badminton, or theater, or voice, or writing, you're going to be hard-pressed finding a worthwhile team, organization, a capella group, or magazine that would take you.<br><br>", "<b>Username: tech_fan</b><br><br>... on the other hand, if you're really good at some of those things, you get to work with future professionals. It's definitely a trade-off, but some people don't want to do anything unless it's \"serious\". (I'm not of this type, I should say.)<br><br>", "<b>Username: JER</b><br><br>The real issue is to pick the school where you think you'll be happy. There's no point in spending four years of your life miserable.<br><br>", "<b>Username: asdf123</b><br><br>ah that's a really good point though. at mit you'll have a better chance to try new things you've never tried before.<br><br>", "<b>Username: Dragon45</b><br><br>I've directly known exactly two people who've gone to MIT.<br><br>One of them was a ridiculously muscular football player- defensive captain. Also just happened to be an amazingly gifted mathematician and programmer.<br><br>The other was a jiu-jistu fighter who now works in Silicon Valley on some stuff that I can't quite tell you about.<br><br><br>Needless to say, my personal view of MIT is that it is an extremely heterogenous, diverse and enjoyable place to be O_o<br><br>", "<b>Username: martinibluex</b><br><br>\"\"The real issue is to pick the school where you think you'll be happy. There's no point in spending four years of your life miserable.\"\"<br><br>If you could ever be miserable [too strong a word] in either of these schools, I would suggest some soul-searching this summer before you go off to college. Both schools are amazing and you might like one better than the other but being miserable I think would come only from within you.<br><br><br>P.S. Boston is not Alaska. It has [some] snow but also a lot of culture and so much to explore. Palo Alto is also great. I love Cali but keep in mid that many people pine over it just to find themselves disappointed. That said, both schools are just great, I will not state my official preference here.<br><br>", "<b>Username: evanescenteuphoria</b><br><br>you're obviously crazy if you'd pick MIT over Stanford.<br><br>", "<b>Username: pebbles</b><br><br>oh dearie me, we <i>do</i> have our share of crazies, don't we?<br><br>", "<b>Username: molliebatmit</b><br><br>Uh, there <i>are</i> people who love the environment at MIT. There are a lot of us, in fact.<br><br>Stanford's a nice place and all, but MIT is home. Can't beat that with the proverbial stick.<br><br>", "<b>Username: lasern</b><br><br>:) Haha! So it seems.<br><br>If you're choosing between Stanford &amp; MIT you can't go wrong, though the different environments will suit people differently... It's all very personal. Anyone who tries to be objectively definitive about this is sorrily delusional.<br><br>", "<b>Username: collegealum314</b><br><br>^If this conversation keeps progressing at this rate, in 10 posts Mollie will be 75 years old.<br><br>", "<b>Username: molliebatmit</b><br><br>But what if the rate isn't linear? In 10 posts, I could very well be 150, or even older.<br><br>(Luckily, I'm sure datalook will show up at some point to debate these six-year-old points, so in ten posts, I am likely to remain well south of thirty.)<br><br>", "<b>Username: tryingforyale</b><br><br>Stanford--> best campus ever, heart of physics and technology (stanford collider, who just found gravity is a type of wave, maannnyy popular applications, many extremely successful business people) Stanford is the heaven for smart and really outstanding people. I am totally aware MIT is one of the best (top 3 in world), but so Stanford is. Also, according to 2016 listing of universities, Stanford is the 3rd but MIT is below 5? Anyways, Stanford is far far more better for living, research opportunities, the money, reputation you can get and the acomplishmets you will be able to make. :) :)<br><br>", "<b>Username: jpm50</b><br><br>@tryingforyale: Thank you for brightening this thread with your humor.<br><br>", "<b>Username: masterx1</b><br><br>ut austin is the best woot<br><br>", "<b>Username: Coloradomama</b><br><br>MIT is the better school for almost any major except English, history and art history. Stanford is more watered down, in the sciences, does not offer much science for humanities majors, offers less career guidance, and VERY stressful socially. I would not send my kids to Stanford, it is over the top stressful for the social aspects of college life! . Its really not very fun is what we hear from every kid that goes to Stanford. MIT is socially much more fun, in comparison, but yes you will work harder by far at MIT if you want As, and yes there is snow. If you don't like snow, pick Stanford, I guess, but be prepared to be really stressed out socially. YUCK!<br><br>", "<b>Username: Coloradomama</b><br><br>Some MIT students major in humanities or social science subjects, often will double major. Many MIT students study at Wellseley College for a year of classes, and some cross register at Harvard U. Many of my MIT classmates have careers such as: French teacher, actress, musician, professor of Asian Studies, and political or law careers. MIT students are very well rounded. Economics at MIT is ranked number 1 along with U of Chicago. Stanford has a slightly different approach so it may be useful to get a degree from both schools, but pick Stanford for grad school, not undergrad.<br>I think thats the best way to go, unless you are absolutely sure you want to major in English, history , art history, as I said above. I think the student body is substantially different with Stanford being the \"western\" school. Its very stressful as I mentioned, the social scene on the west coast, compared to what MIT offers. MIT offers a more relaxed kind of socializing, although there is Number Six Club, and fast paced fraternities and sororities at MIT, for very advanced social kids. I think MIT stratifies social life better, so very social kids join the frats, the ones that are not so advanced socially still have fun in the very social dorms. Its just more relaxed, somehow, is my feeling. But talk to current students and visit both schools to be sure.<br><br>", "<b>Username: lostaccount</b><br><br>LOL on this thread being resurrected from the \"dead and dated thread cemetery\".<br><br>About this\" I am totally aware MIT is one of the best (top 3 in world), but so Stanford is. Also, according to 2016 listing of universities, Stanford is the 3rd but MIT is below 5? \" Check out the world university ratings from London Times or look at the list of departments on US News. You'll see MIT listed as first on many lists.<br><br>In terms of choosing between these two, fit is everything. MIT is filled with a diverse population of very adventurous students who are among the most down to earth, open and accepting students I have ever met. But it is not a good fit for everyone. I'd say it is not a good fit for those who fit the stereotype of the 1960s stem \"nerd\" or for competitive students who get their self worth from their A's. They will find that they are out of their element. Students at MIT collaborate and are probably less likely than students almost anywhere else to sit alone in their room and study for hours on end in order to beat out peers and get A's. It's not a good place for loners or asocial people. It's also not great for those who want a bumper sticker that makes the world know they are important. There is a school up chuck river that might be better for that.<br><br>", "<b>Username: renaissancedad</b><br><br>@Coloradomama, you have a really warped view of Stanford.<br><br>I agree that \"fit\" is everything, and that anyone with the option to choose between such elite schools should investigate carefully and pick which one is the best fit. They all have strengths and weaknesses.<br><br>", "<b>Username: tryingforyale</b><br><br>Thanks but I am hundred percent serious as always. @jpm50<br><br>", "<b>Username: Penn95</b><br><br>imo Stanford has an edge for undergrad both for STEM and non-STEM people. For non-STEM people the edge is pretty obvious. For STEM the edge is because at Stanford you get a just as technically rigorous and superb education as at MIT but also a more well-rounded one than at MIT, which I think is important at the undergraduate level. Of course you can't go wrong with either though.<br><br>", "<b>Username: Mikalye</b><br><br>I actually think that Penn95 is wrong. For non-STEM it is obvious. There are more students, more facilities, it is better. However, for STEM, the Humanities, Arts and Social Sciences are better experiences at MIT than at Stanford. Both schools require exposure to other fields (the GIR at MIT and the WAYS requirement at Stanford), but MIT students actually benefit from not having a huge number of HASS students on campus. If you take a film studies class at MIT, there are not likely to be a large number of Film Studies majors on the MIT campus. As such, all of the facilities are open to all. At Stanford, this is just not the case. If you want to try theatre, then there are no (or at least extremely few) drama majors on campus. Most of the cast of even the largest productions are not theatre majors. At Stanford, this isn't true. Are there more theatre courses at Stanford? Absolutely! But I never met anyone who ran out of options on the MIT campus, barring one student who then used the cross-reg options to take 2 theatre classes at Harvard. If you are a physicist with a strong side interest in drama, at Stanford, you have more options to STUDY theatre. At MIT, you have more options to DO theatre.<br><br>I think that MIT tends to produce more rounded STEM students that Stanford, and this is because the MIT approach to learning (which is that you learn stuff by doing it) applies both in your major field of study, most commonly in the way that the courses are taught and through the UROP program, but also in your side interests. MIT offers apprenticeships to work (and study) alongside some of the best there is. Heck the motto of the school is Mens et Manus - Mind and Hands. At MIT, STEM students will actually have the opportunity to DO more HASS than at Stanford. If that is the way of learning that appeals to you, and you match well for MIT, then MIT is a great place for a STEM student to do HASS. Stanford is also a great place, but for a slightly different student, with a slightly different approach to learning. You cannot go wrong at either, but for my money MIT is better for STEM than Stanford, because you get a more rounded education.<br><br>", "<b>Username: Coloradomama</b><br><br>@renaissancedad I think that many students raised in conservative homes in Ohio, and other midwestern and southern states including Colorado do not fit into the fast paced social scene at Stanford. This latest Ohio swimmer grope at after a frat party at Stanford, really homes in on what I see wrong there. The social scene is very very high pressure for kids who are not from California and used to what its like out there. Kids from where I am from often do not fit into the California social scene at all, even at Cal Poly, which admittedly is a good party school too, and come on home. MIT is slower paced socially for the most part,with the athletic frat being shut down recently. But yes there is plenty of \"action\" at a few MIT frats too. IT happens everywhere, the pressure is much higher at Stanford than at MIT. I will not back down on this. It is my opinion of course.<br><br>", "<b>Username: collegedad13</b><br><br>@Coloradomama I agree with your recent post and I live in California. There is a type of elitist entitlement mentality that goes on and I do not approve of it either.<br><br>", "<b>Username: sbballer</b><br><br>Stanford MIT dual admits choose Stanford 60% of the time.<br><br>", "<b>Username: jpm50</b><br><br>@sbballer:<br>Can you substantiate where you got your data?<br><br>When I read through your past posts, what is difficult for me is that the majority of them are of the form \"Stanford is the answer. What was the question?\"<br><br>Please try and be more equally critical of all data.<br><br>", "<b>Username: Mikalye</b><br><br>That is interesting data, if true. I could not find any recent authoritative source. There was an academic paper roughly a decade ago (<url>http://papers.ssrn.com/sol3/papers.cfm?abstract_id=601105</url>), which showed Stanford losing to Harvard, Yale and MIT, splitting with Princeton and beating all others.<br><br>In 2008, then Dean of Admissions Marilee Jones, was quoted in the Tech, the MIT newspaper saying \"Currently, Harvard and Yale are the only two schools to which MIT loses more students than it wins.\" (<url>http://tech.mit.edu/V125/N63/63admissions.html</url>)<br><br>In 2007, aware it was losing cross-admit battles, particularly with Harvard, the Stanford president announced to the Stanford faculty that they were looking to make significant changes to improve these battles. What I cannot find is any strong data since 2008 to determine whether and how, Stanford was successful. The only authoritative Stanford cross admit data that I can find comes from another report to the Stanford faculty a year later (<url>http://news.stanford.edu/news/2008/june18/minutes-061808.html</url>), which does show Stanford winning 60% of the cross-admit battle with MIT for 2014. Separately I can find them winning 52% of the cross admit battle for the class of 2013 and 49% for the class of 2012. These are the only two years where I can find data that shows Stanford beating MIT.<br><br>What I cannot find is any data for any class in the last 6 years. So I cannot judge if that 60% figure represents a one year anomaly, or whether it has retained that advantage.<br><br>", "<b>Username: renaissancedad</b><br><br>@Coloradomama, you're obviously entitled to your opinion. But the Stanford swimmer as an example of the social scene influencing kids not from California? Please. That sounds like the kid's \"the party culture and alcohol made me do it\" defense. It sounds like he was partying and using drugs back in slow-paced, conservative Ohio. That's a huge cop out.<br><br>There's plenty of the \"fast-paced social scene\" for those who choose to pursue it at Stanford and elsewhere, and there's plenty of opportunity to avoid it for those who don't desire that kind of scene. I went to Stanford from the East coast. I never stepped foot in a frat house in my 4 years on campus, and got drunk at a party exactly once (freshman year; didn't like it and never bothered again; the same number of times I got drunk at parties in high school). I never used drugs in high school, and never once saw them in college, because I never looked for them (though I'm sure they weren't hard to find). I felt no pressure to conform. As you say, there is plenty of \"action\" elsewhere. I personally doubt that \"the pressure is much higher at Stanford than at MIT\". But you are welcome to live in your bubble.<br><br>", "<b>Username: collegedad13</b><br><br>@renaissancedad I do think the social scene is a lot different at Stanford than at MIT. Commenting on that is not living in a bubble.<br><br>", "<b>Username: MITChris</b><br><br>I think whether we 'lose' or 'win' more students to/from Stanford (and Harvard for that matter) varies year-by-year. The pool is small enough so that it's very sensitive to relatively minor fluctuations.<br><br>IDK, I sort of think it's the wrong way to evaluate it. I met with a lot of crossadmits this year. At no point did I ever try to convince any of them to enroll at MIT as opposed to HYPS (or anything else). IMHO, the job is to talk about MIT honestly, and trust the students to make the right decision. In almost every case, the students that I talked to did, I think, and in the few cases where I thought they made the wrong decision...well, it's theirs to make, and in the past, I've been wrong about the wrong-ness of that decision more than I've been right. It's trite to say it all comes down to fit, but also true.<br><br>I blogged about the process more here: <url>http://mitadmissions.org/blogs/entry/choosing-to-become-yourself</url><br><br>", "<b>Username: mamaedefamilia</b><br><br>@MITChris That was a fantastic post. It should be required reading for every rising senior who is angsting over what the \"right\" choice will be. Rather, it should be required reading for every rising senior. ;)<br><br>", "<b>Username: sbballer</b><br><br>Stanford wins the dual admit data over MIT by 60%... it was from last year's faculty minutes. Stanford's yield is the highest in the nation. MIT is third.<br><br>", "<b>Username: jpm50</b><br><br>@sbballer.<br>Do you think your Stanford-only blinders have cost you your credibility?<br><br>", "<b>Username: sbballer</b><br><br>Admissions yield 2015<br><br>Stanford University\t81.1%<br>Harvard University\t80.0%<br>MIT\t72.4%*<br>Yale University\t71.7%*<br>Princeton University\t68.6%<br>University of Pennsylvania\t66%<br><br>", "<b>Username: Mikalye</b><br><br>@MITChris has written a fabulous post and one very artfully constructed, but I find myself disagreeing with one of his key tenets, that this is a decision that should be considered and approached philosophically. I went to MIT (obviously) and one of my best friends in secondary school went to Harvard. As a result, I spent a fair amount of time, particularly my freshman and sophomore years visiting her, and she spent time visiting me. I went to some Harvard parties, I hung out a few times in the dorms, and I was struck by how DIFFERENT it felt from the equivalent experiences on the MIT campus. Finally, one evening we were walking along, and I very uncomfortably told her something like \"Harvard has always struck me as being vaguely ummm.... pretentious, in a way that just never felt particularly comfortable to me.\" And she looked at me, grinned, and said something like \"Oh I am so glad that you said that. I have always felt exactly the same way about MIT.\"<br><br>And of course, she was completely right. MIT is filled with its own pretensions, that are quite different but no less real than those at Harvard. But the thing of it is that the ones at MIT have aligned with my own quirks so that I felt very much at home at MIT, and similarly, she very much at home at Harvard.<br><br>I don't think that this is a decision that you should necessarily approach philosophically. I think you should approach it at a much more gut level. You are not just picking a university. You are picking a home for at least four years. You should feel like you could belong there. There is no best school, such a thing is obviously wrong, but there may be a better choice for an individual student. But only they can know that, and it has very little to do with the trappings of the institution.<br><br>", "<b>Username: Mikalye</b><br><br>To sbballers comment about yield I would only say that yield has only a tangential approach to cross-admits. The key example here is Princeton. About a decade back their administration got very concerned about yield and their admissions office were set targets to improve yield. Their solution to this was to admit kids that they thought would meet Princeton's needs but who, for one reason or another, were unlikely to be cross-admitted to key other schools such as Harvard or Yale. As such, Princeton's yield skyrocketed. That directive went away shortly thereafter. These stats can mean whatever you want them to mean.<br><br>There are a number of universities that encourage admissions applications from students who cannot possibly be admitted. The purpose of this exercise is to raise their selectivity score, by lowering their admitted percentage. MIT, to its credit, does not do this. Indeed, MIT does not normally appear at college fairs in the US**, on the grounds that anyone who needs a college fair to discover MIT, does not normally match well with MIT, and MIT is supremely unconcerned with encouraging applications from those who obviously do not match well, largely because our faculty and administration do not consider that statistic to be any form of meaningful metric.<br><br>Now to be clear, I am not saying that the statistics quoted by sbballer are in any way wrong. However, I am not sure that they have the totemic meaning that seems to be assigned to them.<br><br>**(Note: I do appear for MIT at a number of college fairs outside of the US, because the purpose is quite different. I am often meeting with students whose only application to an American university is their MIT application, and we often talk about stuff that would be \"obvious\" to anyone used to the US tertiary education system).<br><br>", "<b>Username: MITChris</b><br><br>@Mikalye -- I actually don't think we disagree, although upon re-reading that post, I can see how it may have come across that way. The gut/home thing is and always has been my first heuristic. The set of strategies I outline in that post are to help students with uncertain or ambivalent instincts, where both options seem equally home-like and you need to pick only one.<br><br>", "<b>Username: MITChris</b><br><br>re @sbballer's data: I have no reason to doubt it and it wouldn't surprise me if Stanford's yield is higher (overall and on xadmits). There are always kids we admit who we think are unlikely to yield but who are still kids we ought to admit, as @Mikalye said. I'm less concerned with the overall rate and more with the individual cases and why people make decisions they do.<br><br>", "<b>Username: sbballer</b><br><br>all colleges game the system (esp the ivies) to improve yield and admit rate.. whether they admit it or not.<br><br>those colleges that have relatively high EA admit rates are doing this to goose their yield rates. in particular it's obvious that HYP are all using high EA rates to goose yield rates. MIT (which has the lowest EA rate in the country) and Stanford less so.<br><br>MIT to its credit has the lowest EA admit rate.. which will lower overall yield rate.<br><br>MIT EA 656 out of 7,767 (8.4%)<br>Stanford REA 745 out of 7822 (9.5%)<br>Georgetown EA 892 out of 7027 (12.7%)<br>Harvard SCEA 918 out of 6173 (14.9%)<br>Yale SCEA: 795 out of 4662 (17.1%)<br>Princeton SCEA 785 out of 4229 (18.6%)<br><br>", "<b>Username: Ballerina016</b><br><br>MIT doesn't consider legacy. If you take out legacies out of others, the rate might be comparable.<br><br>", "<b>Username: Defensor</b><br><br>\"Also, according to 2016 listing of universities, Stanford is the 3rd but MIT is below 5?\"<br><br>Depends which ranking organization you look at. QS World University Rankings places MIT at #1 in the world, with Stanford tied for #3. The U.S. News Best Global Universities Rankings has MIT at #2 and Stanford at #4.<br><br>", "<b>Username: MITChris</b><br><br>@sbballer - I can't think of anything we do our process to 'game' the yield/admit rate. Sure, we offer competitive financial aid and try to make sure people have a good experience at CPW. But if by 'gaming' you mean things like (e.g.) \"goosing\" our EA admit rates, or not admitting certain kinds of kids (e.g. Californians) because they are statistically less likely to yield...those aren't really things we do.<br><br>", "<b>Username: sbballer</b><br><br>@MITChris the fact that your EA rate is the lowest in the nation supports your contention as stated..(although there is always bias in any admission process) the real offenders are HYP which admit half their class with admit rates that are 3-4x higher than RA admit rates... these schools are obviously gaming the system to boost yield rates. MIT EA and RA admit rates are most similar. Stanford less so.. and HYP are real outliers...<br><br>", "<b>Username: ucresearcher444</b><br><br>Coloradomama, on another thread you stated you were a MIT educational counselor. Does MIT approve of the unprofessional, unsubstantiated comments you make in an attempt to put down Stanford. You refer to the California social scene. What does that have to do with Stanford. Stanford has students from every state in the union and countless countries. Stanford is one of the most diversified institutions in the world.<br><br>If you are really associated with MIT, you should be able to do better than your almost child-like rants devoid of any facts.<br><br>", "<b>Username: collegedad13</b><br><br>@ucresearcher444 you are obviously part of the group that believes Stanford is the perfect place. You should learn some objectivity. Let me remind you that Stanford has never had a women president. Its board of directors is 70 per cent male. Its executive management team is all male. Brock Turner is a product of the Stanford scene by his own admission. I think Stanford is a great school. It is by no means perfect and anybody who believes it is perfect is not realistic<br><br>", "<b>Username: ucresearcher444</b><br><br>Collegedad13, I get it. Your son goes to Harvard and you cant stand the thought of another college challenging for elite status. Your constant attempts to trash Stanford are despicable. You constantly bring up Turner. You seem desperate to bring down Stanford by any means possible on these message boards. It is sad.<br><br>Harvard is a fantastic school. MIT is a fantastic school. I only have positive things to say about them.<br><br>", "<b>Username: collegedad13</b><br><br>ucresearcher444 as I told you before it is a daughter not a son. I understand as a high school student how one such as you has dreams and sometimes those dreams do not coinside with reality so you lash out and call people despicable who point out inconsistencies in your argument.. I think you would be well served to act in a more analytical fashion<br><br>", "<b>Username: Coloradomama</b><br><br>@ucresearcher444 Its nice to be called child like as I would rather be that than other things you might have called me. I talk to many college students locally about MIT and Stanford, and I stand by my comments. Remember, Stanford is a school that heavily recruits legacy and Division 1 athletes, from all over the country. That does in fact change the social pressure at the school. Its not bad if you want to go to a school like Standford. I am NOT saying Stanford is bad academically in any way, I am saying its not the same as MIT SOCIALLY. Academically they look pretty similar in engineering, I would say based on my MIT classmates who went to Stanford for graduate school. . I don't think anyone at MIT would disagree with me, about the social atmosphere at MIT being less \"fast paced\" than Stanford, including the MIT Admissions Officers. By the way, MIT admissions officers all attended and graduated from MIT so they understand what MIT is like socially. That leads to a much better assessment of candidates by MIT Admissions.<br><br>FIT MATTERS to students, especially SOCIAL FIT. This is the number 1 reason Colorado students come home unhappy and transfer out of places like Cal Poly or Stanford. They simply DO NOT FIT. I rest my case. I am really happy I appear child like to you. Its a compliment.<br><br>", "<b>Username: renaissancedad</b><br><br>^ \"By the way, MIT admissions officers all attended and graduated from MIT so they understand what MIT is like socially.\"<br><br>Is that really true? According to @MITChris's blog, he had never had any affiliation with MIT before being hired as an admissions officer.<br><br>I went to Stanford a long time ago, and I certainly wouldn't claim it is perfect; MIT and Stanford are both superb schools, and I think any discussion of which is \"better\" is fruitless. But personally, I never encountered any kind of \"fast paced\" social scene at Stanford (and I came from the east coast), and have no idea what @Coloradomama is talking about. Maybe things have changed, but I'm a bit skeptical, as I am of claims such as MIT admissions having a better assessment of applicants than Stanford admissions officers. It's an imperfect process under any circumstances, and I'd personally avoid such broad generalizations.<br><br>", "<b>Username: skieurope</b><br><br><b>MODERATOR'S NOTE</b>:<br>To review Terms of Service:<br>\"\"Courtesy. At College Confidential, we expect discussion to be courteous even when disagreement may be vigorous. When writing your messages, please use the same courtesy that you would show when speaking face-to-face with someone. Flames, insults, and personal attacks will not be tolerated. It's fine to disagree with opinions, ideas, and facts, but always with respect for the other person. Also, note that messages express the thoughts of the writers, not the community, its owners, staff, or moderators. Visitors who post discourteous messages will be warned; repeat offenders will lose posting rights.\"\"<br>With the possible exception of @MITChris , everyone here is simply expressing an <b>opinion</b>. You are free to disagree with the opinion presented, but you are <b>not</b> free to attack another member for stating her opinion. I've deleted some offending posts. Please abide by the rules.<br><br>", "<b>Username: MITChris</b><br><br>\"\"<br><blockquote class=\"Quote UserQuote\"><br><div class=\"QuoteText\">\"\"By the way, MIT admissions officers all attended and graduated from MIT so they understand what MIT is like socially.\"\"\"\"<br>Is that really true? According to @MITChris's blog, he had never had any affiliation with MIT before being hired as an admissions officer.</div><br></blockquote><br><br>Just to correct the factual record: it is *not* true. Only a handful of our admissions officers attended MIT. I was hired having not stepped foot on MIT's campus until my job interview. Later, I became an alum of CMS/W at the graduate level. I think being an alum helps in some things, but having a different perspective helps in other things.<br><br>", "<b>Username: Coloradomama</b><br><br>Please don't assume that someone with the name \"COLORADOMAMA\" is necessarily female. Many people hide their identity on CC.<br><br>Thanks @MITChris for correcting my misconception about the MIT Admissions office having a lot of MIT graduates. Even MIT graduates make mistakes. :-) Stu Schmill, the dean of Admissions is an MIT grad, the EC coordinator has been an MIT grad in recent years, two different MIT grads. So I run into MIT grads at the MIT Admissions Office. And made a bad assumption. MIT trains ECs at a conference every September by the way. And those conferences are where people like me, ECs meet people like Stu, Dean of Admissions.<br><br>As far as social atmosphere I stand by my statements. Stanford is in a suburb, a wealthy suburb, less to do, so more parties, when I was there visiting, and my MIT classmates got their masters there, its not a statement about academic QUALITY to say that there is a DIFFERENT social atmosphere at Stanford, less to do in Palo Alto than Cambridge/Boston. An MIT student can literally walk to Boston, a Stanford student may take a train to SF, but its a long train ride. I think that suburban campuses have a distinctly different lifestyle than MIT, an urban campus. Likewise, Stanford's division 1 sports and a full ranked arts and science program ATTRACT A DIFFERENT TYPE OF STUDENT than MIT, a division 3 sports school, with a focus on technology.<br><br>Yes this is an opinion.<br><br>I do not understand why anyone would be confused about these differences, but today students put MIT into the Ivy category. I would say Stanford belongs in that category, MIT is not really that type of school. As much as some humanities departments are excellent, really A+, MIT still attracts the math science kid who does NOT play division 1 sports or want to watch , they are not available at MIT.<br><br>"]}