{"title": "michigan ross bba undergrad vs nyu stern undergrad", "comments": ["<b>Username: UCDreamer12</b><br><br>Background:<br><br>", "<b>Username: bearcats</b><br><br>\"Weaknesses: Really burnt out from highschool, don't want to work TOO much, kind of want to chill/party but still keep a high GPA, not the greatest at writing\"<br><br>with this weakness you should be consideirng other careers. It's not easy to get through the two year 80-90 hour average workweek of grunt work in IBD even for the determined person, and it will be virtualy impossible for someone who's not that motivated and don't want to work too much.<br><br>Is there any reason you want to do IBD/PE besides money? because there are many jobs where you can work less and make similar/better money (S&amp;T/AM/HF), but you will actually need a great skill set.<br><br>", "<b>Username: UCDreamer12</b><br><br>what does S&amp;T AM and HF stand for? and someone please answer my questions; i apologize for the long post but cmon...<br><br>", "<b>Username: UCDreamer12</b><br><br>and just because i say i'm burnt out doesn't mean i can't handle it...<br>-i can take on 80-90 hours of work; i took 4 ap's last year and 5 ap's this year on top of having tons of ec's, and i have all 95+ for each one of my classes so I can obviously handle difficult classes with high workload as well... but theres a difference between what i CAN do and what i WANT to do...<br><br>-like who doesnt want to chill/party?<br><br>-writing isn't a huge skill in business...<br><br><br>also, no. i'm all about the money. just like all the other ibankers and such. for what OTHER reasons would anyone go into the business world.... lmao<br><br>", "<b>Username: bluedevilsfan</b><br><br>B-school GPAs (especially in Ross) tend be really inflated. Ross even has it's own GPA scale which is higher than LSA/Engineering's. Most classes are curved to a B+ (3.4) but you really need to work hard and beat the competition to get above that. To get a top job coming out of Ross, who would probably need a 3.8+<br><br>It's really not too hard to get into Ross after freshman year, especially if you are motivated and know what you are doing. About 40% of kids get in and not all are super smart. A lot of kids who apply aren't even sure if they want to do business. The most important things they look for are GPA and leadership potential. Just take easy classes and get a 3.6+. Also, Ross likes frat kids for some reason (probably because of the leadership) so consider pledging a fraternity (social or professional) if you are that type of kid. You will get a lot of partying in that way too :). Otherwise, get involved in clubs and gain leadership positions.<br><br>Being in honors might help you a bit but you do need to take Great Books, which many people find annoying. However, you do get housing in the newly renovated South Quad, which is one of the best dorms on campus. The honors halls tend to be very social and SQ has an amazing location. Otherwise, you risk ending up being on North Campus, which is removed from the rest of the school and sucks in general.<br><br>", "<b>Username: maizeandblue21</b><br><br>For what you want I think Ross is the better choice. Don't listen to the mostly antisocial population of the board, it's definitely possible to have an active party life and still do really well in school. Plenty of people go out 3+ nights a week and still have high GPA's in Ross and Engineering. Writing definitely is a huge skill in business though. Business writing is a whole different style which Ross teaches you. It's all about conciseness and making every idea extremely clear and every word count. You're gonna want to come up with a much better reason for why you want to go into iBanking though. Trust me, people go into it for many more reasons than the money. You have plenty to learn but if you work hard you can pull off everything you want at UM. Good luck.<br><br>PS...Don't worry too much about applying to Ross after freshman year vs going straight into Stern. If you can't get accepted regular admission into Ross, you very likely don't have what it takes to go into iBanking either. Going straight into Stern in that case still wouldn't get you there and would be be doing you any favors. Getting into Ross after freshman year is very doable if you focus on keeping your GPA up and get involved right away on campus. Networking from Ann Arbor vs. NYC isn't a huge deterrent either, and actually it can be an advantage. A lot of employers will expect Stern students to have done internships during the fall or winter in addition to the summer, but obviously that's not really possible for finance/consulting in Ann Arbor for the most part. UM has a huge alumni presence in NYC and Chicago who are always looking out for younger Wolverines.<br><br>", "<b>Username: UCDreamer12</b><br><br>@bluedevilsfan (or anyone): are frats open to anyone who wants to join or does pledging involve a selection process?<br><br>also, what kind of students get the 3.8+ GPAs and the top jobs? Are those the students who spend hours and hours everyday studying? and if you don't get a 3.8+, which companies do you end up in... are you like screwed basically?<br><br>@maizeandblue21 (or anyone): what is even the point of internships during the school year? like they dont seem to accomplish anything other than getting your name out there to employers of the company you work for, but they waste so much time during the year that you have less time for academics and your own fun...<br><br>", "<b>Username: maizeandblue21</b><br><br>1. The top 8 or so fraternities are very selective and then involve a semester long pledge process.<br><br>2. No, you're not screwed in Ross without a 3.8. And in Ann Arbor most people don't do internships during the school year.<br><br>", "<b>Username: UCDreamer12</b><br><br>Is there race discrimination in these pledge processes?<br><br>Also, what are other reasons that people want to do Ibanking jw lol<br><br>", "<b>Username: bluedevilsfan</b><br><br>You participate in this event called rush at the beginning of the semester. During this time, you will visit fraternity houses to learn more about them and they will see what kind of person you are. At the end of rush, a house will give you a bid if they like you. If you accept their bid, pledging starts. Pledging is a time in which you need to \"prove\" you're worthy of membership in the fraternity. It can be very time consuming, especially for the top frats and can involve hazing. You get initiated near the end of the semester<br><br>", "<b>Username: bluedevilsfan</b><br><br>Top fraternities tend to favor white males who are athletic but this isn't always true. They are pretty much looking for \"cool\" people. There are also multicultural fraternities which you could join but they aren't as prestigious<br><br>", "<b>Username: Pat1120</b><br><br>\"-writing isn't a huge skill in business..\"<br><br>LOL<br><br>\"also, no. i'm all about the money. just like all the other ibankers and such. for what OTHER reasons would anyone go into the business world.... lmao\"<br><br>I hope you aren't so arrogant and naive to think that people go into business solely for money...<br><br>Do you even know what investment banking and private equity are?<br><br>", "<b>Username: UCDreamer12</b><br><br>@bluedevilsfan thank you<br><br>@Pat1120 please do tell the many reasons people would go into banking if it isn't about the money<br><br>", "<b>Username: seaslipper</b><br><br>Depends on your tastes. You might want the big city. You might want a college town. I find it hard to concentrate in NYC. Too stressful. People in A2 are much nicer and more relaxed. Also UM has a more glorious history and people feel attached to it after they leave. NYU isn't like that. But you may not care about that.<br><br>I'd go with LSA Honors. Don't worry about the grades. They know everyone is concerned about that.<br><br>", "<b>Username: ForeverAlone</b><br><br>\"\"The average salary for Ross Graduates is $62,000 first year; its top employers are Deloitte(10 people), Microsoft (8 people), Accenture (8 people), Goldman Sachs (7 people)<br>-The average salary for Stern Graduates is $62,000 first year; top employers: PWC, Goldman, Ernst &amp; Young, Morgan Stanley\"\"<br>This should be kind of concerning for Stern since a greater % of their students work in NYC than Ross due to proximity.<br>\"\"@Pat1120 please do tell the many reasons people would go into banking if it isn't about the money\"\"<br>It's always about the money. If you major in mechE, it's about engineering. If you major in Finance, it's about money.<br>oh and the prestige-horing<br>\"\"Also UM has a more glorious history and people feel attached to it after they leave. NYU isn't like that.\"\"<br>because NYU is still down the street from where most people work after college, but in terms of school unity and pride, yes<br><br>", "<b>Username: wayneandgarth</b><br><br>\"It's always about the money. If you major in mechE, it's about engineering. If you major in Finance, it's about money.<br>oh and the prestige-horing\"<br><br>Come again? What in the hell are you talking about? I'm in Finance, I love Finance, its what I learned in school and what I still enjoy greatly. People go into Finance generally because they have an affinity. If they don't, they certainly won't do well enough to stay in the field, let alone make a lot of money at it.<br><br>", "<b>Username: Alexandre</b><br><br>Ross' approach to grading is very different from Stern's. The reason for this is simple; competition. Stern is an intensely competitive environment. They have over 600 students per class (compared to 400 at Ross), and the vast majority (like 80%) want jobs on Wall Street, compared to 30% of Ross students. In other words, at Stern, you have 500 or so Stern students competing for jobs in IBanking each year, compared to 100 from Ross. The vast majority of those Ross students will be placed, mostly with BB IBanks, while the majority of Stern students won't. There is a reason why Stern does not release placement details. It is the only major BBA program not to do so. Let us face it, placing 50-100 students in BB IB when you have 400-500 students competing for them is not impressive!<br><br>", "<b>Username: stjohnson</b><br><br>@Alexandre I noticed that Ross indeed places very well, as their BBA statistics have all been released on their website, and the results are quite similar to yours. Last year, it seems about 40% of students enter in Finance, 16% into Investment Banking, and many people seem to get good jobs from the BB firms. However, I also heard Ross Students saying that only the very top of the class end up with good paying jobs from the top companies, while the rest don't fare off as well, generally speaking... I am also aware that although many Ross students get offers from BB firms, not all of them are exactly on Wall Street, as some may be in other Northeast areas or in the Midwest or West...<br><br>Additionally, I heard that Stern is very competitive, yet I feel most schools tend to be pretty competitive anyways (Harvard, Wharton, Dartmouth, Duke MIT, Chicago, Stanford etc...). But contrary to your statistics, I read that only about 50-60% of students at Stern pursue Finance/Banking (according to Businessweek). I also see your point about Stern's lack of placement details; however, if you have no other source for its placement data, where are you getting the statistic that \"like 80%\" of students there want to get into IB, and that only 50-100 out of those 400-500 students get a job at a BB firm? (As of right now, my only source is Business week). Please enlighten me with a more accurate site/source if I have been mislead by any information.<br><br>", "<b>Username: Alexandre</b><br><br>stjohnson, you ask valid questions. Since Stern does not release data, it is not possible to know for sure. But Businessweek is not listing the percentage of students who are applying for jobs, they are listing students who are placed in various industries. Just because only 50%-60% of Stern graduates are placed in finance jobs does not mean that all those seeking such jobs are placed.<br><br>Also, while all good universities have competitive students, that does not mean that grading is also competitive. Schools like Harvard, Dartmouth, Duke and Stanford are in fact known for being lenient when it comes to grading. MIT and Chicago are indeed tough, but then again, they are not famous for Wall Street placements as are Harvard, Dartmouth and Duke.<br><br>As for Ross BB placements, the vast majority are in fact front office Wall Street placements. Some are place in Chicago, but those are the exception rather than the rule. Also, I am not sure who told you that \"only the very top of the class end up with good paying jobs from the top companies\". The evidence from Ross's annual placement report shows that 25% graduates joined the following companies:<br><br>JP Morgan 16<br>Microsoft 9<br>Goldman Sachs 8<br>Accenture 6<br>IBM 6<br>Morgan Stanley 6<br>Boston Consulting Group 5<br>Cisco 5<br>Ford 4<br>General Motors 4<br>Kraft 4<br>Amazon 3<br>Bain 3<br>Citigroup 3<br>Lazard 2<br>McKinsey 2<br><br>That does not include all high profile, high-paying jobs mind you, only the most common ones. Most years, at least 1 Ross undergrad is placed in companies like Bank of America, UBS, Credit Suisse, BNP Paribas, Societe Generale, RBS, Rothchild, Blackstone, Blackrock, Nomura, Bank of New York Mellon, Boeing, Lockheed Martin, Northrup Grumman, Amgen, Eli Lilly, Pfizer, Stryker, Unilever, Procter and Gamble, L'Oreal, General Electric, Google, Sun Microsystems, Apple, Oracle, A.T. Kearney, Mercer, Oliver Wyman, etc... Companies like Kraft, Procter and Gamble and L'Oreal may not see all that sexy, but to those of us interested in Marketing, it does not get much better.<br><br>Altogether, I would say another 25% of Ross undergrads are placed in such companies. When half your class joins such companies as all the ones listed above, I would say that top jobs are not only offered to \"the very top of the class\". It is in fact the bottom of the class that ends up at companies and organizations such as American Express, Deloitte, EY, PwC, Target, Teach For America, Wells Fargo etc....<br><br>There are two concerns I have about Stern:<br><br>1. It is the only high profile BBA program that does not release a detailed placement report. To me, that is very suspicious.<br>2. Given its size (600/class) and the finance intensive focus of the school and of the students who are drawn to the program, competition to join BB IBanks from Stern is going to be overwhelming.<br><br>", "<b>Username: bearcats</b><br><br>\"As for Ross BB placements, the vast majority are in fact front office Wall Street placements.\"<br>That is not true. More like half from what I see. Quite a number of lower echelon Ross kids accept ops/treasury/credit risk/product control type of positions at BBs.<br>The lower tier Stern kid typically join lesser known boutiques in NYC (a lot of them only have the budget to recruit regionally), while the lower tier Ross kids would gladly accept a backoffice BB role (still better paid than your typical F500 and non-MBB consulting gigs).<br><br>", "<b>Username: Alexandre</b><br><br>\"More like half from what I see. Quite a number of lower echelon Ross kids accept ops/treasury/credit risk/product control type of positions at BBs.\"<br><br>I guess we'll have to disagree based on our personal observations.<br><br>\"lower tier Ross kids would gladly accept a backoffice BB role (still better paid than your typical F500 and non-MBB consulting gigs).\"<br><br>Perhaps in terms of gross salary, but not in terms of salary/hour. Many would rather earn less working 40 hours per week rather than earn IB salaries working 80 hours per week, to say nothing of the questionable ethical values and loose morals endemic to the financial services industry.<br><br>", "<b>Username: Pat1120</b><br><br>Alex, Ross expanded their class sizes from 400 to 500 a couple years back.<br><br>", "<b>Username: Alexandre</b><br><br>According to the 2013 Ross report, the BBA class had 404 graduates. Even if Ross has 500 students per class, it is still smaller than Stern, which has over 600 students per class...and it is less Finance centric than Stern.<br><br>", "<b>Username: ThisIsMichigan</b><br><br>Yes, you'll never make it against all of those people in investment banking \"for the love of it\" lol<br><br>", "<b>Username: qwertyzxc</b><br><br>If those numbers are including all division at the BBs then that is actually not as good as I initially thought. I actually thought Ross placed much better that. The year before last year at one of Morgan Stanley's Stern events, they said Stern sent 17 to Morgan Stanley firmwide which is actually not that much compared to the other firms. Credit Suisse, Goldman, JP Morgan, &amp; Barclays all got around the same or more than that from Stern firmwide.<br><br>@bearcats is definitely right about more options for lower-tier stern students as they will have a ton opportunities at boutiques. There are even people who land a well desired internship during the school year as a sophomore and continuing working there so that by graduation they know the work and the place like the back of their hand and its only natural that they go back for full time. - This happens a lot for boutique investment banks as well as for some well known top hedge funds too.<br><br>", "<b>Username: Alexandre</b><br><br>qwertyzxc, the numbers are actually pretty impressive. Not many programs with a class of 400 will place 30 graduates into Goldman Sachs, JP Morgan and Morgan Stanley. Wharton does a better job, but most other top undergraduate business programs do not. For example, McIntire (UVa) placed 14 of its grads into those three Banks. McDonough (Georgetown) placed 16. So Michigan places as many of its grads into the top 3 IBanks as UVa and Georgetown combined. That's not bad.<br><br>", "<b>Username: qwertyzxc</b><br><br>Those numbers are not bad relatively, but you also have to consider that not all of those placements may be in divisions that people want to be in - some students may take middle-office roles or even front-office roles they didn't want b/c they couldn't land the position they were initially vying for. I had always thought Ross placed better than 6 at MS, 3 at Citi, &amp; 8 at GS given its reputation.<br><br>", "<b>Username: rjkofnovi</b><br><br>Perhaps if Stern would list a detailed placement report qwertyzxc, you would be more impressed with Ross. I wonder why Stern refuses to do it? Perhaps Stern isn't as good as you think?<br><br>", "<b>Username: qwertyzxc</b><br><br>Stern's placement &amp; quality of students is better than I gave it credit for before coming here. If you want the numbers go ahead and check LinkedIN for yourself. Stern's strength comes from the fact that alumni are always in and out of Stern during the year coming back to educate, talk to us, give advice while on their work day. Club leaders send out a couple of emails and all of a sudden we have Global Heads and Managing Directors coming to speak to us. Companies come many many times a semester because it is so easy for them to set up and plan event to Stern. Sophomores here pull down offers that seniors at other target schools are dreaming of. It all comes down to location and the ability to network - Networking is kind in finance, and that's the biggest advantage the Stern has and that is why it's placement is unreal.<br><br>", "<b>Username: Alexandre</b><br><br>qwertyzxc, I am sure Stern's numbers are impressive. I would not expect any less. It is an elite Business program (certainly on par with Ross), but more importantly, it is huge compared to Ross. Ross has 40,000 living alums (MBA and BBA combined), compared to Stern's 90,000. Also, Michigan is not nearly as Wall Street-centric as Stern. Given its location and image, Stern is a magnet for Wall Street types.<br><br>But that was my point above. Stern is huge and virtually all of its students are elbowing and clawing their way through a sea of competitive students to get a job in an IBank. Ross is smaller, and its graduates are far less focused on IBanking. When you have 400 or 500 gifted and uber competitive graduates vying for Wall Street jobs compared to 100 or 150, you are facing completely different realities and odds.<br><br>", "<b>Username: HaroldSawyer</b><br><br>@Alexandre @qwertyzxc is the competition for jobs in many companies limited by a \"capped\" number or range of students from each university? I heard the competition is more general among everyone, rather than just against classmates...<br><br>3. @qwertyzxc your linked in idea was very eye opening. After checking LinkedIn, I see that Stern definitely places extremely well. It has the best representation in every top bank, and,<br><br>If one searches for investment banking analyst titles (analysts generally exclude Grad School student results), USA Location, currently working, the results for the Top 10 Investment Banking Companies are:<br><br>MORGAN STANLEY<br>College: # of Students Average Undergrad Class Size for Senior Class<br><br>1. Harvard: 16 Current, Undergraduate Class Size: About 1700 for every major possible<br>2. Wharton: 15 Current, Undergraduate Class Size: About 600-650<br>3. Stern: 12 Current, Undergraduate Class Size: About 550-600<br>4. Dartmouth: 10 Current, Undergraduate Class Size: About 1100 for every major possible<br>5. Chicago: 11 Current, Undergraduate Class Size: About 1500<br>6. Ross: 10 Current, Undergraduate Class Size: About 400 according to their website<br>7. Yale: 9 Current, Undergraduate Class Size: About 1350 for every major possible<br>7. Duke: 9 Current, Undergraduate Class Size: About 1700 for every major possible<br>9. MIT Sloan: 6 Current, Undergraduate Class Size: About 100 (its a very small program)<br>10.Cornell 5 Current, Undergraduate Class Size: About 3500 for every possible major<br>11.Brown: 3 Current, Undergraduate Class Size: About 1600 for every possible major<br><br>GOLDMAN SACHS:<br><br>1. Wharton: 22<br>2. Harvard: 20<br>3. Stern: 13<br>4. Ross: 12<br>5. Dartmouth: 11<br>6. Duke: 10<br>7. Yale: 9<br>8. Princeton: 6<br>8. Cornell: 6<br>10. Brown: 5<br>11. MIT Sloan: 1<br>11. Chicago: 1<br><br>CITI<br><br>1. Wharton 16<br>2. Stern: 13<br>3. Cornell: 12<br>3. Princeton: 8<br>4. Ross: 6<br>5. Harvard: 5<br>6. Brown: 4<br>6. Yale: 4<br>8. Dartmouth: 2<br>8. Chicago: 2<br>8. Duke: 2<br>11. MIT: 1<br><br>BANK OF AMERICA Merill Lynch<br><br>1. Dartmouth: 12<br>2. Stern: 8<br>2. Duke: 8<br>4. Cornell: 6<br>5. Princeton: 5<br>5. Harvard: 5<br>7. Wharton: 3<br>8. Brown: 2<br>9. MIT: 2<br>10. Ross: 1<br>11. Yale: 0<br>12. Chicago: 0<br><br><br>DEUTSCHE BANK<br><br>1. Duke: 11<br>2. Cornell: 7<br>3. Harvard: 6<br>4. Ross: 5<br>5. Yale: 4<br>6. Stern: 3<br>6. Dartmouth: 3<br>8. MIT: 2<br>9. Princeton: 1<br>9.Wharton: 1<br>9.Chicago: 1<br>12.Brown: 0<br><br><br>CREDIT SUISSE<br><br>1. Wharton: 15<br>2. Harvard: 8<br>3. Stern:8<br>4. Yale: 7<br>4. Chicago: 7<br>6. Cornell: 5<br>7. Ross: 4<br>8. Princeton: 3<br>8. Brown: 3<br>8. Duke: 3<br>11. Dartmouth: 1<br>12. MIT: 0<br><br>BARCLAYS CAPITAL<br><br>1. Stern: 15<br>2. Duke: 9<br>3. Wharton: 6<br>3. Cornell: 6<br>5. Harvard: 5<br>5. Princeton: 5<br>5. Dartmouth: 5<br>5. Yale: 5<br>9. Brown: 4<br>10. Ross: 3<br>11.Chicago: 0<br>11. MIT: 0<br><br>UBS (I guess they're not big on undergrads or analysts unless you're from Harvard)<br><br>1. Harvard: 6<br>2. Duke: 2<br>2. Stern:2<br>4. Wharton :1<br>4. Dartmouth: 1<br>4. Cornell: 1<br>4. Ross: 1<br>4. MIT: 1<br>9. Princeton: 0<br>9. Brown: 0<br>9. Yale: 0<br>9. Chicago: 0<br><br><br><br><br>WELLS FARGO<br><br><br>1. Stern: 14<br>2. Duke: 10<br>3. Wharton: 9<br>4. Ross: 7<br>5. Harvard: 6<br>6. Princeton: 5<br>6. Yale: 5<br>8. Dartmouth: 3<br>8. Chicago: 3<br>8. Cornell: 3<br>11. Brown: 2<br>12. MIT: 0<br><br><br>HSBC (Any current position, since there are no analysts available on LinkedIN)<br><br>1. Stern: 77<br>2. Cornell: 42<br>3. Wharton: 33<br>4. Harvard: 31<br>5. Duke: 16<br>6. Yale: 12<br>7. Dartmouth:10<br>8. Brown: 7<br>9. MIT: 6<br>10. Princeton: 4<br>Chicago: Information not available<br>Ross: Information not available<br><br>JPMorgan Chase: Search for yourselves for this one, I'm having difficulty finding current IB analysts<br><br>Link:<br><br><url>http://****/vsearch/p?title=Investment Banking Analyst&amp;amp;company=JPMorgan Chase&amp;amp;openAdvancedForm=true&amp;amp;titleScope=C&amp;amp;companyScope=C&amp;amp;locationType=I&amp;amp;countryCode=us&amp;amp;rsid=3231056401392184517534&amp;amp;orig=MDYS</url><br><br><br><br>Obviously, not everyone has a LinkedIN account, so I know this data isn't perfect, but generally, it seems that the Wharton, Harvard, Stern, and Duke have the most frequently occurring and most represented undergraduate students in the Top 10 Highest Paying IB firms... I guess its difficult to determine the exact order since were not sure how many students from each school pursues finance/business/econ specifically, but there is no doubt that Stern >Ross, and on par with those other schools mentioned.<br><br>Of course, one can argue that Stern is larger in size and puts more focus on finance, but Wharton's undergraduate class is also very focused on finance and even larger than Stern's, yet both are about on the same level in placement here...<br><br>", "<b>Username: HaroldSawyer</b><br><br>PS, I am a high school senior who plans to major in business/finance, and I applied to every school mentioned in that post<br><br>", "<b>Username: HaroldSawyer</b><br><br>Edit:<br><br>J.P. Morgan information found: the number of current IB undergrads on LinkedIN are:<br><br>1.Cornell:14<br>1.Stern: 14<br>3.Chicago:12<br>4.Harvard:11<br>5.Yale:9<br>5.Princeton:9<br>7.Wharton: 7<br>8.Brown:6<br>9.Sloan:5<br>10.Ross:5<br>11.Dartmouth:4<br>11.Duke:4<br><br>", "<b>Username: pHyRe7</b><br><br>linkedin?? good source...<br><br>", "<b>Username: qwertyzxc</b><br><br>Scale this to include all of the many boutiques &amp; MMs that have relationships to Stern that take a couple of Stern students every year and recruit at very few schools and you get sense of why Stern is such a banking/finance powerhouse.<br><br>", "<b>Username: HaroldSawyer</b><br><br>@pHyRe7 are you being sarcastic or something... ?<br><br>", "<b>Username: HaroldSawyer</b><br><br>qwertyzxc any idea how boutiques are different from bb firms (other than the amount of money invested/available and the size of hte company). Like shorter hours? Lower salary? More bonus oriented? etc...<br><br>", "<b>Username: qwertyzxc</b><br><br>Depends on what boutiques/MMs we are talking about. The top boutiques will have higher salary, hours are relatively same in the industry, leaner deal teams (more access to management), extremely high finance prestige but low/mediocre lay prestige, and virtually same if not better exit opportunities. Often times at the BBs one division will screw up bonuses for other divisions apparently (don't know too much about this) but that is less of an issue at top boutiques.<br><br>When you start going down the list of the boutiques into the generally unknown ones - some will be good, some bad. Hours will be same, maybe less if less deal flow and pay may be around the same to maybe slightly less than BB firms but usually boutiques pay a lot more than BBs, The difference is the exit opps from the unknown boutiques - you won't have a chance of entering the elite PE, HF firms.<br><br>Also exiting out of finance all together will be harder from boutiques than from BBs<br><br>", "<b>Username: Alexandre</b><br><br>HaroldSawyer, Linkedin is not reliable. Michigan students are notorious at not joining sites such as Linkedin. Of the dozens of fellow alums, fewer than 10% of them are on Linkedin. Alums of my other alma matter, Cornell, are far more prone to join sites such as Linkedin. Literally 100% of my Cornell connections are on Linkedin.<br><br>Anyway, Ross does pretty well considering the size of the program and the lack of interest in IBanking among its students. I added the total of your numbers above, and this is what I got:<br><br>Goldman Sachs + JP Morgan + Morgan Stanley<br><br>Harvard 47<br>Wharton 44<br>Stern 39<br>Ross 27<br>Yale 27<br>Cornell 25<br>Dartmouth 25<br>Chicago 24<br>Duke 24<br>Brown 14<br>Sloan 12<br><br>Surprisingly, when you factor in size of program, Ross is #1 among the Big 3 IBanks. Even more impressive when you consider that programs like Stern and Wharton, and universities like Cornell, Duke and Harvard will have 2-3 times more applicants for IBanking jobs than Ross.<br><br>The remaining IBanks (not including HSBC or Well Fargo):<br><br>Stern 49<br>Wharton 42<br>Cornell 37<br>Duke 35<br>Dartmouth 24<br>Princeton 22<br>Ross 20<br>Yale 20<br>Brown 11<br>Chicago 10<br>Sloan 6<br><br>But like I said, the only valid source is either one published by the University or by the company. Linkedin is not reliable, even if you extrapolate.<br><br>And for the record, no program comes close to Wharton. The only reason why Stern may place almost as many grads into IBanks as Wharton is because Wharton has many students who opt for careers in Management Consulting. Last year alone, Wharton placed a whopping 40 grads into Bain, BCG and McKinsey. The year before, Wharton placed 50. When you add the 60 or so that are placed into Goldman Sachs, Morgan Stanley and JP Morgan annually, you are looking at 100+ placed into the top 3 IBanks and the top 3 MC firms. Nobody comes close...other than Harvard.<br><br>", "<b>Username: HaroldSawyer</b><br><br>I tried to use linked in because I thought people joined the site to network on their own will, not because of school-related customs; I thought the probability that individuals have LinkedIn should be somewhat constant, considering that I selected from 11 companies, 12 schools, and thousands of people in my sample. Generally, if you try to reason things out, the numbers seem to make sense anyways. In IB, Harvard and Wharton were on top, Stern seemed a bit under but nevertheless very close. Ross had slightly lower numbers, but is probably better represented proportionally compared to the others, but maybe the same goes for duke and chicago and Ivys.<br><br>I guess you cant really go wrong with any of these schools for IB lol they all seem to be pretty highly targeted.<br><br>", "<b>Username: Alexandre</b><br><br>I would agree with your assessment Harold. All the schools on your list are excellent, particularly if you are interested in a career in finance.<br><br>", "<b>Username: Alexandre</b><br><br>\"HaroldSawyer, I only found 2 IBanking analysts from Ross working at J.P. Morgan and 4 from Ross working at Morgan Stanley. How did you get your numbers?\"<br><br>ennisthemenace, in the case of Ross, you do not have to resort to linkedin. Ross publishes placement figures. In the latest graduating class, 16 joined JP Morgan and 6 joined Morgan Stanley. 8 joined Goldman Sachs.<br><br>\"Michigan's representation at these banks is heavily lacking compared to Stern nevertheless.\"<br><br>Care to share Stern's placement report with us. I could not find it. Besides, given the fact that Stern has 600 students per class compared to Ross' 400, and the likelihood that a higher percentage of Stern students apply for IBanking jobs, I would hope that Stern places at least twice as many of its graduates in IBanks than Ross. So if Ross placed 30 grads into GS, JPM and MS, I would expect Stern to have placed 60. That's how many Wharton, which incidentally is the same size as Stern and likely has a similar concentration of Ibanking aspiring graduates, places into GS, JPM and MS on an annual basis.<br><br>Even if you use linked in as a source, according to HaroldSawyer, Stern placed 88 grads, compared to Ross's 47. That's to be expected given Stern's size advantage and finance-focused student body.<br><br>\"Comparing Ross to Harvard or Cornell is silly since the former is a pre-selected group from a larger university who have outstanding grades, extracurriculars, and a desire to join the business world. There are a lot of weak applicants from Harvard or Duke who have &lt;3.5 GPAs and no impressive ECs who would have been eliminated from the process at the outset if these schools have undergraduate business programs.\"<br><br>Very astute and lucid point ennisthemenace. But then again, Cornell, Duke and Harvard do not have graduating classes of 400. Their graduating classes are in the 1,700-3,000 range. I am fairly certain that you have well over 300 graduates with excellent grades and ECs graduating from those universities seeking jobs on Wall Street. That's more than the number of Ross students seeking jobs on Wall Street.<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"since the former is a pre-selected group from a larger university who have outstanding grades, extracurriculars, and a desire to join the business world.\"\"<br>Only the last of the three is correct.<br><br>", "<b>Username: dwr6254</b><br><br>@Alexandre if a good deal of students at Ross don't use LinkedIn, wouldn't it be safe to assume that there's probably a good deal of students from other students who also don't use LinkedIn? Unless Ross tells its studnets not to use linked in, while all the other schools directly encourage their students to use it...<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"if a good deal of students at Ross don't use LinkedIn, wouldn't it be safe to assume that there's probably a good deal of students from other students who also don't use LinkedIn?\"\"<br>If a good deal of students at most of the schools don't use LinkedIn, why is it a good benchmark?<br><br>", "<b>Username: Decorative22</b><br><br>My spouse is a Ross graduate. He is not on LinkedIn.<br><br>My maid of honor graduated from Ross.<br><br>Not on LinkedIn.<br><br>One of my closest friend's spouse is Ross. Not on LinkedIn.<br><br>I can go on for quite awhile. I think trying to use LinkedIn as a measure of placement or some sort of barometer for a school is quite likely to be a fool's errand.<br><br>Best to check with the school itself.<br><br>", "<b>Username: rjkofnovi</b><br><br>\"Best to check with the school itself.\"<br><br>Here is a link to where Stern's graduates have placed:<br><br>", "<b>Username: Decorative22</b><br><br>I don't actually care about who goes where. LOL<br><br>I just thought I could add some real world anecdotal points into the mix.<br><br>I truly believe in going to the school that suits each student's needs the best, whatever that may be. This thread has become a sort of bizarre contest, and amusing to read. ;)<br><br>", "<b>Username: Decorative22</b><br><br>I admit, though, the empty link for Stern made me giggle. LOL<br><br>", "<b>Username: HaroldSawyer</b><br><br>@goblue81 it's reliable because out of the out of the group of people that DO have a LinkedIn, Stern clearly outnumbers Ross...<br><br>Based on what you people say about Ross, the school's students rarely use LinkedIN, for an ex, Ross's students in JPM only have 2 IB analysts out of 16 represented on LinkedIn, and 14/16 that unrepresented, but with that logic, then there could be the same ratio of people who aren't represented from other schools as well... since all the conditions were left constant, Stern, Wharton, Harvard, etc... would also only have 2/16 people represented, and based on the current given statistics, they would STILL have a ton of more students in these companies than does Ross... Lol you can't just assume that Ross students rarely use LinkedIn, but the other schools's students all do...<br><br>But since this thread is on Michigan's page, it's not surprising that there would obviously be a lot of Michigan fan's putting their biased opinions on here ...<br><br>", "<b>Username: HaroldSawyer</b><br><br>It's strange that students from Ross don't use LinkedIn. So many professional businessmen use that site to network.<br><br>", "<b>Username: Bouncer</b><br><br>Students at Ross don't need the internet to network.<br><br>", "<b>Username: dwr6254</b><br><br>LOL props to the OP who posted this topic of question on the Michigan thread hahaha the biased comments are hilarious, especially \"Students at Ross don't need the internet to network\" lmao... What do they use? Hand written letters?<br><br>All jokes aside, I just felt like sharing some information here. I can't say too much from my own experience, since I'm just a HS Student who applied to both Ross and Stern this year -so obviously I don't work in IB- but my uncle was an MD at Morgan Stanley on wall street for 6 years before going into PE this year, and he was telling me to apply to Stern ED II, instead of doing regular and waiting for the other Ivy and Ross's decisions to come out in late March (I was rejected from Wharton ED). Like he graduated from UChicago and Wharton Grad School, so he probably doesn't have a lot of bias towards Ross or Stern, but he said that Stern undergrads are undoubtedly far better represented at Morgan Stanley than the majority of the ivy's, mit, ross, etc... and that \"Sternies\" apparently swarm the other top BB firms in general (which seems to support what the LinkedIn data said). So to him, Stern was the smartest choice I could've made lol. I listened to his advice since he definitely knows a lot better than I did/do about wall street placement lol. I am happy to say I was accepted to Stern a few days ago too :D<br><br>Generally, it would seem that Stern is better for IB, and probably places better even given the different interest levels. It's probably because Stern is more focused towards Finance, so the students would be better equipped in banking and such, which probably explains the higher interest, placement and quality of students. Interestingly enough, my uncle also said \"you can't go wrong with Ross\", and saying how it is still an amazing school and such lol... so idk. Personally, I would have loved going to Ross. It's probably stronger in the other fields of business so I've heard, and it definitely gives a better well rounded college experience too haha<br><br>", "<b>Username: HaroldSawyer</b><br><br>@dwr6254 everything you said is pretty valid. If you want IBanking, go to Stern, anything else, look elsewhere haha<br><br>", "<b>Username: Alexandre</b><br><br>Harold, like I said, it depends on the school. Michigan alums (including Ross alums) are notoriously bad at social media. Chicago and Northwestern alums are also not known for their use of social media. Maybe it is a Midwestern thing.<br><br>dwr, Stern most likely does not place better into Wall Street than Ross. It obviously places more, since the program is much bigger and more finance-centric, but that does not mean it places better. Wharton, which is undeniably the best at placing graduates in Wall Street jobs usually has twice as many joining major BB IBanks than Ross. Again, like Stern, Wharton is much bigger than Ross, and significantly more finance-centric, so as a percentage of students seeking such jobs, I would say Ross is almost as effective as Wharton. I doubt Stern is better.<br><br>", "<b>Username: HaroldSawyer</b><br><br>@Alexandre i'm not sure if you can make that conclusion I mean the stern kids are clearly placing just as well as the wharton kdis on linked in, are you saying the wharton kids also dont use linked in? wharton's even bigger than stern by about 100 kids ...<br><br>", "<b>Username: HaroldSawyer</b><br><br>lol @alexandre ,I too wish stern published its placement data. Maybe someone could send them an email of this thread and maybe that would convince them haha<br><br>Also, Ross has 16% of its total students in Ibanking, Stern has 53% (look on business week, when they say \"financial services\" it means ibanking. Ross on BW is also 16% ibanking as it is on the BBA profile). So yeah I guess its fair to say that Stern should have at least 3 times as many students placed into the top firms.<br><br><br>But I don't like how you use the \"bad at social media\" excuse when you see that Stern's numbers are a ton higher than Ross's on LinkedIN lol the chances that someone uses or doesn't use the linked in site is the same for every person in every school, don't deny that. If I went to Ross, I could still make a LinkedIN account and use it to make connections lol... it has nothing to do with what school I go to<br><br>Also, I'd like to point out that in my report, I only looked up current Investment Banking analysts placed on LinkedIN for all these schools. The fact that only 2 out of the 16 JPM Ross grads showed up may be due to the fact that not every one of those 16 JPM kids went into the IB Division... afterall, only 16% of Ross does IB, and 16% of 16 is 2.5<br><br>Additionally, when Stern's IB placement on LinkedIN is similar to Wharton's, a school that is also very heavily focused on finance, and also contains about 50-100 more people per graduating class than stern, are you going to say that Ross places better than Wharton in IB as well?<br><br>", "<b>Username: rjkofnovi</b><br><br>Stern does not publish its placement data. Period. Business schools love to brag how great they are, so why is NYU afraid to print theirs? They have the information readily available and yet can't seem to put it down in writing for the general public to read. Why should anyone rely on LinkedIN for this type of vital information?<br><br>", "<b>Username: Alexandre</b><br><br>Actually Harold, in the case of Businessweek data you provided, Financial Services and Investment Banking are the same in the case of Michigan, but not in the case of Wharton and Stern, both of which are including all Finance jobs (including Corporate Finance, Trading, Wealth Management etc...) in their \"Financial Services\" umbrella. Trust me, there is NO WAY that any business program places more than 20% or 25% of its graduates in IBanking. NO WAY! Just look at Ross and Wharton's career placement data and you will see:<br><br>Ross:<br>44% go into Finance, of which 16% go into Investment Banking (as you can see, Ross reported only IBanking jobs as \"Financial Services\".<br><br><url>http://www.bus.umich.edu/pdf/EmploymentData2013.pdf</url> (page 36)<br><br>Wharton:<br>59% go into Finance, of which 25% go into Investment Banking (as you can see, Wharton reported all finance jobs as \"Financial Services\".<br><br><url>http://www.vpul.upenn.edu/careerservices/files/WHA_2013cp.pdf</url><br><br>Those figures are as I expected. Wharton edges out Ross, but that's probably because Wharton is more finance-centric, as is shown by the overall percentage seeking jobs in Finance (44% at Ross vs 59% at Wharton).<br><br>I am still looking for Stern's data. Wharton and Ross seem perfectly content to publish their placement details. Stern? I am sure that Stern does well, but if Wharton does not edge out Ross, Stern certainly doesn't either. The fact of the matter is, Ross is one of the most strategic IBanking hunting grounds.<br><br>Also, Wharton is not larger than Stern by 50-100 per class. Stern and Wharton both have classes of 600 or so. According to my most recent figures, Wharton enrolled 2,562 and Stern enrolled 2,457. Since both are four-year programs, that means Wharton has 640 per class, compared to Stern's 615 per class. In other words, they are identical in size.<br><br>On a final note, I do not recommend using linkedin as a source, especially when conversing with well-informed individuals. In the case of Ross, Wharton, Dyson, McDonough, McIntire, Sloan etc..., you just need to look at the respective placement reports, just like the ones I posted above. Afterall, why guess and extrapolate when you can actually rely on factual data? In the case of Stern...well, in their case, you may resort the the absolute certainty of linkedin! ;)<br><br>", "<b>Username: HaroldSawyer</b><br><br>@rjkofovi NYU publishes it's placement data as a whole so they can avoid publishing data for individual schools. The reason is not because Stern itself places badly, but its more likely because the don't want to expose how crappy the other schools of NYU place. Think about it, Stern is actually the only respectable school at Nyu l<br><br>@Alexandre I like how you mentioned that its impossible for anyone to have a 53% IB placement, and how there is a generally low trend of IB placement from all schools( 15-25%), so my mistake from earlier haha. Stern definitely falls in that range also. Like given the 102 people from that I already found who work in IB from the top 10 companies, this already constitutes for about 17% of the Stern graduating class... not to mention the people who aren't even on LinkedIn, after all, like you said, LinkedIN obviously can't predict the number of people in IB who DON't have LinkedIN lol, but it surely can account for people who do. So we know at LEAST 102 Sternies currently work as IB Analysts from the 9-10 all the companies I previously mentioned...<br><br>Haha you're right abot LinkedIn though. The large number of people who were excluded from LinkedIN from Ross and Wharton (Wharton's 2013 Undergraduate Data: <url>http://www.vpul.upenn.edu/careerservices/files/Class2013CareerPlans.pdf</url> ) show that LinkedIN definitely is not a good predictor of what we don't know, but it at least gives an idea of what we do know.<br><br>", "<b>Username: HaroldSawyer</b><br><br>@Alexandre if you ever find Stern's placement data, please do message me haha<br><br>", "<b>Username: Alexandre</b><br><br>\"The placement reports are somewhat misleading as well since they don't tell you exactly what positions in the banks that these business school graduates entered. Only very few of the Ross grads that entered JP Morgan became IBanking analysts; the rest pursued less desirable roles like Asset Management, Wealth Management, Credit Risk, IT, etc.\"<br><br>True enough. But that is the case with all programs. It's not like al Stern graduates join IBanks as IBanking analysts.<br><br>\"Maybe Stern doesn't need to release placement data since its prowess in being a top Wall Street feeder school alongside other schools such as Harvard, Georgetown, Dartmouth, Duke, and Cornell is already established.\"<br><br>Michigan's prowess is just as established as those schools you listed. It does not stop Ross from publishing details on the placement of its graduates. Cornell Dyson and Georgetown McDonough also have placement reports, as do all good undergraduate business programs, including Sloan, McIntire, Ross and Wharton. Stern is an outlier. Dartmouth and Duke do not have undergraduate business programs.<br><br>\"Are you going to doubt Harvard Alexandre just because they don't release a report detailing what their graduates do once they leave campus?\"<br><br>I am not going to doubt Harvard. But I do doubt Stern. The two are not the same. Harvard is Harvard, Stern isn't!<br><br>\"How can we be sure that a lot of Ross graduates aren't attempting to get IBanking jobs because they know that they are not qualified enough? They might be \"settling\" for companies like J&amp;J, Target, Amazon, etc. since they are not as selective as IBanking firms and their career counselors might be steering them away from finance.\"<br><br>\"Besides, if I'm truly ambitious and want to be the best of the best, I want to attend a school that sends the most graduates to I Banks in pure numbers since I'm more concerned with how the best graduates from a program are doing.\"<br><br>That's pretty much the standard attitude of the majority of students at all top universities, including NYU and Michigan.<br><br>\"Stern is better represented at virtually every I Bank compared to Ross and that's a fact.If you graduate at the top of your class at Stern, you have a better shot of getting a job at Morgan Stanley compared to Ross.\"<br><br>Better represented? Yes, obviously, since Stern has 2-3 times more graduates applying for such jobs. Better shot at getting a job at Morgan Stanley (or any BB IBank)? Not really. In fact, I would not be surprised if the placement rate is as high, if not higher, from Ross, mostly thanks to its more benign grading philosophy and to having far fewer applicants for such jobs in the first place.<br><br>I never claimed that all Ross graduates who wish to pursue careers in IBanking are successfully placed. But the competition for such jobs at Ross is not nearly as intense as it is at Stern. Stern is known to be very cutthroat, precisely for this reason. You should check out the grading curve at Stern and compare it to Ross. Ross is not considered cutthroat. The percentage of students who wish to pursue careers in Management, Marketing and Consulting from Ross is much higher than it is at Stern, and the percentage of students who wish to pursue careers in IBanking from Ross is significantly lower than it is at Stern.<br><br>", "<b>Username: SomeOldGuy</b><br><br>Shockingly, not everyone is interested in moving to New York. Or, to quote the band Foxygen, \"You don't have to be an ****; you're not in Brooklyn any more.\"<br><br>", "<b>Username: HaroldSawyer</b><br><br>@Alexandre I like how you avoided my last point in my previous paragraph lol<br><br>But please stop assuming that the competition is only between students in their own school. On wall street, the competition is between students from one school with other students from every school, not just their own school. There's no such thing as a cap on the number of students that can be hired within a school. There is just a cap of number of students that can be hired each year...<br><br>@ennisthemenace your point is very spot on. 16 students from Ross were put into JPM, but only about 2-3 would end up in Investment Banking. After I spoke with several Ross students, they all told me that only the very top tier of Ross students manage to land IB positions in the top BB firms... 15-16% sounds about right. Apparently, the other 85% are either: rejected from these firms and go into less competitive fields, in other majors to begin with, or turned off by the idea that IB requires 100-120 workweeks, and would much rather have less pay and 40 hour work weeks.<br><br>IB requires intelligence, drive, and dedication. The vast majority of Ross's students are only admitted after their Freshman year at Michigans LSA, and so the quality Ross students is obviously much lower than that of Stern, which explains why Ross students are generally not cut out for IB, but their top tier of students obviously are. Those were likely the preadmitted class also.<br><br>Basically, the average accepted student in Ross had a 3.68 from LSA, and about 33% of the total Ross applicants were admitted. The students from LSA aren't exactly the brightest either, generally speaking, as one would need about a 90 GPA and a 2000+ SAT on average, at least from my school.<br><br>Stern as a whole, on the other hand, firstly rarely allows internal transfers, and it's incoming freshman class has about a 12% acceptance rate, in which 92% of its class was in the top 10% of their high school, and its students usually score in the top 1% of sat scores (2200+). Its selectivity is similar to that of Ross's Pre-Admit program. Evidently, the students at Ross would need to prove themselves more by having these placement reports and higher GPAS, since the quality of its students arent exactly as appealing to recruiters. Since the vast majority of Stern's students are already Ivy Caliber, and every wall street/IB recruiter knows Stern and the quality of students that it contains, so there is essentially no need to create a placement report to \"Prove\" its value, it has already been long-established as one of the top target schools like Harvard, Wharton and the other Ivys. (Although, it wouldn't hurt if the students themselves could see these stats!)<br><br>People only apply to Stern because they already know it is a golden ticket to the best financial positions.... if Stern truly gave the impression that it was worse than Ross, it wouldn't have 6000+ applicants every year. The applicants may as well apply to places like Michigan, where its easier to get admitted and where it would \"supposedly\" be easier to land IB jobs, but clearly thats not the case<br><br>", "<b>Username: SomeOldGuy</b><br><br>As I was saying . . . .<br><br>", "<b>Username: Alexandre</b><br><br>Harold, your post above makes 2 faulty assumptions:<br><br>1. That students do not compete with their classmates for jobs. That is completely incorrect. In fact, the stiffest competition students face is from their own classmates. Students must first compete for grades (Stern is notorious for grade deflation, while Ross is known for grade inflation), and then, they compete for the limited jobs available to them. Companies do in fact cap the number of interviews that they conduct at each program or university they recruit at, and ultimately, limit the number of students that they hire from each university. That is why Stern has such a steep grading curve. With literally 500 students vying for jobs at Goldman Sachs each year, they have to provide companies with a reasonably reliable rating. Like I said, I think Ross is a surer bet.<br><br>2. That Ross is not as selective as Stern. That is incorrect. Ross is as selective as Stern...and the quality of the students is roughly identical. For the one third of Ross students that are preadmitted, you actually have figures that you can compare to Stern. 2,000 applied of which 350 were admitted (15%) and of those who enrolled, the average cummulative unweighed HS GPA was 3.9, SAT (CR+M only) was 1490. The remaining 65% of Ross students are admitted after completing at least one year at Michigan. Those cannot be compared statistically to Ross preadmits or to Stern students since the the Ross admissions office relies primarily of their performance and accomplishments at Michigan (in and out of the classroom). However, their credentials are equally as impressive. As it is, Michigan is very selective, and the the ones that get into Ross are generally ranked among the top third of the Michigan student body.<br><br><url>http://www.bus.umich.edu/admissions/UndergraduatePrograms/PDF/BBA_Class_Profiles.pdf</url><br><br>", "<b>Username: dwr6254</b><br><br>LOL I agree the Ross Pre-admit pool is very selectie and brings in a really talented group of 130 students. However, the other 75% of students in Ross that come in during Soph year drags down the quality of Ross like the person above said. @Alexandre the points you use definitely help me to confirm it.<br><br>Notice the Ross Pre-Admit average sat is 1483 (CR+M), and they on average have 3.9's.. which is definitely in the top 10% of almost every high school. These pre-admit kids constitute for about 25% of the class (130/500), but then there's the total Ross class average SAT, which is a 1377 (Business-week). That means the other 75% of the class (370/500) dragged the average sat scores down by over 100 points, meaning the Regular-Ross-Admit students's averages had to have been about a 1340 (CR+M). Sorry if these numbers arent completely accurate, but the point is that the regular Ross admits are generally really mediocre in comparison.<br><br>Compared to Stern's students, whose total average is 1440 (CR+M), the majority of Ross's students as a whole, are clearly a less capable group. Its not surprising that many of the Ross students aren't cut out for IB, and likely wouldn't even dream of going after such a cut-throat environment. Luckily, there's that well-known Ross grade inflation would help out a good deal of these students with their lackluster performances in class.<br><br>Stern's gpa is only deflated because it has about 600 ivy caliber students competing for jobs, and yeah there's definitely competition within each school, but the competition definitely extends more so beyond just the school.<br>Additionally, recruiters know that Ross has major grade inflation, and they clearly know Stern has major deflation, since they are indeed \"notorious\" for it. These curves explain why only the very top %ile of Ross students receive top IB jobs, while kids with 3.5's+ at Stern can still get the same positions.<br><br>", "<b>Username: dwr6254</b><br><br>@Alexandre what are your credentials even? Like from a quick scroll on your profile, it looks like you've attended Michigan some point or another, and its appears that you spend a LOT of your time on CC talking about random things that aren't even college or job related... like do you even WORK in IB? or like have a job even... lol almost 21,000 posts<br><br>", "<b>Username: rjkofnovi</b><br><br>Alexandre is a super moderator here at CC. As such, he has the ability to modify or even eliminate any postings, both of yours included.<br><br>", "<b>Username: Alexandre</b><br><br>dwr, the 1377 SAT average is not for Ross, it is for Michigan overall. The mid 50% for all Freshmen enrolling at Michigan last year was 1280-1480, with a mean of 1380 or so. Ross does not publish mean SAT scores for the entire class, only for preadmits (their mean SAT is 1490), but the students who enroll at Michigan and then successfully enroll at Ross typically have much higher SAT scores than the 1380 average. If the mean is 1380 for all students, and those who get into Ross once at Michigan (non-preadmits) are among the top quarter of the student body at Michigan (typically Michigan students who are admitted at Ross have Michigan GPAs in the 3.6+ range, placing them in the top quartile of Michigan students), it is safe to say that their SAT scores were higher than the mean (likely well over 1450, since the top quartile at Michigan scored over 1480 on the SAT).<br><br>Generally speaking, only 4 year programs like Wharton and Stern publish admissions data separately. Programs like Ross, Haas and McIntire, that admit most, if not all, of their students from their own student body and not out of high school, do not publish SAT means and averages. As such, you are incorrect in assuming that direct admits into Ross are stronger academically. Like most very selective programs, Ross preadmit is very random. Many equally gifted students are not preadmitted but enroll in Michigan and are admitted once there. Try to think logically guys. Virtually every single post you have written has been flawed and filled with incorrect assumptions.<br><br>As for my own personal background and the number of posts, it sort of comes with the territory. I joined CC 10 years ago and have been a Super Moderator ever since. I won't bore you guys with my career trajectory though.<br><br>", "<b>Username: HaroldSawyer</b><br><br>@Alexandre, all my data came from Businessweek, LinkedIN, Ross Placement, and Wharton Placements. I have no bias, I just analyze what is presented and make conclusions from that. Obviously, my conclusions can't all be true, but to say your conclusions are more valid? Well...<br><br>Anyone who reads these posts who don't have any prior bias to these schools can easily see the extreme bias you show towards Michigan as well as the many flaws in every post you say as well, especially considering that: you have no actual wall street or banking background, you have 21000 posts on college confidential, and your data also comes predominantly from assumptions that you've made throughout the years you've obsessed over Michigan, but can't validate with published data aside from the sites I've mentioned above ^^^^, so I you're not exactly a reliable source.<br><br>1. Go find a link that shows Stern's separate data, because I guarantee that you won't<br>2. Find some evidence that shows Michigan's average sat CR+M is 1377, since you're so sure that the data published on Businessweek for Michigan accounts only for Michigan, and this special treatment doesn't apply to the schools that are better than Michigan.<br>3. Ross Pre-Admit definitely is not random, since the majority of students are very smart. 1480 SAT + 3.9 GPA as just the average shows they definitely put a lot of weight on academic performance and scores<br>4. Unless you can show some actual evidence (that doesn't come from your mouth) that proves anything I've said is false, you're assumptions that my conclusions are wrong aren't true either.<br>5. Just by re-reading your posts alone, one can see that your own data isn't even concrete, and you change your own statistics on a frequent basis to try and make Ross look like a better school than it actually is. Don't believe me? Go re-read some of your own posts. there are so many inconsistencies.<br>6. It's not hard to get a 3.6+ at Michigan LSA and end up in the top 1/3rd of your class<br><br><br>7. This thread was intended to help UCdreamer and future applicants make a better choice in applying to B-schools according to their goals, but they can choose for themselves and make their own conclusions by looking at the data presented in this thread. (See pages 2 and 3).<br><br>8. Alexandre isn't the only person from Ross on this site. A quick chat with a few other Ross grads or current students can easily expose you to the reality that Ross would be worse for IB lol hopefully these students you speak to aren't as biased in opinion.<br><br>9. To keep arguing is pretty pointless because our arguments won't change the reality of anything. Generally speaking, its just a fact that Stern is better than Ross in the long run for IB, PE and HFs. Take a few steps into wall street and you'll see what I mean.<br><br>If you want to work for Ge, Amazon, Ford, look towards Ross.<br>Goldman, Morgan Stanley, JPM -> Stern. (You don't hear kids who want to AVOID IB saying \"Yeah Stern is my #1 choice\") lol<br><br>", "<b>Username: Alexandre</b><br><br>\"Find some evidence that shows Michigan's average sat CR+M is 1377, since you're so sure that the data published on Businessweek for Michigan accounts only for Michigan, and this special treatment doesn't apply to the schools that are better than Michigan.\"<br><br>All of my data is based on fact Harold. According to the Michigan common data set for Michigan's most recent Freshman class:<br>Mid 50% CR 620-720<br>Mid 50% M 660-760<br>Mid 50% CR+M  1280-1480<br>Mean  1380<br><br>Like I said, the 1377 figure posted by BW must be that of Michigan overall, not of Ross. Ross is significantly more selective than Michigan overall as the average student admitted at Ross has a Michigan GPA of 3.7.<br><br><url>http://obp.umich.edu/wp-content/uploads/pubdata/cds/cds_2013-2014_umaa.pdf</url><br><br>Unfortunately, NYU's has not posted a common data set since 2008 (again, very suspicious). However, according to the 2014 USNWR, NYU's mid 50% SAT ranges are:<br>Mid 50% CR 620-720<br>Mid 50% M 640-740<br>Mid 50% CR+M  1260-1460<br>Mean  1360<br><br>Clearly, the 1444 SAT figure posted by BW must be that of Stern specifically, since it is slightly, but clearly, higher than NYU's overall average of 1360 by 84 points.<br><br><url>http://premium.usnews.com/best-colleges/new-york-university-2785/applying/entering-class-stats</url><br><br>I repeat Harold, you frequently make incorrect and sweeping assumptions. Like your statement that:<br><br>1. Stern students are smarter than Ross students<br>2. Or that students do not compete with their classmates for jobs<br>3. Or that it is not difficult to maintain a 3.7 GPA at Michigan<br>4. Or that it is easier to get a job on Wall Street from Stern<br>5. Or that 53% of Stern students work in IBanking vs 16% of Ross students based on BW loose definition of \"Financial Services\"<br><br>Those are just some faulty assumptions that you made based on poorly-evaluated data. If you had taken the time to do some research, you would have avoided those errors.<br><br>Most of my statements have been based on fact. I generally rely almost entirely on source data (common data sets, placement reports etc...). I never said it was easier to get a job on Wall Street from Ross. I said that last year, 30 Ross students joined GS, MS and JPM (factual as shown in the link below), which statistically isn't much lower than Wharton when adjusted for size. Since Stern does not publish data, I said we don't know for sure, but that since Wharton isn't significantly better than Ross, it is safe to say that Stern won't be either.<br><br><url>http://www.bus.umich.edu/pdf/EmploymentData2013.pdf</url><br><br>You rely almost entirely on opinion, Businessweek, hearsay and linkedin. I hope that if you ever do make it to Wall Street, you approach your work far more diligently and thoroughly.<br><br>", "<b>Username: rjkofnovi</b><br><br>\"Unfortunately, NYU's has not posted a common data set since 2008 (again, very suspicious).\"<br><br>Says a lot about the credibility of Stern, don't you think \"Hal?\"<br><br>", "<b>Username: HaroldSawyer</b><br><br>LOL @Alexandre, if the average Michigan SAT is a 1380, you are also including the engineering majors, pre-med majors and math majors, whose general sats are a lot higher than 1380 and they don't even apply to Ross... after all the exclusions, the average Ross applicant indeed falls at around the mid 1300s, since the majority of students at large public schools who apply for business majors aren't exactly smart or have any true passions...<br><br>Its easy to tell you don't know a lot about statistics either...<br>-You can't average the 25th %ile score and the 75th %ile score and assume that number is the average score. It won't even give you a median score<br><br>-How can you compare Michigan's 2013's data to NYU's 2008 data? Aren't you aware that these aren't even fair comparisons? Average/median sat admissions standards have gotten so much more difficult since 2008... you've been on CC for 10 years this should be easy for you to spot.<br><br>Michigan's 2008 data was<br>Critical Reading 590-690 25-75%ile<br>Mathematics 630-730 25-75%ile<br>CR \"average\" according to you, would be a 640, and Math would be a 680 at that time. 680+640=1320. Nyu's \"average\" was 1360 in 2008. Interesting how that works huh?<br><br>Given this fact, you made Michigan's average sat of today look 60 points higher in comparison to NYU's, even though its data was from 2008, when in reality, the general trend of sat scores have just increased in all the universities by a significant figure, and Michigan's sat scores were still lower than that of NYU's even in 2008 lol<br><br>Additionally, a student can have a 1200 sat and a 3.8 fresh year at Mich and still get admitted to Ross since their sats aren't even considered in the Ross sophomore admission process, so that even leaves more room for low sat scorers to get admitted into ross after fresh year.<br><br>So again with these \"assumptions\"<br>1. If you want to find out, you can call the admissions and ask for their data. If not, I think its safe to say that Ross students still generally aren't as smart lol. Even for me, I applied to Ross as a safety since I knew I'd get in. Stern was more of a reach.<br><br>2. You were saying how competition is only against classmates, I was saying how its just against people in general, which includes classmates. What do you expect from IB... its competitive. And I like how you avoided addressing the fact that recruiters know Ross inflates GPA while Stern deflates, so that's why only the top range of students from ross get these good IB jobs hahaha<br><br>3. Is it 3.6 or 3.7? Your numbers are still very inconsistent from post to post. Either way, it shouldn't be hard to keep that average during your 1st year at a public university and get in the top 3rd of your class if you're smart... if you can't, you probably shouldn't be going into business in the first place...<br><br>4. It's just common sense that Stern students can access wall street jobs more easily lmao you can literally walk to your interview. Interviews can walk or take a 10 minute drive to the students lol minimal travelling costs<br><br>5. I was already able to find 102 current top 10 BB firm IB analysts on LinkedIN from Stern. Once again, LinkedIN isn't reliable to PREDICT the number of people in each school in IB, but it definitely CONFIRMS that at least 102 students from Stern are currently in it, vs the 50ish from Ross.<br><br>In Businessweek, Financial services may, or may not, have meant \"Finance\" in general for NYU. I only made a list of students who are currently working in the top 10 BB firms for IB... end of the day, that's only 10 companies... there are also hundreds of boutique, MM, and other random companies in NYC where a stern student can get an IB job ...<br><br>Even if it meant Finance in general, there are STILL hundreds of more businesses that aren't IB related in NYC that a finance major can work for... So everything I said about that is still pretty spot on lol<br><br>I love how you avoid addressing points, like 3,4,5,7,8,9, and your data for sat averages from ross vs stern are still inaccurate and inequitable hahaha<br><br>", "<b>Username: Alexandre</b><br><br>\"LOL @Alexandre, if the average Michigan SAT is a 1380, you are also including the engineering majors, pre-med majors and math majors, whose general sats are a lot higher than 1380 and they don't even apply to Ross...<br><br>That is true, but it also includes Art, Music, Education, Nursing and Kinesiology, whose general stats are a lot lower than 1380. Also, a lot of Engineering, Math and Premeds apply to Ross. Besides, Michigan students who apply to Ross take the same classes as those premed and Math majors, and they still manage to maintain, on average, a 3.7 GPA at Michigan.<br><br>\"after all the exclusions, the average Ross applicant indeed falls at around the mid 1300s, since the majority of students at large public schools who apply for business majors aren't exactly smart or have any true passions...\"<br><br>Wow, that's quite the assumption. But it is flawed because the average Michigan GPA for Michigan students admitted into Ross is 3.7. I doubt that Ross students lack passion.<br><br>\"-How can you compare Michigan's 2013's data to NYU's 2008 data? Aren't you aware that these aren't even fair comparisons? Average/median sat admissions standards have gotten so much more difficult since 2008... you've been on CC for 10 years this should be easy for you to spot.\"<br><br>Harold, I did not use NYU's 2008 CDS in my post above. I used the 2014 USNWR range and even provided a link. I thought I made that pretty clear in my post. Somebody must lack reason altogether to compare data from 2013 to data from 2008! Historically, NYU and Michigan have had almost identical SAT ranges. NYU does not seem to have many functioning CDSs. I am not sure why that is. But I did manage to find the only NYU CDS that actually works (2011-2012).<br><br>According to both Universities' 2011-2012 CDSs:<br>Michigan Mid 50% range:<br>CR 600-700<br>Math 650-750<br><br><url>http://obp.umich.edu/wp-content/uploads/pubdata/cds/umaa_cds2012.pdf</url><br><br>NYU<br>CR 630-720<br>Math 630-740<br><br><url>http://www.nyu.edu/ir/pdf/cds/CDS_2011-2012 Final_NYU.pdf</url><br><br>Like I said, almost identical.<br><br>\"1. If you want to find out, you can call the admissions and ask for their data. If not, I think its safe to say that Ross students still generally aren't as smart lol. Even for me, I applied to Ross as a safety since I knew I'd get in. Stern was more of a reach.\"<br><br>Ross is a safety for you? That's impressive. You are obviously referring to Ross preadmit. Ross preadmit is as selective as Stern...possibly even more so. Did you not see the data posted by Ross for preadmit? 2,000 applied, 350 admitted, mean unweighed GPA 3.9, mean SAT 1484. Those numbers are similar to Stern. In fact, the SAT may be slightly higher, but about 30-40 points. That is insignificant, but clearly points to Ross preadmi being at least as selective as Stern.<br><br><url>http://www.bus.umich.edu/admissions/UndergraduatePrograms/PDF/BBA_Class_Profiles.pdf</url><br><br>\"2. You were saying how competition is only against classmates, I was saying how its just against people in general, which includes classmates. What do you expect from IB... its competitive. And I like how you avoided addressing the fact that recruiters know Ross inflates GPA while Stern deflates, so that's why only the top range of students from ross get these good IB jobs hahaha\"<br><br>I did not ignore it. Recruiters just do not care if a school high grade inflation or grade deflation. They have their GPA expectations which they apply across the board. Do you think employers will value a 3.3 GPA from a program with grade deflation practices over a 3.7 GPA from a program with grade inflation policies?<br><br>\"3. Is it 3.6 or 3.7? Your numbers are still very inconsistent from post to post. Either way, it shouldn't be hard to keep that average during your 1st year at a public university and get in the top 3rd of your class if you're smart... if you can't, you probably shouldn't be going into business in the first place...\"<br><br>The average is 3.68, but 80% of successful Michigan applicants have 3.5+ GPAs.<br><br>\"4. It's just common sense that Stern students can access wall street jobs more easily lmao you can literally walk to your interview. Interviews can walk or take a 10 minute drive to the students lol minimal travelling costs\"<br><br>I am afraid it does not work that way Harold. Some of the most fertile hunting grounds for IBanks at no that close to NYC, including Dartmouth, Duke, Michigan, UVa.<br><br>\"5. I was already able to find 102 current top 10 BB firm IB analysts on LinkedIN from Stern. Once again, LinkedIN isn't reliable to PREDICT the number of people in each school in IB, but it definitely CONFIRMS that at least 102 students from Stern are currently in it, vs the 50ish from Ross.\"<br><br>That sounds about right. Given the size difference between Ross and Stern, I would expect Stern to have twice as many alums working on Wall Street. How does that prove that Stern is better at placing students in Wall Street firms? I would understand if Stern placed 6 or 7 times more students, but twice? Even if Ross and Stern were the same size, it would not prove that Stern provides any real advantage. But Ross is 50% smaller than Stern. Either way, do yourself a favor and never use linkedin to make a point. It will slide here because nobody knows you, but in the real world, you will be mocked for using a source such as linkedin to make a point.<br><br>At any rate, I repeat my initial point. There is no evidence that Stern is more effective at placing students in Wall Street jobs. Of all the programs I have seen, only Wharton edges out Ross, and even then, not by as much as one may think. I rather doubt that Stern is as potent as Wharton, and unless the program starts publishing placement data, we will simply never know. As far as I am concerned, Ross and Stern are roughly identical in their ability to place grads in Wall Street banks. The main difference, as I have point out repeatedly, is that the atmosphere at Ross is less cutthroat, more collegiate and more laidback.<br><br>", "<b>Username: dwr6254</b><br><br>Alexandre and Harold, this thread needs to end and you two need to relax lol. Ross is good and highly respected, no doubt. Just less in Investment Banking than Wharton, Harvard, Stern, Dartmouth or Duke. Though one can't statistically prove this, its just the general vibe. Alexandre, if you had actually worked in IB on wall street and not spent hours on CC everyday, you would know this.<br><br>I spoke with my uncle today about Stern vs Ross after reading Alexandre's posts, as I began to doubt my decision to ED 2 to Stern due to the competitiveness, curve and sketchy placement. But he said that Stern is definitely a better choice and places better than almost every college since almost all recruiters on wall street know that Stern produces high quality students and that it deflates gpa, and therefore they have different expectations for different schools. Of course, a 3.7 at Ross > 3.3 at Stern, but a 3.5 at Stern>>3.5 at Ross if everything else was about the same, while a 3.4 at Stern would be about the same as a 3.6-3.7 at Ross.<br><br>Apparently, a Ross student would have to be much more impressive in terms of activities, interviews, and academics to get the same position as one from the aforementioned universities, at least for IB in Morgan Stanley (he was an MD there).Ross students need to be top 10% of the class to get into IB at MS or GS on wall street. Definitely not the case at Stern. 5 Sternies were hired under his management in 2012, 2 had 3.5s, 2 had 3.6s, 1 had a 3.7. Only 1 from Ross, and he had a 4.0. In 2011, 6 Sternies, 4 had a 3.5-3.7, 1 with a 3.8, 1 with a 3.9. 2011 had 2 kids from Ross, both had a 4.0. Many Ross kids with 3.8s and 3.9s are rejected. Make your own conclusions<br><br>I think I'll put more faith in my uncle's advice to go with Stern, since he has legitimate credentials and actual experience in Ibanking in a BB firm.<br><br>", "<b>Username: Alexandre</b><br><br>dwr, I worked for a BB IBank from 1996-1999. I changed careers after graduate school as I did not enjoy finance. I have, over the years, maintained close ties with Financial institutions. My own family (including father, uncles and grandparents) have reached very senior levels with institutions such as Goldman Sachs, Credit Suisse and BNP Paribas. Also, several of my friends from my years in Banking are now SVPs, Directors and some even Executives at BB IBanks. I even know the head of HR at one of the top 3 IBanks, and receive annual reports of where they recruit the most.<br><br>Like you, I also base some of my thoughts on opinion and experience. For example, I personally think Ross is in fact a safer option than Stern because there is far less competition for IBanking jobs and the grading philosophy is much more conducive to graduate school admissions and job placement. Besides, NYU does not offer such a great college experience while Michigan offers the quintessential college experience. But that is purely my opinion. I have no concrete evidence that Stern's cutthroat grading policies or that the number of grads focusing on investment banking affect the odds of success, and not everybody seeks the collegiate lifestyle offered at Michigan. Conversely, I have not seen any evidence of a preference for Stern, Dartmouth or Duke candidates over Ross, although there does appear to be a preference for Harvard, Princeton and Wharton candidates. Clearly, my experience and opinion differ from that of your uncle. I am sure there are many like your uncle, who believe that Stern is a notch above Ross. However, the majority of the people I have spoken to on this subject do not accord it any more respect than other major target.<br><br>None of that matters, though, since it cannot be proven. I rely almost entirely on data when I make statements on CC, and Stern, Duke and Dartmouth do not publish data, although in the case of Dartmouth and Duke, it is understandable since they do not have undergraduate business programs.<br><br>I will publish exact figures for PE firms later this week. I will focus primarily on Bain, Blackstone, Carlyle and KKR. It will be interesting to see which undergraduate institution is better represented. I know Harvard and Penn will be the top 2 by far, but when I conducted this exercise a few years ago, Michigan actually did better than NYU.<br><br>", "<b>Username: Pat1120</b><br><br>This thread is honestly hilarious. I picked Ross over Stern. I'm a freshman who has already secured an internship in investment banking this summer (w/o family connections) - and I would've done the same thing at Stern.<br><br>There is a serious confounding error when people claim Stern is better than Ross for IB. Sternies care a lot more about finance than Ross kids. Ross students, as a whole, are interested in all facets of business, not just finance. Both schools have tremendous student bodies and opportunities. If you're cut out for investment banking or PE or whatever else, you'll probably land a similar job from both schools.<br><br>But honestly, who the hell cares about IB? It's college; have some fun. I enjoy my Saturday mornings in the Big House. I go to school in one of the greatest college towns in the world. I don't think Sternies can say the same.<br><br>", "<b>Username: dwr6254</b><br><br>Haha @pat1120 your point is pretty similar to Harold's from earlier. He also indicated that the kids who are cut out for IB will succeed in IB either way, Ross or Stern, and those who aren't will just do something else lol. But yeah, campus life at Michigan >>>> NYU for the majority of people. Personally, I don't mind either like... frat house parties vs bars, hookah lounges, nightclubs and raves... all seem like they'd be a good time haha<br><br>@Alexandre that would be an interesting report to see. But aren't jobs in PE HF etc... usually attained only many years after graduate school? (Unless you had really good connections right out of college or you're a true prodigy)... And a kid from Stern under could go to HBS but his path to PE was probably more accredited to his Harvard education and connections made there, more so than Stern undergrad haha how does all this stuff get accounted for?<br><br>", "<b>Username: Alexandre</b><br><br>\"Personally, I don't mind either like... frat house parties vs bars, hookah lounges, nightclubs and raves... all seem like they'd be a good time\"<br><br>There is more than frat parties at Michigan. I personally almost never went to frat parties. You have bars, a couple of nightclubs, house parties etc...But you are quite right, some people do not like the college atmosphere and prefer an urban experience such as NYU. To each his own.<br><br>Anyway dwr, you are 100% correct. PE/VC firms seldom recruit students straight out of college, although some firms hire BBAs. Blackstone hired 10 from Wharton alone last year. But that's Wharton. Blackstone also hires undergrads from McIntire and Ross occasionally, but that is rare. I am not sure at which other universities or programs they recruit, but I assume that they recruit from Harvard, Dartmouth and Princeton as well as from Stern. One degree many employees at PE firms seem to share is an MBA from HBS.<br><br>That being said, if a large number of alums from an undergraduate institution end up in PE firms, it can be safe to say that the university in question opens doors to undergrads that leads to careers in PE.<br><br>", "<b>Username: rjkofnovi</b><br><br>Interesting ennisthemenace how you would bring Duke into this conversation. Hmmmmmmm<br><br>", "<b>Username: dadinator</b><br><br>deleted<br><br>", "<b>Username: Alexandre</b><br><br>\"NYU's location in the greatest city in the world for culture and entertainment besides Paris lends itself to a lot more social opportunities than Ann Arbor's sleepy college town environment.\"<br><br>ennisthemenace, like I said, to each his own. Most 18-22 year olds stand far more to gain from attending a university with a strong and cohesive campus community. For such students, attending a university like NYU is not optimal. Michigan is in fact arguably the best campus environment in the nation. And that \"sleepy town\" of Ann Arbor is almost invariably rated among the top 3 college towns in the nation. While NYC is obviously great and has much to offer, it is mainly designed for working adults and cannot make up for NYU's campus shortcomings.<br><br>\"You can travel to Syracuse to see a college basketball game or attend a frat party if you want to get a little bit of the \"traditional college\" experience!\"<br><br>You got it in reverse. Students live on campus. They study on campus, socialize of campus and conduct most of their extra-curricular activities on campus. Since they spend most of their time on campus, it is the campus that matters more than the surrounding city/town. For the those occasions that call for a large city, Michigan students can spend a weekend in Chicago or NYC.<br><br>\"Do you feel like Dartmouth, Princeton, and Duke would be better options than undergraduate business schools then since they have higher grade inflation (liberal arts curriculum) and you can crack IBanking with a Sociology or Public Policy degree with less competition? It seems that once you attend a \"target private school\", GPA is the primary differentiator before the interview stage so you should feel free to major in whatever subject you find the most interesting and are better suited to your natural abilities. Most of your classmates will be more interested in Law School, Medical School, and Education (TFA and Inner City Teaching Corps) than they will be in i-banking or management consulting than at Ross or Stern students who have business jobs as their end goal.\"<br><br>Princeton is remarkable. I have said as much all along. Along with Harvard and Wharton, it is one of the top 3 campuses for IBanking recruiting activity. Dartmouth and Duke are also excellent, but I would give Harvard, Princeton and Wharton the clear edge. I would even give Ross the slight edge. For one, you seriously downplay the interest in IBanking at Dartmouth and Duke. There are more students dreaming of IBanking then you realize. From what I hear, there are significantly more students interested in IBanking jobs at Duke or Dartmouth than there are at Ross, and major IBanks do not hire more students from Duke or Dartmouth than they do Ross students. The people know who attended Duke and Dartmouth certainly confirmed the high volume of students seeking jobs in IBanking. Also, Ross grade inflation is about as blatant as grade inflation at Dartmouth and Duke, so grading policy is not going to be an advantage. That being said, I think if one really prefers not to spend half of his/her time taking business classes, attending Dartmouth or Duke is a better option. At Michigan, Ross is clearly the way to go for those interested in IBanking jobs. LSA and CoE students can find jobs in IBanking, but the odds are not nearly as good. However, it should be noted that since Ross only requires 55 credits be taken at the Business school, one can theoretically double major in a liberal arts subject such as Sociology or Mathematics and graduate on time, although it will require an extra effort on the part of the student.<br><br>\"Also, if I miss out on getting into Ross after my Freshman Year, then I will be mad at myself for not choosing private schools where you have a chance to rebound after a bad freshman year.\"<br><br>While it is very competitive to get into Ross, students who are strong enough academically to get into a university like Duke or Dartmouth would likely be in the top 60% of Michigan's student body, so there odds of getting into Ross are reasonably good. Still, for those interested in a career in IBanking, if I had a choice between Michigan without Ross preadmit or Duke or Dartmouth, I would recommend Duke or Dartmouth as getting into Ross is not certain.<br><br>\"I look forward to your lists of school representation from the banks where you are acquainted with HR professionals and the PE/HF placement results.\"<br><br>Unfortunately, I cannot divulge the bank in question or provide exact numbers. I did so a few years ago and I regretted it! But I will say it is one of the top 3 IBanks. Last year, Ross was among the top 3 universities/programs at placing undergrads in IBanking jobs at that Bank. And last year was not an outlier. Michigan has a history of placing alums in that bank. Currently, Michigan alums are among the 5 best represented at that bank.<br><br>I will share the results of the PE report I am working on shortly. It should be ready come Monday or Tuesday.<br><br>", "<b>Username: dadinator</b><br><br>This is just too much.<br><br>After reading Alexandre's posts for several years and along the way picking up bits and pieces about his background and accomplishments, I would just mention that this is one person who values Alexandre's thoughts and opinions very highly.<br><br>Alexandre is someone who should be viewed as a very knowledgeable and helpful resource.<br><br>Everyone has to make their own decisions about college, but Alexandre is a wealth of well thought out, well reasoned, analytical information and should be relied upon as such.<br><br>(BTW, I don't know Alexandre and I didn't attend either Stern or Michigan.)<br><br>", "<b>Username: collegecarla</b><br><br>I agree with dadinator. Alexandre is a wealth of knowledge and many people (I for one), have learned a lot from his advice, on a host of issues. Like dadinator, I have no connection to Michigan or NYU.<br><br>", "<b>Username: blprof</b><br><br>This whole thread has gotten ridiculous, but I can't help pointing out to ennisthemenace that Syracuse is a good 6 hour road trip from NYC. Through a lot of snow in the winter. Not exactly something you'd do to go to a frat party.<br><br>", "<b>Username: beckervross</b><br><br>My friends tell me Ross kids get made fun on Wall St for being \"public school dummies.\" Now of course it's just some office banter, but takeaway is that people are going to give you crap for going to a huge public school where the bottom half is a little suspect. This is a fact.<br><br>Ross is a great in-state value and also provides a decent backup for NY/NJ/PA students who can't get into Stern or Wharton. Everybody knows this.<br><br>", "<b>Username: Jtwis55</b><br><br>And the students who make it into Investment Banking from Ross in the first place have to be the top 5-10% of their class, and they are still the last to get promoted into higher positions in companies if they had no connections, and they are constantly shat on for being stupid because they truly are the worst of the best.<br><br>", "<b>Username: HaroldSawyer</b><br><br>How are people still discussing this? @Jtwis55 's post can be used as a summary of the last 7 pages here lol<br><br>@rjkofnovi, more posts don't make you any more informed. It just says you spend way too much time on college confidential. Sorry if high school kids actually have better things to do than post 8000 things on a website. Not that many people spend their lives on cc lol<br><br>", "<b>Username: Decorative22</b><br><br>Yup. RJKnovi.<br><br>It's crystal clear. Alexandre has clearly touched a nerve.<br><br>( as an aside- I was unaware that UChicago had an undergrad business school? Jtwis? )<br><br>", "<b>Username: ForeverAlone</b><br><br>\"\"Michigan, but the fact of the matter is that Michigan is a PUBLIC SCHOOL with like 28000 kids, a 40% acceptance rate, and it's filled with lazy and stupid students.\"\"<br><br>And do you really think that NYU students are really that much different? Look at their admissions statistics for GPA and test scores. NYU is a private school, yet it's still as large as many state universities. Both Michigan and NYU had acceptance rates of 37% and 35% in 2012 respectively. Given that Michigan has a larger incoming class size per year, that would make it slightly better. Michigan's 4 year graduation rate is 75% while NYU has 79%, however Michigan has a 6 year graduate rate of 90% while NYU is 85%. Michigan has higher ranked departments (grad and undergrad) than NYU.<br><br>So by mocking Michigan, you're really not doing NYU any favors because they are undeniably in the same tier.<br><br><br>Anyways, I think this thread goes to show how pathetic financial/banking/consulting practices can be.<br><br>", "<b>Username: beckervross</b><br><br>\"Good luck at Stern, kiddos. You'll NEED to do well to pay back the loans.\"<br><br>Out of state Michigan v Stern is very comparable. If you're not going to invest in your education, what is worthy of investment? I mean seriously. It's the most important decision we'll ever make. Also why do you think private schools can get away with charging so much for the past several decades? Because they deliver a product people want and pay for. The market has spoken and the product is worthy of the cost.<br><br>", "<b>Username: qwertyzxc</b><br><br>@Jtwis55 Have you visited NYU Stern? Before you write it off saying it has no campus, community - you should really try to visit the school, talk to Stern students &amp; do a little more research.<br><br>I was afraid of some of the same things you mentioned before I came to Stern but had I visited and done more research I would've realized how awesome it is and how strong of a bond you are making with your friends and peers b/c constantly exploring the city with them. NYU integrates itself really well into the city and at no point at my time at NYU did i feel like there was no community. Granted you have to be willing go to events when they occur and not just sit in your room.<br><br>Students Organizations are always throwing events at clubs, bars, lounges throughout the city. You get to travel so much (another way you get really close with your peers) - I will have gone abroad 4-5+ times during my time here. Easy for companies, alumni, and people you hear on the news to come and do presentations and they are always in and out. And honestly I'm always just amazed by my peers as well - they are some of the smartest, most socially well-adjusted people i have ever met. The whole no campus/no community thing is way blown out of proportion. If you have any questions feel free to ask me.<br><br>", "<b>Username: Jtwis55</b><br><br>@ForeverAlone I never said Nyu is good. I don't think either school is that good. My point was just that Alexandre is exaggerating the \"magnificence\" of Michigan and the schools within it, and its not as good as he depicts it to be, but if you went there I'm sure you would have a different opinion, but everyone has school pride and bias... Thank your for proving that michigan sucks though lol<br><br>@qwertyzxc no I haven't but I will. When did you graduate?<br><br>", "<b>Username: Jtwis55</b><br><br>Obviously people from Michigan want to claim they're good lol and the only reason people are sticking up for it in this thread is because this thread is in the \"University of Michigan\" section. Have this post in any other part of CC and Michigan will get trashed so hard.<br><br>", "<b>Username: ForeverAlone</b><br><br>I've never been impressed by the average Ross kid here. But both Ross and the Stern student bodies are probably roughly equal and same goes for what they learn. Still very concerning that Stern does not print careercenter statistics. Why is that?<br><br>Really the only reason why the average Sternie will do better than the average Ross kid is being located in NYC.<br>Not because of academic prowess or superior students. Put Princeton away from from the coast, and you still have a powerhouse. Take NYU away from NYC, name it something different and you pretty much have Michigan.<br><br>", "<b>Username: Jtwis55</b><br><br>Like grads and students from Michigan always would think \"Just because I went to Michigan doesn't mean I'm going to be a failure\" so they have to try to convince themselves and the rest of the world that Michigan has great programs, when in reality, everyone knows that's not really the case...<br><br>All the wall street executives are from the Ivy's, Duke, Stern, Chicago, MIT. Very few are from Ross in comparison, so the Ross kids will never gain the prestige or respect from the more powerful executives in the companies because they're associated with Michigan, and therefore they'd have to work 3x as hard to even get the job offers, and work even harder to climb up to attain the higher paying positions<br><br>", "<b>Username: Jtwis55</b><br><br>@ForeverAlone if you read one of the previous posts, it says 75% of Ross students are selected from LSA after freshman year, which is swamped with idiots and losers... Stern is extremely selective and hard to get into from the start. So its students are smarter. Like when I apply next year, I can't guarantee that I'll get into Stern, but I know I'll totally be able to get into Ross like its my worst case scenario lol<br><br>", "<b>Username: blprof</b><br><br>It must be nice to be 18 and know everything.<br><br>"]}