{"title": "northwestern vs duke vs berkeley", "comments": ["<b>Username: purpledinos</b><br><br>Hi guys!! I would really appreciate some input as to which university I should attend. I plan on double majoring on English and Biology. I am not extremely into the party scene (I'll attend one a week...at most...maybe). As of right now I am leaning slightly more towards Northwestern; however, I am still very much undecided. Any comments are welcome!!!<br><br>", "<b>Username: mbotvinnik</b><br><br>Congrats on your acceptances! I am a current student at UC Berkeley and would be happy to answer any questions you might have about it.<br><br>There is everything at Berkeley that you could ever want (in terms of academics, research, sports, extracurriculars, social life, easy to get around, etc). The students are awesome and very enthusiastic about Berkeley and would welcome you with open arms. Berkeley has great programs in both English and Biology (I know many people involved in IB (Integrative Bio) and MCB (Mollecular Cell bio).<br><br>I've never had a problem getting into any class (this semester I started off at #90 on the waitlist for a 600+ person class and ended up getting in), although I entered Berkeley with many AP/college credits (so I entered with sophomore standing). I suppose it depends on your intended major / AP credit standing.<br><br>At Cal, there are many useful tools which help you plan your schedule / find classes. Ninjacourses (<url>http://ninjacourses.com/</url>) is the best way to visualize your schedule and peruse through ratings of classes/professors while Telebears Oracle (<url>http://telebearsoracle.com/#semester:sp14</url>) helps in determining when certain classes fill up compared to other classes (so you can determine when to sign up for which classes).<br><br>", "<b>Username: NROTCgrad</b><br><br>Hands down Northwestern is the best university among the three. No contest, even though Duke an Berkeley are both great schools. Also, all three are big enough that you can avoid the party scene, if you are concerned about that.<br><br>If I was you, I would consider the weather at each location. If you hate cold weather, then Northwestern might be a problem, because Chicago is extremely cold (and windy). Berkeley has very mild weather; not cold in the winter, and not hot in the summer. Duke is more in between the other two, regarding climate.<br><br>Berkeley is very much a California school, with the vast majority of students being California residents (however, it has a significant number of international students). Duke and Northwestern, on the other hand, draw their student body from all of the country, and also have international students.<br><br>If this were my choice, I might just choose Northwestern despite the cold, because it really is the best of the three. Berkeley is a little too big for me (Northwestern plus Duke, combined, would still be smaller than Berkeley). Duke would be my second preference.<br><br>Good luck. You really cannot go wrong with any of these three.<br><br>", "<b>Username: purpledinos</b><br><br>Thanks for the great answers!!<br><br>", "<b>Username: purpledinos</b><br><br>@NROTCgrad in your opinion, what specifically makes Northwestern the best choice out of my other options?<br><br>", "<b>Username: purpledinos</b><br><br>and @mbotvinnik, I am not sure if I want to pursue a pre-med track, but I have heard that, by attending a large school such as Berkeley, it is very difficult to get to work in labs or to get internships in general. Do you have any experience with that?<br><br>", "<b>Username: NROTCgrad</b><br><br>Putting Northwestern ahead of Duke and Berkeley is based on a couple of things. First, Berkeley, amazing as it is, remains a small notch lower than either Duke or Northwestern. I have never heard anybody question that. Its main advantage (compared to Duke and Northwestern) is its climate, its proximity to \"Silicone Valley,\" and for some people its left wing reputation (which it shares with the region as a whole, but especially San Francisco). However, it is far larger, with a much higher student to faculty ration of 17 to 1, compared to 7 to 1 for both Duke and Northwestern. This means that you will have significantly larger classes at Berkeley, and not know your professors as well as you would at Duke or Northwestern.<br><br>So, comparing Northwestern and Duke, why choose Northwestern? Well, frankly, I might have overstated the case there. I might even have overcompensated for the fact that I, personally, would go to Duke if it were my choice. Duke and Northwestern are both very highly regarded, and similar in size. However I do think that Northwestern has a better reputation, but I cannot actually justify it. I think that being so close to Chicago is a major benefit, although winter weather is terrible (so, go to Duke if you hate being cold). Chicago is one of America's great cities and living close by is an education in itself. Plus, educational opportunities are probably a little more likely to simply happen more naturally there than in Durham, North Carolina where Duke is located. Of course Duke graduates will have fantastic opportunities too, but they mostly will need to leave North Carolina to do so. In sum, if you have truly high ambition, you might want to choose Northwestern. If you want warmer weather, then Duke might be a better choice.<br><br>", "<b>Username: mbotvinnik</b><br><br>\"First, Berkeley, amazing as it is, remains a small notch lower than either Duke or Northwestern.\" => I guess I'll be the first. Berkeley has tremendous academics in all fields and comparing them to any other school is rather silly.<br><br>I've never heard of anyone having trouble contacting professors, doing research, or getting involved with internships. If you are willing to put in the effort to seek out opportunities then you will be highly successful. I have several friends in pre-med and pre-vet who are involved with shadowing doctors, vets, etc.<br><br>", "<b>Username: NROTCgrad</b><br><br>@ChaChaanTeng might be able to give a good explanation of Northwestern's strength's compared to Duke and Berkeley<br><br>I just invited him. :-c<br><br>", "<b>Username: classclown</b><br><br>Probably Duke but Northwestern is a very close second...You can't go wrong with either!<br><br>", "<b>Username: Bala</b><br><br>You're lucky to have a multitude of riches. Socially, you seem a better fit at NU or Berkeley than Duke. If money is not at issue, I would favor NU. Promoting Berkeley as mbotvinnik does by stating \"I've never had a problem getting into any class (this semester I started off at #90 on the waitlist for a 600+ person class and ended up getting in)\" should raise alarms. NU will simply have more financial resources than Berkeley. The recession hit higher education funding especially hard in California. It's also hard to undervalue NU's flexibility to now allow for-credit internships DURING the school year. This means opportunities are suddenly available in the fall, winter or spring that one may have been shut out of during the hyper-competitive summer months. Chicago resources in academic or industrial research, banking, consulting, journalism, publishing, the arts . . . . is impossible to trump. These are opportunities that ultimately translate into great resume builders, LORs, and job offers.<br><br>", "<b>Username: purpledinos</b><br><br>First of all, thank you all for your thoughtful answers. I really appreciate all of your help!! I have narrowed down my choices to Northwestern and Duke. I feel that I may be a better social fit for Northwestern; however, it seems like many people I have talked to (including my mom, counselor, and friends) regard Duke as being the more prestigious university. I personally am not that influenced by minor differences in prestige. However, I am now wondering: Is there any substantial advantage in attending the slightly more prestigious university?<br><br>", "<b>Username: kimfuge88</b><br><br>You will get different responses regarding prestige based on geography and people. Go with fit in this case.<br><br>I think the category below is one for which Duke is consistently top 5...<br><br><url>http://www.buzzfeed.com/jpmoore/10-douchiest-colleges-in-america</url><br><url>http://www.gq.com/entertainment/humor/200908/douchy-colleges-list-brown-university-duke-harvard-princeton-nyu-notre-dame-vassar-slideshow#slide=25</url><br><br>", "<b>Username: NROTCgrad</b><br><br>\"I personally am not that influenced by minor differences in prestige.\"<br><br>Outstanding! Prestige is one thing, but what is this thing about getting so nuanced about it? purpledinos, I don't get it either.<br><br>The other great thing about going to Northwestern is that you can go to the greatest baseball park ever built, Wrigley Field, anytime the Cubs are in town. Close to paradise.<br><br>", "<b>Username: justicebeans</b><br><br>In terms of prestige, Duke is probably the most prestigious in the U.S.--closely followed by Northwestern. (Internationally, Berkeley is definitely the most prestigious out of the 3, though). Among employers, I would say that Duke and Northwestern are both highly (if not equally...) regarded. Thus, if you're trying to choose between Duke and Northwestern, please don't take prestige into account, unless you want more bragging rights to your mom, counselor, and friends.<br><br>If you really do plan on double majoring, Northwestern would be the better fit, since it runs on the Quarter System, thus making it easier for you to double major. I'd recommend actually visiting Duke and Northwestern, and joining a class or two--it'll probably make your decision-making process easier. Again, both are great schools, so you can't go wrong. Which college would I personally pick? Northwestern.<br><br>", "<b>Username: theluckystar</b><br><br>Congratulations on your college choices! Frankly, you cannot go wrong with any of the three. If you boil down to either NU or Duke, I'd say Northwestern. You'd get plenty of prestige from NU so prestige should not be a factor of consideration.<br><br>", "<b>Username: NROTCgrad</b><br><br>alicejohnson, you might want to notice that I backed down on my view in my second posting, and in fact stated that I would probably choose Duke if this was my personal choice.<br><br>However, your post overcompensates for my own errors (which I agree that I made). The difference between Duke and Northwestern is not wide, even if it is consistent. For example, the selectivity for Duke is 14% compared to 18% for NU... which is not a huge difference, perhaps even less salient given that Duke is far better known to most people and thus probably draws more applicants. SAT scores for entering freshman are somewhat higher for Northwestern than for Duke, which might lead a person to reasonably assume that Duke is simply attracting less qualified students than is NU.<br><br>In short, I was wrong in my original \"hands down\" comment, but it is not clear cut that Duke is significantly better than NU either. A fantastic education will be obtained from either one. Or Berkeley, for that matter.<br><br>", "<b>Username: ChaChaanTeng</b><br><br>alicejohnson, you should work for the marketing department for Duke. But we all know marketing shouldn't be taken seriously, including yours. Obvoiusly, you wouldn't mention the following:<br><br>1. Many of Duke's Rhodes and Marshall winners were on various merit-based scholarships given by Duke. In other words, if Duke didn't have these merit-based scholarships, their numbers would have been significantly smaller. There's nothing magic about Duke education vs other peers like Northwestern, JHU, or Georgetown. The main difference is those others don't use merit-based cash to lure the best of the best from HYPMS.<br><br>2. Most of Duke research dollars are for its highly ranked medical school. It's not like their other fields, such as sciences and engineering are all that (except only BME)..<br><br>3. Duke has less faculty with AAAS &amp; NAE memberships than Northwestern. Duke has higher \"productivity\" than UChicago too but I highly doubt Duke's faculty are more prominent.<br><br>4. As for campus beauty, I would take the lakefront over those copycat Gothic buildings any day.<br><br>5. Yes, weather at Durham is better but I would never choose Durham over arguably the greatest American city, even if the winter freezes my b*tt off. I believe most people wouldn't either.<br><br>In conclusion, Duke and Northwestern are peers. Don't make it sound like Duke is at the level of HYPS, it's not.<br><br>", "<b>Username: ChaChaanTeng</b><br><br>As for grad school placement, please show us data that show a Duke candidate would somehow has the edge over candidates from other peer schools with identical stats (GPA, test scores, etc). Please also provide data that show the number of applicants vs number of admits and their stats. Until then, you have no basis to back up your claim.<br><br>", "<b>Username: ChaChaanTeng</b><br><br>Supernova123,<br><br>You are confusing the difference between raw data and the (mis)interpretation of them. Just because the faculty are more \"productive\" doesn't necessarily mean they are more prominent. Productivity is in constant flux anyway; faculty can easily publish several papers in one year and not a single one in the next year. At least AAAS and NAE take a much longer and more holistic view when they grant memberships.<br><br>Anybody can easily come up with arbitrary criteria such as whether one school has more beautiful people than another school. That person could use the number of blondes as the measure and concludes that University of Alabama has more beautiful people than Duke because Bama has higher percentage of blondes. Just because you got \"objective data\", number of blondes, doesn't mean the claim is right!<br><br>", "<b>Username: NorthwesternDad</b><br><br>And the national merit scholarships offered by NU is a drop in the bucket ($2000 per year) :-)<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Awww, that's cute. Duke and Northwestern partisans arguing over national academy membership. :)<br><br>", "<b>Username: NROTCgrad</b><br><br>@Supernova123<br>My statistics for selectivity at Duke and Northwestern are accurate. If you think that they are inaccurate, then provide your own data. As of now, my data stands.<br><br>", "<b>Username: NROTCgrad</b><br><br>@Supernova123<br>Googling is your job now. I already did it and that is what you see. Provide your own stats!<br><br>", "<b>Username: NROTCgrad</b><br><br>The actual math is 11.7%, which is not that far from the 14% which I quoted (from last year). I will grant you, your data is more up to date, and the trend is downward.<br><br>But still no data for Northwestern? Do I detect bias here?<br><br>", "<b>Username: ChaChaanTeng</b><br><br>eni,<br><br>I am talkiing about AAAS and NAE. Look up their websites for the numbers. Duke has less, not even close for NAE.<br><br>Nobodty would turn down HYPS for $2,000!<br><br>Supernova123,<br>Duke doesn't have higher math score. It's 10 points higher at 75th percentile but 10 points lower at 25th percentile. So it's even. The only reason behind the 10 difference at the 75th percentile is that Duke's engineering students make up 30% of the student body. At Northwestern, that's more like 15% (both are my rough estimates but should be prety close). If you compare only the same type of school, NU is probably even ahead. Honestly, I feel silly to even split a 10-point difference; you really shouldn't have brought that up at the first place.<br><br>Yes, they do make a difference. Northwestern has been at the low end as far as generosity goes. The point is it's silly to claim one would give superior education than others using those numbers. Northwestern actually has more Cambridge Gates scholars who are entitled to even more monetary awards with more flexible duration than Rhodes; does it make it better? No.<br><br>", "<b>Username: NROTCgrad</b><br><br>\"As far as SAT scores are concerned, it's probably worth mentioning that a significantly higher portion of Duke's incoming class submits SAT scores (NU leans towards the ACT).\"<br><br>This is not true. 80% of NU entering freshman submit the SAT, while 93% do so for Duke. This is statistically insignificant. In each case, the sample size is so large that clearly the SAT statistics are accurate for both schools. Plus, my investigation shows that the math scores for NU and Duke are almost identical (700 to 780, middle 50%). Please provide any statistics which prove otherwise.<br><br>ChaChaanTeng is correct, a 10 point difference on the SAT is not worth mentioning.<br><br>", "<b>Username: Bala</b><br><br>Most recent #s from Dept of Education NCES College Navigator<br><br>Duke<br>ACT 30-34<br>SAT Verbal 670-760<br>SAT Math 690-790<br><br>Northwestern<br>ACT 31-34<br>SAT Verbal 690-760<br>SAT Math 700-790<br><br>", "<b>Username: NROTCgrad</b><br><br>supernova123 has started the following thread:<br><url>http://talk.collegeconfidential.com/profile/discussions/100317880/Supernova123</url><br><br>Looks like he might be just a Duke University partisan who hates to admit that another school is a pretty darn good choice.<br><br>", "<b>Username: NROTCgrad</b><br><br>Okay, fine. Let's say it is 10.8.<br>It is also totally irrelevant.<br><br>Admission rates are the most irrelevant statistic about any college. The only thing they are good for is to help a student determine their chances of admission -- nothing else. It tells you next to nothing about the quality of the college.<br><br>The SAT and ACT scores at least tell you something. In that, NU is as good or better than Duke. See the post by Bala, above.<br><br>", "<b>Username: Jeremyjoe</b><br><br>I worked a top bulge bracket investment bank for 7 years in NYC and can confidently say that Duke and Northwestern are very much peers. It is ludicrous to suggest otherwise. Objectively speaking, look at the numbers, they speak for themselves - see below<br><br>from collegeboard.com's profile..obviously, a year outdated but you get an idea for the class strength of both<br><br>Northwestern SAT - 1390 to 1550 SAT....ACT - 31 - 34....91% in top 10 of their class<br>Duke SAT - 1360 to 1550....ACT - 31 - 34....90% in top 10 of their class<br><br>This year - NU's acceptance rate is around 13% and Duke's is close to 11 or 12% (including ED and RD).<br><br>It looks like they are very close from a student body strength perspective. In fact, Northwestern has a sightly higher SAT average. And the argument that Northwestern has a much higher concentration of students submitting ACT scorers as opposed to SAT scores, is also an exaggeration. Please look at the numbers below.<br><br>Duke - 75 / 49: SAT / ACT Split<br>Northwestern - 64 / 60: SAT / ACT Split<br><br>At both schools, the majority of students submits SAT scores but there is a large portion at both schools that submit both SAT and ACT scores.<br><br>Also, from a reputation standpoint, both schools in US News have comparable (if not the same) reputation scores from academics.<br><br>Both schools have very strong grad programs. Northwestern wins in the MBA category (top 5 b school). Duke wins in the med school ranking (top 5-10). Both have top 15 law schools. Northwestern has one of the best econ programs in the world and Duke has some solid programs as well.<br><br>Please choose based on fit. Both schools are fantastic. Personally, being close to one of the best cities in the world (Chicago) would make me inclined to choose Northwestern over Duke, since it is in Durham. Northwestern students have access to many internship opportunities, world-class restaurants and theatre, etc.<br><br>Best of luck. My choice would be Northwestern!<br><br>", "<b>Username: NROTCgrad</b><br><br>Supernova123,<br>You are the one that was wrong in your claims about SAT scores for Duke. All we did was point out your error. In other words, it was your strategy -- not mine or anybody else. Sorry, but that is the fact.<br><br>Just because Northwestern freshmen have slightly higher SAT scores (and it is slight), does not mean that NU is a better school. It simply means that NU is just as good at attracting high caliber students as Duke is. This is especially interesting because Duke is far better known. It is not a huge point, and simply means that they are clearly peer institutions.<br><br>Everybody here thinks that Duke is a fabulous school. Duke is not being dissed here. Yet, you have this weird urge to have a debate.<br><br>You have the potential to be an outstanding advocate for Duke. Why don't you work on that instead of creating controversy where none exists.<br><br>", "<b>Username: superdub</b><br><br>Can I ask both of you who are arguing, does it matter? It's obvious that both schools are great, and if one were to say one is better than the other, then they would be wrong and right because that is such an open question and the answer depends solely on the person answering.<br><br>", "<b>Username: superdub</b><br><br>@jeremyjoe I heard duke is more favored than NU for NYC offices, is that true? while nu places better in chicago?<br><br>", "<b>Username: bud123</b><br><br>supernova, yes Vanderbilt has high test scores (RD SAT M 750-800, V 740-800, and ACT 33-35) but they are holistic in their admission process just like Duke, NU and all the other \"most selective\" universities. Test scores alone will not get you into Vanderbilt. 94% were in the top 10% of their class, 100% held major leadership positions or won major awards, 46% were varsity team captains or county /state award winners, 93% held major leadership positions in community service or social groups, and 40% held major positions or won major awards in the fine arts.<br><br>", "<b>Username: AnonMom13</b><br><br>So, let's be clear -- you have two fabulous choices and I am sure you will be happy at both schools. If you visit both campuses (do an overnight if you can although time is running short!) you might get a sense for which is a better fit. Where are you from? Don't underestimate the value of being a drive away instead of a flight away. Good luck.<br><br>", "<b>Username: YrToGo</b><br><br>Does Duke offer anything comparable to NU's MMSS and Kellogg Financial Economics certificate ? That combination seems outstanding.<br><br>", "<b>Username: SAY</b><br><br>Do all of you realize SN123 is a high school student? Duke and NU are very similar academically but very different by culture. Duke is very southern surrounded by the deep south. NU has a completely different feel and vibe. No one could confuse them.<br><br>", "<b>Username: Crimsonstained7</b><br><br>Alright, let me put this the best way I possibly can.<br><br>Durham is not a nice city.<br><br>With about 2x the crime rate of Evanston, Durham is pretty dangerous, it's not attractive, and when I visited twice I saw approximately 0 amounts of culture. People say the research triangle is a nice area, but they mostly mean Raleigh and Chapel Hill plus the confines of Duke, not the actual surrounding area of Durham. If you're looking for a nice area as a major part of the fit, Northwestern is in a way nicer area. Plus add in the cultural capital, historic nature, and general awesomeness of Chicago, I'd say there's no argument if those kinds of things were a major factor.<br><br>However, if you're looking for prestige, Duke is far more well known on the East Coast. When my friend said he got accepted to Duke people were amazed, when I got accepted to Northwestern, people wondered where it was (I'm from SC). That didn't matter to me, but it was just something I'd like to note.<br><br>Duke has great basketball, while we don't have any great teams in the major sports, so if you're looking for a huge sport to rally around, Duke's probably better.<br><br>If you care about weather a ton, Duke's better.<br><br>If you want a huge amount of flexibility in your courses, Northwestern's quarter system has Duke beat (I might be a Major + 2 Minors with at least 7 or so left over classes after school and major/minor requirements).<br><br>If you're looking for a larger diversity of students, Northwestern's the way to go. My group of friends includes a theater major, journalism major, hard science majors, and more liberal arts type majors. I know tons of musicians, a dancer, and tons of other people into tons of different things. Duke, as far as I saw and have heard from my friend there, isn't nearly as diverse in terms of what people are interested in.<br><br>Point is, look into your fit at schools. If you care a lot about the weather and sports, then you won't like NU as much, almost assuredly, but if you love watching student theater and might double major (which you said you might) then NU's probably better.<br><br>", "<b>Username: 11bawb</b><br><br>San Francisco is indeed a fantastic place. But, no, unless the OP is already pursuing a PhD, there is absolutely no meaningful difference between the very high quality undergraduate programs in English and Biology at all three schools.<br><br>", "<b>Username: purpledinos</b><br><br>Thanks so much to everyone who contributed to this thread!! After much deliberation, I have decided to attend Northwestern. After visiting all of the campuses and talking to students at the schools, I found that I am a better fit for both NU's campus (and relative proximity to Chicago) and its student body. Good luck to everyone else making their college decisions!! I hope that this thread helps loads.<br><br>", "<b>Username: rjc996</b><br><br>Hey purpledinos!<br><br>I'm in the same position right now that you were in a year ago. I was just curious as to what made you choose Northwestern and how you knew it was the right fit. I love both schools/campuses and I'm having a very difficult time deciding.<br><br>"]}