{"title": "cornell vs johns hopkins", "comments": ["<b>Username: fjchowdhury</b><br><br>Got into both, now need to make a critical decision.. College of Arts and Sciences at Hopkins or College of Human Ecology at Cornell? I want to be a doctor but want to study the history of medicine/science/technology as a major. Any thoughts? How do both treat pre-meds? Which one has higher/lower grade inflation/deflation? Which one has an overall better quality of student life? Better food?<br><br>", "<b>Username: arjuninthehouse</b><br><br>if u want to become a doctor *sigh* choose JHU...<br><br>", "<b>Username: bongoboy</b><br><br>Cornell definitely has better food. It's rated in the top 5 by Princeton Review.<br><br>Both schools have grade deflation.<br><br>Cornell has a better quality of life I'm sure. I've heard bad things about JHU, especially for pre-meds.<br><br>Cornell is more prestigious.<br><br>", "<b>Username: spyrey</b><br><br>I'd say it just comes down to which school you like more. Both schools are equal in terms of quality of education and oppurtunities. Do you like the idea of living in Baltimore, or in Ithaca?<br><br>", "<b>Username: NishtDawg</b><br><br>John's Hopkins is waay prestigious when it comes to med, though.<br><br>", "<b>Username: bongoboy</b><br><br>Also, I heard that JHU's immediate location is crappy.<br><br>", "<b>Username: arjuninthehouse</b><br><br>bongoboy,<br>JHU's medical program is 7th best in the world!!!<br>for medicine...JHU's better<br><br>", "<b>Username: bongoboy</b><br><br>Not at all by the rest of the school and the outside world doesn't and wouldn't know once you graduated.<br><br>", "<b>Username: fjchowdhury</b><br><br>Do both schools really have grade deflation? Blah, crap. I went to Cornell for three weeks to study (summer program), and I absolutely loved Ithaca. Not sure about the winters though... and I would really like to be close to home. But I LOVED Cornell and Ithaca especially!<br><br>How would you compare Cornell's College of Human Ecology with Johns Hopkins College of Arts and Sciences though?? Is Human Ecology \"less prestigious\" than the other? Is it looked down upon by the rest of the school? Just wondering...<br><br>", "<b>Username: CompMan86</b><br><br>Arts and Sciences is kind of viewed as the \"general education\" school. The people who don't know what they want to major in go to A&amp;S usually.<br><br>", "<b>Username: SineWave</b><br><br>I say go Johns Hopkins - it is THE place for medicine. Cornell is ivy, but human ecology doesn't seem as fitting as JHU.<br>On the other hand, I have heard that JHU's campus is rather ugly, especially in comparison to cornell's...but that is just what I have heard.<br>Do you care more about prestige and productivity or about how nice things will look/taste?<br><br>", "<b>Username: norcalguy</b><br><br>I would say that Cornell will probably give you more of a full college experience while JHU is more \"sciency.\" JHU does have a slightly higher placement rate in med school school (the actual rank of JHU and Cornell's med schools are irrelevant in this case) but keep in mind that JHU does pre-screen their applicants. If you apply to med school w/ what they feel to be low stats, they will write you a bad committee letter.<br><br>", "<b>Username: jjh33</b><br><br>although i got rejected from both..<br><br>i would choose Cornell = location!!!<br><br>", "<b>Username: shizz</b><br><br>If you want to become a doctor, go to the school where you will succeed. Med schools won't care that you went to JHU as opposed to Cornell. The ranking of the medical school has no bearing whatsoever on the quality of the pre-med program. I don't know why anyone thinks it does. I've heard horror stories about the pre-med program at Hopkins from friends that went there. If you strive in a super cutthroat environment, then knock yourself out and have fun at Hopkins. That's not to say it's not stressful at Cornell, but it doesn't attract the crazies at quite the same rate.<br><br>Visit both schools and see which one you like better. I visited Hopkins back in the day and I didn't like it at all, but I did fall in love with Cornell.<br><br>", "<b>Username: frs</b><br><br>I got outright rejected from Johns Hopkins today, so I thought I was gone for Cornell, but I actually got accepted at Cornell. What is the admission rate at JHU?<br><br>", "<b>Username: Moose0884</b><br><br>\"\"bongoboy,<br>JHU's medical program is 7th best in the world!!!<br>for medicine...JHU's better\"\"<br>The *ONLY* reason why that would matter undergrad, is some potential research I guess?<br><br>", "<b>Username: shizz</b><br><br>\"\"The *ONLY* reason why that would matter undergrad, is some potential research I guess?\"\"<br><br>and med schools will rarely take on undergrad researchers, and if they do itll be to make them wash test tubes for minimum wage<br><br>", "<b>Username: BanKai</b><br><br>JHU's campus is amazing. very pretty. plus you're in the CITY. who wants to look at pretty landscape??? there is a TON of stuff to do in baltimore.<br><br>When people ask you where you're going, and you say JHU, they usually ask, \"O you wanna do medicine?\" First impression that I get for Cornell is engineering.<br><br>JHU's acceptance rate dropped cause so many more people applied this year and apparently the E.D. group was very strong (according to the admissions guy on CC).<br><br>If you're doing med, go to JHU.<br><br>", "<b>Username: theslowclap</b><br><br>Pick Cornell. Cornell has better food. Cornell is more beautiful. Cornell is more prestigious. It snows at Cornell. There are hotter girls at Cornell. Cornell doesn't screen its medical school applicants. Johns Hopkins has more cut-throat competition. Bears eat bluejays.<br><br>And it doesn't matter how high the medical school is ranked. We are talking about undergraduate here. Pre-med and medical school are completely different things.<br><br>", "<b>Username: 1337hax0r</b><br><br>i also got into JHU and cr0n3ll. However, I'm going for engineering. Cornell would be the obvious choice right? I'm in a deadlock between JHU, Cornell, Carnegie Mellon, and Umich...all great for engineering. I'm still not sure if that's what I want to do though...I like philosophy, psychology, and neuro/cog sciences. I don't like remote places, but then again cornell's campus is so big that it's like a city on its own. Hmm...help me decide.<br><br>", "<b>Username: arjuninthehouse</b><br><br>ooo...definitely Cornell then<br><br>", "<b>Username: BanKai</b><br><br>\"There are hotter girls at Cornell.\"<br><br>... NO...<br><br>", "<b>Username: bongoboy</b><br><br>Oh come on. Everybody knows those JHU girls are beasts.<br><br>", "<b>Username: heythatslife</b><br><br>Do we have any tangible proof that the girls at either schools are better than the stock from the other? Until we do, let's leave that out of the equation.<br><br>Cornell definitely has better environment, hands down. Who wants to live in a run-down city? Having lived in pristine countryside for the past several years, I feel that my lungs would rot if ever I was to spend more than 5 days in a city like that.<br><br>", "<b>Username: CC Admin</b><br><br>Damn i just found out this morning i forgot to withdraw from JHU. as a result i got my first rejection email!! oh yeah! i'm so glad they rejected me :D<br><br>", "<b>Username: PalmBeach33480</b><br><br>tough pick..that's all i can say :)<br><br>", "<b>Username: stonecold23</b><br><br>im going to hopkins, but only bc i got waitlisted at cornell; if i get in to cornell, goin ther<br><br>", "<b>Username: Agrophobic</b><br><br>what if we're not doing medicine but just biology in general(undecided)<br><br>Cornell or JHU biomedical engineering?<br><br>", "<b>Username: Melodie</b><br><br>All these posts are helpful for someone who wants to do science/engineering, but which school should I go to if I have no idea what I want to do?<br><br>", "<b>Username: The Madden Bus</b><br><br>the curriculum for pre-med is probably of equal difficulty at both Cornell and Johns Hopkins (incidentally they are probably the two most difficult universities to succeed at in pre-med). I guess chose on other factors.<br><br>", "<b>Username: K1ngMe</b><br><br>\"JHU's campus is amazing. very pretty.\" ...I'm sorry. WHAT!? There is no way you are comparing a busted ghetto setting to a perfect college town of Ithaca.<br><br>Also, \"There are hotter girls at Cornell. \" + \" Johns Hopkins has more cut-throat competition.\" ... Both are not true. I dont know about chicas going to JHU, but i know that Big Red girls are pretty fugly. \" Bears eat bluejays.\" ... i swear i saw a bear being chased by a jay. the thing ran it down and beat it's head into the ground. it was horrible<br><br>", "<b>Username: mllestephanie</b><br><br>The Madden Bus (or anyone else), why is Cornell one of the most difficult places to succeed at for pre-med?<br><br>Also, sorry for being a complete loser, but can someone explain to me what grade inflation/deflation means? thanks...<br><br>", "<b>Username: envelopes</b><br><br>wow, 1337hax0r - i'm in the same predicament you are (cmu/jhu/cornell for engineering) and i have no idea which i'm going to choose >&lt;<br><br>", "<b>Username: fjchowdhury</b><br><br>haha yeah, this is a really tough choice ot make! also, how are the pre-med programs at both schools harder than other schools' to succeed in?<br><br>thanks for all your comments guys, they are helping out a lot<br><br>", "<b>Username: Melodie</b><br><br>Asking again since everyone is still talking about engineering and pre-med... Where should I go if I don't know what I want to do yet?<br><br>", "<b>Username: gomestar</b><br><br>melodie - probably Cornell. JHU has a fantastic pre-med program that is equal to or better than Cornell's, but for everything else Cornell is hard to beat (especially by a school like JHU). Cornell has more courses, more majors, more programs, etc.<br><br>", "<b>Username: bball87</b><br><br>all i know is that when Cornell and JHU go head to head, Cornell usually wins, there was even a study, said that Cornell usually loses to Duke, Columbia, Penn, Brown, the rest of the ivies<br><br>equal with NU, Gtown, and a few others<br><br>wins over JHU and Wash U<br><br>", "<b>Username: fjchowdhury</b><br><br>BUMP...<br><br>I got a 100k scholarship to JHU.. this puts me in an even tighter bind! Cornell only gives need-based assistance so I doubt I will get any since my parents can afford it... what should I do?? Or rather, what would you do??? (You know you don't know what to do when you ask people online to help you decide, haha)<br><br>", "<b>Username: TrackBabi17</b><br><br>This may be a little biased coming from a Baltimorian that's tryna get out of MD, but they may be the same on The List (u kno which one i'm talking about) but Cornell is an Ivy, it gives a lot of finaid, it's in a beautiful environment, and of coures has great food (that's all i need). Plus I've lived near the JHU campus my whole life and it cool but real small, it takes like 30 minutes to walk through the whole thing. The city of Baltimore is lively, but you have to be a Baltimorian to kno the ins and outs (like not interacting with the homeless b/c they could be a crackhead). If you like city life and cafeteria food go to JHU but if you like the great outdoors and gourmet food go to Cornell. Visit both to get a first impression.<br><br>", "<b>Username: ranjeremy</b><br><br>for the reason that matters most, which is academics, JHU is DEFINITELY better than cornell for premed. there are other less important things (such as the campus and food) that would make cornell seem more desirable, but what does it really matter? as long as you get fed and have a place to live, the extent of the superiority of said food and place is really insignificant. plus, the very prestigious JHU graduate medical school is next to impossible to get into, but attending JHU for undergrad would undoubtedly help.<br><br>", "<b>Username: live-</b><br><br>I've lived in Baltimore (or 15 minutes north of downtown) my whole life and will be attending Cornell (engineering) next year -<br><br>First off, Baltimore is just like any city - of course you don't interact with homeless people or beggars or whatnot. Just ignore them. Baltimore has a bad reputation for crime rates and such, but, like anything, if you don't go looking for trouble you aren't going to get it.<br><br>Food - I can't say anything about Cornell's (except that their on-campus food has a great rep), but I know JHU will have great off-campus food if you are into seafood.<br><br>Also - I'm not sure where everyone gets it that the quality of life at JHU is crappy, but around here, its known as a party school. I know a few people who are freshmen there right now as well as people at Towson U (which you'd think would be much more of a party school), and all of them say that parties and the social scene in general are way better at JHU. I've never heard anyone say they don't like being at JHU...<br><br>The winters aren't going to be all that different - more snow in Ithaca, sure, and a bit colder, but its still quite chilly in Baltimore from November to February. Not really something to make or break a school.<br><br>Academically, I wouldn't say (based on reputation) there's too much of a difference...so if youa re having a hard time deciding, that 100k scholarship (congrats on that) should make it a no-brainer.<br><br>", "<b>Username: fjchowdhury</b><br><br>Thanks so much for your advice guys! It's very interesting to see the two very contrasting perspectives on Baltimore. I'm thinking that it will eventually come down to the money, but we will have to see. I am going to go visit Hopkins one last time to get the feel of it (I visited it last year during the winter so it looked very bleak) and I willl have to make a choice.<br><br>", "<b>Username: stonecold23</b><br><br>if you got a 100K scholarship to JHU , then your not going to have a problem dealing with grade deflation or competitiveness at either... since its clear that your among the cream of the crop<br><br>", "<b>Username: aminaest</b><br><br>Cornell's got the best food ever, you can smell it from miles away. Hopkin's food tastes like Cafeteria food from the second grade. Unless you want to be spending 20 bucks a day on starbucks sugary pie, then you better stick with Cornell. On the other hand, i heard its expensive to live in Ithaca so I dont know.<br><br>Hopkins is much smaller than cornell, so it will be harder to get away from people you dislike. Buth with cornell, the student body will be so diverse (ranging from hotelies to engineering) that you will bound to find someone you like. So if money is not an issue, then attend cornell.<br><br>", "<b>Username: TrackBabi17</b><br><br>yes please visit b/c my perspective is a little pessimistic. Ive been waiting to get away from B-more for like four years. If I went to JHU I would be way too close to home.<br><br>", "<b>Username: aminaest</b><br><br>OH right, Cornell's got prettier people...and more parties (if you want to dwell on the superficial aspects).<br><br>", "<b>Username: TheBasedGod</b><br><br>what were your grades and ec<br><br>"]}