{"title": "ucla vs berkeley vs nyu", "comments": ["<b>Username: CHOUder</b><br><br>Okay, so I'm in a three-way dilemma between these three schools. Here's my take on it...<br><br>", "<b>Username: JJJNET</b><br><br>about NYU not being as prestigous. it is!!! it is as prestigous as UCLA and slowly catching up to berkeley... it is also the most prestigous internationally. If it were up to me, it would be a toss up between UCLA and NYU<br><br>", "<b>Username: Chibifry</b><br><br>woahh NYU is definately better than UCLA and on par with berkeley if not better.. NYU has consistently been voted as #1 dream school! but yea, this is a pretty hard decision. I would say if you can afford it , go to NYU. But I have a big NYU bias, you see. lol. UC Berk is really good.. but you dont seem to love it much. I would say for you, it seems like UCLA is really where you wanna go, despite the whole prestigous ranking thing.<br><br>", "<b>Username: va bene</b><br><br>CHOUder, you mean:<br><br>Sludging through the slush with the wind whipping at your face and your nose running, sipping coffee.<br><br>Haha, just kidding. Good luck with your decision, my advice would be to visit the schools and talk to the students outside the admissions dept.<br><br>", "<b>Username: Sogui</b><br><br>Which school did you get into at NYU?<br><br>", "<b>Username: suze</b><br><br>Only in Cali do they believe that NYU is inferior to undergrad at LA and Cal. If you want to live in CA for life, then go to one of those. But NYU has it all. Great profs, great location, great access to jobs all over the world. If you've spent most of your life in CA, head to NYC for a really great experience.<br><br>", "<b>Username: CHOUder</b><br><br>Sogui, I got into Steinhardt as a Communications major.<br><br>", "<b>Username: Flippy</b><br><br>NYU sucks ass compared to the top notched UCs. How could people think that NYU is more prestigious than Berkeley and UCLA?<br><br>O_o<br><br>I'd say UC Berkeley all the way.<br><br>", "<b>Username: bobbobbob</b><br><br>Yea i live in NY and even I know that Berkeley > NYU any day of the week.<br><br>", "<b>Username: liek0806</b><br><br>There's no point on spending a ton of more money just to attend NYU, save that money, and go there for grad school especially when you can get in state tuition at UCB or UCLA. I say go to UCLA, it's away from home, and it's definetly a different experiance than living in NoCAl.<br><br>However, i have no idea how anyone could love the whole so cal or hollywood scene, it's very superficial, it isn't real. I've lived in LA for 18 years, I know!<br><br>", "<b>Username: Beloved</b><br><br>I'd say either UCLA or Berkeley . Nice weather and affordable cost<br><br>", "<b>Username: flopsy</b><br><br>If you're a California resident, I would choose either UCB or UCLA and rule out NYU. :rolleyes:<br><br>", "<b>Username: CHOUder</b><br><br>Thanks for the suggestions! I've decided that NYU is just wayyyy to expensive for me and a little too far from home, so right now I'm pretty much down to UCLA or Berkeley. Any reason to why I should pick one over another?<br><br>", "<b>Username: calmom</b><br><br>Go to UCLA because its farther from home and you say you love LA.<br><br>I hate LA and so do my kids -- neither would want to go there -- and I absolutely love Berkeley -- but I happened to also read your first post. You'll be happier if you choose the school that is your \"original dream school\". Tell your parents that you'll go to Berkeley for grad school. ;)<br><br>", "<b>Username: spacemonkey</b><br><br>is the OP's name jason by any chance?<br><br>", "<b>Username: namaste</b><br><br>i personally favor UCLA, but in your case it wont make a big difference. if a reason you like UCLA Is the \"hollywood scene\", that is the wrong reason unless you have MONEY. the \"hollywood scene\" is not nearly as fun and glamorous as its made out to be.<br><br>", "<b>Username: GentlemanandScholar</b><br><br>If I were you my list would go 1)NYU 2)UCLA 3)Berkeley. Now, if you were asking me which is \"best\" my list might be different, but I just think the experience of moving cross country to the biggest city in the country would be an awesome way to spend your college years.<br><br>", "<b>Username: CHOUder</b><br><br>even at the expense of nearly 50 thousand a year?<br><br>", "<b>Username: sepi111</b><br><br>I went to berkeley in their extension program. I am also, not someone that studies 24/7 and I was able to find friends in extension and in the dorms and stuff that totally match my personality. Yeah, some berkeley kids are pretty hardcore but I had no problem finding friends that were more on the social side like me! I've had an awesome time and I would totally recommend it.<br><br>", "<b>Username: ebeautie</b><br><br>UCLA...you say that it was originally your dream school and atmosphere is much more important than prestige.<br><br>", "<b>Username: kfc4u</b><br><br>(since you already ruled out NYU), between berkeley and ucla, i'd say visit the campuses again to see which one you can imagine yourself in for the next 4 years.<br><br>NYU is not as prestigious as berkeley or ucla but its undergrad academic quality is about the same and its name recognition is pretty up there too (especially internationally, as someone else pointed out). (there are differences between the terms prestige, quality, and name recognition)<br><br>", "<b>Username: Neo Yoyo</b><br><br>I don't know what your major you're doing, but I would choose UCLA over Cal over NYU based on what you've mentioned. I find it important to go to a school that fits me best, and it seems like UCLA fits you best.<br><br>I, for one, will be a NorCaler going down to UCLA this fall.<br><br>", "<b>Username: CHOUder</b><br><br>My major is undeclared at both ucla and cal, but i really want to pursue either business or communications.<br><br>One thing that I am VERY concerned about is the competition at berkeley... I hear that many engineering students have had mental breakdowns due to academic stress. Ahhh.<br><br>", "<b>Username: kaitylin</b><br><br>Pick UCLA. Its in a great part of LA and its a great school.<br><br>", "<b>Username: kfc4u</b><br><br>\"\"My major is undeclared at both ucla and cal, but i really want to pursue either business or communications.\"\"<br><br>business is \"hella\" competitive (in the spirit of norcal haha) at berkeley, but business-economics at UCLA is also competitive, but not to the extent of how berkeley students compete to get into Haas.<br><br>as for communications, i'm not sure about berkeley. at UCLA, i've heard it's competitive to get into the program, but once you get in, it's pretty easy.<br><br>", "<b>Username: blaw</b><br><br>NYU is pointless unless you already got into Stern or their mass comm<br>program. I believe these are almost impossible to transfer into.<br>Ideally you would have got into Stern and make up the cost difference<br>with Internships on wall street in the summer and even the school year.<br>But that may be dreaming ... could have been ... would have been $$$$$<br><br>", "<b>Username: CHOUder</b><br><br>kfc4u, I heard about how competitive Haas at Berkeley is too... :(<br><br>And I actually did get into NYU's communications program, which really makes my decision tough! But again, like I said, my choices are pretty much down to UCLA or Berkeley because of the tuition cost for NYU. I was also considering USC (Marshall) for a little bit, but realized that I could go to UCLA for less money.<br><br>", "<b>Username: CHOUder</b><br><br>But then again, berkeley is cool too! darn it this is really hard!!!<br><br>", "<b>Username: infamy</b><br><br>rule out NYU, it's a good school but it's not up to par with LA or Berkeley, at least not yet. visit both schools and make a decision based off of your visits.<br><br>", "<b>Username: ScAR</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/Flippy\">Flippy</a> wrote:\"\"<br><br>NYU is definatly not as good as Berkeley, but it's close, and its better than UCLA. Plus NYU is widely known around the world to be one of the best colleges where students actually have a \"life\". Giving up a little Prestige to be a bit happier is deffinately worthit.<br>\"\"<a rel=\"nofollow\" href=\"/profile/bobbobbob\">bobbobbob</a> wrote:\"\"<br><br>What do you live under a rock? I live in New Hyde Park in Queens (the good part) and if you think CA is better than NY than wow you must<br>\"\"<a rel=\"nofollow\" href=\"/profile/ScAR\">ScAR</a> wrote:\"\"<br><br>", "<b>Username: dh999</b><br><br>UCLA or UC Berkeley will open more doors then NYU will.<br><br>", "<b>Username: ashcliff</b><br><br>hey CHOUder i have to make the same decision....ugh...it's so hard!! berkley and ucla are such amazing schools and i love both of them. i've lived in san diego all my life though, so of course berkley sounds a little more interesting because it's so different. but i don't know if i want to get away from our awesome socal weather. i've also got this image in my head that cal is just really really into academics. does anyone know about their social life?<br><br>", "<b>Username: CHOUder</b><br><br>from what i hear, most ppl just study :(<br><br>", "<b>Username: legionaire</b><br><br>if cost is a factor stay in California, if not go to NYU. I believe you got into Steinhardt<br><br>", "<b>Username: LisaG</b><br><br>I wasn't too crazy about NYU's lack of a campus when I went to visit. But that's my personal preference.<br><br>The UC's would definitely be more economical (with less travel expenses and lower tuition) and the name recognition/academics are generally comparable.<br><br>", "<b>Username: Esamisa</b><br><br>I say no to NYU... I mean it is prestigious, but i think Berkeley beats it in that particular section... I would say UCLA and NYU would be about the say in the name recognition and pretigiousness... (my opinion) NYU's going up the ranks VERY quickly though. Oh, and if you want a campus, i would rule out NYU again (or lack of campus thereof)<br><br>And besides, if you can goto UC schools for instate price, why would you want to get a 30,000 plus loans for your parents? (thats what most people i saw got)<br><br>Though for business, i wouldn't goto UCLA.. I would choose NYU (stern) and i don't know much about Berkeley... but everybody knows stern is way up there in the business school rankings (top 3, i believe) though like others said, its hard to get in or transfer to... (or impossible)<br><br>If you are ready for academic challange, i say go for berkeley... Personally, i would be afraid...<br><br>", "<b>Username: DRab</b><br><br>Most people don't \"just study\" at Berkeley. And it isn't \"impossible\" to get into Haas. It is somewhat difficult, but far from \"impossible.\"<br><br>", "<b>Username: vsnake611</b><br><br>I'm in the exact same boat. UCLA v berkeley v NYU, except im from Georgia so the costs are a little more equitable. although I've pretty much ruled out NYU also. I'm also thinking something along the lines of communication. Music scene is a must. and the stoner scene isnt a bad thing (I've heard CAL has really gotten more conservative than its stereotype). also, can anyone give a good academic comparison b/w the two. I know CAL is more prestigous but I am under the impression thats mostly from math/sci/research which isnt really what I'm into.<br>(dont mean to steal your thread chouder-sorry)<br><br>", "<b>Username: DRab</b><br><br>Berkeley is about as strong in the social sciences and humanities as it is in the sciences and engineering. However, it is slightly less good in the arts.<br><br>As to communications, I hear UCLA's program is stronger. I don't know much about it, but that's the word on the street. Berkeley's mass comm seems alright to me, although it's considered a joke major by many here. You take many classes in departments outside of mass com (be they sociology, anthropology, or whatever).<br><br>Check the mass com website (seach Berkeley for the mas com major).<br><br>Berkeley is more conservative than its stereotype, but is plenty liberal. UCLA is fairly liberal as well, and in some ways more liberal.<br><br>", "<b>Username: Golden Boy</b><br><br>HAAS has a 50% admit rate...not too bad really.<br><br>If you're interested in business, hit up Cal. HAAS is ranked 3rd for ugrad business (though I have my doubts about a ugrad business degree in general, if its really what you want...) and Cal has high ranked programs in pretty much everything.<br><br>You say you live 50 mins? Which way? Any chance you come from the Stanford area? That's where I'm from and I def feel you on the whole \"Its too damn close to home\" factor.<br><br>", "<b>Username: hersheykisses347</b><br><br>so...my top 3 are also uc berk, ucla, and nyu! im from cle, ohio...but i've wanted to go to ucla since middle school as well! i visited \"cal\", and i didnt like it...just like you....so now its between ucla and nyu! i agree, nyu is def much much much more expensive, and i love love love ucla! for under-grad rankings, ucla=26 and nyu=36 (us news report) but for business/law (which is what i want to do !) i think there may be more opps at nyu! I am so torn...its so weird that we have the exact same top 3!<br><br>for business, haas is basically impossible i know! and stern at nyu u need a 3.6/3.7 so i've heard in order to transfer..so yah thats pretty impossible too. from what im reading, it looks like ucla and nyu have the same prestige/name factor, so it looks like i'll be heading out to cali..<br><br>", "<b>Username: ubuntu34520</b><br><br>Lets see, is it better to pay in-state money and go to a great school in beautiful weather, or to go to a slightly less prestigious school in crappy weather and pay $55,000 year. Difficult decision . . .<br><br>As to UCLA vs. Berkeley, that's tough for me to say. I don't know much about their respective business/communication programs (though I assume they're close if the decision is so hard), but if your lifelong dream has been to go to UCLA, then that's where you should go.<br><br>", "<b>Username: BedHead</b><br><br>I don't know why the original poster is even confused. These schools would all be great. Each one of them has their own strengths, and the relative prestige issues IMO should take a back seat to the following:<br><br>The OP isn't psyched about Berkeley. So, don't go! And yes, there is huge benefit to getting far enough away from home that you feel like you are experiencing independence and a really different milieu.<br><br>The OP has always dreamed of UCLA.<br><br>The OP thinks NYU is really cool, or something like that.<br><br>Well, NYU is really cool. And people should challenge themselves by getting out of their comfort zones. But is this worth the price difference? I haven't read enough of this post to know your financial situation. If you're rich it doesn't matter. Otherwise, think of your parents. It's not fair to demand that much more of them, IMO, for something that's not such a step up.<br><br>I personally think Berkeley is the most prestigious and I don't know the relative rankings between NYU and UCLA. But the fact is, someone who does really well in b-school at NYU Stern and gets a great Wall Street job is going to be more likely doing better than a UCLA grad coming to NYC. On the flip side, if you want to go into the LA film business, go to UCLA.....<br><br>This is an easy question: go to UCLA. But wherever you go, work hard and do well and relative prestige differences will matter a lot less than you think.<br><br>", "<b>Username: entomom</b><br><br>The OP is from 2006, it was dug up again in 2007 and now in 2009! When using the Search function, please check the dates of threads. While the discussion may still be valid, there's no need to answer the OP who is now a soph somewhere.<br><br>"]}