{"title": "usc cinema television vs nyu tisch film television", "comments": ["<b>Username: oolboe21</b><br><br>Hi! Recently, I have received acceptance letters from both USC Cinema&Television and NYU Tisch Film& Television.<br><br>", "<b>Username: ebayispayingforcollege</b><br><br>USC is tougher to get into but only because they accept fewer people. Both schools standands are extremely high. NYU is more \"indie\". They have a reality series you can try to catch called \"Film School\" that follows the students in the Film school there. M Night Shamalyon (sp?) is a graduate of the NYU film school. NYU hosts an admitted students reception in the Spring. You may want to attend plus NY is nice in the spring. My son had the same decision, he was torn, but he chose USC and loves it even though NYU was more generous with merit aid.<br><br>", "<b>Username: tawny</b><br><br>After visiting both, I'd pick NYU Tisch just because I love how it encompasses all performing and media arts in one school and I want to be surrounded by all of that. Something about NYU's atmosphere just seems so much more creative/insightful/vivid... It's a personal choice, I think - its where you feel more comfortable... USC Film was initially my #1 choice, but now I haven't even heard my decision and its April, so unless I do get in and I get good financial aid, I don't think I'd even consider it anymore...<br><br>congrats on both those acceptances, by the way, that's very impressive! you'll probably be happy at either school, they're both great.<br><br>", "<b>Username: CA2006</b><br><br>my girlfriend was admitted at SC for Film and to NYU Tisch. I love the USC campus and So Cal, but went with her and her family to NY to visit NYU. First, the school and program are awesome. I don't know anything about USC Film but she thinks NYU is better (or at least as good.) Go visit NYU before selecting USC and So Cal. And even though I think USC is a good school it's not that well known outside of the West Coast.<br><br>", "<b>Username: Zelda Fitzgerald</b><br><br>\"\"And even though I think USC is a good school it's not that well known outside of the West Coast.\"\"<br><br>au contraire (i don't speak french, sorry) many people know of USC and USC film has been named the #1 film school in the US by US News Report for the past 6 or so years....<br><br>i dunno. i was rejected from tisch's dramatic writing, but got into USC's WST, which accepts far less people.<br><br>", "<b>Username: CA2006</b><br><br>I don't speak French either. I agree with you that USC Film is well known and take your statement for being #1 as fact. USC as a school is not though... go east of the Rockies and people think of USC as University of South Carolina.<br>I don't know about being harder to get into, one of the people posting 5 or 6 back mentioned it just seems that way because SC is much smaller.<br>Either decision is a good one. And if you only have USC as a choice, then go with it. I just happen to be a So Cal kid that loves NY living!<br><br>", "<b>Username: redski59</b><br><br>\"\"go east of the Rockies and people think of USC as University of South Carolina\"\"<br>Lol, I've got to agree with that statement. A lot of people at first were shocked when I said I turned down acceptances from Chicago and UVa for USC. Of course, none of them are football fans ;)<br><br>", "<b>Username: dragon17</b><br><br>I would pick USC because, after all, Hollywood is in L.A. Another point is that George Lucas is a USC alumni. :)<br><br>", "<b>Username: oolboe21</b><br><br>thank you all for great comments! i'll consider your recommendations carefully =D thanks again!<br><br>", "<b>Username: Esamisa</b><br><br>I know NYU's financial aid sucks... that would be the main reason I would goto USC.<br><br>", "<b>Username: elliott</b><br><br>\"au contraire (i don't speak french, sorry) many people know of USC and USC film has been named the #1 film school in the US by US News Report for the past 6 or so years....\"<br><br>Do you have the whole list?<br><br>", "<b>Username: CA2006</b><br><br>she doesn't speak French and she doesn't know her facts either. My girlfriend has the US News for the last 5 years and USC is not #1.<br><br>", "<b>Username: redski59</b><br><br>Seems like the School of CNTV did not get your memo, CA2006: <url>http://www.uscsummerfilm.com/</url>.<br><br>Look at #1. (no pun intended)<br><br>", "<b>Username: tsdad</b><br><br>As a follow-up to post number 8: the names of some of the CNTV buildings at USC:<br><br>1. <b>George Lucas Instructional Building</b> which includes the main four-story George Lucas Instructional Building, and the adjacent <b>Johnny Carson Television Stage</b> and <b>Harold Lloyd Stage</b>.<br><br>2. <b>Marie Lucas Post-Production Building</b> which includes sound and video facilities as well as the Animation &amp; Digital Arts Division located on the third floor.<br><br>3. <b>Robert Zemeckis Center for Digital Arts</b>, a 35,000 square foot facility, represents the country's first and only fully digital training center.<br><br>4. <b>Frank Sinatra Hall</b> and <b>Ron Howard Screening Room</b>.<br><br>5. <b>Steven Spielberg Music Scoring Stage</b>.<br><br>6. <b>David Wolper Center</b>.<br><br>And then, of course, there is the <b>Hugh M. Hefner Endowed Chair</b>.<br><br>", "<b>Username: CA2006</b><br><br>Redski: Wasn't my memo. I will be honest and tell you I don't know much about USC Film other than I hear it's a great school. But you are providing a USC link. My girlfriend is deciding on NYU Tisch and USC. It's basically a free ride at USC vs I don't know what she has to pay at NYU. She has stats from outside of USC that show NYU is a better school. I value stats and so do a lot of students because that's all we have to go off of sometimes. Don't be so defensive, I am NOT knocking USC or the Film School.<br><br>", "<b>Username: QW553</b><br><br>I didn't anyone feeling offended. But seriously your girl friend should go to NYU.<br><br>BTW I don't believe she get free ride to USC. Wanna prove me wrong?<br><br>", "<b>Username: Zelda Fitzgerald</b><br><br>\"\"1. George Lucas Instructional Building which includes the main four-story George Lucas Instructional Building, and the adjacent Johnny Carson Television Stage and Harold Lloyd Stage.\"\"<br><br>Harold Lloyd gives me a happy feeling inside :)<br><br>i could watch his DVD box set all day long<br><br>", "<b>Username: tsdad</b><br><br>\"\"She has stats from outside of USC that show NYU is a better school.\"\"<br><br>1. What kind of stats would she have that evaluates how one film school is better than another? What criteria are used? Number of cameras available to students? Number of courses taught? Facilities? What exactly?<br><br>2. Do these stats show that NYU is so much better than USC that your friend would be justified spending $160,000 to go to NYU over USC assuming a free ride a the latter?<br><br>BTW, I have never heard that NYU is a better film school than USC. There is a perceived difference in the two schools, which most people consider equal, that focuses on what the students want and what the professors teach. USC is considered industry-oriented while NYU is consider independent-oriented, but I don't know if that's even true.<br><br>", "<b>Username: Shirobot</b><br><br>I'm in a similar situation. I have to decide between USC CNTV Critical Studies and NYU Tisch Cinema Studies... On the whole, I like things about each school. USC's mix of production and theory even in Critical Studies definitely beats out NYU's strict separation between the two disciplines. However, I'm much more into indie films than those coming from Hollywood, which is a point for NYU if the general consensus as to the two school's focuses is correct. Also, it seems to me that CNTV is much more competitive (in terms of admissions) than Tisch, but it's difficult to say how much or if that really matters. I think it matters to me a bit (CNTV also seems to be much smaller as a result, something I think I like), but I don't know how much I want to base my decision on it. As far as the general living stuff, it's difficult for me to give an edge to one or the other. NYU's independent atmosphere sounds nice, but so does USC's traditional college experience.<br><br>One unexpected thing is that NYU was actually quite a bit more generous with financial aid than USC (50K costs, 20K non-loans/work study from NYU, 47K costs, 11.5K non-loans/work study from USC).<br><br>Yesterday, I was leaning toward NYU. Today, after a call from a Critical Studies student who answered a few questions, I'm leaning toward USC. I'm sure I'll similarly change my mind several more times before I actually have to decide. >_&lt;<br><br>", "<b>Username: QW553</b><br><br>I don't think any school will choose to focus on indie films. It mostly may just be the result of environment, culture, etc. NYC and Hollywood are different.<br><br>I believe both schools will teach you the basic theory and skill set to enable you do whatever you want. This kind of question can be best answered by the students and recent alumni from respective schools. Why don't you call them again?<br><br>", "<b>Username: tsdad</b><br><br>Shirbot:<br><br>Critical Studies is a great entre into film especially for undergrads where the \"why\" may be more important than the \"how\" in developing artistic sensibilties. And, as you noted, there are plenty of opportunities for crit studies majors to do course work in both production and screenwriting.<br><br>", "<b>Username: KudosMyHero</b><br><br>Anyone who thinks USC isn't reknown for their film program is just lying to themselves. USC has the best film program in the WORLD. Not just the United States. In terms of connections, funding, and faculty, the USC program can't be beat.<br><br>If I get admitted to USC for history, I'm going to apply to the film program when I get there. Currently, I'm applying to UCLA (ducks punches) and University of Texas film production programs.<br><br>", "<b>Username: Dawn</b><br><br>While USC does have an extremely well known film program, so does NYU. In my opnion, there are pros and cons to each and I chose NYU over USC for two reasons: I prefer NY to LA and NYU starts film classes earlier. Both will have awesome connections and are known as the two best film schools and I think it is debatable as to whether one is actually \"better\" than the other.<br><br>", "<b>Username: KudosMyHero</b><br><br>Well unless NYU changed in a geographic time warp, USC is far closer to the heart of the entertainment industry (Hollywood). While you can say that NYC has entertainment as well, it is not NEARLY as big as Hollywood. This fact is not debatable in the slightest.<br><br>", "<b>Username: guidez89</b><br><br>I agree with Kudos, USC has THE BEST film school, no dispute here. NYU is good, but it's location is not nearly as nice as USC's and it just isn't as world-reknown. USC is the place to go if your want to do FILM, but NYU is a close second.<br><br>", "<b>Username: Zelda Fitzgerald</b><br><br>perhaps i'm just biased because i got into USC and not NYU's writing program...<br><br>but USC > NYU<br><br>end of story<br><br>", "<b>Username: TrojanWannabe</b><br><br>Just so you know I've heard from NYU Film students that you don't do any production until second semester of you junior year it's all theory up until that point. The producton facilities at USC also blow NYUs out of the water. The buildings are all fitted with THX sound becuase Tom Holman who created THX sound is one of the deans. THX sound is top of the line in sound production. If you have visited the film buildings at USC I don't know how you could possibly pick any other school. Also, FYI there is 0 college campus atmosphere at NYU.<br><br>", "<b>Username: mad-toast</b><br><br>Commenting first on how USC is not known East of the Rockies- I live in Massachusetts, and part of that statement I would say is true. Most people think when I say USC, I'm referring to U of South Carolina. However, the people in the film industry, no matter where you are in the country, know of USC and the kind of students that go there. The people that matter know USC is a great school.<br>Secondly, my brother currently attends NYU, although not for film, his roomate is a film student. My brother loves NYU and tells me that his roomate really enjoys the film program as well. Like what most people have said before NYU is better known for the \"indie\" approach, producing more \"independent-type\" filmakers (however that is not an absolute, you can be whatever you want to be at either school.) USC seems to be better known at producing more \"in the biz\" type filmmakers-ones who know the business and know how to succeed with their own vision. However, like I said before they are both great schools and you can be really anything that you want to be at either of them.<br>Now, for the only major differences I know about (beyond location etc..) For USC, in the production track, students are able to \"specialize\" in a certain aspect of the production side of filmmaking- like becoming an editor instead of a director. I don't know if this is possible at NYU, but everything I have heard from my brother's roomate is that the focus is on directing. The next big difference though is that (from what I've heard from admissions people etc...) is that at USC, if you want to be a director, for your senior colorsynch thesis (the movie you will show as the highlight of your portfolio to get a job) you have to be chosen as 1 of 4 out of 10-20 directing focus students to have your film funded and the materials granted. At NYU, this same thing does occur (I'm not as sure on the numbers though) for the senior thesis film. However, each NYU student gets to make a colorsynch film just as a requirement in their junior year, not solely for their thesis film, so there is a little greater opportunity there.<br>All in all, both schools are great, I've been to NYU many many times and really do enjoy the city (however, this is my preference.) But I am going to be going to USC this fall for Critical Studies because I feel USC has greater opportunities for me (especially being located in LA and the \"trojan network\") and has better facilities (although again a personal preference.) When deciding between the two schools, the best thing you can do (especially because both are fabulous schools to begin with, and you are very lucky to have this choice) is to decide where you are most comfortable. In the end, the school does play a big part in your developement, but success is really up to you. Good luck with your decision.<br>(PS the flight time is about 6-8 hours depending on stopovers from LA to NY, so that might be a factor too-just saying.)<br><br>", "<b>Username: Shirobot</b><br><br>When you say \"in the biz\" and \"indie,\" do you mean the school's approach to film funding/distribution or the school's approach to style and film as a whole? Basically, this the main thing holding up my decision on NYU VS. USC (other than the fact that I think I like NYC more than LA, but I've never even been to LA, and I haven't spent any large amount of time in NYC, so I can't really say this with any confidence: just a gut reaction). To be honest, I do not like the majority of films coming out of Hollywood today, and I find that independant and foreign (of course, I realize that I'm seeing the cream of the crop from around the world and basically everything out of Hollywood) films are much more to my tastes. That being said, the close proximity to Hollywood and a knowledge of the Hollywood business seem like they would be beneficial even to a \"indie\" advocate. I'm just worried that I'm going to get all business from USC, while I'd like to be focusing on the art. Is the difference between NYU and USC really that large when it comes to business VS. art? It's annoying, because I like everything about USC (well, not everything, but you know what I mean) except for this, but it's something that's important to me.<br><br>Thanks for all the information, mad-toast. I assume you had to choose between NYU and USC as well... Were you Cinema Studies or Film &amp; Television at NYU? Did any other things influence your decision? Also, what kind of films do you like (same question to any other prospective CNTV students)? Someone posed the idea to me that perhaps it isn't USC that's all about the Hollywood style, but rather it's the USC students, so I'm curious where their tastes lie.<br><br>", "<b>Username: kaitylin</b><br><br>Go to USC. Cinema Studies at NYU is in Arts and Science--not Tisch so you can't even take the Tisch classes! It's very little 'practical' work, just theory and it ISN'T part of the official film school. At USC critical studies is in CNTV so you have the opportunity to really be a part of the film program and get to know other film students. Plus, you get to take production courses and stuff and you will have the chance to make connections. USC will set you up for getting a job in Hollywood much better than NYU, ESPECIALLY an Arts and Sciences Degree from NYU. As for whether or not USC is 'buisness' oriented rather than 'art' its really hard to say. However, in the end it comes down to what you CHOOSE to make. If you want to make a very artsy film then you can make it and they aren't going to discourage you. However, they probably won't discourage you from making the typical 'Hollywood' type film either which they might do at NYU. The director who drected Grease and other movies just spoke to my film class (i'm not at USC but I'm trying to transfer there) and he went to USC and showed us his student films (as well as George Lucas' student films which he acted in when they were students at USC) and they were VERY artistic and had an indie feel to them so I guess it really depends on the individual. You can make whatever you like but I highly suggest you pick CNTV at USC.<br><br>", "<b>Username: elliott</b><br><br><url>http://cinema.tisch.nyu.edu/page/home.html</url><br><br>", "<b>Username: sfgiants</b><br><br>From USC CNTV website: Since 1973, not a year has passed without a USC alumnus/alumna receiving an Academy Award nomination.<br><br>That's crazy. :D<br><br>", "<b>Username: kaitylin</b><br><br>Ok, sorry. I guess it is an interdisciplinary degree with Tisch but it is still a College Arts and Sciences Degree. However, even the part of it that is taken at Tisch isn't in the department of film in television though. It's in the Center for New Media which is seperate so it involves different courses than film majors. I personally wouldn't go there over USC since it has no production requirement and the USC critical studies is actually part of the same department as the other film degrees. Also, its a new degree so USC is more established.<br><br>Maurice Kanbar Institute of Film &amp; Television Degrees:<br>Film &amp; Television<br>Photography &amp; Imaging<br>Interactive Telecommunications<br>Rita &amp; Burton Goldberg Department of Dramatic Writing<br><br>Skirball Center for New Media Degrees:<br>Cinema Studies<br>Moving Image Archiving &amp; Preservation<br><br>The degree is STILL part of Arts and Sciences though. It's listed in the Arts and Sciences but it has courses at Tisch (NOT the Film/Television department though). The Tisch grad school had a cinema studies degree but the undergrad degree is new and is actually administered by Arts and Sciences.<br><br>Here's the description from the Arts and Sciences site:<br><br>The Cinema Studies Major for Students in the College of Arts &amp; Science<br>The College of Arts &amp; Science, in conjunction with the Tisch School of the Arts, announces a new cinema studies major available to CAS students. This is the first truly inter-school major to be offered in CAS.<br>The major is to be taken in Tisch?s Cinema Studies Department and consists of a minimum of 40 points divided into three tiers of study. Tier I consists of a core curriculum for cinema studies majors that comprises five courses (20 points) taken in sequence. Tier 2 consists of small lecture classes in the areas of film auteurs, genres, movements, national cinemas, television studies, and special topics. A two-course distribution requirement in film history is required: one course in U.S. cinema, one course in a non-U.S. cinema. Tier 3 consists of large lecture classes in film aesthetics, directors, and genres, designed to fit the curriculum requirements of students in Cinema Studies, both in TSOA and CAS.<br><br>Students wishing to complete honors in this major will be accommodated by the TSOA faculty; such students will take two advanced seminars, meet at least twice with the Director of Undergraduate Studies each semester, and complete an approved research project.<br><br>The application for this major consists of a completed application form which can be found below, a one-page personal statement addressing why you want to major in cinema studies, and an essay on an arts or humanities subject (which can be a term paper from a previous course). Click here to download the application form.<br><br>Here is the College of Arts and Sciences Link:<br><url>http://www.nyu.edu/cas/Academic/Programs/CinemaStudiesMajor.html</url><br><br>This is also the list of College of Arts and Sciences majors and its on there:<br><url>http://www.nyu.edu/cas/Academic/Programs/Programs.html</url><br><br>", "<b>Username: Shirobot</b><br><br>Thanks for all the input, kaitylin; I appreciate it. :D<br><br>Yeah, the Cinema Studies program is completely separate from production, which is a huge positive factor for USC. Also, while Cinema Studies is \"officially\" in Tisch, I think the fact that they're opening it up to CAS students (to some degree) really shows that they don't consider it to be quite in the same realm as production, whereas USC integrates and equally respects every aspect of film. I was considering NYU Cinema Studies and then pursuing a double major with Film &amp; Television sophomore year (they specifically mention this course of action on the Tisch Cinema Studies page), but I'm far from guaranteed to even get into the program, and even if I do, it will be a double major work load, which I hear is rather difficult with production being one of the majors. Regardless, I love everything about CNTV except this business/art thing, and I think you're right about it coming down to me and what I want to make. Also, considering budgets, I imagine most student films anywhere tend to lean toward artistic... I'm definitely heavily leaning toward USC right now, but that one thing (and NYC VS. LA to a lesser extent) is still on mind.<br><br>", "<b>Username: elliott</b><br><br>Is one allowed to double (or triple) major within USC Cinema/TV?<br><br>", "<b>Username: ebayispayingforcollege</b><br><br>Shirobot - While at parents weekend last Oct. I was able to obtain from CNTV a DVD of USC students works called \"first look\" with about 8 short works. While I haven't seen a NYU DVD, I was very impressed by the USC one - a mixture of Hollywood (\"The Tao of Pong\") and Indie, (\"Television\") some a combo of both. What stood out was they were all beautifully crafted - even the indie-style ones thus very \"watchable\".<br><br>", "<b>Username: tsdad</b><br><br>\"\"Is one allowed to double (or triple) major within USC Cinema/TV?\"\"<br><br>Do you mean can a criticial studies major double major in production? I don't know the answer to that, but off the top of my head I doubt it. If you mean can someone in film double major outside of film, the answer is yes. USC encourages students to take courses outside of their major. For a while my son in critical studies had a second major in history, but dropped it to take a minor in peace and conflict studies.<br><br>Critical studies students must take two production courses:<br>\"\"Required Production Courses<br><br>Undergraduates admitted to the Critical Studies Program are required to take CTPR 241 Fundamentals of Cinema Technique and CTPR 290 Cinematic Communication. These introductory production courses are taken concurrently during the junior year (see description below).<br><br>CTPR 241 is an experiential course dealing with the technical and aesthetic principles of directing, cinematography, editing and the development of ideas through a cinematic vocabulary.<br><br>In CTPR 290 students are taught the principles of filmmaking through demonstrations, hands-on production and critical analysis. Each student makes five digital video non-dialogue movies using equipment supplied by the school. A lab fee of $500 and an insurance fee of $500 are required. Students will spend $100 to $200 on production expenses.\"\"<br><br>Additionally, screenwriting courses are available to them.<br><br>", "<b>Username: ld10lmp</b><br><br>1st of all, while USC is ranked higher, it is in contention for #1 with Tisch. When people speak of good film schools, they always talk of the \"USC or the NYU.\" So that ranking is de minimis. So that should not factor.<br><br>The thing about the USC program is that it has very little students and is highly competitive. THis is not the bad part. The bad part is that students dont go to USC and work hands on. Its not what you would like it to be. Students can have amazing talent and end up being just the guy holding the boom in another guys project. Also, you dont start until about soph or junior year i dont remember.<br><br>NYU in contrast has a more hands on, film film film technique in teaching. There is also a greater chance you can do your own stuff as opposed to someone elses.<br><br>And great, the star wars guy went to USC. Whoever is boasting that does not know the extensive list of alumni at nyu. Scorcese, Lumet, TOdd Philips who did Old School road trip, etc, Brett Ratner that did the x-men trilogy and mr. and mrs. smith, ang lee, spike lee, and many more directors including Woody Allen.<br><br>At NYU, you also have the luxury of using the drama kids in your film and the design kids to help make sets and costumes and etc. NYU also boasts impressive alumni in the acting departments including Phillip Seymour Hoffman, Angelina Jolie, hehe, FElicity Huffman, and a bunch more.<br><br>So for me, its NYU. Also, NYC is more \"real\" and provoking than hollywood or LA.<br><br>", "<b>Username: ld10lmp</b><br><br>Also, you can't say that USC has the best program because its in LA...who cares. NYU films feed into sundance, people come from LA to screen films at NYU because of its program and talent that has come from NYU. So again, location doesn't mean a thing. And just because you are closer to Hollywood does not mean it will be easier to get noticed, or to make connections. Hollywood is a messed up place, and you'd have to work much harder than you think just to get noticed among all of that. So yes, you are right...USC has the best program because it is in LA and you get connections...show me some stats, show me some evidence to back up this banter, and then i'll agree. But until then, for a student, an 18 year old student, nyc is more pure and a better place to learn film as an individual.<br><br>", "<b>Username: SnowflakePillow</b><br><br>Look, USC and NYU can both do independent films. If you actually look on their website, for example, they have an expert in doing indie films as efficiently as possible coming to talk. And for more \"Hollywood-ish\" films, it has plenty of famous speakers constantly coming to talk with the students because it is a local place. Plus, there are plenty of actors in the area for student productions. USC however, might have more local competition in UCLA. I didn't even apply to NYU because I am pursuing Interactive Entertainment, but I still think that USC is a bit better because it can do either type of film fine. NYU as a whole is a smaller school, but USC is smaller in terms of the actual film school.<br><br>", "<b>Username: directorsachin</b><br><br>NYU actually gave me much better financial aid than USC... probably an anomaly, but it happened!<br><br>"]}