{"title": "uw udub vs uw madison", "comments": ["<b>Username: dburns1</b><br><br>Im trying to decide between university of Washington and university of Wisconsin-Madison. I am trying to major in Computer Science. Also going into ROTC. I know both schools have good CS programs so academically they should be somewhat similar. They both have a nice Surrounding city. It's hard to pick between the two. Any input on which one might be better? (Yes I posted about A&M vs UW-Madison, but A&M has been cut)<br><br>", "<b>Username: NROTCgrad</b><br><br>Students at Wisconsin are more into NCAA sports than at U.Washington.<br><br>Hard to beat the beauty of U.Washington campus, especially on days when you can see Mount Rainier.<br><br>I lived in Seattle for many years, and would choose its rainy weather over Wisconsin snow. But if you want snow, you can drive about an hour into the Cascade Mountains. No escaping snow in Wisconsin, without a plane ticket.<br><br>Seattle is a much bigger city than Madison. Downtown Seattle is as good as it gets, and is a short bus ride from the campus.<br><br>", "<b>Username: dburns1</b><br><br>I have visited Udubs campus and it was extremely gorgeous. I love Seattle because it's close to home and I love the city it's such a nice place. Madison also looks really nice and has snow which is a plus<br><br>", "<b>Username: JustOneDad</b><br><br>Yeah, it's a hard choice. Two good schools.<br><br>But, Seattle gets it for the environment.<br><br>", "<b>Username: dburns1</b><br><br>True. But for some reason when i look up the schools UW is usually ranked a bit under madison in social, city and a few other categories like that (according to student review and rate my professor)<br><br>", "<b>Username: PurpleTitan</b><br><br>Both have good CS programs, but a key difference is that unless you are among the small number directly admitted in to CS at UDub, you have to apply for CS after starting at UDub, and I hear that only a third of those applicants successfully get in to UDub's CS program.<br>Meanwhile, so far, declaring for a CS major at UW-Madison is still ridiculously easy.<br>This would be a key factor in my decision-making if I was in your shoes.<br><br>", "<b>Username: BrownParent</b><br><br>Why didn't you just post all your choices in one post. Now we have no reference to what already was said.<br><br>", "<b>Username: happy1</b><br><br>I agree with @PurpleTitan - if one school has direct admit and/or easy entrance to CS and the other school makes it difficult to get in the program you want that should be a huge factor in your decision. Both schools are pretty equivalent so if you are assured of getting into your major at UW- Madison and not at UDub, I'd go to UW. You should do some research about how difficult it is to get into the CS major at each school.<br><br>", "<b>Username: informative</b><br><br>I'd rather attend Washington if purely based on location. The student body will be very different at a coastal school rather than one in the midwest. The weather will also be better in Washington if you aren't particularly interested in cold upper-midwest winters.<br><br>Academically, both are good schools as far as state schools go.<br><br>", "<b>Username: LizHolt</b><br><br>I attended U-Dub some years back and also UW-Madison.<br>Agree with others, U-Dub and Seattle are great. Amazing campus and city. But there were a lot of commuter students at U-Dub and the campus was quite dead in the afternoons/evenings/weekends. There is plenty to do in Seattle, don't get me wrong, but the campus really emptied out so the vibe was much different than in Madison were there seemed to be students walking around at all hours. In my experience of UW-Madison there were more events (speakers, performances, clubs, etc) and a lot more going on at the Student Unions in the after hours. Also very true about the very strong support for Badgers vs.milder interest/support for the Huskies.<br>I don't know about the degree quality, it sounds like they're fairly equivalent, but as a student my experiences were very different on those campuses. Both good, but very different.<br><br>", "<b>Username: LizHolt</b><br><br>I forgot to comment that its true about going for the direct admit to CS. I had lots of friends scrambling for a second choice major at U_Dub because they didn't make the cut in their first choice.<br><br>", "<b>Username: MYOS1634</b><br><br>Are you a direct admit for CS at UWashington?<br>How much would each cost you? (tuition+fees+room&amp;board) - (grants&amp;scholarships) =?<br><br>", "<b>Username: dburns1</b><br><br>@MYOS1634 I am still waiting on a decision from the school. I would get instate tuition for U-dub but I would be paying OOS for Wisconsin. I don't know what it will cost me to go to both schools as I have not finished applying to scholarships<br><br>", "<b>Username: JustOneDad</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/LizHolt\">LizHolt</a> wrote:\"\"<br>That's common for Seattle. It has to do more with the fact that Seattle folks are out <i>doing</i> their own things.<br><br>", "<b>Username: barrons</b><br><br>Weather is Seattle is hardly a plus. I just spent the last 23 years there and cool-cold rain dominating from October-July is not fun. Udub has more of a commuter feel and there is no concentrated student social life outside of frat row which is very popular. Moreso than at Madison because there is nothing else. Academics are a wash. Madison also has a more geo diverse student body for US students. .<br><br>", "<b>Username: rjkofnovi</b><br><br>I agree with barrons. Too many people just assume that warmer winter temperatures make for a better overall climate.<br><br>\"That's common for Seattle. It has to do more with the fact that Seattle folks are out doing their own things.\"<br><br>That is also a common theme here on CC that hardly explains why the student body is so lackluster in its support of its home teams.<br><br>", "<b>Username: tk21769</b><br><br>\"\"I love Seattle because it's close to home and I love the city it's such a nice place.\"\"<br><br>Well then why would you pay a big price premium for an out-of-state public university?<br>If you'd be full-pay at either school, you'd be paying about 50% more for Wisconsin<br>(~$24K/year for Washington in-state vs. ~$36K/year for Wisconsin OOS), right?<br><br>Why pay nearly $50K more for one good state flagship v. another good state flagship?<br><br>If money is no object, and you want assurance that you'll be able to major in CS or whatever else you want, then consider private alternatives (which may even be cheaper after aid than an OOS public school).<br><br>", "<b>Username: JustOneDad</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/rjkofnovi\">rjkofnovi</a> wrote:\"\"<br>Well, let me see if I can explain this in some detail to you.<br><br>During the same period of time, when athletic supporters are going to sit and watch the home team in the big stadium, Seattleites are more likely to be skiing, boating, mountain biking, climbing, kayaking, running, playing soccer, sailing or just otherwise engaged in a pursuit of <i>something</i>.<br><br>", "<b>Username: MYOS1634</b><br><br>If you get into CS at UWashington and you're in state, there'd really be no reason to go anywhere else. :)<br>If you don't get into CS at UWA, then UWisconsin makes sense, since its CS major isn't selective but does \"deliver\".<br>Personally I prefer super cold with blue skies to constant rain, but that's just me. :)<br><br>", "<b>Username: dburns1</b><br><br>@tk21769 I am not stressing about paying because I am trying to get an ROTC scholarship that will help pay for college.<br><br>", "<b>Username: barrons</b><br><br>So, the Udub students are doing all those things. You do know you can also do all those things at UW too? It has its own large sailing fleet and you can join for minimal cost. They just also fill the stadium and Kohl on game days because unlike Udub, they are very good and the atmosphere is amazing. UW students get to do it all. With gusto and a little zaniness.<br><br><url>http://hoofers.org/#home_section</url><br><br><url>http://247sports.com/Board/30/Contents/Wisconsin-named-1-College-Sports-town-in-America-19654492</url><br><br>", "<b>Username: rjkofnovi</b><br><br>Don't bother trying to explain it to coasties barrons. Some of them just don't get it.<br><br>", "<b>Username: dburns1</b><br><br>I am leaning more towards Wisc anyways. I like what I have heard, and the area looks beautiful. Plus they seem to combine the best of both worlds, academics and social life.<br><br>", "<b>Username: fragbot</b><br><br>\"\"I forgot to comment that its true about going for the direct admit to CS. I had lots of friends scrambling for a second choice major at U_Dub because they didn't make the cut in their first choice.\"\"<br><br>As someone who has hired numerous CS grads from the Seattle campus, we also look pretty closely at graduates of the Applied and Computational Math Sciences (ACMS) program. We've also done well with CS grads from SeattleU, Western and Gonzaga. As I write this, I realize don't know a single entry-level hire we've done from WSU even considering groups outside my own.<br><br>Regarding relative school spirit, I presume Wisconsin is better as the (admittedly few) football games I've attended at Husky stadium had almost empty student sections. Even the Apple Cup isn't immune.<br><br>", "<b>Username: NROTCgrad</b><br><br>This business of shortening to both U.Wisconsin and U.Washington to UW and UDub in the same thread is lunacy. Almost impossible to keep them straight because they are completely interchangeable for both schools. I am hoping that we discover that acronyms contribute to global warming. Jargon drivel. :-?<br><br>", "<b>Username: barrons</b><br><br>UW is never called Udub by anyone from Wisconsin or any UW graduate. In Seattle/WA Udub is nearly always called Udub by everyone including UW grads.<br><br>", "<b>Username: NROTCgrad</b><br><br>@barrons inside information, in other words. still jargon.<br><br>", "<b>Username: barrons</b><br><br>For most it is crystal clear. Berkeley is just Berkeley or Cal--never UCB. But UCLA is always UCLA--never LA or Cal or anything else. Just shorthand--not jargon. jargon takes a simple thing and makes it sound complex. Like Sociology.<br><br>", "<b>Username: dburns1</b><br><br>As a washingtonian UW has always been Udub never just UW<br><br>", "<b>Username: BrownParent</b><br><br>Please, Udub is quite common for Seattle only. Now you too are in-the-know. It reminds me of a funny article on collegeconfidential-speak, I think in the Chron of Higher Learning. You would be familiar with a lot of those terms but Udub is widespread outside CC.<br><br>", "<b>Username: NROTCgrad</b><br><br>Yes, and everyone knows that OSU means Ohio State University... or Oklahoma State University... or Oregon State University. :-S<br><br>I know all these things... but a lot of people don't. Especially people new to CC.<br><br>Personally, I have definitely heard people refer to U.Wisconsin as Udub. Which confused me at first, because I lived in Seattle for over ten years... where, by the way, U.Washington is almost always abbreviated UW in writing even though pronounced Udub.<br><br>", "<b>Username: NROTCgrad</b><br><br>\"\"UW is never called Udub by anyone from Wisconsin or any UW graduate\"\"<br>Really?<br><url>https://www.****/udubwsum</url> (Facebook page for WSUW)<br><url>https://****/udubco</url><br><br>:-?<br><br>", "<b>Username: dburns1</b><br><br>It's not that big of a deal honestly. Quick question, if I got an Army ROTC 4 year scholarship, does that mean I got full tuition paid for?<br><br>", "<b>Username: NROTCgrad</b><br><br>Yes, all Army ROTC scholarships are for full tuition.<br><br>Some colleges and universities will also add <b><u>free room and board</u></b> for students with ROTC scholarships. Seattle University is one of those. See the final paragraph of this website. <url>http://www.seattleu.edu/rotc/faq/</url><br><br>So is Pacific Lutheran University in Tacoma, Washington. <url>http://www.plu.edu/rotc/</url><br><br>The University of Portland, down in Oregon is another one. Also Coe College in Iowa and Rochester Institute of Technology. Tulane University.<br><br>Marquette University (in Wisconsin) provides an additional $7,000 per year for any additional university costs, including room and board. <url>http://www.marquette.edu/explore/scholarships-rotc.php</url><br><br>Drexel University has provided a free room plus a 25% discount on their meal plan in the past. I think they still do, but that info seems buried in their website.<br><br>I do not know if any deadlines have passed for these colleges.<br><br>", "<b>Username: NROTCgrad</b><br><br>University of Oregon offers a 40% discount on room and board to ROTC scholarship students.<br><url>http://rotc.uoregon.edu/opportunities/scholarship/</url><br><br>I know that it says \"housing discount\" but this has always been understood to be both room and board. However, you might want to double check, if you are interested.<br><br>", "<b>Username: anhydrite</b><br><br>If the OP were considering any college on ROTC that also offers room and board incentives, he must weigh those institutions against the quality and reputations of his other choices. What would be the cost-benefit analysis of comparing, to take one obvious comparison, a degree in CS from UW-Seattle (plus paying room and board), vs. Seattle U. (w/ free room and board) over the duration of a career?<br><br>In other words, as ROTC covers full tuition at all eligible universities, some room and board discount is like an additional, smaller scholarship incentive to attend. Some of these schools may not be worth it for their quality of education / experience / career benefits. Then again, Rochester Institute of Tech. may provide one counter-example, as I believe it can offer a solid education in some STEM fields. There could be a few other surprises, too (Tulane, if true, would be a very nice full ride). But due diligence is required.<br><br>Still, very nice info. to know for future applicants.<br><br>", "<b>Username: barrons</b><br><br>WSUW serves UW Whitewater--not the real UW campus.<br>And a twitter site for some commercial outfit making T-shirts not really related to UW with 45 tweets.<br><br>Overwhelming<br><br>", "<b>Username: dburns1</b><br><br>I think it might be a little to late to go back and change it but I don't think I want to go anywhere else besides UW. Plus I don't know how hard it is to change my school of intent to another college<br><br>", "<b>Username: NROTCgrad</b><br><br>\"\"I don't think I want to go anywhere else besides UW.\"\"<br>Fair enough. I just thought you might want to know other options. Best of luck! :-bd<br><br>", "<b>Username: dburns1</b><br><br>Can you guys tell me the worst parts about each of those schools in your experience? I want to also weigh out the bad in both of them<br><br>", "<b>Username: Midwestmomofboys</b><br><br>As for Wisconsin, where my kid goes, he would say -- weather. Winter is long and the temps shockingly low the past two winters.<br><br>", "<b>Username: barrons</b><br><br>Community feel. UW is tight knit and a 24/7 kind of place. Udub still has more commuter school feel with much less school spirit/togetherness.<br><br>", "<b>Username: dburns1</b><br><br>Do you know why Udub is generally rated lower in terms of food on campus?<br><br>", "<b>Username: UWfromCA</b><br><br>Barrons, that is not the impression I get from UDub these days. There are lots of clubs and organizations, affinity and interest groups, in addition to varsity and intramural sports teams, with activities and events happening every day on and around campus. I read that 7,280 students live in UW Seattle-campus housing (6,429 in residence halls, 851 in UW apartments), and over 70% of freshmen live on campus. Also, about 1/3 are OOS and international students, and they are not leaving campus in the evenings or on weekends.<br><br>"]}