{"title": "help stanford vs columbia", "comments": ["<b>Username: a_nicte</b><br><br>Help guys what is better stanford or columbia. Im humanitites ( not quite sure excatly what yet.. but considering political economy, latin american studies, pre law...) also whats better for internationals?<br><br>", "<b>Username: slipper1234</b><br><br>SO different in terms of lifestyle, and so similar in academic quality, that academics are secondary. The core is also a unique factor.<br><br>", "<b>Username: collegecanwait</b><br><br>You can't beat California weather, Stanford is a better school academically with a much better reputation, and it has a reputation for being kind and welcoming to ppl, rather than the \"coldness\" towards strangers known to permeate NYC<br><br>", "<b>Username: roundtheclock</b><br><br>Hi,<br>I'm also deciding between these two and would appreciate any other input. Can you guys compare the sciences at Columbia and Stanford? Thanks!<br><br>", "<b>Username: slipper1234</b><br><br>I'd give the Academic edge to Stanford in almost every area except flm, music, and a couple other areas.<br><br>I'd give the quality of life edge to Stanford.<br><br>I'd give the \"campus life\" edge to Stanford.<br><br>I'd give the \"urban\" edge to Columbia.<br><br>Basically if NYC is worth it to give up some of your \"college experience\" and a (VERY little) bit of academic prestige go to Columbia. IF its not go to Stanford.<br><br>Personally, I'd go to stanford in a nanosecond.<br><br>", "<b>Username: cadad</b><br><br>Do you mean Columbia has more prestige than Stanford or you mean Columbia ony has a bit of prestige?<br><br>", "<b>Username: slipper1234</b><br><br>I mean Columbia has only a little bit less prestige than Stanford.<br><br>", "<b>Username: blah1111</b><br><br>Just to clarify, slipper1234 would go to a lot of places in a nanosecond before Columbia. He transferred out after his freshman year.<br><br>", "<b>Username: cadad</b><br><br>Slipper1234 - What you don't like Columbia about? Please share!<br><br>", "<b>Username: slipper1234</b><br><br>(PS- Revised Post that I posted elsewhere)<br><br>I transferred to Dartmouth for both social and academic reasons. Columbia was great for the core, but in most of the bigger classes I felt like a number. I hated taking a \"ticket\" to see the registrar, or having to go out of my way to meet some of my professors. It seemed corporate to me. On the other hand, it had some great departments - film, arabic, music, etc. I just felt that for undergrad I wanted more attention BEFORE my senior year.<br><br>The social life is probably why I left. Columbia felt deserted and dark on the weekends, people slip into cliques and went into the city. You just never really feel like a part of anything special, just someone doing his/ her thing and Columbia happens to be where you live and go to class. First year is fun (all first year dorms, cafeteria, etc), but after that the community is not nearly as strong. Alsom you miss out on the \"laid back\" fun that happens at other schools. Sure people are out on the Green, but I guess I preferred knowing most of the people instead of having random grad students everywhere. Also, in regards to nightlife, every once in a while people are out in Morningside Heights, but its totally hit or miss. there are Fri/ Sat nights when the campus feels dead. It also feels institutional (swiping cards into the dorms, etc) the same way the classes do.<br><br>So, if you are a person who wants a very specific major, could care less about campus life and community, and are more 'independent\" - i.e. perhaps on the intense side and more focused on hanging out with one clique - Columbia is for you.<br><br>If not, I think there are better choices. Personally I think columbia is great for grad school, but you miss out on \"normal\" college when you choose it for undergrad. Some are ready for this and hate \"normal\" college life, other's are the opposite. I guess I was one of the people who wanted a more intimate \"warm and fuzzy\" college experience.<br><br>", "<b>Username: cadad</b><br><br>Slipper1234 - What is your major?<br><br>When you say \"college life\", do you mean buddies hanging out after class? Faculty and students are like a family?<br><br>I do feel the faculty is not that \"intimate\" and \"warm\".. I feel it different from Uppen and Brown.<br><br>Do you not like their academic environment? Sorry for these questions. I am trying to evaluate for my son. He is choosing between Caltech and Columbia..<br><br>", "<b>Username: sac</b><br><br>Have you ever spent any time at Stanford, Slipper?<br><br>My son made this choice and is in his second year at Columbia. He loves it. They are so close in terms of academic reputation, I would not even factor it into the equation -- unless you are someone totally dedicated to a specific department and know that field will be your life, and the field is computer science or certain types of engineering. Then, Stanford would have the obvious edge.<br><br>For the humanities, although Stanford has good humanities departments, the university is very much driven by science and engineering departments. You will find many more humanities majors at Columbia and a more intense intellectual atmosphere in the classroom and out. If you can visit both places and sit in on classes, I'd recommend it. Call it loving to discuss ideas or call it loving to argue, I would just say that Columbia is more intellectually (and politically) alive.<br>On the other hand, Stanford is friendlier in the way California tends to be friendlier -- you'll find more people there smiling as you pass by.<br><br>The core curriculum at Columbia contributes to the intellectual atmosphere, because everyone is reading the same books at the same time. You can do something at Stanford that is similar -- SLE -- but those students tend to be socially isolated from the rest of the first years, according to other students my son talked to. Anyone considering Columbia should take a hard look at the core (especially if you come from a country with a high school curriculum that might make it repetitive), as it is a major part of the Columbia experience. It was a definite attraction for my kid, though he is a math/science type. The core classes are small, around 20 students, and discussion based.<br><br>Stanford has the outdoors (most people ride bikes to get around the spread out campus), great weather, a suburban and safe feel. The university itself is not any cozier ( it is a research university and closer to Columbia than Dartmouth in terms of class size and the need for students to take the initiative to make contact with professors.) The bureaucracy at Stanford, however, is easier to work with and friendlier.<br><br>Because there is not much to do in the area immediately around Stanford, more people participate in on-campus social life. Comparing a calendar of events at the two campuses, I think you'd find that Columbia actually has much more happening on campus, it's just that when you put together the number of events, plus NYC, you don't get the critical mass attending any one event at Columbia. So, more choice of things to do is a trade-off for not all heading to the same party together on Saturday night.<br><br>If you don't like New York City, then Columbia is obviously not the place to go to school. My son doesn't always like dealing with the city, and likes the fact that Columbia has a real campus and that he can escape into it when he feels like it. On the other hand, when he does want to go out, there are tremendous opportunities to be had -- music, eating, art, theater, clubs, internships -- all of which he is taking advantage of.<br><br>Both universities get a lot of international students. New York City, of course, is a much more international place than Palo Alto.<br><br>Congratulations on having such great choices! You will get a fine education at either place, it really is a matter of what you're seeking in the way of campus culture.<br><br>", "<b>Username: suburbamania</b><br><br>sac- well said<br><br>", "<b>Username: slipper1234</b><br><br>Cadad- When I say college life, I mean frisbee on the green, random snowball fights (not possible at stanford lol!), people hanging out at house parties, going on road trips, having big weekends (like homecoming with bonfires). NYC is just not as \"laid back\" as some other places. Also, as Sac mentioned, there is little \"critical mass at the parties.\" I loved slip and slide on the green and spontaneous sledding. Columbia kids have a more serious, adult experience, in my opinion.<br><br>Columbia inflates some play balloons on the main steps and holds a concert and calls it a big weekend. As I mentioned, Columbia is a great school for a certain type but its not for everyone.<br><br>", "<b>Username: sac</b><br><br>There's no reason you can't do virtually all those things at Columbia (well, not the bonfire, but there are pre-game events) and, in fact, some people do. They slide down trays on the Steps when it snows, build snowmen, throw snowballs. They throw footballs on that small patch of grass on South Lawn, they go to parties, they go on road trips with friends. They go to dances. The difference is that not all or even most of them do it at any one time.<br><br>As for holding concerts and calling it a big weekend, that's a little like bringing coals to Newcastle. There are so many concerts available in the city on any given weekend.<br><br>If you are someone who loves watching and cheering sports events, and all the spirit that comes with that, obviously Stanford wins handsdown. If you want to play intramural sports, Stanford also offers more options and better facilities. If it's more important to you to be in a place where art and music and theater are happening all the time, Columbia stands out.<br><br>To paraphrase: Stanford is a great school for a certain type but it's not for everyone.:) Which is a statement that can be made about every college and the whole point of finding the one that fits best for any individual student.<br><br>", "<b>Username: a_nicte</b><br><br>Who is viewed more favorably Columbia or Stanford? Is there grade inflation? Who has better internships?<br><br>", "<b>Username: sac</b><br><br>sigh.<br>\"\"Who is viewed more favorably Columbia or Stanford?\"\"<br>By whom? Medical schools? PhD programs in English? Morgan and Stanley? USNews and World Report? Taxi drivers in Taiwan?<br>\"\"Is there grade inflation?\"\"<br>Yes<br>\"\"Who has better internships?\"\"<br>Internships in what? Better how?<br><br>Honestly, these are not the right kind of questions for deciding where to get your undergraduate education. You can't lose between these two institutions. Go with the school that you're leaning towards.<br><br>", "<b>Username: slipper1234</b><br><br>I agree that those are not the right questions. You don't choose between a BMW and Mercedes because one has one extra horsepower. they are profoundly different places - that's the difference.<br><br>Sac, as for campus events, I attended Columbia for a year so I know the social life well. My Dartmouth experience had little to do with sports - in fact I attended more columbia sporting events (2) at Columbia than at Dartmouth (1). The bonfires, \"big weekends\", etc are part of the \"spirit\" of the place and have nothing to do with sports. I have NO idea why people confuse sports with \"campus spirit.\" This might be true at Ohio State, but not at the top schools except maybe Duke. Campus Spirit is seeing all your friends in the main quad of a campus and having your friends running around all day throwing frisbees, running around with squirt guns, and maybe even drinking a little during the day during big weekends. This is part of the experience people at Brown, Penn, Dartmouth, Stanford, Duke, Princeton, etc all have but Columbia students don't. Some at Columbia might not miss this at all, but those who do are not going to get it at Columbia bottom line. Columbia is much more cliquey and fragmented for this to ever happen. The parties are mostly \"closed\" at Columbia while at other campuses everyone is welcome.<br><br>Columbia is more \"different\" than any other top school period. For those who like this its perfect, but I wouldn't jump in without knowing what you are getting into.<br><br>", "<b>Username: quantifyme</b><br><br>hey, I had to make this exact decision last year. here is my reflection and opinion.... if you are a humanities major, I would definitely give thye edge to columbia. the faculty is absolutely renowned and brilliant (and I have found extremely accessible), and the atmosphere is very intelectualy with seemingly constant philosophical and academic debate. I visited stanford and was very impressed with their science facilities (which as a humanities major meant nothing to me). also, the campuses are very different. Personally I love living in nyc, yet in a secluded community. if you want to be in the city you can just step outside the campus gates, but if you want to be on a college campus columbia is very isolated. both campuses are respectively striking. columbia is absolutely beautiful, the greek architecture and quad layout is amazing, and the stanford campus is huge, and provides for a very 'chill' atmosphere. academically, for me there is not a superior college in the u.s.. the nyc environment at times is a bit tense and austere, but overall I like it. stanford is a much more relaxed environment and would be enjoyable, but not the intense intelectual or cultural experience I am having at columbia.<br><br>", "<b>Username: cadad</b><br><br>How is the Columbia science program compared to Stanford science program?<br><br>", "<b>Username: garland</b><br><br>You know, Slipper, I understand you had a bad time at Columbia, and it was not the right school for you, but isn't it time to let it go?<br><br>The image of all your friends on the quad, running around all day with squirt guns, is <i>your</i> definition of school spirit. ANd the fact that you didn't have that experience at CU doesn't mean it doesn't happen there--my son has told many stories of traying, snowball fights, going to dances, etc. That's all part of his expereince there. But, yeah, he does spend most of his time with his <i>friends</i> (how come it's a clique when it's Columbia, but it's friends when it's Dartmouth?)<br><br>I don't hear about \"closed\" or \"open\" parties from him--he's not the big party type, so I guess if that kind of partying is what you're looking for, maybe it's less common there. But a campus life? yeah, it's there. To say that Columbia is different from any other campus in the country is ludicrous. I attended Michigan, and you know what? When I walked across the Diag, the chances were infintessimal that I would run into someone I know--and most students don't even live on campus after the first year or two. But no one ever said UM lacked for school spirit, however you choose to define it.<br><br>The Dartmouth/Princeton rah rah model is one kind of school--it's not the be all and end all of campus experiences. It's what <i>you</i> wanted--so it's great that you found it. The school my D started at had a similar party spirit atmosphere, she left for a much quirkier school--Wesleyan--which I'm sure you also would have hated. Each to his own. I never name the school she transfered from because it was not right for her, but that doesn't mean it was somehow \"wrong.\"<br><br>Glad you found your type of school, but don't be so quick (and so persistent) to castigate another school because of your bad time. Thousands of other students are there, getting a good education, and having a ton of fun while doing so.<br><br>", "<b>Username: brostrad</b><br><br>i agree w/garland. slipper's observation that columbia is a very serious, adult place is on the money. yet to write it off as a school lacking in community is a gross exaggeration. in addition, i'm sure that dartmouth students don't spend all that much time squirting each other with water guns and playing frisbee, as it's pretty damn cold up there for most of the year. as for the original question...both schools are obviously great. new york certainly provides a more stimulating atmosphere than palo alto. so if you want campus to be the center of your college experience, then take stanford. if you want a campus with a decently strong sense of community alongside a city with readily accessible alternatives, take columbia. in addition, think a bit about the core. if it's important to you to have read the major works in western literature and philosophy/political thought and to have basic exposure to western art/music, columbia takes just about any other school in the country. stanford's science is probably stronger than columbia's, but believe me, the pure science majors here are indredibly smart in their own right. in short, go for environment. needless to say, both schools are excellent options.<br><br>", "<b>Username: sac</b><br><br>quantifyme -- are you my son? :) I know you're not, but you sound just like him.<br><br>", "<b>Username: HC240</b><br><br>definitely columbia!<br><br>", "<b>Username: takeme2cali</b><br><br>sac is correct<br>Stanford is geared more towards the science and math fields in terms of its strong points/departments.<br>If you want the better education for humanities, it is definitely Columbia. Their core curriculum makes it excellent in that.<br>I personally love Stanford because I absolutely love Northern Cal. but that's just me :)<br><br>", "<b>Username: veerawudth</b><br><br>Stanford is much much better! :)<br>try posting this thread on the Stanford board and see what others say :)<br><br>", "<b>Username: brostrad</b><br><br>well that's sure insightful<br><br>", "<b>Username: slipper1234</b><br><br>Garland- I would have liked Wesleyan. People there STAY on campus. If I didn't attend to Dartmouth, I would have gone to Brown. Vassar is one of my favorite schools in the world. I don't think you understand my point.<br><br><br>Columbia is everything Wesleyan isn't: socially its sterile and corporate- empty on the weekends and people don't hang out together. I know many very happy Columbia students who couldn't imagine themselves anywhere else. But I also know unhappy students who probably could have made a better choice and jumped at Columbia when they saw the \"beautiful campus\" and \"access to NYC\". The truth is that \"access to NYC\" comes at a price you don't hear about on college tours. Perhaps I should keep my observations to myself, but having known many schools well Columbia doesn't compare in terms of school spirit. Its a great place (maybe the BEST place) for a more adult or quieter less social person (like it sounds like your son is)/ Also, I think its great for minorities into \"minority scenes,\" so they all escape together into NYC.<br><br>But for someone seeking a typical college experience iit isn't that at all. Every other school in the Ivy League is.<br><br>The point is Columbia is a polarizing place, spend some serious time making sure you like it.<br><br>", "<b>Username: lilsmileycolumbian</b><br><br>I go to Columbia, and while I do agree with slipper in some part, I feel like Columbia does have the best of both worlds. I can spend a weekend in Greenwich going to cafes and jazz clubs or explore the Lower East Side for spoken word venues, but I can also stay on campus and go to a frat party where I run into everybody from some girl I vaguely know from some sort of student organization to a guy that lives down the hall. Its NOT a typical college experience, but it really is what you make out of it. I would also like to point out that facebook does a lot for uniting people and advertising parties, but I know people here that stay on campus ALL the time and make it a \"typical\" college experience and others that don't. And when the weather is this nice out, EVERYBODY is camped out outside, reading, playing frisbee, fraterniziing on the steps. The campus is also really small, so whenever I'm walking around, I always run into people I know. Heck I always run into people in know in NYC. I also tell people Columbia is different, its not the typical college experience, but then I also don't appreciate someone who went to Columbia undergrad for one year at least five years ago to evaluate an undergrad experience. While I agree that the city and large graduate population makes Columbia have a more adult-ish feel, the freshman dorms are set up in a way that helps classmates unite and bond, and parties are always happening and open to everyone. Its not a typical college experience in terms of life does not REVOLVE around Columbia, but I definitely go to on campus events all the time and run into people I know.<br><br>", "<b>Username: slipper1234</b><br><br>The thing is I went to Columbia for grad school too, so I know it really well. I know a ton of Columbia undergrads (AND alumni). While Columbia \"has\" some frats and for a couple months a year people are on the steps, its not even close to other colleges where the whole campus seems to hang out together. Attend Bacchanal, then attend Spring Weekend at Brown, Spring Fling at Penn, or Green Key at Dartmouth and you'll see a real distinct difference.<br><br>The freshman dorm experience is great, but after that there's no real common dining hall, housing is scattered, the library is silentm, and after sophomore year the core is pretty much done. Students don't really own their own space (no one lives in houses), so the laid back parties other typical college activity becomes difficult. While there are campus events, they aren't well attended. Most of Columbia's social life is centered around smaller \"cliques\" and groups, rather than big campus events. Some like this, some don't; but you have to acknowledge NYC access comes at a price. It depends whether that's a price a person is willing to pay, some are and others arent.<br><br>", "<b>Username: garland</b><br><br>The reason I said you would not have liked WEsleyan is because it's not centered around \"big\" campus events either. Sure, they have Wesfest, like those other gatherngs you mentioned, but at all of these places, that's only a couple days out of the year.<br><br>At Wes, people do stay on campus (when they're not traveling to Boston, NYC, etc) but they all go different ways. There's not one place to be, no big games, no bonfires, etc. There are different types of students, who tend to hang out with the same people.<br><br>I think at most schools, and for most students, the desire to go to big parties wanes after freshman year. Those schools where it doesn't, may be your type of school. Plenty others are different. You like rural and small with a cohesive school \"spirit\". columbia, like Chicago and BU and NYU and Northwestern and Michigan and many others, are big and urban. It's not \"different\" from any other school. It's just not like what you like.<br><br>I have to say, it is hard to imagine someone liking both Dartmouth and Wesleyan (or Vassar). They seem to be pretty different, to me.<br><br>", "<b>Username: slipper1234</b><br><br>I think you have a different perspective garland.<br><br>1) The Dartmouth bonfire is one event during homecoming- not a defining experience just as Wesfest is not. As for sports? Who cares. Its about the campus all staying on campus. Michigan is vibrant at night (I've been there for two weekends), Northwestern similarly is \"happening.\" You feel the energy of the places, even if people are scattered everywhere. Columbia, NYU, and BU feel like Ghost Towns because the students AREN'T on campus.<br><br>2) The things uniting NU, Vassar, Dartmouth, Penn, Brown, (almost every college in the country besides the few urban ones) is a feeling of \"laid-backness\" that is difficult to quantify or perhaps even explain. Perhaps students not really \"owning\" any space has alot to do with this, and having too many options adds to it.<br><br>", "<b>Username: garland</b><br><br>Don't quite get the \"owning space\" theory. Small campus houses which students share is not the \"norm\" at most colleges in the country.<br><br>", "<b>Username: johnwesley</b><br><br>I think there is clearly a little bit of the same DNA embedded within both schools. It wasn't that long ago that they were both members of the Pentagonal Conference (the Little Three, plus Bowdoin and Dartmouth, they were credited a few years ago, in an Atlantic Monthly article, with inventing Early Decision as a way of protecting its turf against HYP.) And, Karl Furstenburg, Dartmouth's veteran dean of admissions is a Wesleyan alum. Likewise, Wesleyan has an active fraternity scene (small compared to Dartmouth's but definitely a part of the overall social fabric) and a small but devoted sports following; three different professional franchises have had Wesleyan alum at their helm at one time or another within the past year: the Boston Red Sox, The New England Patriots and the New York Jets.<br><br>", "<b>Username: sac</b><br><br>\"\"I think its great for minorities into \"minority scenes,\" so they all escape together into NYC.\"\"<br><br>Slipper -- When you keep talking about closed parties and cliques, why do I get the feeling you're talking about ethnic groups. Are you?<br>\"\"But for someone seeking a typical college experience iit isn't that at all. Every other school in the Ivy League is.\"\"<br>This statement is just silly. What does the social life at Cornell have to do with the social life at Princeton? Harvard and Brown are not a whole lot alike socially, either. Which is \"typical\"? Harvard with its all-male finals clubs? Yale with its secret societies? Cornell, which not only doesn't have a residential college system, but where a large number of students live off campus? Or, Dartmouth, with its lack of diversity, and big frat/jock scene. The point is that they are not much alike and therefore no one of them can be called \"typical.\"<br><br>I also think, grad school at Columbia or not, you are out of date. Pre -Instant messaging, text messaging, cell phones, facebook, blogs.<br><br>The idea that Columbia is for less social students is ridiculous. Students don't head out into NYC alone -- they head out in groups, sometimes big groups. Student groups sometimes rent clubs to party in. It's different than, say, Cornell, where many students live off campus and have parties in apartments, or Dartmouth where they stay on campus and go to frat parties. But that doesn't make it less social.<br><br>People aren't objecting to your preference of Dartmouth (or any other school) over Columbia, they are reacting to your very narrow definition of what is \"typical\" or what is social or what is fun, which by implication makes everyone atypical whose idea of the ultimate college experience isn't to be drunk in the middle of the afternoon with everyone else on the campus.<br><br>", "<b>Username: slipper1234</b><br><br>>>>>Or, Dartmouth, with its lack of diversity, and big frat/jock scene.<br><br>I just think I am much more in tune with the college scenes. Dartmouth is about 32% minority - more diverse than Brown, Princeton, and Cornell - and right alongside Yale and Penn - in terms of diversity. While less than 50% are in frats, only four-five out of 17 are \"jock\" houses, the rest are not at all. huge stereotype lingering from the 80s that's no longer valid.<br><br>I'll address the rest later- gotta run.<br><br>", "<b>Username: sac</b><br><br>\"\"less than 50% are in frats\"\"<br>oh, glad to hear there's not a big frat scene.<br><br>", "<b>Username: slipper1234</b><br><br>Its a big frat scene but frats mean many different things. At big state schools its lines at doors, testosterone, brothers + girls only, etc.<br><br>At Dartmouth its open door, minorities are in frats, every party pretty much has the campus coming, everyone is aware of all the parties, and many are not based on sports teams. Pledging is relatively not serious compared to other schools. Its welcoming and unique, as most Ivy frat scenes are.<br><br>", "<b>Username: slipper1234</b><br><br>Sac- I have spent a weekend at every single Ivy. Harvard and Brown are actually very similar. In fact they are the two most similar Ivies.<br><br>Every Ivy except Columbia has:<br>1) Frats/ Eating Clubs/ Social Houses/ Residential Colleges: support a par of the social scene. Columbia has frats but they are very inclusive and rarely open their doors to outsiders.<br><br>2) Off-campus social scene based on STUDENT HOUSES.<br><br>3) University Dining Halls open for all four years. Lerner is nothing like these other places.<br><br>4) Social libraries.<br><br>All of which make a \"typical\" college experience where the CAMPUS supports the population rather than the city. I think any Columbia student would atest to the fact that its the most \"unique\" Ivy socially by a long-shot.<br><br>I feel like my arguments are not so hard to grasp. Columbia is an awesome school for a certain type, as I have asserted often. But the city's options, size of the school (tons of grad students), fragmentation (CC vs. BC vs. GS), lack of student owned space (off-campus houses), etc all serve to detract from the social scene, at least compared to other schools. Columbia is awesome for those who don't need that sense of community - but it is different.<br><br>", "<b>Username: slipper1234</b><br><br>>>>>Slipper -- When you keep talking about closed parties and cliques, why do I get the feeling you're talking about ethnic groups. Are you?<br><br>I am talking about ethnic cliques, lifestyle cliques, socio-economic cliques, drug based cliques - the same things that cliques are all over the world.<br><br>", "<b>Username: lilsmileycolumbian</b><br><br>I came to Columbia believing that Columbia did not have an on campus community, but that was okay because I've never been too rah rah school spirit anyway. Columbia can be very cliquish, which no one had told me, but I do feel that slipper that your information about Columbia is outdated, which is what bothers me. I'm currently an undergrad here, and from what I have observed, the city does not NEARLY dominate life as much as I thought it would. People are on the steps all the time, weather permitting, not just sometimes. It has a very laidback California feel, and I was pleasantly suprised by this. Columbia is certainly unique and I warn any person that wants to come here that there is a less campus centered life, everybody seems to go to the same major on-campus events. Sometimes people stay in, other times people go out. What makes Columbia different is the option. Also, facebook did a lot to revolutionize the college experience by helping to advertise campus events and parties. And facebook invites keeps people in the loop.<br><br>", "<b>Username: slipper1234</b><br><br>Lilsmiley, I guess my point is not that columbia doesn't have an on-campus social life- it does. Just much less so than its peers.<br><br>", "<b>Username: sac</b><br><br>\"\"I feel like my arguments are not so hard to grasp. Columbia is an awesome school for a certain type, as I have asserted often.\"\"<br>I agree with that! In fact, I believe it is a statement that could be made about every school. Dartmouth is awesome for some people, MIT is awesome for some people, Harvard is awesome for some people, but not necessarily the same people. It's the way you lump every other Ivy, as well as every other college you consider \"typical\", together -- and oppose them all to the Columbia experience -- that I find problematic. As if Columbia is a place for only a certain type, but other Ivies are for every type.<br><br>Wonder how many Brown students would agree with your statement that Harvard and Brown are the most alike of the Ivies.<br><br>As to the arguments I and others have made here, the point is that Columbia does not lack campus social life. It offers choice -- and for many people that is a positive, not a negative.<br><br>", "<b>Username: sac</b><br><br>I do acknowledge your expertise on Dartmouth, and am pleasantly surprised by its efforts towards diversity. A lot can change in a few years at a college:) Columbia can get more on-campus social life, Dartmouth can get more diverse.<br><br>This is from 2002:<br>\"\"Most everyone agrees that Dartmouth has a lot of work ahead of it. The drive [for greater diversity and understanding between races] here was inspired in part by an internal report last year telling of many minority students who over the years actually \"felt damaged\" by the climate at the college. Just four years ago, a Dartmouth fraternity and sorority prompted an outcry on campus after having \"a ghetto party\" at which students dressed in so-called inner city clothes.<br>...<br>This year, Dartmouth's incoming freshman class consists of about 30 percent minority students, the most diverse group in the college's history, with 13 percent Asian, 7 percent Hispanic, nearly 7 percent black and 3 percent Native American.<br><br>This is a great step forward for Dartmouth which does need a focus on diversity and greater understanding between the races.\"\"<br><br>", "<b>Username: veerawudth</b><br><br>Go to Stanford!<br>Please post this thread in the Stanford board and see what others say :)<br><br>", "<b>Username: slipper1234</b><br><br>I think SAC that I know Columbia undergrad better than you think. I agree that cell phones, AIM, and Facebook make it easier to communicate, but the simple truth is outside of the first week where people are all over 114th street people tend to segregate and go off into the city. The \"festive\" feeling just isn't there.<br><br>", "<b>Username: quantifyme</b><br><br>that is just not true. when the weather is nice (which admittedly is not as often as stanford) the campus has every bit of a traditional campus feel. at the moment, I am looking out of my dorm room at fields absolutely blanketed by lounging students, library steps packed with reading/talking kids, and air filled with frisbees.<br><br>", "<b>Username: lilsmileycolumbian</b><br><br>As a student here at Columbia, I'm really really fed up of hearing slipper claim that Columbia students go off to the city all the time and that there is no festive feeling. That's ridiculous. People do both, they stay on campus, go off campus. Its expensive to go off campus all the time, and there's plenty of people here all the time as well. Although the weather isn't always as nice as Stanford, when it is, everyone is outside playing frisbee, croquet, eating, reading, and people have classes outside. People sit on the steps and watch movies, smoke hookah, whatever. I come from where Stanford is where the weather is generally nice and let me tell you, when the weather is nice here, people REALLY appreciate it compares to Cali where I'm so used to it. When it snows really hard, everyone packs up in snow gear and run around outside and have snowball fights and sled down the steps. On the first snow, a bunch of us Floridians and Californians ran around at four in the morning throwing snowballs. There's even community outside of campus. When the Christmas tree lighting occured or the Halloween parade, you can guarantee a strong Columbia contingent. Columbia has one of the smallest undergrad population, and you are constantly running into your classmates because there is no segregating college system and the campus is tiny so you see everybody all the time. I want this to be VERY clear to anyone considering Columbia because I was misinformed. Sure, you may get lost in the administration and bureaucracy, but for the most part, the class has more unity because we're not THAT close to the city like NYU where we run around greenwich everyday. Please DON'T expect New York City to absolutely dominate your life here. I go off campus A LOT more than some of my peers, and I still have a very strong campus sentiment. The \"festive\" feeling is definitely here depending on how you define it. I don't like to attack people but I feel like slipper falls under the catagory of almost white upper middle class that wants kind of an old school boy feel about his school, which is NOT what you're going to get here. I'm sorry if I am wrong. I'm on these boards because few students come here, and my information is up to date and honest with what is going on here. I found these boards to be very helpful in my college decision making process. I care about the people that come to Columbia, and I host pre-frosh so I can share with them my experience both at Columbia and in the city. Columbia is AMAZING, granted not for everybody, but to say that it lacks a \"festive\" feeling really really ****es me off. And to say that people segregate and go off into the city is not NEARLY as true as slipper makes it out to be. As you become an upper classmen, then yes, its true, you tend to go off more into the city, and yes freshman go to Greenwich and the Lower East Side a lot. But I feel community on and off campus ranging from sledding down low library steps to large movie outings in times square because we can. It may not be AS MUCH community as in other colleges, but come on, people seem to hang out with relatively the same people no matter what college they go to. And as to not having off campus HOUSES to party at, that's because we have much more off campus places to party at ranging from rented out clubs to restaurants and so on. Columbia is for the more independent and less shelters, for those that are slightly more adult, yet the typical college frat boys/atheletes exist, and while life is not SUPPORTED by Columbia, it doesnt mean that Columbia is not festive. Excuse any grammar and spelling errors I have made, its Thursday night and I want to go out. But as a Columbia student, I am positively OUTRAGED by this whole \"oh Columbia isn't festive\" thing. I just had a grad student say that he looks at everyone lounging in the lawn and misses being an undergrad because grad students to lounge on the lawn. How can you say you know Columbia undergrad better than I do? I go and live there as an undergrad RIGHT NOW, and I agree that its a hard time adjusting, there's less hand holding, but the festive feeling is there. You say you know a lot of undergrads, etc. I talk to people too. Columbia has less community than other colleges. Yes. But there's a strong undergrad spirit that exists in the quad and on the streets of morningside everyday and every night. I'm no authority Columbia and I can only speak from my own experience and from the others that I've spoken with. True, if you haven't found some friends, than it can be lonely. As with life.<br><br>", "<b>Username: freddyj</b><br><br>thanks lilsmileycolumbian! that was really helpful.<br><br>", "<b>Username: jamishmo</b><br><br>Yeah, as a freshman at Columbia, it's quite tiring to hear people say that Columbia lacks community. I feel like I know every freshman's face since almost all of us live in one of two buildings, and I run into classmates EVERYWHERE. Basically, what lilsmileycolumbian said is completely true. Morningside Heights is basically a college town in itself, while still being an integral part of New York City. Stanford's campus is HUGE, while I rarely have to walk more than 1500 feet anywhere. Since Columbia is in New York, its campus is quite compact, which definitely fosters community. Plus, Columbia is an Ivy, and you'll never be able to say you go to an Ivy-League school if you go to Stanford. I know it's elitist, but it makes a difference for some...plus, since Columbia is much older than Stanford, its got a lot of that old-school charm. Stanford looks like a Disney Land. While Stanford has far better athletics, that is a product of its non-Ivy status, where they offer athletes $$$. Finally, New York kicks Palo Altos ass any day of the week.<br><br>", "<b>Username: blah1111</b><br><br>to be fair, though, Stanford honestly doesn't need ivy status to be considered prestigious and elite. it's about half as old as Columbia, and yet more people know what Stanford is than Columbia. and this is coming from a Columbia student. I personally think Columbia is great, and I'd definitely choose it over Stanford any day (just my preference), but we shouldn't delude ourselves about its prestige, since Stanford edges out Columbia in that department, though arguably not by much.<br><br>", "<b>Username: a_nicte</b><br><br>Alright I am on the brink of making my choice and i need to know two very important things... (i have just completed visiting both and am very very confused)<br>1) is the whole red tape/ un helpful administration aspect of columbia true? especially in their mentorship system<br>2) Stanford gives money like water... for studing abroad.. everything, I had the impression columbia is more stingy. I am wrong, how liberal is columbia with its under grads, money wise? not just fiancial aid but for undergrad research grants etc<br><br>", "<b>Username: blah1111</b><br><br>though Columbia nominally gives more money to its grad students than other Ivy league schools (about $25k a year in addition to free tuition/fees, more than about six of the Ivies), the standard of living in New York City makes it difficult to stretch that out, giving the impression that Columbia is very stingy with its grad students.<br><br>", "<b>Username: blah1111</b><br><br>I've never had a problem with the administration/red tape. If you set up an appointment, you'll be guaranteed one, barring of course grave circumstances. My advisor's <b>secretary</b> knows me by name, for crying out loud.<br><br>", "<b>Username: a_nicte</b><br><br>what about stinginess with its undergrad though... and how easy is it to get an off campus job?<br><br>", "<b>Username: bidkid</b><br><br>You'll be living in new york city... The whole city is your job market and the school doesn't regulate what you do with your free time so i'd say very easy.<br><br>", "<b>Username: a_nicte</b><br><br>Thank you guys.. im split- i visited both schools and although stanford is giving me more money, I cant get over what i FELT at columbia, i want to go there and if I resolve my financial issues I will- hands down.<br><br>", "<b>Username: blah1111</b><br><br>Fax Columbia your Stanford aid with a concise explanation of why you feel you need more money. Columbia would be happy to reconsider your offer, and even match your better aid, as in most cases. You might want to do this as soon as possible because it takes them about a week to process/review the files and come to a decision; May is coming around in less than two weeks. Send the fax with an \"Attn: Appeals Committee\" at the financial aid office if you plan on doing this. Good luck with your offer!<br><br>", "<b>Username: iversion</b><br><br>\"\"Stanford looks like a Disney Land.\"\"<br><br>Are you out of your mind?<br><br>", "<b>Username: a_nicte</b><br><br>I did fax them about that, because i do need more aid. They gave me lots of loans while my other offer gave me none. Do you think they will reduce thier loans? Should I email them, i am afraid I will not get a desicion in time because mail takes forever to get here<br><br>", "<b>Username: blah1111</b><br><br>you should call them and express your need to hurry, since you have to decide by the first of May.<br><br>", "<b>Username: Rabban</b><br><br>If I were you, I would choose \"Columbia\" and never look back. :)<br><br>", "<b>Username: slipper1234</b><br><br>Lilsmiley-<br><br>1) I have no desire for \"old boy\" experiences<br><br>2) I think you need to visit some other schools. Of course Columbia has community, but its not even close to the other Ivies or a place like Stanford. Where is everyone Sat night? 1020? the West End? EC apartments? None of which come close to other schools social venues.<br><br>", "<b>Username: lilsmileycolumbian</b><br><br>I have visited some other schools. Their social venues seem to be just as divided as Columbia's. In fact, when I visited Yale, the kids said to me \"Oh you're from Columbia? The parties are so much BETTER there I hear! Yeah, Yale parties are lame.\" My main issue is that you give a very distorted view of Columbia from a perspective of someone that maybe didn't feel as comfortable, so in any school you don't like, you feel that the social environment is isolating. I get that from people coming from all sorts of schools- social environment can be isolating anywhere.<br><br>", "<b>Username: WildLion82</b><br><br>As a grad student, I can agree with lilsmiley on the whole \"lounging on the steps\" thing, though I've been able to enjoy some afternoons studying on the grass (admittedly not as cool as sipping beer out of bagged bottles on the first day of spring, but I guess I'll take it).<br><br>That being said, I can see the rationale behind all sides of this argument. I know nothing about Stanford, so I won't touch it. As I've posted in other threads tonight, I went to undergrad at Northwestern, and while I think that community is a concern everywhere, Columbia seems far more disjointed, elitist, etc. I understand slipper's comments in re: a laid-back atmosphere that is lacking at Columbia. Like it or not, people at Columbia (well, undergrads moreso than grad students) tend to take themselves very seriously--too seriously, in my humble opinion. But that's just the tone of the place. Some people really like that atmosphere and feel that it drives them to do better work. There are those who don't necessarily want a \"laid-back\" atmosphere and would rather be somewhere intense and businesslike. After all, as intense and businesslike as Columbia seems, I know that these kids have some fun as well--most college students do, regardless of where they go.<br><br>Ultimately, I think that Columbia undergrads really seem to love the place and become fairly attached to it. In fact, I think it's fairly universal for students at a given college to take a lot of pride in it and identify strongly with it, regardless of the prevailing attitude and campus \"spirit\" (hell, if Caltech kids can get excited about their rivalry with MIT, then I'd imagine that Columbia kids can get excited about *something*).<br><br>The OP will probably look back on his college years with fondness, whether he picks Stanford or Columbia. In the unlikely event that the choice he makes is simply unbearable, a transfer is always an option.<br><br>", "<b>Username: slipper1234</b><br><br>I think Wildlion hit it on the head. Columbia is a serious environment - bottom line. Some find that refreshing, I found it cumbersome.<br><br>", "<b>Username: acinva</b><br><br>Let's face it, the rah rah types who paint their faces to go to sports events and celebrate wildly after a win aren't going to be at Columbia. While these kids are very visible at a places like Duke or Notre Dame, you won't see anybody like that running wildly around Columbia. The atmosphere is more serene than at some other colleges. You don't feel the rah rah excitement when you're on the Colulmbia campus. But, that's not to say there's nothing to get excited about. There are many clubs to join and there's the LLC to find people that share your interests. It's not going to come knocking on your door at Columbia. You will have to make an effort to find it, but it's there. Columbia is a low-key campus but there is definitely something for everybody if you seek it out.<br><br>", "<b>Username: slipper1234</b><br><br>I think people pigeonhole 2 types of college experiences 1) rah-rah sports, frats, \"old boy\", etc or 2) more urban, sophisticated, cultured.<br><br>This is patently false.<br><br>I barely hung out at frats at my college, never went to sporting events, but found a much more community oriented atmosphere. I probably have more undergrad friends than 95% of grad students and I really think Columbia heavily lacs in this area. Maybe my issue is I am comparing it to other community schools I know well like Brown and Dartmouth. But truthfully Columbia has the worst community of any top school I know and I have met many many ambivalent students. People clique of more than at other schools, and there aren't many common social venues to bring people together after freshmen year. People don't seem to love it overall.<br><br>", "<b>Username: sourpunchsk</b><br><br>hmm, well i just did an overnight there, and the whole lack of spirit thing really just didnt seem true at all. everywhere i went were people wearing columbia apparel and all the current students i met (including those who weren't hosts absolutely loved columbia. so in my view, they DO seem to love it. obviously, you didn't, but why try to paint it in such a harsh light slipper? every person is different, perhaps u needed the constant nudging and support of the \"campus community\" but columbia students are more independent. this does not mean cliquy or *****y, it means that they like to go out and get things in life. and im sorry, but cliques happen everywhere (i know that penn gets this complaint a lot, despite its more \"campusy\" feel). each person should decide for themselves where they feel the best and that's that.<br><br>", "<b>Username: brdc_2</b><br><br>I second sourpunchsk's post. I was labelling Columbia with all the characteristics slipper said before I went to visit. When I visited, the students I talked to all absolutely loved Columbia and said that it was just nonesense that there's no community, that it's hard to meet people. However, a current student at Penn that I talked to told me that, from her school, every year about 20 students go to Penn, and 20 to Columbia, and that those going to Columbia generally are unhappy once there, and those to Penn generally happy. Plus there ARE people on this board who say all these things about Columbia, that to be wary if attending there.<br><br>I think it's safe to conclude that these can be very subjective things. You just gotta see it for yourself--upon visiting a campus, one may absolutely love it, while another may loathe it.<br><br>Meanwhile, can we get more firsthand opinions?<br><br>", "<b>Username: Nickeel Patel</b><br><br>I have just been accepted to University of Arizona and Michigan State University.<br>I am a business marketing major and i am looking for a fun yet reutationable university.<br><br>I have done my research, an UA and MSU ranks almost the same under \"US News 2006 undergraduate business program\".<br><br>I haven't been to either campus but i hear MSU's campus is great because it is an agricultural college. But UA is based in tuson, AZ, and i have seen pics of the campus and it looks great.<br><br>I know that the party scenes are also great at UA and MSU.<br><br>Academic wise, UA and MSU holds about the same also. Does anyone know if majority of students at UA or MSU are smart (i mean will influence ur future) or are they just a bunch of average Joes??????????<br><br>But i think MSU hold it over UA for reputation wise, i mean it isn't a bad school.<br><br>I got a scholarship to UA for three years but never got one from MSU.<br><br>PLEASE HELP ME MAKE A DECISION!!!!! I\"M BEGGING SOMEONE, SHARE SOME WISEDOM!!!!!!!!<br><br>", "<b>Username: brdc_2</b><br><br>you should post on their respective boards on this website. the people there would know better<br><br>", "<b>Username: a_nicte</b><br><br>AWww... i dont know what to do! Stanford has so much money FOR everything! I loved Columbia and NYC escpecially since im an international... I loved the atmosphere at Stanford too though... Ok nre stategy... What would change about columbia/ stanford?<br><br>", "<b>Username: brdc_2</b><br><br>what do you mean what would change?<br><br>", "<b>Username: a_nicte</b><br><br>Basically I want the dirt on both schools. I know everyone pretty much loves thier school (except for slipper apparently) but still what are the ugly things? If you wanted to improve things how would you make things better?<br><br>", "<b>Username: lilsmileycolumbian</b><br><br>If I wanted to improve things we wouldn't live in 116th, but more mid-town. The subway ride to greenwich is 37 minutes according to hopstop.com, so it can be kind of a pain going downtown sometimes.<br><br>Also, I think it would be beneficial if University Writing had themed writing classes like George Washington University and Harvard rather than a semester long writing class that involves writing about nothing.<br><br>Please STOP making generalizations about Columbia. I agree, be wary of picking Columbia because it can be a more independent and adult ish atmosphere, and in my personal experience, I have yet to meet a SEAS kid that loves or even likes the SEAS program, so if you're going to SEAS, you have to weigh how much New York City or Columbia makes it worth it. I do praise slipper for pointing out the cliques, which is something that I never read about before I came here. That is a negative factor, and it is something that I dislike. But students OVERALL don't hate the school, and the ones that are bitter are generally the ones that didn't make an effort to make friends. I like schools that are in big cities and disjointed. I like my world to revolve around something more than college life. Yet I also love Columbia community, and I love being able to come back to my school and gaze around my campus. Columbia community, like I said before, may not seem to as \"strong\" as other campuses, but it exists, and it makes most of the students feel a part of something bigger. But I do warn everyone that comes here that it is not the traditional college experience, however, I get very defensive and protective when I feel people are dissing it without really experiencing it. I'm sure you hear undergraduates complaining..I complain all the time about stuff here. Young people tend to blow off steam that way.<br><br>Most people I know that go to Stanford are happy at Stanford. They only say that Palo Alto sucks (which it does. I've grown up around there). If you go to Stanford, community definitely exists there, and your world will pretty much revolve around Stanford because it's HUGE and it's actually it's own city. I've stayed there for summer programs and pretty much grew up with the idea that I would go there. However, someone like ME would hate it there.<br><br>If you want to contact me sometime a_nicte with specific questions, I know both communities fairly well. I do agree that it takes a special kind of person to go to Columbia and really get the experience out of it.<br><br>", "<b>Username: bigU212</b><br><br>I chose Columbia because of the city. If I can make a small group of friends, I should be fine.<br><br>From visiting the school and talking to people who attended it, I get the sense that community at Columbia is much less organized, but that it's not a matter of people being cloistered and unfriendly. It's just that there are too many museums, internships, stores etc... in NYC to keep everyone in one place at one time. Why would you go to watch third-rate college football with all of that at your fingertips?<br><br>", "<b>Username: slipper1234</b><br><br>Lilsmiley I agree with everything you said in that last post. I am comparing columbia to places like Brown and Dartmouth, of course it will have less community and cohesiveness than places like that. Conversely Columbia has MUCH more community than most other urban schools. If Dartmouth or Princeton are 10s in terms of \"spirit and community\" a place like Columbia is a 4 or 5, a place like NYU is a 1. As I have pointed out Columbia's faults, I think I need to point out some of its benefits over other places:<br><br>1) It does have community for an urban school. For students wanting an urban experience its more than enough and blows places like NYU out of the water<br>2) Cultural sensitivity: Its anti-jock if anything. Overall students are very open-minded<br>3) The core: for CC students I think its a huge benefit<br>4) Awesome \"esoteric\" departments. If you want Sanskrit or screenwriting it will be there<br>5) Girls: If you are a guy you'll be pretty happy with the ratio<br><br>", "<b>Username: sac</b><br><br>a_nicte: to answer a couple of questions you posed a while back:<br><br>No, you won't find the money for undergrad projects at Columbia the way you will at Stanford. Stanford has just raised a ton of money for undergraduate education. It is easy there to write a proposal to do something and get funded as an undergrad.<br><br>Yes, you will find LOTS of part-time job possibilities at Columbia, and many more off campus jobs or internships in NYC than Palo Alto.<br><br>You might also take into account that NYC is an expensive place to have fun. I don't know the rules on employment for an international student, but presumably you've looked into that if you're thinking of getting a part-time job.<br><br>", "<b>Username: collegehunter101</b><br><br>i thought people go to college for education; not for frat or parties. social life is all about yourself, you create yours. I also thought that it is inappropriate to critique a school just because you could not find your social niche there.<br><br>", "<b>Username: slipper1234</b><br><br>>>>i thought people go to college for education<br><br>Wrong. That's only one piece of the puzzle. My schooling has only been a part of my education. The people you meet, the way you shine among your peers, etc all are very important. At my MBA interviews, the resume got you the interview but personality fit got you the job.<br><br>", "<b>Username: brostrad</b><br><br>listen, most people are at columbia for the education. so, not \"wrong.\" of course they seek social lives too, but education is probably the main piece of the puzzle for c.u. students. you're going to find all kinds of people at columbia. granted, there will be a good number of weirdos. but come on man, it's really not too hard to find something fun to do in the columbia area on a weekend night. maybe you won't find massive frat parties and year-round frisbee-playing on lawns, but there are more than enough bars, room parties, campus events to keep ppl happy.<br><br>", "<b>Username: slipper1234</b><br><br>The point though is that for most cases the education difference between any top 15 is nil (except vocational areas like engineering, film, music, nursing etc - where almost no Ivy is at the top). In fact it can be said that the more LACish schools like Pton, Dartmouth, Amherst, etc are the best at educating undergrads. But the social life differences are dramatic. Choosing one Ivy over another if someone is pre-med, for example, for any reason outside of campus atmosphere is silly.<br><br>", "<b>Username: a_nicte</b><br><br>Thank you all... I just couldnt do it, California was too much for me, COLUMBIA 2010<br><br>", "<b>Username: Falrapax</b><br><br>NOOOOOOOOOOOOOOOOOO I'm on the Columbia waitlist :(<br>And I got rejected from Stanford, my first choice. NO a_nicte! Preserve my dream and let me have my second-favorite! DON'T TAKE MY SPOT T_T<br><br>anyway, weirdly, one frat threw a party for pre-frosh when my friend visited a week or two ago. apparently there were huge numbers of people, pre-frosh, frat kids and normal students. do you wait for social life to come to you, slipper? yeah there are cliques at every university. it's what humans do: most people like having friends they feel truly understand them. personally, I am a clique-less fellow. my school is severely cliquish, but the only kids who are *******s about their cliques are the mean-spirited preppy unintelligent kids who I'd rather not be friends with anyway when there's nicer, more intriguing people to hang out with. I have two or three excellent friends, and then rub shoulders with pretty much everyone wonderfully. why not just do that? when I visited columbia, I made a point of talking to lots of students. just because they don't look at you with a smile as they walk by doesn't mean they don't have a good heart- I don't think I talked to a single kid feeling shunned or like he didn't really want to talk to me. some were awfully quiet, some were downright exuberant once you got them going, but maybe, slipper, you have a tendency to assume that if a person doesn't scream hello to you and hug you the moment they see you, it means they don't want to communicate. some kids are more reserved, or more intense, but perfectly friendly if you break into their little world. that's the feeling I got at columbia- no one is going to stop me or anyone else from joining their 'clique': the cliques aren't there for elitist purposes, it's just kids hanging out with kids they feel comfortable with.<br><br>and if there were never any big parties, why not instigate some of your own? college is about giving it your all and cutting yourself loose so you can discover yourself. who's stopping you from transforming the face of social life at columbia? you could have started an organization dedicated to forming events that would have concentrated attendance to avoid fragmentation. I've been on the campus and I know how busy it is- you could have gotten people together to stand around handing out flyers to increase your numbers. not only would you have gotten what you wanted, but it'd have been all YOU. I think kids like to party at columbia, and if they had reason to think that your shindigs were going to be more exciting than going to the khyber pass hookah bar in east village with their barnard girlfriends and simpsons fan club buddies, they'd go in a heartbeat. m<br><br>", "<b>Username: a_nicte</b><br><br>sorry already sent my deposit and housing stuff!<br>but good luck with the wait list<br><br>", "<b>Username: quantifyme</b><br><br>good call a_nicte. Last year I had to make this decision on may 1st. a year later, I am pretty positive I made the right choice in choosing columbia. you have quite a unique stimulating experience ahead of you, not just a typical college experience.<br><br>", "<b>Username: brdc_2</b><br><br>i just chose Columbia over somewhere else tonight too, buddy.<br>Good luck Falrapax, keep hoping but don't keep your hopes up too high.<br><br>", "<b>Username: a_nicte</b><br><br>I am so happy about my desicion... i loved stanford but I couldnt take california... im an international and the stanford bubble didnt appeal to me... columbia is more innovative, diverse, over all awake and active... right?<br><br>", "<b>Username: brdc_2</b><br><br>That's an impression of mine too. Columbia is, first, at the crossroads of the world as its brochure claims. Second, its student body is the most diverse in the Ivy League; these students somehow give a more intellectual/politically active feel. Furthermore, the Core curriculum adds to this \"at the frontiers of the world\" feel.<br><br>Let's be happy about our decisions together!<br><br>", "<b>Username: a_nicte</b><br><br>hey were you at days on campus?<br><br>", "<b>Username: brdc_2</b><br><br>ya. wanna chat on aim? your inbox is full<br><br>", "<b>Username: a_nicte</b><br><br>i cleaned my box<br>and i dont have AIM because i dont live in the states... I have msn messenger though<br><br>", "<b>Username: Falrapax</b><br><br>omg everyone is accepting columbia.......I'm never getting in ^_^<br><br>", "<b>Username: Falrapax</b><br><br>that was supposed to be T_T<br><br>", "<b>Username: brdc_2</b><br><br>i'm sorry. i'm sure your other choices are awesome too, if you made the waitlist<br><br>", "<b>Username: bookfreak89</b><br><br>Dartmouth doesn't have high # of minorities. The top Ivies, that are more diverse, are Yale = Columbia ~UPenn. Princeton and Harvard are somewhat tied for 3rd. Dartmouth isn't all that close. Stanford probably has a higher percentage of minorities than all the Ivies.<br><br>veer: please stop coercing the OP to post this in the Stanford thread if s/he wants to then s/he will. If you want to explain the pros of Stanford, by all means explain it. Don't wait to have your \"Stanford crew\" behind you so that they'll agree with practically everything you say. -_-<br><br>", "<b>Username: lilsmileycolumbian</b><br><br>Oh, if you're an international student, than I do feel that you would like Columbia a lot more than Stanford. Just don't forget to make your own opportunities when you get here and know that the friends you originally make might be \"re-adjusted.\"<br><br>", "<b>Username: Pindar</b><br><br>i'm sorry to bring htis thread back to live, i just have to point out quickly that what bookfreak said was rather funny. the picture of one stanfordian (is that what they are called btw?) leading a mass of cardinals and trees charging down this board to negate every columbian comment is pretty funny.<br><br>any way, on all those that picked columbia over stanford, or vice versa, i hope you did because you DID get a rounded opinion---as bookfreak mentioned, i do hope those that choose one over the other also posted on the opposite boards to get opposite perspectives. nonetheless, since it matters little now (10 days after may 1st), congrats on columbia and much luck to the class of 2010. i hope you find that you are satisfied.<br><br>", "<b>Username: slipper1234</b><br><br>Ummm...Dartmouth is more diverse than Princeton, Brown, and Cornell. Nice try though.<br><br>", "<b>Username: DiamondT</b><br><br>Dartmouth is more diverse than Princeton and Brown?<br><br>what are you on?<br><br>", "<b>Username: slipper1234</b><br><br>By percent of students who are minorities. Dartmouth has been more diverse than all the schools I mentioned since the class of 2003 (Dartmouth was 30.3% minority then, Brown 29.7%, Princeton 27%), although for the first ime in half a decade this year is different (2010) since Pton had a big boost in Minority yield. Dartmouth hasn't had a class with less than 30% minority since the class of 2002.<br><br>", "<b>Username: Rabban</b><br><br>Academics : Throw a dice cuz it's a wash<br>Diversity: URM --> Columbia, Asians --> Stanford<br><br>", "<b>Username: bookfreak89</b><br><br>Hmm...I was going by what the school websites had to say. Usually, the schools update them every year. -_____-<br><br>Dartmouth:<br><br><url>http://www.dartmouth.edu/apply/gene...ts-student.html</url><br><br>Students of Color comprise 27.4% of the undergraduate body<br>6.2% African-American students<br>12% Asian American students<br>6.3% Latino/a students<br>2.9% Native American students<br><br>~73% White<br><br>Brown:<br><br><url>http://www.brown.edu/Administration...andfigures.html</url><br><br>About 28% of undergrads are people of color.<br>~72% white<br><br>Princeton:<br><br><url>http://registrar1.princeton.edu/data/common/cds2005.pdf</url><br><br>Nonresident aliens (international) = 423 = 8.88%<br>Black = 403 = 8.46%<br>American Indian or Alaska Native = 37 = .777%<br>Asian or Pacific Islander = 623 = 13.08%<br>Hispanic = 325 = 6.82%<br>White, non-Hispanic = 2950 = 61.96%<br>Total 4761<br><br>", "<b>Username: slipper1234</b><br><br>Bookfreak, those Dartmouth stats are old (Dartmouth needs to update the webpage!!) and are a from 2004 when the Dartmouth class of 2001-2004 was on campus (2002 was a low year with 23% minority). That site also says its 51/49 male female when now its the opposite. I have the stats in a pdf given to interviewers from the admissions office right here in front of me, every single class following the class of 2003 is over 30% minority. Adding the totals from the Dartmouth classes of 2006-2010 Dartmouth is 30.6% minority and 7.2% international.<br><br>Also, you include international in the princeton number (which Pton does in a shady manner....Dartmouth is over 7% international as well but they do not include it in the minority stats...if you include that number Dartmouth is about 38-39%).<br><br>SO the point is that Dartmouth is more diverse or equally diverse than these schools. WHAT gets me personally is that people view Dartmouth as a non-diverse school when that is COMPLETELY outdated viewpoint. Also, did you know that 84% of Dartmouth students voted for Kerry in 2004? so much for a conservative \"white\" school. Its a tragedy that the 80s image persists.<br><br>So Dartmouth isn't \"at all close\" to Pton in terms of minority enrollment? The stats beg to differ. \"What am I on\" Diamond? I am on a quest to stop misinformation!!<br><br>", "<b>Username: slipper1234</b><br><br><url>http://www.princetonreview.com/college/research/profiles/studentbody.asp?listing=1023117&amp;ltid=1&amp;intbucketid=</url><br><br>More recent Dartmouth stats posted here, taken from PR.<br><br>As I said, its a travesty people view D as \"far less diverse\" when in fact it can be argued it is more diverse than these other schools.<br><br>", "<b>Username: slipper1234</b><br><br>Diamond and bookfreak,<br><br>Actually if you don't mind me asking why did you think Dartmouth was less diverse than these other schools. D has been very diverse (and very liberal) for years, but I have a feeling its reputation from the 80s still lingers in certain places (particularly places ot on the east coast).<br><br>"]}