{"title": "brown vs stanford", "comments": ["<b>Username: FarmDad</b><br><br>This is a comparison that I have not yet seen. What would you say are the relative merits for a liberal arts student interested in history, international relations, creative writing, and classical voice?<br><br>", "<b>Username: dnduswo</b><br><br>did you get into them or something???if you did im really sorry....<br>i really dont understand...this kind of thread...(no offense..)<br><br>", "<b>Username: FarmDad</b><br><br>My daughter has the option of Brown or Stanford.<br><br>", "<b>Username: dcircle</b><br><br>both are great schools. if possible, you should visit both and see which environment (academic/cultural/climate) appeals to you more.<br><br>international relations and creative writing are both very strong at brown<br><br><url>http://www.brown.edu/Departments/Literary_Arts/</url> creative writing at brown is called literary arts--there are opportunities to do senior capstone projects with people like Paula Vogel, Robert Coover, John Edgar Wideman, CD Wright and others<br><br><url>http://www.brown.edu/Departments/History/</url> another strong department, but going through some turnover right now with some faculty retiring, and more new hires on the way<br><br>one advantage to Brown, is that your daughter could conceivably use the open curriculum to triple concentrate in all three areas, while also pursuing classical voice lessons<br><url>http://www.brown.edu/Departments/Music/people/teaching.html</url><br><br>", "<b>Username: SBmom</b><br><br>The schools are both so strong that I would pick based on the differences-- in curriculum, campus culture, size, &amp; location. Your D will get an amazing education either place.<br><br>For me, Brown's smaller size and undergrad focus were a plus, the open curriculum was a plus, and (having grown up within an hour of Palo Alto) Brown's new &amp; different location was a huge plus.<br><br>Campus cultures are fairly similar, but the Division 1 sports are obviously more intense at Stanford, and the large spread-out campus creates a different \"feel.\" I thought Brown was much more beautiful, but I had had brick and ivy in mind since I was about 12 ;).<br><br>These are all subjective decisions; your D will have to form her own opinions.<br><br>", "<b>Username: mensa160</b><br><br>Brwon is more cultured. Stanford is west coast TV culture.<br><br>", "<b>Username: DanJH1202</b><br><br>I really like both schools. I applied early to Stanford (deferred, then rejected) and applied regular to Brown (accepted). I will be attending Brown in the fall. The main reason I originally wanted Stanford over Brown was a stronger engineering program (which I probably won't major in now anyway) and I like California. But here's my take on the two schools: both have a fairly open-minded, liberalish student body with a very laid back and chill atmosphere (which I really like about both schools). Although both campuses will have a very diverse student body with all kinds of people, it seems that Stanford is a little preppier than Brown (a pro or a con, depending on who you are). Stanford does carry slightly more prestige than Brown, and Brown is still stuck with the unfair label of being full of crazy pita-bread eating hippies. Which, if you visit the campus, is not true. there are all sorts of people there. Both, I think, would give you a hell of an education. Just depends on which atmosphere suits you best.<br><br>", "<b>Username: FarmDad</b><br><br>Thanks to all for your comments. I really appreciate them and welcome any more. DanJH, good luck next year at Brown! You're in a great school.<br><br>", "<b>Username: veerawudth</b><br><br>In my opinion, Stanford is better.<br>Try posting this thread in the Stanford board and see what others say :)<br><br>", "<b>Username: Brunonian2010</b><br><br>stanford is not more prestigous than Brown<br><br>", "<b>Username: Marsden</b><br><br>Stanford is <i>definitely</i> more prestigious. Its worldwide fame hardly needs remarking here. However, that does not make it a better school.<br><br>Quite the contrary, your daughter might well like the closer focus on undergraduate education that Brown is likely to provide. And given the interests you have listed, I think Brown is the more appropriate choice.<br><br>", "<b>Username: Pinderhughes</b><br><br>Both are great schools, but it depends on your audience which one is more prestigious. For those who matter, the Northeast elite, especially Wall Street types, there really isn't a debate here. Brown is far and away more prestigious. As good as Stanford is, it is still not vintage Ivy League, and the Ivy label matters in the Northeast. Now, if you are talking about Asian engineering types, Stanford is more prestigious. However, it is significant that the last time I saw the statistics, Stanford Law School had, in its entering class, as many Brown undergrads as Stanford undergrads, and Law Schools tend to give a slight edge to its own undergrads.<br><br>", "<b>Username: 2o_o7</b><br><br>Stanford is internationally recognized. I'd say that pretty much all over the world (including the US) its name carries greater prestige...even some kids from the Mid-Atlantic area hadn't heard of Brown before college searching.<br><br>Again, that is no reason to choose one over the other.<br><br>", "<b>Username: monosierra</b><br><br>It really depends on your major, if prestige and faculty quality is what you're looking for. Stanford definitely has an edge in physics and most disciplines of engineering. Its economics and political science programs are also 'better' than Brown's, in the sense that they have more big-name profs and rank higher in those research rankings. Then again, since its undergrad education we're talking abt, perhaps the difference won't be that great.<br><br>", "<b>Username: RowanMD</b><br><br>My Bias:<br><br>Accepted: Brown, Princeton, Cornell, Colgate, UVA, Middlefield and a bunch of Canadian schools (I'm from Toronto)<br>Denied: Harvard<br>Didn't apply: Rest of the Ivies, Any West Coast schools.<br><br>Looked for a prestigious liberal arts school with balanced athletics (swam for Brown) and a great education with renowned TEACHERS, and strong sciences department.<br><br>I went to Brown for undergrad, now finishing my medical residency at Stanford so I have intimate knowledge of both schools. I graduated Brown with my eyes opened to different ways of learning, and a desire to re-evaluate the status quo whenever possible.<br><br>My personal interests lie with the disgrace of socio-economic inequity, and a strong desire to make the world a better place. Call me an idealist...but I'm not. I am a realist who would rather methodically pick my battles and thus affect lasting change.<br><br>I went into Family Medicine and now Sports Medicine with a desire to treat the whole being, and to be able to reach out to anyone in any country, of any socioeconomic class. I love my field, and the direction I am heading and have to thank BOTH schools for getting me here.<br><br>My thoughts:<br><br>1) Prestige perceptions:<br>East Coast- B>S<br>West Coast- S>B<br>Heartland- S=B<br>Internationally- S=B (btw, there were an insane amount of international royalty at Brown, something I didn't expect before going)<br><br>2) Atmosphere:<br>Stanford- Much larger feel, less personal, less of a nest, growing atmosphere, more of a feeling that you're part of a giant machine or empire. Definitely more preppy. I get the sense that while Stanford is a laid back and fun place to be, it's also a bit more conservative overall. I love California so in terms of climate, Stanford>>>Brown.<br><br>Brown- Progressive, nourishing, eye-opening, UNDERGRADUATE FOCUSED. It's open curriculum is structured to encourage learning HOW to think so it fosters an edgy, questioning student body. I loved it, though it may be a turn off to a more stuck in the mud type of student. It is historically the most progressive school within the Ivies and that feeling was appreciated by myself and most of my friends.<br><br>3) Curriculum:<br>Stanford: Extremely strong in Engineering, physics, High tech and super-specialized sciences<br><br>Brown: Extremely strong in life sciences (including medical sciences), History, Art, and especially International Relations. There seems to be a funnel from Brown to the U.N. I personally know three people IN MY CLASS ALONE who are now working in rewarding careers there. Many go on to prestigious IR graduate schools like Fletcher (Tufts), Woodrow Wilson (Princeton), Stanford, JFK (Harvard), and Columbia before going on to the UN.<br><br>Brown has an open curriculum. For those that are not sure what they want to do or for those that have a great curiosity for all that there is to know in this world in many fields outside of a major interest, Brown is the better place...period.<br><br>Ex. My wife, also from Brown took classes from around 16 departments, and had to decide on a major between Education, Music, International Relations and a couple others I don't remember. While it worked out for her (creative, international career as a video/documentary producer) it can be daunting to those that can't deal with choice.<br><br>(BTW, I double majored (call concentrations at Brown) in Biology and Geology-Biology, with a neuroscience honors thesis.)<br><br>Qualifier: Both are tremendously strong in MANY departments. I argue that an undergraduate education is best taught by TEACHERS and not by \"top of their field professors\" who are more interested in their research, careers, and GRADUATE level teaching than teaching undergrads. Both schools have their fair of both types so research the departments and classes well before committing!<br><br>Quality of Life:<br>I can't say much about Stanford's undergrad but my memories at Brown are filled with nothing but warm and fuzzies... It's consistently ranked top 5-10 for quality of life and student happiness. Providence, RI is a great place to grow into yourself intellectually as it's a progressive, multicultural and diverse socio-economic city but feels like a large friendly town, and is very student friendly. It's a short drive or train ride to Boston and New York (visited both numerous times in undergrad)<br><br>Stanford is in Palo Alto, one of the richest neighborhoods in the SF bay area. I have NO problems saying that socio-economically Providence is FAR more diverse. Of course, I qualify this by saying SF is so near Palo Alto and much of the rest of the Bay area is very diverse.<br><br>Marketability: S=B, unless you're a hard core engineer, physicist, etc. then S>B. If you're more humanities focused, I strongly believe B>S.<br>I'm always surprised by how many Brown grads are in the SF Bay area living and working, and HAPPY! In addition, I'm amazed by how many go on to do creative jobs that are based around social justice but are also very profitable.<br><br>My advice, go visit BOTH schools, have your daughter spend a night with a student. Also, pull aside students, faculty, locals and ask what their experience is! When I visited all the schools I was accepted at, the choice became very clear.<br><br>Good luck. It's a tough decision! Hope this helps.<br><br>", "<b>Username: undisclosed</b><br><br>C'mon. Stanford is definitely more prestigious than Brown.<br><br>However both are excellent well-renowned institutions however so if you're not going in a domain where international reputation matters all that much, it really shouldn't matter.<br><br>", "<b>Username: mumzy3</b><br><br>I have two D's going to college this fall. My D who is a senior this year will going to Stanford and older D who is on a gap year this year will be going to Brown. Both D's visited and researched both schools and each decided on the schools that best fit them -- socially, academically, and while my younger D thought Stanford's campus was beautiful, my older thought it was too spread out and didn't like the architecture, and fell in love with everything about Brown. So it is best to go visit both schools. Excellent education in both and I would like to think that they are the same prestige-wise! The right thing to do would be to see which is a better fit and where one will be happy for four years.<br><br>RowanMD -- great input! My D who is going to Brown thought Stanford would be better for post-grad<br><br>", "<b>Username: Phead128</b><br><br>Stanford is more prestigious than Brown. Stanford is on par with MIT and Caltech in terms of prestige.<br><br>", "<b>Username: RowanMD</b><br><br>Thanks. I agree with your D's perception that Stanford would be better for post-grad...which is why I came here. :)<br><br>", "<b>Username: Pinderhughes</b><br><br>Excellent post Rowan, and pretty much agree with everything you said. It really does depend on the region of the country as far as comparative prestige is concerned. I went to a New England boarding school. When it came time to apply to colleges, the goal was an Ivy League school, not Stanford. As good as Stanford is, there is a cachet to having an Ivy pedigree in the Northeast that Stanford, as an undergraduate school, really can't match. So, my point still stands. In the Northeast, particularly in New York and New England, Brown is simply more prestigious than Stanford. In California, the opposite is true. It also must be said that European royalty that attend elite secondary schools like Eton, Harrow, Aiglon, or Le Rosey tend to prefer Brown to Stanford, if they elect to come to an American college. With Asian students at these schools, it may be different.<br><br>", "<b>Username: Temeraire</b><br><br>I know the original point of this thread was to discuss which school would be a better fit for the OP, but I just had to point out (the obvious) that Stanford is ridiculously higher in terms of prestige than Brown when it comes to the Asian community. There is no contest. I come from an Asian family and a few vocal relatives are still chiding me for choosing Brown over a few other \"more prestigious\" schools. :rolleyes:<br><br>", "<b>Username: ilovebagels</b><br><br>\"\"Stanford is definitely more prestigious. Its worldwide fame hardly needs remarking here. However, that does not make it a better school.\"\"<br><br>Marsden nailed it!<br><br>", "<b>Username: zfox001</b><br><br>I think a huge difference is the curriculum at both schools. Brown is really into the free/not structured very liberal approach.<br><br>", "<b>Username: kartrider360</b><br><br>Stanford is more prestigious than Brown by far. Other than the states, the rest of the world doesn't even know Brown (let alone it is an ivy league). In Asia, it's 1. Harvard and then 2. UCLA. Yes, it's weird, but basically everyone in Asia knows UCLA.<br>But as mentioned before, it doesn't make S a better school than B.<br><br>", "<b>Username: franglish</b><br><br>Well, to the rest of the world, either America's streets are paved with gold (OK, maybe that's not so true any longer) or paved with self-involved, spoiled people or blood-thirsty thugs. We know none of this is true. Stereotypes abound where there is a lot of information and not much fact. So, it doesn't really matter which school is more famous or prestigious where. The fact of the matter is that these two schools are both wonderful, similar in some ways, very different in others, and may or may not be right for each student. This is just an example of picking nits, and is pretty silly in the long run. Rowan makes the best post, because s/he is comparing the two and giving information that people can actually use. Much more useful, don't you think?<br><br>", "<b>Username: innervisions</b><br><br>I don't think international prestige really has any meaning. If anybody knows anything about undergraduate education, these two institutions are in the top 10-15 in the world, depending on field. Just because some guy in Asia doesn't know what Brown is does not make it less prestigious. Prestige is related to the opinions of academics, employers, educators, grad schools, etc., and it's difficult to make a case that either is overall more prestigious.<br><br>Stanford is a huge name, but it might not be so if there were more top schools on the west coast.<br><br>", "<b>Username: mumzy3</b><br><br>That is very true indeed!<br><br>", "<b>Username: Strawboy</b><br><br>Stop being so ambitious. Dang.<br><br>", "<b>Username: tonyspizza1800</b><br><br>Brown and Stanford are pretty comparable in terms of prestige. I don't think you can really argue that Stanford is \"more prestigious by far\" at all. Definitely let your daughter visit both schools before making a decision. Good luck!<br><br>", "<b>Username: Strawboy</b><br><br>....Come. on.<br><br>", "<b>Username: Avian Maid</b><br><br>Stanford>Brown. I cannot think of a single area (academics) where Brown is better than Stanford<br><br>", "<b>Username: alfredeneuman</b><br><br>Neuroscience? I'm a junior, and I\"m looking at both brown and stanford. Brown has a definite neuro department with a neuro concentration and even a cog neuro concentration too. I think they were the first undergraduate school in the country to offer it. Stanford has it, but it's a combination of bio and psych. their grad programs definitely have neuro, but for undergrad, they don't. (This is all from the research I've done on both schools).<br><br>I won't make a definitive comment on Stanford and Brown's prestige, because they are both fine schools, but stanford overall is larger, has more grad programs, etc, so in terms of the absolute value of research and activity, there's just more going on at Stanford.<br><br>", "<b>Username: ClaySoul</b><br><br>art, for one, and the above mentioned neuro disciplines, also applied math, egyptology, history of math, gender and sexuality studies, south asian studies, middle eastern studies, american civilization...<br><br>but all i've really done is given you a list of programs that brown has that stanford doesn't (and correct me if I'm wrong). look, once you're talking about school the caliber of brown and stanford, it is highly dubious to claim that, for example stanford's english is better than brown's. it's much more an issue of of fit than so-called quality of academics. additionally, there's a considerable amount going on here, it's just geared towards us undergraduates and so it's not quantified in the same way as grad research, which is ultimately useless to you unless you can a. learn from it in a productive way, or b. are a grad student. I can tell you that when I was at Tulane, which has a much larger though probably less prestigious in most areas, grad program than Brown, I certainly garnered absolutely nothing from the grad department, except annoyance from grad TA's who didn't give a crap.<br><br>As an art student, however, and having done research into this issue, I will say that Brown's art department is better than Stanford's, with a greater breadth of courses, resources, RISD, and a focus on art and not simply art as an integrative tool for the rest of your education. And other schools have better art programs than Brown. I happen to like it very much, some don't.<br><br>but stanford sure has us beat on sun. $hit.<br><br>", "<b>Username: gqunit</b><br><br>the answer's pretty straightforward...<br><br>if you are doing anything even remotely tech related = Stanford. All other majors, you cannot go wrong with either; at this point it becomes matter of personal preference on location, weather, etc.<br><br>Keep in mind though, Stanford's \"traditional\" art programs ... suck. New media art programs are top-notch, however. (i am minoring in art with a focus on digital art).<br><br>And people, prestige should literally be the last thing to consider, especially when we are comparing two top-tier schools.<br><br>", "<b>Username: GoingToSpaceBRB</b><br><br>From RowanMD<br>\"\"<br>My Bias:<br><br>Accepted: Brown, Princeton, Cornell, Colgate, UVA, Middlefield and a bunch of Canadian schools (I'm from Toronto)<br>Denied: Harvard<br>Didn't apply: Rest of the Ivies, Any West Coast schools.<br><br>Looked for a prestigious liberal arts school with balanced athletics (swam for Brown) and a great education with renowned TEACHERS, and strong sciences department.<br><br>I went to Brown for undergrad, now finishing my medical residency at Stanford so I have intimate knowledge of both schools. I graduated Brown with my eyes opened to different ways of learning, and a desire to re-evaluate the status quo whenever possible.<br><br>My personal interests lie with the disgrace of socio-economic inequity, and a strong desire to make the world a better place. Call me an idealist...but I'm not. I am a realist who would rather methodically pick my battles and thus affect lasting change.<br><br>I went into Family Medicine and now Sports Medicine with a desire to treat the whole being, and to be able to reach out to anyone in any country, of any socioeconomic class. I love my field, and the direction I am heading and have to thank BOTH schools for getting me here.<br><br>My thoughts:<br><br>1) Prestige perceptions:<br>East Coast- B>S<br>West Coast- S>B<br>Heartland- S=B<br>Internationally- S=B (btw, there were an insane amount of international royalty at Brown, something I didn't expect before going)<br><br>2) Atmosphere:<br>Stanford- Much larger feel, less personal, less of a nest, growing atmosphere, more of a feeling that you're part of a giant machine or empire. Definitely more preppy. I get the sense that while Stanford is a laid back and fun place to be, it's also a bit more conservative overall. I love California so in terms of climate, Stanford>>>Brown.<br><br>Brown- Progressive, nourishing, eye-opening, UNDERGRADUATE FOCUSED. It's open curriculum is structured to encourage learning HOW to think so it fosters an edgy, questioning student body. I loved it, though it may be a turn off to a more stuck in the mud type of student. It is historically the most progressive school within the Ivies and that feeling was appreciated by myself and most of my friends.<br><br>3) Curriculum:<br>Stanford: Extremely strong in Engineering, physics, High tech and super-specialized sciences<br><br>Brown: Extremely strong in life sciences (including medical sciences), History, Art, and especially International Relations. There seems to be a funnel from Brown to the U.N. I personally know three people IN MY CLASS ALONE who are now working in rewarding careers there. Many go on to prestigious IR graduate schools like Fletcher (Tufts), Woodrow Wilson (Princeton), Stanford, JFK (Harvard), and Columbia before going on to the UN.<br><br>Brown has an open curriculum. For those that are not sure what they want to do or for those that have a great curiosity for all that there is to know in this world in many fields outside of a major interest, Brown is the better place...period.<br><br>Ex. My wife, also from Brown took classes from around 16 departments, and had to decide on a major between Education, Music, International Relations and a couple others I don't remember. While it worked out for her (creative, international career as a video/documentary producer) it can be daunting to those that can't deal with choice.<br><br>(BTW, I double majored (call concentrations at Brown) in Biology and Geology-Biology, with a neuroscience honors thesis.)<br><br>Qualifier: Both are tremendously strong in MANY departments. I argue that an undergraduate education is best taught by TEACHERS and not by \"top of their field professors\" who are more interested in their research, careers, and GRADUATE level teaching than teaching undergrads. Both schools have their fair of both types so research the departments and classes well before committing!<br><br>Quality of Life:<br>I can't say much about Stanford's undergrad but my memories at Brown are filled with nothing but warm and fuzzies... It's consistently ranked top 5-10 for quality of life and student happiness. Providence, RI is a great place to grow into yourself intellectually as it's a progressive, multicultural and diverse socio-economic city but feels like a large friendly town, and is very student friendly. It's a short drive or train ride to Boston and New York (visited both numerous times in undergrad)<br><br>Stanford is in Palo Alto, one of the richest neighborhoods in the SF bay area. I have NO problems saying that socio-economically Providence is FAR more diverse. Of course, I qualify this by saying SF is so near Palo Alto and much of the rest of the Bay area is very diverse.<br><br>Marketability: S=B, unless you're a hard core engineer, physicist, etc. then S>B. If you're more humanities focused, I strongly believe B>S.<br>I'm always surprised by how many Brown grads are in the SF Bay area living and working, and HAPPY! In addition, I'm amazed by how many go on to do creative jobs that are based around social justice but are also very profitable.<br><br>My advice, go visit BOTH schools, have your daughter spend a night with a student. Also, pull aside students, faculty, locals and ask what their experience is! When I visited all the schools I was accepted at, the choice became very clear.<br><br>Good luck. It's a tough decision! Hope this helps.<br>\"\"<br><br>This.<br><br>", "<b>Username: AdOfficer</b><br><br>Rowan, great post. When did you graduate? I think I might know you...<br><br>I would second a lot of what Rowan has said. I attended Brown for my UNDERGRADUATE education and learned not only how to think about different things in different ways, but also how to see the connections between different disciplines - truly, Brown offers a tradition yet unparalleled liberal arts education. I also learned WHY seeing how different disciplines are related is important and how to write well - both extremely valuable in the \"real\" world.<br><br>The \"community\" at Brown is a special one - it is open and accepting of differences, yet different groups still actively engage one another in a variety of dialogues, both inside and outside of the classroom. Although it has a reputation for being uber-liberal, in truth, it is much closer to the middle of the road than some students there care to admit (IMHO). I was personally challenged by the socio-economics of the place - there were MANY very wealthy kids at Brown and coming from a pretty modest place in life, this was at first tough to deal with. However, Brown has been aggressive in attracting a far more diverse student population in the past 10 years and friends I have who work there report that there is more and more diversity on campus. My sense from friends working in admissions and development there is that legacies and development cases also don't get nearly as much consideration for these relationships in the admissions process than they do at other schools.<br><br>I saved a mega-research university (Harvard) for graduate school, and I'm glad I did. I wouldn't change my time at Harvard for anything, but for me, personally, the focus on the undergraduate at Brown really blew Harvard away, despite Harvard's graduate prowess. I ultimately chose Brown over H, P, S, and some other schools for undergrad because I didn't want to be in huge classes and taught by teaching assistants; I also wanted to explore a variety of disciplines and meet people different from myself. Brown was the perfect choice for me.<br><br>In terms of prestige, I think the argument is moot. Stanford DOES NOT have the cache that Brown does on the East Coast or in Europe and the Middle East. Stanford is clearly the bomb on the West Coast and in Asia. However, they are both OUTSTANDING institutions and the students who attend either are extremely privileged to be at them. I personally feel that Brown did an exceptional job in preparing me for graduate school and opening me up to the idea that service to others is an ideal we should all value. It is a special place in this respect. Stanford, on the other had, is in California (and, seriously, the winters in Providence can be brutal) and has a more preprofessionally-focused student body that provides an excellent network post-grad (as does Brown, but I don't think Brownies are going into law, business, and other \"professional areas\" at the same rate as Cardinals - there are a lot of Brownies in teaching and education, non-profits, film and tv, and creative professions). Regardless, they are both amazing places and, as I tell all prospective students I meet, the academic and social fit of a place is ultimately way more important than prestige, especially when you are looking at places of this caliber. I still get crap from friends and family for turning down H, P, and S for college, but ultimately, I know that I made the right choice for myself.<br><br>ClaySoul - glad you are liking the art department at Brown...are you majoring in art? This was the one department at Brown that I felt was difficult to get classes in if you weren't a major or senior.<br><br>", "<b>Username: RowanMD</b><br><br>Great post AdOfficer. I completely agree.<br><br>Bottom line from my personal experience- Everyone asks about Brown on every job interview. It's made me very marketable and I believe has gotten me in the door for each interview. My interviewers have all mentioned that Brown grads they have encountered are free-thinking creators that push boundaries and thus are great for think-tanks, research, etc.<br><br>One thing to add. Brown is now need-blind. The multicultural student body is now extremely socio-economically diverse as well. I bet it's even more of an awesome, dynamic place to be now!<br><br>BTW, going back for my 10 year reunion this May!<br><br>", "<b>Username: pineapple324</b><br><br>I'm from the West Coast and from what I can tell, people here put Stanford on level with Princeton and MIT so as far as prestige goes, Brown can't even compare. Probably cuz I live in the Silicon Valley and for a lot of people, anything that isn't related to engineering and comp sci (and maybe medicine or business) a waste of time.<br><br>However, I don't think Stanford is too big on the humanities. Like I said earlier, a lot of people here don't think too highly of subjects such as history and English. So if you're not into science-y stuff, go to Brown.<br><br>", "<b>Username: wolfmanjack</b><br><br>^ This thread is from 2006. The OP must be graduating from wherever soon.<br><br>", "<b>Username: Lobzz</b><br><br>This thread is really old. But anyway....<br><br>I hate how people tend to take \"prestige\" into consideration even when the schools are clearly on an equal level. Stanford is not better than Brown; Brown is not better than Stanford. That said, some may prefer either school. Also, one cannot go wrong when one is choosing between the two....<br><br>but....<br><br>Brown is know to give lots of attention to its undergrads... I would pick Brown over Stanford any day.<br><br>", "<b>Username: iamtbh</b><br><br>\"\"Prestige perceptions:<br>East Coast- B>S<br>West Coast- S>B<br>Heartland- S=B<br>Internationally- S=B\"\"<br><br><br>Given that this is the Brown forum, some Brownian bias should obviously be expected. But this is borderline delusional. Most people (Americans and especially internationals) have never heard of Brown, let alone think that it is prestigious.<br><br><br>Hate to burst your Brownian bubble, but this is the reality:<br><br><br>East Coast- S>B<br>West Coast- S>>>B<br>Heartland- S>>B<br>Internationally- S>>>>B<br><br><br>Of course, while prestige may be a primary consideration for college selection, it is not the only one. So <b>1 out of 4</b> Stanford-Brown cross-admits do choose Brown:<br><br><a href=\"http://www.nytimes.com/imagepages/2006/09/17/weekinreview/20060917_LEONHARDT_CHART.html\" rel=\"nofollow\">The New York Times > Week in Review > Image > Collegiate Matchups: Predicting Student Choices</a><br><br>But they're doing so not because of, but despite prestige.<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/AdOfficer\">AdOfficer</a> wrote:\"\"<br><br><br>Says the <b>Brown</b> admissions officer/college rep!<br><br>\"\"<a rel=\"nofollow\" href=\"/profile/AdOfficer\">AdOfficer</a> wrote:\"\"<br><br><br>This would be a very strange and curious reaction indeed if Brown were really as prestigious as H, P and S.<br><br>", "<b>Username: lapras</b><br><br>iamtbh,<br><br>you talk about the difference in prestige as though Brown is a complete ****hole. Yes, I would say that Stanford is the more prestigious, but when it comes down to it, between the two, I would definitely choose Brown. That decision has a lot to do with the program I'm interested in (along with other reasons), but I also love Brown. And this is coming from a Stanford legacy.<br><br>At the end of the day, if attending Brown over Stanford is going to keep me from getting a job in the future, then I'll be damned, but this entire argument is just splitting hairs.<br><br>", "<b>Username: longrohnsilver</b><br><br>Stanford is a great west coast school but no matter what, it will never have the cache of being an Ivy League School.<br><br>In my opinion, most of the people in America think of Stanford as the Tiger Woods-John Elway sports school that never quite gets to great and they think of Brown as an Ivy League school. No matter what kind of spin you put on Stanford, it is not seen the same way any of the Ivy League schools is seen.<br><br>Brown=Ivy League=wow.<br>Stanford=school that loses to Cal or UCLA or USC in (pick your sport)=yawn<br><br>", "<b>Username: ella93</b><br><br>^ Stanford is equally well known as the Ivy Leagues, infact not-so-smart people out of the US think that Stanford is an Ivy (then one day they find out that Ivy League=eight west coast schools, and that Stanford is in Cali).<br>But generally in rankings Stanford is higher up and it is better for science-y typed people, whereas Brown is very liberal and creative and for people who are not so sure of what they'd like to major in.<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/longrohnsilver\">longrohnsilver</a> wrote:\"\"<br><br><br>You're partially right. I am fairly certain that Stanford doesn't want to be seen the same way as Brown and Cornell are seen (which is not very much at all):<br><br>\"\"All in all, what would you say is the best college or university in the United States? (open-ended responses)<br><br>Best/<br>Second Best<br><br>%<br><br><b>Harvard University<br>24<br><br>Stanford University<br>11<br><br>Yale University<br>11</b><br><br><br>Massachusetts Institute of Technology (MIT)<br>6<br><br>University of California at Berkeley<br>4<br><br>Notre Dame University<br>4<br><br>Princeton University<br>4<br><br>University of Michigan<br>3<br><br>Duke University<br>3<br><br>University of California at Los Angeles (UCLA)<br>3<br><br>University of Texas<br>2<br><br>Texas A&amp;M University<br>2<br><br>Ohio State University<br>2<br><br>University of North Carolina<br>2<br><br>Penn State University<br>2<br><br>University of Pennsylvania (Penn)<br>2<br><br>University of Minnesota<br>1<br><br><b>Brown University<br>1<br>Cornell University<br>1 </b>\"\"<br><br><a href=\"http://www.gallup.com/poll/9109/harvard-number-one-university-eyes-public.aspx\" rel=\"nofollow\">Harvard Number One University in Eyes of Public</a><br><br><br>It's truly unfortunate that Stanford isn't seen the same way as Harvard and Yale. Oh, wait...<br><br>", "<b>Username: modestmelody</b><br><br>A lot of weird things said in this thread, a lot of unnecessary defense from both sides.<br><br>FWIW, AdOfficer is not an adcom at or for Brown but is a Brown alum.<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/longrohnsilver\">longrohnsilver</a> wrote:\"\"<br><br><br>Let me help longrohnsilver explain what he means. Here is a typical conversation at longrohnsilver's Annual Family Reunion:<br><br><br>Random Relative of (longrohnsilver) - So, longrohnsilver, where are you going to school these days?<br><br>longrohnsilver - BROWN<br><br>RR - *silence*<br><br>l - It's in the IVY LEAGUE!!!<br><br>RR - *silence*<br><br>l - Hello? It's kinda like Harvard and Yale??<br><br>RR - wow?<br><br>", "<b>Username: wolfmanjack</b><br><br>^What a joke this guy is.<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/modestmelody\">modestmelody</a> wrote:\"\"<br><br><br>Well, that certainly clears up his or her \"objectivity\"! It seems as if other Brown alums are equally \"objective.\"<br><br>", "<b>Username: modestmelody</b><br><br>It seems as though a lot of people in these threads come out of the wood works to say dumb things. :shrugs: Most of the people saying dumb things in these threads were either not Brown alums or students who had just gotten into Brown and hadn't really even stepped foot here (check some of the post dates).<br><br>Anyway, I was just clearing up that mistake because people get nervous/stupid when they think an AdOfficer from a school is posting. While Brown does have officers who are aware of this page, they don't have anyone posting.<br><br>", "<b>Username: Arzachel</b><br><br>Overall Stanford is the \"better\" school, but there are still tons of reasons to choose Brown over Stanford so why does it even matter?<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/modestmelody\">modestmelody</a> wrote:\"\"<br><br><br>I thought you said that AdOfficer is a Brown alum.<br><br>", "<b>Username: wolfmanjack</b><br><br>LOL^ (10char)<br><br>", "<b>Username: modestmelody</b><br><br>AdOfficer wrote a bunch of stuff about why he/she loved Brown and what made Brown unique, said that the Ivies have a lot of cachet in some areas internationally versus Standford in other areas, and then did a lot of equivocating otherwise. Most of what was said was, \"Brown was great for me because of these things that are not like what you'll find at Stanford,\" not, \"Stanford is not as good or prestigious as Brown and Brown is better for everyone because of these things,\" etc etc.<br><br>If you think that's saying dumb things then you don't know jack.<br><br>", "<b>Username: trf1021</b><br><br>Well, Stanford rejected me yesterday, so BROWN! :)<br><br>(I would have chosen Brown anyway)<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/modestmelody\">modestmelody</a> wrote:\"\"<br><br><br>Who's \"jack\"? Is that AdOfficer's real name or something? But seriously, I am willing to give him a pass. However, I am not so forgiving of these other Brownian \"geniuses\":<br><br>\"\"<a rel=\"nofollow\" href=\"/profile/mensa160\">mensa160</a> wrote:\"\"<br><br><br>Yes, spelling ability is not positively correlated with intelligence. But, mensa boy, you should at least be able to spell the name of the school for which you are ****. If you're trying to suggest that your IQ is 160, who do you think you're fooling?<br><br>\"\"<a rel=\"nofollow\" href=\"/profile/Pinderhughes\">Pinderhughes</a> wrote:\"\"<br><br><br>Okay, whiz kid, please explain why Stanford has a greater Wall Street presence than Brown, despite being 3,000 miles away as well as having equivalent, if not better options in Silicon Valley?<br><br>\"\"<a rel=\"nofollow\" href=\"/profile/RowanMD\">RowanMD</a> wrote:\"\"<br><br><br>Some medical doctors seem to have \"God complexes.\" This may be why a former double-major in Biology and Geology-Biology (with a neuroscience honors thesis) feels qualified to speak about things (i.e. the humanities offerings at Stanford vs. Brown) of which they are ignorant. Hate to break it to you, doc, but your \"strong beliefs\" are proven false once again.<br><br><br>English: Stanford #2 > Brown #13<br>History: Stanford #1 > Brown #17<br><br><br><url>http://www.stat.tamu.edu/~jnewton/nrc_rankings/nrc41indiv.html</url><br><br>", "<b>Username: modestmelody</b><br><br>Mensa is not a Brown student. PH said a lot of stuff that doesn't make sense about Brown in that time period, but I think he hadn't even been here yet at the time.<br><br><br>Graduate rankings have very little relation to undergrad. I have no idea about Stanford's offerings in humanities for undegrads or grads but that's not remotely good evidence in either directions.<br><br>", "<b>Username: wolfmanjack</b><br><br>Sounds like someone has some angst they've been wanting to release anonymously on an internet forum. Also, none of us really want to bother arguing with you because your arguments are uneducated. You have no idea that what you're spewing is worthless AND you have an attitude about it. Nice combo.<br><br>", "<b>Username: Endicott</b><br><br>As an East Coaster, I would also say that Stanford is more prestigious than Brown. A lot of people don't even know that Brown is an Ivy League school.<br><br>", "<b>Username: chsowlflax17</b><br><br>Personal point of view: My friend is going to Stanford, but was rejected from Brown. I was the opposite. The reactions when we told people where we were going was almost exactly the same, with the added responses of \"Oh, California, you'll have great weather\" versus \"New England, huh? That's so far away.\" In terms of getting a job/going to grad school, how you perform and what opportunities you pursue is a better determinant of where you'll be than \"prestige.\" Both schools offer amazing opportunities, but in a different manner. For the vast majority of people, it doesn't matter if you're going to Stanford vs. Brown vs. Columbia vs. Yale vs. MIT, etc., because people realize if you're going to any of these schools, you're a top-notch student.<br><br>", "<b>Username: arcadefire1027</b><br><br>From my experience on the west coast: no one has heard of Brown, but everyone has heard of and respects Stanford.<br><br>I'd prefer Brown.<br><br>", "<b>Username: longrohnsilver</b><br><br>Wow! Sorry to have offended you, iambth. I guess I hit a raw nerve or something when I suggested that Americans see Stanford as a sports school out west and the Ivy League as more impressive. I liked your statistics. They were helpful. You even highlighted the important parts for us!<br><br>You're smart! And funny, too.<br><br>I learned my lesson when you wrote about my family get-together!<br><br>I wish I were as cool as you and everyone else on the west coast.<br><br>Anyway, Cal beat Stanford in football again this year.<br><br>I bet Stanford could beat Brown in a football game. so, at least you got that going for you!<br><br>", "<b>Username: warblersrule</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/Arzachel\">Arzachel</a> wrote:\"\"<br>That sums things up quite nicely.<br><br>The vast majority of cross-admits are going to pick Stanford over Brown. Of the roughly 30% of admits who turn down Stanford, only 1% select Brown. Put a different way, Brown gets only 6 or 7 Stanford admits a year. In stark contrast, Harvard gets about 180.<br><br>As was stated earlier, Stanford takes the lead in most academic disciplines, except a few of the humanities (e.g. classics and religious studies). Indeed, pound for pound, it's arguably the strongest of any American university except Berkeley.<br><br>In terms of graduate placement, Stanford regularly exceeds Brown. Despite having an excellent law school of its own and the vaunted \"undergraduate focus\" of Brown, it places nearly twice as many students at Harvard and Yale Law as Brown. This carries over to award production, where Stanford blows Brown out of the water for nearly every postgraduate award except the Fulbright, where Stanford has only a moderate edge. It must be noted that this may be less of a case of something magical done by Stanford and more a testament to the strength of its student body.<br><br>I would also give the edge to Stanford in campus beauty and weather. Brown's campus is tiny and cramped, and the differences in weather are self-evident. Stanford also has an extreme edge in the balancing of academics and athletics, though Brown students are typically not overly concerned with rah-rah athletics. I prefer Brown's location, however, as I prefer Providence-Boston to Palo Alto.<br><br><br><br>All of that aside, Brown is a great school. An ambitious student graduating from Brown won't have ANY doors closed to him/her, and it's not exactly chopped liver when it comes to academics. There are, as Arzachel noted, reasons to select Brown over Stanford. The PLME program is a draw, and the location attracts others. The open curriculum is undoubtedly Brown's biggest advantage over its competitors, and the A/B/C/NC grading system is quite nice. One would not be insane for selecting Brown over Stanford.<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/longrohnsilver\">longrohnsilver</a> wrote:\"\"<br><br><br>No offense taken, but don't you get tired of riding the coattails of HYP?<br><br>\"\"<a rel=\"nofollow\" href=\"/profile/longrohnsilver\">longrohnsilver</a> wrote:\"\"<br><br><br>Not to mention, good looking!<br><br>\"\"<a rel=\"nofollow\" href=\"/profile/longrohnsilver\">longrohnsilver</a> wrote:\"\"<br><br><br>I taught you well.<br><br>\"\"<a rel=\"nofollow\" href=\"/profile/longrohnsilver\">longrohnsilver</a> wrote:\"\"<br><br><br>You can always wish.<br><br>\"\"<a rel=\"nofollow\" href=\"/profile/longrohnsilver\">longrohnsilver</a> wrote:\"\"<br><br><br>So Brown has a football team, huh? Who do you play? RISD??<br><br>", "<b>Username: tstong</b><br><br>Lol you guys went to these colleges? I would've thought that they weeded out all the immature pricks during interviews...<br><br>", "<b>Username: iamtbh</b><br><br>We can't all be as mature or non-judgmental as you. But we do know how to mind our own business.<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/wolfmanjack\">wolfmanjack</a> wrote:\"\"<br><br><br>Don't be too hard on yourself.<br><br>", "<b>Username: modestmelody</b><br><br>Wow we're getting **** hard.<br><br>", "<b>Username: wolfmanjack</b><br><br>not even well. at least **** of the past had something to argue.<br><br>", "<b>Username: toxic93</b><br><br>Brown has way more prestige than Stanford. Brown is an Ivy League, once people hear that they go wow. Stanford is a great school and its on my list of colleges that I want to go to. In fact I herd of Stanford when I went college hunting, I never knew it existed till a few weeks ago. I knew of Brown since I was a kid, where I live (East Coast) Brown is really up there with Harvard and Yale.<br><br><br>But you have to remember Brown is a more Liberal Arts college, that broadens your mind of your surrounding. And Stanford is more of a Science college. Hands down both are excellent colleges.<br><br>", "<b>Username: oreolover</b><br><br>Hands down Stanford is a better school, and if you were lucky enough to be accepted to both, I would pick Stanford, as would 75% of others (<a href=\"http://www.nytimes.com/imagepages/2006/09/17/weekinreview/20060917_LEONHARDT_CHART.html\" rel=\"nofollow\">The New York Times > Week in Review > Image > Collegiate Matchups: Predicting Student Choices</a>)<br>That being said, it is a matter of personality and Brown seems more relaxed and liberal so if you have the opportunity to visit, see which one you like best, and if not, do as much research as possible on the types of students, teaching style etc.<br><br>", "<b>Username: wolfmanjack</b><br><br>oreo that data has been debated endlessly on this forum<br><br>", "<b>Username: warblersrule</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/toxic93\">toxic93</a> wrote:\"\"<br>The Northeast isn't the world (granted, I know this realization can be shocking to some). Go down to the South, and 9/10 haven't heard of Brown but at least vaguely know of Stanford as a good school.<br>\"\"<a rel=\"nofollow\" href=\"/profile/toxic93\">toxic93</a> wrote:\"\"<br>31% of Brown students major in math/science. 35% of Stanford students do. Not exactly a huge difference. Well, at least in the number of students (the quality of resources and instruction may obviously vary). It may also be a surprise for you to find out that the sciences are liberal arts fields and can broaden your mind.<br><br>By all means, however, don't let the facts stop you.<br><br>", "<b>Username: justastudent10</b><br><br>I was recently admitted to a bunch of schools, of which I have managed to narrow down my list to Brown vs Stanford.<br>I'm a humanities person, but really don't know what I want to major in. In terms of prestige, I don't really care. I'd be proud to go to either of them. I was attracted to them for similar reasons, but never worried that I would get into both. I like the liberal and laid back feel of both of the campuses. My biggest concern is basically where I would be the happiest.<br>Can anyone tell me how they compare regarding the type of students that attend? Stress levels? Size of classes? Community service?<br>Thanks.<br><br>", "<b>Username: dirtychucks</b><br><br>Im in the EXACT same situation as the person above. Haha, small world.<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/oreolover\">oreolover</a> wrote:\"\"<br>\"\"<a rel=\"nofollow\" href=\"/profile/wolfmanjack\">wolfmanjack</a> wrote:\"\"<br><br><br>Don't you get it, oreolover? The Brownians only endlessly debate the \"Collegiate Matchups\" when it's a school (e.g. some other non-HYP ivy) against which Brown wins cross-admits. When it's one of HYPSM, they (wisely) keep their mouths shut.<br><br>", "<b>Username: lapras</b><br><br>why does this matter so much? the original poster obviously made their choice; the thread is from 2006...<br><br>", "<b>Username: iamtbh</b><br><br>A Brown undergraduate alum revived this thread (nearly ten years after her college graduation):<br><br>\"\"<a rel=\"nofollow\" href=\"/profile/RowanMD\">RowanMD</a> wrote:\"\"<br><br>", "<b>Username: Jagvillintevara</b><br><br>Okay. I'm in the same situation as justastudent10. I'm between Brown, Stanford, and Duke, and am a humanities person. Though I'd like to say I'm not concerned about prestige...it is kind of swaying my decision. Is Stanford really THAT much above Brown? Aren't they at least very similar in standing. I know that many of these ranking websites are pretty skewed.<br><br>", "<b>Username: RoyalFlush</b><br><br>Please don't make the mistake of letting infinitesimal differences in \"prestige\" have any weighing on your decision process. It may seem important now to nitpick differing public opinions on prestige, but when the school year starts, do you really think it will have any bearing on your overall happiness? When you graduate, do you really think you may be more respected by an employer because a college is better known in Asia? When it comes down to it, you have the very comforting predicament of choosing between two great schools where although a high level of education is guaranteed, your compatibility with the student body and overall happiness as a student is not.<br><br>", "<b>Username: justastudent10</b><br><br>I really agree with the last post. It'd be a lot easier to just guide myself by \"prestige\", but there is not a general consensus, and I know that that is not what matters to me the most. So, anyone out there have any input on the two schools beyond the name? How do they differ?<br><br>", "<b>Username: chsowlflax17</b><br><br>The obvious:<br><br>Stanford: quarter system, large graduate program, in northern California, IHUM/core requirements<br><br>Brown: semesters, small graduate program, in New England, and open curriculum<br><br>So, how does that all play out? I currently have two friends at Stanford, and they love it. If you get into interesting IHUM classes, it seems like they're a fun time. However, it also seems like the students are more competitive at Stanford, and grades are more important (i.e. people seem to compete more against each other for them. At Brown they're important, but you don't feel like you're competing with others to get them). If you like weather to be relatively the same year-round, Stanford is nice. However, becoming a TA at Stanford seems to be a good deal more difficult than at Brown (example of difference in graduate enrollment), but research opportunities at both schools abound. Brown could definitely be considered a more hipster school, where people tend to be more laid back, and at the same time Brown seems to require more independence than Stanford: you're responsible for every choice you make, from housing to classes. Eg: Brown's housing lottery is crazy. You join with a group of anywhere from 1-12 students. Your group gets a number, and then on the day of the pick you have (I believe) 30 seconds for your group to make a decision (with a display showing what housing is still available). Stanford, on the other hand, you go into a lottery with a group of friends, and you list out your top choices. However, everyone is given an individual number, and if you have a good enough number, where you'd get better housing than your group, you can check a box saying you'd like to be put in the better housing, rather than stay with your friends. Stanford's system relies a lot more on a computer, whereas Brown's system, besides the number you get, your group has complete control over what housing you choose.<br><br>That said, they're both great schools, and it really depends on the type of person you are in which school will be better for you.<br><br>", "<b>Username: Jagvillintevara</b><br><br>Oooh that lottery sounds hectic. I see that you attend Brown...What are you majoring in? What do you think of the school? What schools were you considering when you had to decide between colleges? Sorry...quite a few questions in a row.<br><br>", "<b>Username: disgradius</b><br><br>Not to bash on Brown, but Stanford is pretty much universally more prestigious. There's a reason people say HYPS(M if we include non liberal arts). That said, fit is a big issue so consider carefully!<br><br>Whoever said something about northeast elites thinking Brown is more prestigious is BSing. Recruiting wise, Stanford wins hands down.<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/disgradius\">disgradius</a> wrote:\"\"<br><br><br>These Brownians are full of BS. (I am starting to think the B in BS is for Brown.) Check out this bold-faced lie (from another thread):<br>\"\"<a rel=\"nofollow\" href=\"/profile/Sungchul\">Sungchul</a> wrote:\"\"<br><br><br>Here is the real data:<br><br><a href=\"http://www.brown.edu/Administration/Dean_of_the_College/hco/data/\" rel=\"nofollow\">Medical Admission Data Snapshot</a><br><br><br>The TRUTH is that Brown has a 81% (&lt;70%) acceptance rate for pre-med students (undergrad alums) in regard to ANY choice.<br><br>", "<b>Username: modestmelody</b><br><br>Some of these students are working on older numbers. 5 years ago when we had a lot fewer premed students, the number that applied to medical school straight out of college hit that number.<br><br>Separate from that, your 70% number is a complete misreading of that link.<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/modestmelody\">modestmelody</a> wrote:\"\"<br><br><br>Can you provide a source for this? I don't believe that the med school applicant pool can increase (and the acceptance rate decline) that much in a 5-year period. Even if true (which I doubt), this Brownian used the PRESENT tense:<br><br>\"\"<a rel=\"nofollow\" href=\"/profile/Sungchul\">Sungchul</a> wrote:\"\"<br><br>", "<b>Username: modestmelody</b><br><br>I don't have the stat because it's an old one. I know what they put out from admissions when I applied 5 years ago and that was the number and I've also watched that number change over time.<br><br>Do you have any purpose on this site other than being a royal pain ass?<br><br>", "<b>Username: iamtbh</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/modestmelody\">modestmelody</a> wrote:\"\"<br><br><br>Of course, you don't.<br><br>", "<b>Username: modestmelody</b><br><br>Sorry-- information on the internet doesn't always stay there for five years, nor does personal communication at info sessions come with a crib sheet complete with references.<br><br>", "<b>Username: justastudent10</b><br><br>Where would I find smaller and more personalized classes?<br><br>Would professors at Stanford be interested in the teaching or would a lot of them just be concerned with their own research?<br><br>Where do students have more time to work on non-academic activities (be it community service or just hanging out)?<br><br>", "<b>Username: lapras</b><br><br>have you even visited yet? that would be a good start. I know it's hard because both school's are on opposite coasts, but there's only so much that online opinions can help<br><br>", "<b>Username: justastudent10</b><br><br>I did visit but a while ago... I can't really go back because I don't even live in the US<br><br>", "<b>Username: eating food</b><br><br>\"\"Where would I find smaller and more personalized classes?<br><br>Would professors at Stanford be interested in the teaching or would a lot of them just be concerned with their own research?<br><br>Where do students have more time to work on non-academic activities (be it community service or just hanging out)?\"\"<br><br>I think one thing that I've learned since coming to college is that all of these questions are pretty much irrelevant.<br><br>At any ivy/ivy-caliber school you'll be able to find professors concerned with teaching and professors not so concerned with it. At every school, you'll be able to find large classes and small, personal classes (this also depends on what you major in, typically humanities majors benefit from seminar style learning a bit more quickly than quantitative majors). Finally, you can generally make your course load as challenging or as easy as you want. You will also learn upon reaching college that you may not care about doing homework (this revelation may surprise you at first, but this lackadaisical mentality is actually quite common on ivy campuses).<br><br>Ultimately what it comes down to is which school has clubs you're most interested in. Which school has a campus that you find unconditionally beautiful, even on the nasty ugly days. Which school could you see making your <i>home</i> for the next four years. And be honest with yourself. There are tons of people I know at Stanford, Harvard, and even here at Yale who chose where they are based on the name or irrelevant questions like your own and are very unhappy with their decision.<br><br>I advise you visit, analyze your feelings, and go from there :).<br><br>", "<b>Username: justastudent10</b><br><br>Thanks, that's really helpful!<br><br>", "<b>Username: ilovebagels</b><br><br>\"\"stanford is not more prestigous than Brown\"\"<br><br>the hell it isn't.<br><br>", "<b>Username: chsowlflax17</b><br><br>Sorry, this is pointless. Brown is far more prestigious than my state school: however, if someone got into both, but lacked the independent drive to make use of Brown's open curriculum and self-driven atmosphere, I'd recommend they stay at home. It truly is a matter of where you'll most thrive, especially as any difference in prestige is relatively small (both have low acceptance rates, both have well-renowned fields, both have great grad-school placement, etc.)<br><br>", "<b>Username: twitter23</b><br><br>\"The Northeast isn't the world (granted, I know this realization can be shocking to some). Go down to the South, and 9/10 haven't heard of Brown but at least vaguely know of Stanford as a good school.\"<br><br>I find it hilarious that you are honestly calling Brown \"BS\" JUST because more people have heard of Stanford.<br><br>Both of these schools are brilliant. They wouldn't be continuously ranked at the top if they weren't.<br><br>WHO CARES if more people \"heard\" of Stanford or Brown?<br><br>It depends on where one is situated in the world.<br><br>Anyways, I would go to either school based on the preferred way I like to learn, the academics, the local atmosphere...not prestige. They've both obviously got those.<br><br>", "<b>Username: datalook</b><br><br>National academy of science membership:<br>Stanford (134 members),<br>Brown (10 members)<br><br>National Academy of Engineering:<br>Stanford (92)<br>Brown (4)<br><br>", "<b>Username: honestly</b><br><br>wow, very helpful . thank you :) RowanMD<br><br>", "<b>Username: datalook</b><br><br>membership at Institute of Medicine:<br>Stanford (60 members), Brown (3)<br><br>winners of USA presidential national medal of science:<br>Stanford (34 winners), Brown (1 winner)<br><br>", "<b>Username: RowanMD</b><br><br>@honestly, no problem. It's a big decision, both are great schools with vastly different feel. I loved my time at both schools.<br><br>Undergrad is a time to open your mind, and expose yourself to open ended learning where YOU can make your own opinions while still relatively unaffected by adult dogma and responsibility.<br><br><a href=\"http://www.boston.com/news/local/breaking_news/2010/08/mit_top_us_univ.html\" rel=\"nofollow\">MIT top US university for study, Brown 'happiest' - Local News Updates - MetroDesk - The Boston Globe</a><br><br>The 2008 Center for College Affordability and Productivity (CCAP) ranked Brown 5th in the country among national universities.\"[43] As it had in 2007 and 2010, the 2011 Princeton Review email poll of college students ranked Brown 1st in the country for \"Happiest Students.\"[44] (Wikipedia)<br><br>Good luck. At the very least you should be happy!<br><br>", "<b>Username: onlinepass</b><br><br>Brown has 600 university faculty members.<br>and 2000 medical school faculty members.<br><br>Stanford has 2000 university faculty members alone.<br>And probably more than 10000 medical faculty.<br><br>", "<b>Username: hanana</b><br><br>Prestige is very irrelevant in this case. The people who are smart enough eg. good employers, will not like one better because of the 'prestige' unless they have a connection to either school.<br>Each school has their own strong programs, and Brown is located in Providence, RI whilst Stanford in Palo Alto, CA. The environment is genuinely different.<br>One must research more into the schools if they are lucky enough to consider the two.<br><br>", "<b>Username: wahkimoocow</b><br><br>overall, stanford is stronger than brown<br><br>", "<b>Username: cmburns14</b><br><br>I agree that Stanford is stronger than Brown in every academic area.<br><br>Nobel Prizes<br>Stanford (51)<br>Brown (7)<br><br><a href=\"http://en.wikipedia.org/wiki/List_of_Nobel_laureates_by_university_affiliation\" rel=\"nofollow\">List of Nobel laureates by university affiliation - Wikipedia, the free encyclopedia</a><br><br>However, for undergraduate education, the differences will be slight. For graduate school, it may be helpful to have attended Stanford for undergrad as its faculty recommendations carry more weight on average. Brown does have David Mumford, a Fields Medalist (an emiritus prof in applied math).<br><br>", "<b>Username: wahkimoocow</b><br><br>^You cant say STanford is stronger on the grounds that the school has more nobel prize winners than Brown. Stanford has way more staff than Brown.<br><br>", "<b>Username: Engineerjw</b><br><br>You can't compare potatoes and apples. And just for the sake of an anecdote, most people I know that are interested in humanities/non-science and math would go to Brown in a heartbeat over Stanford.<br><br>P.S. Get how I made brown and red food items? : D<br><br>"]}