{"title": "unc vs uw madison vs umd for computer science", "comments": ["<b>Username: qdchen7878</b><br><br>Hello,I am an international transfer student who want to major in computer science(undergrad) and hopefully get a job after graduation. I was admitted bt the 3 schools above. Which school should I choose? I have the following important considerations:<br><br>", "<b>Username: qdchen7878</b><br><br>Anyone give advice?Thanks!!!!!!!!!<br><br>", "<b>Username: qdchen7878</b><br><br>HELP!!!!!!!~~~~<br><br>", "<b>Username: BrownParent</b><br><br>Looks like you have a thread already.<br><br>", "<b>Username: qdchen7878</b><br><br>@BrownParent Yeah,but I have given up Austin because they release their decision too late<br><br>", "<b>Username: qdchen7878</b><br><br>@BrownParent I am hesitating about UNC and UW-Madison, which do you think fits me better?<br><br>", "<b>Username: 2019Parent</b><br><br>Madison is a premier program and the city of Madison is vibrant and lovely.<br><br>Very hard school to beat.<br><br>", "<b>Username: tk21769</b><br><br>All 3 are respected state universities. CS at any of these schools is likely to attract smart students.<br>Your own effort, interests, and experiences will make a bigger difference than any help you get from the college brand, per se. CS programs at these research universities (and most others) will all cover approximately the same core subjects. There may be significant differences in the faculty coverage of certain specialized areas (e.g. bioinformatics or natural language processing). However, those distinctions typically are more relevant for grad students than undergrads. I don't think the presence/absence of an engineering college is a very significant factor here.<br><br>One factor you may want to consider is internship opportunities (which can be important to building a good resume). I would think that UNC or UMCP are a little stronger than Wisconsin in this respect (judging only from geography ... although there are good CS jobs all over America). UMCP opportunities will tend to be a little more driven (directly or indirectly) by the needs of the federal government, which of course has a huge presence in the Baltimore-Washington corridor. As a foreign national, you may be at a disadvantage for some of those positions.<br><br>So maybe I'd lean toward UNC (although I don't think you can go far wrong with any of them).<br>NC has better weather than Wisconsin or MD. For what it's worth, it has the highest overall US News ranking of the 3. Its region has a relatively diversified economy. Proximity to Duke University may have advantages (although ... it may also bring competition for some internships.)<br><br>", "<b>Username: happymomof1</b><br><br>\"Which school can help me better equipped with the ability to enter into the industry and get a well-paid job,which one has a better reputation in silicon valley?\"<br><br>This is a very specific question that you need to address with the Career Center at each university. You are an international student, and many internship and employment options that are open to US students will not be open to you. You need to make certain that the university that you attend has good placement for international students.<br><br>", "<b>Username: barrons</b><br><br>UW <url>http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-science-schools/computer-science-rankings</url><br><br><url>http://wtnnews.com/articles/2355/</url><br><br>", "<b>Username: PurpleTitan</b><br><br>@tk21769, actually, that's not true for CS. I found a pretty wide range in the difficult of OS finals questions across various research universities. Remember that CS isn't engineering and ABET accreditation doesn't matter for CS.<br><br>However, UW-Madison, UMD, and UNC (as well as UT-Austin) are all good CS schools.<br><br>", "<b>Username: tk21769</b><br><br>^ <i>What</i> is not true for CS?<br><br>", "<b>Username: simba9</b><br><br>I live and work in the San Francisco/Silicon Valley area, and would say that the schools will be viewed equivalently out here. I've never seen hiring managers pay attention to CS department rankings.<br><br>", "<b>Username: NavalTradition</b><br><br>Weather is better in Chapel Hill.<br><br>", "<b>Username: barrons</b><br><br><url>http://www.thrillist.com/eat/nation/best-college-towns-in-america-for-food-and-drink</url><br><br>", "<b>Username: PurpleTitan</b><br><br>@tk21769, OK, re-reading your post, your statement that CS programs at most flagships will cover the same subjects is true. However, even in the same subject (OS), there will be a pretty big difference in difficulty (and thus how much they challenge the students and thus the quality of the grads they turn out, unless a student goes above and beyond the material and challenges themselves more) across different flagships (though the RU's under discussion all have strong CS programs).<br><br>BTW, electives certainly may matter as well for an undergrad interested in a specific subfield.<br><br>", "<b>Username: tk21769</b><br><br>^ OK, I can agree with that. Sure, course difficulty varies from college to college and professor to professor.<br>However, I'm not aware of a good data source that would help the OP systematically compare course difficulty across the 3 schools he's considering.<br><br>", "<b>Username: PurpleTitan</b><br><br>@tk21769, one way is to try to find and compare final exams from online like I did. In any case, I'd expect these schools to be about the same; they're all good CS schools.<br><br>", "<b>Username: qdchen7878</b><br><br>@PurpleTitan Thanks for your answer! Then which one in the 3 schools has the best academic strength in CS?<br><br>", "<b>Username: qdchen7878</b><br><br>@simba9 Thanks !<br><br>", "<b>Username: qdchen7878</b><br><br>@barrons Thanks ! It seems that you vote for UW-Madison. I am also very fond of this school. There is only one concern,you know, the long cold winter...<br><br>", "<b>Username: qdchen7878</b><br><br>@tk21769 Thank you for the detailed reply ! It is really tough to make a final decision.<br><br>", "<b>Username: PurpleTitan</b><br><br>They are all strong. In terms of faculty research prowess, UW-Madison, UMD, and UT-Austin may have a slight edge over UNC, but all of them are far more than good enough to prepare you for grad school or a job. Remember that for grad school and getting a job, what you do yourself and your own abilities will be far, far more important than which of these schools you choose.<br><br>Also, not having an engineering school pretty much doesn't matter at all for CS (unless you want to concentrate more on the hardware side).<br><br>So, IMO, your decision should come down to non-academic criteria. Weather? Fun college town? How international it is?<br><br>", "<b>Username: ewho</b><br><br>I will be biased toward Wisconsin as I am a Badger at large, though I was there for grad school. The CS dept is fine and Wisconsin has a relatively strong engineering school. You can take courses in ECE and their stats/math depts are also very strong, well George Box was still teaching when I was there. They also have a large Chinese community so you should not feel lonely ~ I was assigned the number 215? student from Mainland China. :)<br><br>It is cold, but you will get used to it. Madison area did not enough tech companies when I was there, so many CS/ECE graduates were recruited to SV, especially those ECE undergraduates to Intel.<br><br>Time may have changed, but I don't know. Wisconsin used to be one the most progressive universities in the country.<br><br>", "<b>Username: barrons</b><br><br>That has changed with growth at EPIC (6000 workers) and smaller companies around area. But many still go west too.<br><br>", "<b>Username: qdchen7878</b><br><br>@PurpleTitan Very insightful !<br><br>", "<b>Username: qdchen7878</b><br><br>@ewho HaHa,how do you know I am from china mainland. Nice to meet you!!!<br><br>", "<b>Username: qdchen7878</b><br><br>@ewho Could you please give me your wechat? here is my wechat: cqd373658559 .<br><br>", "<b>Username: PurpleTitan</b><br><br>BTW, I don't know where in China you are from, but Madison is about as cold as Beijing (yet I don't hear Tsinghua and Beida students complaining about the weather).<br><br>", "<b>Username: qdchen7878</b><br><br>@PurpleTitan I heard its temperature is close to LiaoNing province or JiLin province? Ha Ha~~<br><br>", "<b>Username: PurpleTitan</b><br><br>?? Beijing winters are about the same as those in the southern part of the DongBei.<br><br>", "<b>Username: plaseletmein888</b><br><br>@qdchen7878 qidi chen, guess who I am<br><br>", "<b>Username: qdchen7878</b><br><br>@plaseletmein888 Pan<br><br>", "<b>Username: qdchen7878</b><br><br>;<br><br>", "<b>Username: MYOS1634</b><br><br>All three are excellent; both Madison and Chapel Hill are quintessential college towns, with Madison having an edge in terms of internships for CS and Chapel Hill having an edge for weather. Note that both are going to suffer MAJOR funding cuts, those to Wisconsin have already been decided (someone calculated that the funding cuts would be equivalent to closing the school of engineering and the nursing school.)<br>In the end, I'd choose UMD, because for an international student its location is better: major airport, public transportation, easy access to most of the East Coast's major cities.<br>Also, no funding cuts that I know of (and in fact there should be some funding influx to the CS school at least).<br>Will you be allowed to live in a dorm? Does any of these three have a Living Learning Community for transfers, so that you're acclimated quickly into the university's culture?<br><br>", "<b>Username: PurpleTitan</b><br><br>@MYOS1634, UW-Madison has what is essentially a dedicated research endowment (separate from its regular endowment), though. Though funding cuts are a concern.<br><br>", "<b>Username: barrons</b><br><br>WARF--(yes related to heart drug warfarin invented at UW) has about $3 Billion dedicated to UW science and research.<br><br>The budget has not yet been decided and will not be until next week. Then it goes to Governor who can still make changes.<br><br>", "<b>Username: qdchen7878</b><br><br>@MYOS1634 Insightful ! I knew the tuition of UW-Madison will rise 3000$ per year for the next 4 semesters, which comes from the fund cut from the government. This is something that will reduce the attraction of UW for OOS students.<br><br>", "<b>Username: anhydrite</b><br><br>MYOS, I don't know where you received that info. for Wisconsin, but it is inaccurate regarding the proposals.<br><br>I would recommend both Madison and Chapel Hill over Maryland for their campus and town environments. College Park would not be high on my list for ideal campuses, though it is certainly serviceable. While I agree Chapel Hill may be a bit out of the way (it does have Research Triangle Park and is beautiful), Madison has Chicago, and a bit further, Minneapolis. I personally wouldn't recommend Milwaukee as a destination, but right now, I certainly would not recommend Baltimore either.<br><br>OP, are you thinking of deciding anytime soon?<br><br>", "<b>Username: qdchen7878</b><br><br>@anhydrite The 14-15 tuition of UW is 26000 for OOS including international, 15- 16 is 29000$,16-17 tuition is 32000$ . I will choose from UW and UNC~<br><br>", "<b>Username: anhydrite</b><br><br>I am not asking for a tuition statement, qdchen. We have been trying to assist you to come to a decision.<br><br>I am noting that MYOS said the cuts have already been decided -- this is not the case for UW, but may well be for UNC. The amount of the cuts that Madison campus will need to absorb is not yet clear, and it would certainly not do so by abolishing, say, nursing and engineering, if those numbers end up even close to accurate. It's misleading, as however it ends up, the budget operations will absorb cuts and allocate revenues in the most efficient distributions possible to maintain high quality educational and research activities.<br><br>Also note that, if budget cuts were similar, UNC's smaller size could mean it suffers proportionately more (the larger the campus and research parks, the more cushion there is to absorb potential cuts).<br><br>Given the reputations and traditions of both UW and UNC, I still do not see the quality of education on offer at either suffering much, if at all.<br><br>", "<b>Username: DrGoogle</b><br><br>Post #40, I dint think MYOS said funding will be cut to engineering and nursing, but she said the equivalent to closing engineering and nursing schools which is quite huge.<br><br>", "<b>Username: barrons</b><br><br><url>http://www.isthmus.com/news/news/uw-system-budget-cuts/</url><br><br>Current worse case is about 6.5% cut to each school.<br><br>", "<b>Username: qdchen7878</b><br><br>Tuition is something close to every student while budget is kind of intangible<br><br>", "<b>Username: anhydrite</b><br><br>I agree that can be true for students. I simply don't understand why you quoted my handle and stated upcoming tuition rates, as neither MYOS nor I mentioned it in the recent cross-posts. We are already aware. I also do not think the upcoming tuition for Wisconsin will deter that many students in the future, as it has been historically low and below market-value, even for many Big Ten institutions, when Wisconsin has departments and resources that rate within the top three of the Big Ten (which now has, I believe, fourteen institutions). When an OOS student wants to study in a top department at Wisconsin, they will still come.<br><br>Let me put this politely another way: you have asked a comparative question about the three institutions in more than one thread. We are trying to answer to the best of our abilities, and some of us on the board know the higher education system here pretty well. I think it is becoming counter-productive to state more information if you are not processing it. I am wondering why you haven't decided yet, because most students have unless they received waitlist notifications that changed their decisions.<br><br>At any rate, I think I've said my piece, and I wish you the best of luck.<br><br>", "<b>Username: qdchen7878</b><br><br>I just got accepted by UT-Austin,but my current major is math and I know it is not easy to switch to CS major. The problem became complicated.<br><br>", "<b>Username: PurpleTitan</b><br><br>My understanding is that transferring in to CS at UT-Austin is virtually impossible, so the problem didn't become more complicated since I wouldn't consider UT-Austin an option.<br><br>", "<b>Username: qdchen7878</b><br><br>@PurpleTitan Why impossible?<br><br>", "<b>Username: PurpleTitan</b><br><br>Because they had overadmitted in to CS at UT-Austin so now they are taking almost zero transfers in to CS. Even students with near-perfect GPAs are denied.<br><br>In any case, considering that all 4 schools listed are almost identical in strength in CS, I don't understand why you'd still have one where your chances of being a CS major there are slim as a possible option.<br><br>", "<b>Username: qdchen7878</b><br><br>@PurpleTitan Thanks<br><br>"]}