{"title": "dartmouth vs williams vs princeton vs yale", "comments": ["<b>Username: Camboronioo</b><br><br>Hi everyone i'm hoping to be able to go to either Yale, Princeton, Williams or Dartmouth as an international student from the UK. I have never been to any of them before and have just read articles. I have the SAT scores for them and I'm hoping to major in English literature and was wondering how the academics in english compare at each school. Also what is the atmosphere like at each of these schools and what are the campuses like. I have read stories on a rolling stone article about Dartmouth and was wondering if it was true or not.<br><br>", "<b>Username: collegemom3717</b><br><br>Good to see you are narrowing your focus ;-)<br><br>They are pretty different places in some obvious and less than obvious ways. Try u n i g o and niche for college profiles on each, but in reality you are going to want to visit them. Obviously, also read the English section of their respective websites. Depending on your area of interest one may jump out more than another.<br><br>If one stands out for you, I strongly suggest applying ED/EA.<br><br>Early Decision is binding: if you are accepted you must attend (there is a FA exception, but it won't apply to you). Dartmouth and Williams accept about 40% of their class ED (v 10/15%).<br><br>Single Choice Early Action: non-binding, but you can only apply to one private (not state) uni SCEA. Princeton &amp; Yale admit ~ 19% SCEA, v 5-7% regular decision (RD).<br><br>Note that the acceptance rates are much higher than in RD, but they are a little misleading, b/c they include recruited athletes- about 60% of Yale's SCEA applicants were deferred to regular admissions, and 1/4 were denied outright (but then at least you know where you stand). Conventional wisdom is that ED give you a bigger boost, b/c of your commitment to attend.<br><br>You \"have the SAT scores\"- but so do the majority of the applicants. You have pretty good ECs- but so do the majority of the applicants. Your secondary school marks are strong- but are those of the majority of the applicants to these schools, and . In other words, you have the necessary pieces, but they are not sufficient in themselves. You need to add *you* to your marks through your essays.<br><br>Also, as others have said, if you are going to go to college in the US, you will need to apply to a range of colleges: applying to just those 4 is an extremely high-risk strategy!<br><br>", "<b>Username: uesmomof2</b><br><br>Unlike admission to British universities, which are more based on test scores and a rigorous interview process, the schools you mentioned practice \"holistic admissions\" which means that test scores are only one factor that admissions committees take into account along with grades, course rigor, recommendations, essays, extracurriculars and \"institutional priorities\" (recruited athletes, legacy, development, URM, etc.)<br><br>", "<b>Username: merc81</b><br><br>I interpret the OP's reference to his/her SAT scores as reflecting only the briefest possible summary of his/her qualifications.<br><br>", "<b>Username: uesmomof2</b><br><br>@merc81 you are probably correct but I went to an information session for Oxford with my D last year and it was interesting to hear that the British universities don't have many of the \"institutional prioritiy\" slots in admissions like the U.S. universities do. No recruited athletes, etc.<br><br>", "<b>Username: BatesParent2019</b><br><br>@Camboronioo<br><br>I think you have to decide whether you are interested in attending a top school here or just those.<br><br>If it is just those, then most likely you will get four letters that start with \"Dear applicant, while your application impressed our admissions committee, we regret to inform you....\"<br><br>There is no shortage of applicants from the UK to those schools and test scores are just one component, shrinking each year, of the decision.<br><br>Also, several of William's peer schools don't require SAT scores at all.<br><br>If you decide to come to the US and attend an elite school you need a sound plan.<br><br>", "<b>Username: merc81</b><br><br>@uesmomof2: I appreciated your first hand account. The explanation I've heard from that side of the pond is that students show up ready and willing to participate in extracurriculars anyway (using ECs as one example of an institutional admissions priority); this does seem to put an interesting twist into comprehending some of the sundry selection criteria in the U.S.<br><br>", "<b>Username: TheDidactic</b><br><br>SAT score doesn't always guarantee admission or give you a better advantage, but it's a start. You'll have to Google and prowl around here and other sites like @collegemom3717 mentioned to get an idea of student life and campuses. Can't say if the hazing incident is the most accurate at Dartmouth, but hazing is a part of the Greek life/frat culture. At a place like Dartmouth where the Greek life is a strong part of campus life, it may be difficult to avoid or difficult to not participate. If Greek life is a turn-off for you, you'll have to adjust your search accordingly.<br><br>Princeton, Dartmouth and Yale are reaches no matter what, but you should seriously look into Williams (a not as snowball chance in Florida acceptance probability)<br><br>", "<b>Username: merc81</b><br><br>The Rolling Stone article essentially describes a student who both seeks and is susceptible to the drinking culture at Dartmouth. The reported message is that, for a certain type of student, the drinking culture at Dartmouth -- perhaps to an extent not generally found at other colleges -- is fully antithetical to intellectual pursuits and an extremely unhealthy form of alcohol abuse. However, you do need to get further perspective on whether the article describes Dartmouth's center-culture or one of its fringe-cultures. Beyond that, once you are at a college, you, as much as any other student there, help to define what the culture actually is.<br><br>", "<b>Username: lalalemma</b><br><br>Yale is more artsy/liberal, the other three kind of have reputations for being preppy, old money type schools. Williams is a lot smaller and more isolated than the others, and it's also the only true LAC on the list. Dartmouth probably has the most Greek life and drinking culture.<br><br>As others have mentioned, having the SAT scores really isn't going to be enough. Scores are only part of the picture, but even if everything else on your application is perfect they're still all going to be reaches. That is how selective they are. If you definitely want to come to the US for college, you're going to need to find some matches and safeties.<br><br>", "<b>Username: merc81</b><br><br>Williams had a 41% ED acceptance rate this year. I think this school would be an ED match based on what this poster has included on other threads. Many CC contributors suggest that ED confers no real advantage, but there's a Kennedy School of Government study that indicates the advantage is substantial.<br><br>", "<b>Username: BatesParent2019</b><br><br>@merc81<br><br>That statistic for a small school, about half the freshman class, is very misleading. More than half of the kids that apply ED to NESCAC schools were pre-read over the summer so applying was a formality, plus the legacy and URM students. There is a bump for regular students but it is small.<br><br>", "<b>Username: merc81</b><br><br>Have you read the Kennedy School study? This is an excerpt:<br><br>\"An early student scoring 1200 to 1290 [out of 1600 on the SAT] was MORE likely to be admitted than a regular student scoring 1300-1390.\"<br><br>", "<b>Username: BatesParent2019</b><br><br>I don't need to. I was directly involved with 15 similar schools and went through the process with a recruited athlete. Perhaps in Williams case the adjusted ED admit rate is about 20-25%.<br><br>Plus that study was written in 2001, more students try ED, so the benefit dimishes each year that goes by as more do it.<br><br>", "<b>Username: merc81</b><br><br>\"I don't need to. I ... went through the process with a recruited athlete.\"<br><br>From an Atlantic article on the Kennedy report: \"The ... findings were ... striking because ... \"hooked\" applicants were excluded from the study.\"<br><br>", "<b>Username: BatesParent2019</b><br><br>@merc81 Use the data from Williams own press release and adjust the numbers for an estimate of 125 students that are recruited, legacy or otherwise preselected and see what the number is. There is a better acceptance rate but it is nothing remotely close to the headline. Again, a 2001 study is very stale because more and more kids use ED every year.<br><br>", "<b>Username: merc81</b><br><br>^ The Kennedy Study was designed to disentangle these factors. It would be naive of me to think I could exceed their professionalism.<br><br>I'm aware of the age of the study and other caveats that can come with any citation.<br><br>", "<b>Username: prezbucky</b><br><br>i think of them like this in terms of both prestige and admissions difficulty:<br><br>1. Princeton = Yale<br>3. Dartmouth = Williams<br><br>Some will say that the best education for you, as an undergrad, will be at Williams, since it is a premier Liberal Arts College - and, as such, features a 100% undergrad-focused atmosphere with very small class sizes, ease of access to professors, etc.<br><br>And it is true that your average class size, over four years, will be smallest at Williams. Because of that, you will have great access to professors.<br><br>But...<br><br>Yale and Princeton are two of the three best, and most prestigious, universities in the USA and (for that matter) the world. As a Tiger or an Ely you get Nobel Prize winners, writers of textbooks, and otherwise top minds in their fields as your teachers. There are more students so your classes will be a bit larger for your first two years, typically, but once you are into your major-specific classes you'll experience smaller class sizes. They do more meaningful research than is conducted at LACs (even top-notch LACs like Williams), so if you are into the cutting-edge stuff, Princeton and Yale are better than Williams.<br><br>Dartmouth is an outstanding school with teaching that equals, or seriously approaches, the quality found at the other three. Its national and international reputation is bigger than Williams' but smaller than that of P and Y.<br><br>Princeton has its eating clubs, Yale has its residential colleges, Dartmouth has its Greek party scene, and at Williams the jocks mix with the nerds. Students at all four tout the social aspects of their schools. Probably you could enjoy ypur time at any of them, but \"fit\" is important, so you should do additional research into their social vibes.<br><br>All four are very selective. P and Y are a bit more selective than D and W.<br><br>Each school has its charms. Probably the easiest thing would be to get into only one of them, thus saving you a hard decision. But if you are lucky enough to have to choose, your selection will not (cannot...) be wrong.<br><br>Good luck!<br><br>", "<b>Username: Oberyn</b><br><br>The ED acceptance rate for Williams is extremely misleading as others have said. I had a 2350 and was deferred ED and eventually wait-listed from Williams. However, I received a likely letter from Dartmouth out of more than 20,000 applicants this year. I had no hooks as a middle class Asian male living in New England.<br><br>", "<b>Username: Qwerty568</b><br><br>Williams is a fairly jock-y school. I would assume a large percentage of the ED admits are athletes.<br><br>", "<b>Username: Camboronioo</b><br><br>WOW!!! thanks everyone, this is so so helpful. From what i'v researched and heard I think Dartmouth, Princeton and Williams are more for me but i will still apply to Yale of course. For those asking, I'm only applying to these ones as my choices in the UK are Oxford and Durham.<br><br>Does anyone know what the typical Princeton, Williams and Dartmouth applicant is like so I can get a feel about the 'social vibe'. Also, at my school we have boarding houses, is that a sort of equivalent to Greek life?<br><br>", "<b>Username: BatesParent2019</b><br><br>@Camboronioo<br><br>Your first question is impossible to answer other than to say they are high performing students which, including athletes, are the top 5% of all students.<br><br>US schools are very diverse in student-type and generalizing, especially at this stage of process, is pointless. If you try to select the group on this criteria your chances of getting into even one drops precipitously from a small chance.<br><br>Many US students of this caliber apply to a large group of top schools and make their final choice from one or two. Many high stat international students seem to think these schools are waiting and hoping for their application. It is going to much harder for you than you think.<br><br>The Boarding Houses are somewhat similar to fraternities and sororities but Boarding Houses are school specific whereas the others are part of a national organization. Socially they are similar systems more or less. I went to Templeton College for one year, so I remember them.<br><br>", "<b>Username: PurpleTitan</b><br><br>To the OP: plenty of applicants in the top 1% get rejected from these schools. The Ivies&amp;equivalents don't have enough space for all of the top 1% of American students (and they certainly don't take just that group as holistic admissions means all sorts of factors come in to play).<br><br>As you're probably aware, scores alone do not guarantee you admission to Oxford either, though if you do well enough on A-levels, Durham certainly could be your safety.<br><br>", "<b>Username: Camboronioo</b><br><br>Thank you, I understand that universities are so diverse, but, for example, it is said that Harvard students are very nerdy. Now although this is probably not completely true, it must display some truth.<br><br>So i guess i'm really just asking about stereotypes with some basis in reality. I know it's terrible to judge it on stereotypes but I am interested in finding out what others would think of these schools and what sort of person {vaguely} these schools take in.<br><br>", "<b>Username: BatesParent2019</b><br><br>Let me help you out with this. Would you say you are a Posh speaker or more Cockney or Estuary.<br><br>", "<b>Username: PurpleTitan</b><br><br>Let me help you out some more: right now, you don't have any choices to make because you have no options (besides maybe Durham). If you actually manage to get in to some of these schools, then you may consider stuff like fit, culture, etc.<br><br>", "<b>Username: Camboronioo</b><br><br>I would probably classify myself as the first of the three, I'm also applying to Leeds (as my safe choice), UCL and LSE but Durham and Oxford are my top 2.<br><br>", "<b>Username: Camboronioo</b><br><br>but I pretty much know all the culture and 'types' of these Unis<br><br>", "<b>Username: BatesParent2019</b><br><br>Ok that is very helpful.<br><br>Here is how I see it.<br><br>Yale - Posh<br>Harvard - Posh<br>Columbia - Estuary<br>Cornell - Cockney<br>Dartmouth - Cockney<br>Brown - Estuary<br>Penn - Estuary<br>Princeton - Posh<br>Williams - Posh<br><br>", "<b>Username: Camboronioo</b><br><br>oh, ok. I always thought that Dartmouth was more posh then the completely other end of the spectrum. Thank you this is useful<br><br>", "<b>Username: BatesParent2019</b><br><br>Yes overall it is very, but relative it is more of a rough and tumble crowd. Hard-nosed types.<br><br>How did Williams get on your list. To me Bowdoin fits a Brit much more and the location is dramatically better.<br><br>", "<b>Username: Camboronioo</b><br><br>oh, ok, thank you<br><br>", "<b>Username: collegemom3717</b><br><br>red pants will feel at home at all of the ones that you are interested in ;-)<br><br>", "<b>Username: Camboronioo</b><br><br>i prefer rural settings, and i like the term plan at williams<br><br>", "<b>Username: Camboronioo</b><br><br>well, I prefer a rural setting and after comparing courses i preferred Williams, I think i might apply to Amherst, Swarthmore, Bowdoin and Middlebury to. I'm still not sure if LAC's or universities are for me though<br><br>", "<b>Username: PurpleTitan</b><br><br>@BatesParent2019, wut.<br><br>Dartmouth is so not Cockney.<br><br>Heavy drinkers and partiers, yes, but preppy all the way through.<br><br>British and American social classes (or even stereotypes of them) don't match exactly.<br><br><br>Also, categorizing Harvard as \"posh\" seems rather outdated. They (and Stanford) just want the best in all fields (so do Y &amp; P for that matter, but H &amp; S would win out more). The fact of the matter is that all the Ivies now (and most Ivy-eqivalents) will have similar mixes of social classes.<br><br>", "<b>Username: BatesParent2019</b><br><br>He was interested in stereotypes<br><br>", "<b>Username: merc81</b><br><br>Back to English lit, the online article, \"The 25 Most Literary Colleges in America,\" includes and briefly discusses both Williams and Princeton.<br><br>", "<b>Username: Camboronioo</b><br><br>thanks, i'll take a look<br><br>", "<b>Username: merc81</b><br><br>They obviously downloaded an image for Williams without a lot of thought -- the photo is of Oxford University.<br><br>", "<b>Username: Camboronioo</b><br><br>haha, yes I see that!!<br><br>"]}