{"title": "purdue engineering vs nyu engineering", "comments": ["<b>Username: KrishSC</b><br><br>I really really need some help here. I'm an international student, btw.<br><br>", "<b>Username: KrishSC</b><br><br>BUMP<br><br>", "<b>Username: BatesParent2019</b><br><br>Purdue is in indeed world class and has been for as long as I can remember.<br><br>Any engineer or engineering company in the US or abroad worth working for will know Purdue is tops.<br><br>Purdue also offers a full and uniquely complete American university experience. Sports, school spirit, interaction with other great engineering schools in the Big Ten. Great campus and great college town.<br><br>This is an easy choice. NYU is not in the same league with Purdue.<br><br>", "<b>Username: KrishSC</b><br><br>How is it that almost everyone (70%) gets into Purdue while 30-40% alone get into NYU Engineering?<br><br>", "<b>Username: KrishSC</b><br><br>If NYU is not in the same league as Purdue, wouldn't that also mean that Harvard, Yale, etc aren't also in the same league as Purdue Engineering?<br><br>", "<b>Username: BatesParent2019</b><br><br>Purdue is a state school and therefore has a mandate to be inclusive. I bet the drop out rate from that program in the first year exceeds 50%.<br><br>NYU is a second tier at best engineering school.<br><br>International students do this all the time, they are fixated on the brand names they know and assume because NYU has New York in the name that is in indication of quality.<br><br>In terms of engineering, Purdue is a tippy top school and the college of engineering probably has 25% of the total enrollment.<br><br>", "<b>Username: BatesParent2019</b><br><br>That is correct, Harvard and Yale are not. The closest Ivy League school is Cornell.<br><br>Don't waste your time with NYU for engineering. Did you visit Purdue? If you were impressed by NYU's facilities then you would have fainted at Purdue.<br><br>", "<b>Username: KrishSC</b><br><br>Bump.. Any more views?<br><br>", "<b>Username: NoVADad99</b><br><br>NYU Engineering (formerly Polytechnic University) is well known in many foreign countries. Since they gave you the scholarship money, I would just go there. Purdue is an excellent school, but probably won't give you any better career prospects than NYU Poly in your home country.<br><br>", "<b>Username: BatesParent2019</b><br><br>I couldn't disagree more and we have engineers here with MBA's. One commented \" is that a serious question?\"<br><br>Purdue is ranked 26th globally and is known everywhere as an elite engineering school. Purdue has alumni all over the globe.<br><br>Money aside, this is a simple choice. You will also have a much better experience at Purdue than in Brooklyn.<br><br>", "<b>Username: ucbalumnus</b><br><br>How are the two schools viewed by employers in the country that you intend to work in?<br><br>What are the net prices after applying scholarships, and how much does that matter to you?<br><br>", "<b>Username: KrishSC</b><br><br>Purdue is ranked 102 globally and NYU is ranked 41 globally. (QS Rankings)<br>In times: Purdue-102 NYU-38<br><br>These are Overall rankings. Reputation wise NYU is pretty reputed and Purdue is nowhere on the list of reputation rankings.<br><br>Net Price at Purde - 40000$<br>Net Price at NYU- 25000$ (much more doable)<br>Though the money does matter, while making a decision I want to make one without considering it.<br>I got the UC's too but they are completely out of my budget as I'm an international student.<br><br>However, money factor aside, I want to make a good decision. To be honest, in my country, practically nobody knows Purdue but many do know NYU. I've also practically DISCARDED the UK options for other reasons (got into KCL, UCL, UManchester, USouthampton, UBristol). So right now I'm just choosing between NYU and Purdue.<br><br>Even though Harvard Engineering \"isn't in the same league\" as Purdue Engineering, I'm sure anyone in Purdue would like to go to Harvard even for Engineering. Can the same be said for NYU?<br><br>", "<b>Username: BatesParent2019</b><br><br>Purdue is ranked 26th globally in Engineering and it is a powerhouse here and overseas. If it makes you feel better, engineering is in a separate college of 10,000 students.<br><br>If you spoke to engineering companies in the UK about Purdue you would get the same response I am giving you.<br><br>And you would be wrong about your statement regarding Harvard.<br><br>Engineers are scientists, they are program driven, fact driven, outcome driven, not status driven.<br><br>NYUs overall ratings are largely driven by the undergraduate and graduate business school and as a university it is quite good. Engineering did not exist at NYU until just recently. It is not considered a top program. It is also very small and does not have the funding Purdue has.<br><br>Do yourself a favor and pick the engineering school based on the strength and reputation of the major and not the headline status of the university. Most of the Big Ten schools also have globally ranked engineering programs and you probably would have the same reaction.<br><br>Also, if you don't care about anything else regarding your school experience then NYU may be attractive but going to school in the downtown area of Brooklyn where probably half are commuters is not what most American students seek.<br><br>", "<b>Username: ucbalumnus</b><br><br>What do <i>engineering employers</i> in the country you wish to work in think of the reputations of the schools? (In the US, Purdue is probably better regarded by engineering employers than NYU or even Harvard, though the reverse is true for finance employers. But this may not be the case in other countries.)<br><br>Also, is there a GPA threshold to renew the scholarship at NYU? However, if the GPA requirement (if it exists) is not onerous, then the lower cost of NYU would be a strong argument in its favor.<br><br>", "<b>Username: gdlt234</b><br><br>I'd totally pick NYU in your situation. I never thought anybody could say that NYU is cheaper than another option. Purdue is a good engineering school, but I'd heavily disagree with how good some people are saying it is... Also as a state school I'm not sure if they're really required to be inclusive seeing as the UC's are also state schools and can be very exclusive.<br><br>", "<b>Username: BatesParent2019</b><br><br>@gdlt234 based on what that Purdue isn't as good as people say?<br><br>Also, NYU Poly is not NYU in the village. The campus is in Brooklyn.<br><br>", "<b>Username: NoVADad99</b><br><br>Let's get something straight about NYU Polytechnic. It is not a \"new\" school. It's been around since 1854 and has a worldwide reputation for excellence in engineering. While not in the top tier of engineering schools in the US, its alumni have done very well in their careers, including very high rankings in pay compared to top tier schools like MIT.<br><br><url>http://en.wikipedia.org/wiki/New_York_University_Polytechnic_School_of_Engineering</url><br><br>", "<b>Username: gdlt234</b><br><br>@BatesParent2019 I only meant that Purdue isn't as good an engineering school as some make it out to be. There are a lot of other schools with better budgets, faculty, students, etc. It's still a good option for engineers no doubt, I was just pointing out to the OP that he shouldn't be misled.<br><br>", "<b>Username: NoVADad99</b><br><br>Brooklyn is now hotter than Manhattan for real estate and the social scene for 20 somethings.<br><br>", "<b>Username: BatesParent2019</b><br><br>@gdlt234 Then if that were the case then Purdue would not rank #6 in the US and #26 globally. These rankings have been this way for years and years and years.<br><br>What are you basing your statement on?<br><br>@NoVADad99 Downtown Brooklyn is not a great area. I know it well.<br><br>", "<b>Username: gdlt234</b><br><br>@BatesParent2019 the rankings don't really change the facts. Purdue doesn't have a strong a budget nor student body as a lot of competing engineering schools. Besides isn't that #6 ranking from the USNWR? Which bases that off of scores given by other institutions rather than more important factors? But regardless, the rankings can't change the facts. Purdue is a good engineering school, I'm really not trying to challenge that. I'm only stating that it's just not the crown jewel of engineering schools that some make it out to be.<br><br>", "<b>Username: BatesParent2019</b><br><br>@gdlt234<br><br>Respectfully, you don't know what you are talking about. Purdue is a state school and has the state budget to lean on, far more than NYU will ever have. NYU is quite stretched financially which is why financial aid is so bad.<br><br>No matter which ranking you look at going back years, Purdue is always in the elite brackets.<br><br>", "<b>Username: KrishSC</b><br><br>The physical separation isn't something I'm worried about because it's only a difference of 15-20 minutes actually. Btw it's not separate from NYU because NYU bought it last year. I've checked the engineering rankings and Purdue is ranked 48 lower than universities like UManchester, etc<br>Also my other question is if only the main campus of Purdue is good in engineering or if the others are equally good.<br><br>Also, the thing about NYU is that it's overall reputation. I know you're saying Purdue has a better reputation, but then how would that translate into NYU graduates earning more? Purdue isn't on that Payscale list.<br><br>I really want to make the best decision possible because I have 3 weeks left to decide on Purdue. Please continue to comment.<br><br>Another thing is that I'm from India and 10 people from my school have applied to Purdue and all have gotten in. Knowing them personally I can say that they are not as good as many others in my school academically. Doesn't this show that Purdue isn't an exclusive University and takes in almost everyone who applies? What makes a Purdue Engineering so special and so hot among employers?<br><br>The NYU Engineering notable alumni list has better and bigger names than the Purdue Engineering alumni list btw.<br><br>", "<b>Username: Chardo</b><br><br>The business school people at NYU did a great job here. This is a textbook example of brand management. Take a mediocre college with a famous name solely due to its location, hype it to OOS and internationals as the place to be, charge a premium price for the experience, and build your brand. Earn a decent reputation for finance and theater, thanks to your proximity to Wall Street and Broadway. Realize you're missing engineering, a hot growth area. Buy a nearby engineering college, which was nothing particularly special on its own, and slap your brand on it. Viola, you have now have engineering. It's still the same ordinary engineering college (not bad, but certainly nothing special) that attracted mostly commuters, but now it has a famous brand name.<br><br>Maybe Perdue is not as well known in your country, but it is an outstanding engineering school, one of the best in the world. Money certainly matters, and a $15,000 difference is significant (btw, have you factored NYC's unbelievably high costs for everything?). Money aside, the only reason I can see preferring NYU over Perdue is if you really want to be in the big city. Note that you will be in Brooklyn, though, not Manhattan. You will literally be commuting to and from Manhattan (subway $2.75 each way or $116/month unlimited) for the main campus, dorms, and nightlife.<br><br>Are these schools your only two options?<br><br>", "<b>Username: gdlt234</b><br><br>@BatesParent2019 I realize they have the state budget to lean on, but that isn't much. The state also has to allocate money to the other state schools. Besides Indiana doesn't exactly have a huge coin purse. Besides a lot of private schools like MIT have much larger budgets without relying on the state. Also like I said before, students and faculty just don't compete with other schools.<br>I don't think you understood what I was trying to say. I don't think that the rankings tell the whole story most of the time anyway, and the OP should really make a decision based on things other than rankings. Also, I'm not trying to say that NYU is a better school for engineering than Purdue is, I don't believe that at all, only that NYU is the better choice in this situation.<br>Again I'd like to reiterate, I am not saying that Purdue is a bad school, I'm really not. I'm only saying that some people seem to hype it up as the end all be all engineering school when it's just not.<br><br>", "<b>Username: KrishSC</b><br><br>No these schools or not my only options, but are only my two affordable options. Because the UCs, and other private universities that I got into have an estimated expenditure of approx. 65K. @Chardo, so will you say the same thing about all the ivies? Brand name only no substance at all? Just because they're lower ranked than Purdue?<br><br>", "<b>Username: gdlt234</b><br><br>@KrishSC everything you've said is exactly why I've said you should choose NYU over Purdue. Purdue has the better engineering school, but everything else points to NYU. The money, the students, the reputation, everything. If you choose Purdue, fantastic. If you choose NYU, fantastic. You'll likely find success as an engineer if you go to either. All I'm saying is that NYU seems like the overall better choice.<br><br>", "<b>Username: TheDidactic</b><br><br>Purdue and NYU are both great in their own ways. Personally, I believe Purdue's engineering is better than NYU's. If you can afford Purdue, I would say go there. Not banking off of name; I'm banking off of quality which is MUCH more important and not synonymous with prestige. However, NYU is giving you a good scholarship so if money is an issue, by all means, go there.<br><br>", "<b>Username: DrGoogle</b><br><br>Purdue engineering is better than NYU. Only NYU Stern is more known. A few years back even NYU didn't quite have the prestige. But the location where NYU is more attractive for lots of students. NYU also gives out lots of scholarships when it was NYU Poly. But I've heard Brooklyn is getting better location for tech jobs like Uber is there.<br>But I wouldn't be surprised that those kids who got into Purdue also got into NYU PoLy.<br><br>", "<b>Username: KrishSC</b><br><br>The thing is 8 of them applied to NYU but I was the only one who got in. We all got into Purdue though. There's another person right here on CC whom I wouldn't want to name with extraordinary stats who didn't get into NYU. So I do think it's more exclusive than Purdue is.<br><br>", "<b>Username: BatesParent2019</b><br><br>@Chardo<br><br>What a bull's eye. I have lived in NY my entire life and how you described NYU is perfect.<br><br>In the NY area, NYU is below all the other schools including Rowan's when it comes to engineering.<br><br>@KrishSC Besides the program you have to at least acknowledge that campus life is important. You will be there for four years. I can promise you that being on a Big Ten Campus will give you more things to smile about than being stuck on a subway in NY. If you wanna go out with your buddies for a burger and a few pints, plan on dropping at least $50 everytime in NY. Purdue is known to have excellent food at the dining halls, NYU does not. NYU housing is also substandard.<br><br>Go to Purdue and when Notre Dame or Michigan comes into town for football, just watch that town light up.<br><br>", "<b>Username: KrishSC</b><br><br>Hey are the other Purdue campuses engineering as good as the West lafayette campus' engineering program? Or is the West lafayette one the best?<br><br>", "<b>Username: Chardo</b><br><br>I wouldn't say the Ivies (or NYU) are no substance at all, as they are accredited engineering programs. I was commenting specifically about NYU, which is in no way on par with the Ivies. While the Ivies are not well regarded for engineering (other than Cornell), they are obviously first rate overall. The Ivy brands are very powerful, and most of their engineering grads are hired into finance and consulting jobs (where that prestigious brand is important), not true engineering jobs.<br><br>", "<b>Username: BatesParent2019</b><br><br>West Lafayette is where the College of Engineering is located. There has to be at least 20 buildings in the center of campus for the engineering college.<br><br>", "<b>Username: KrishSC</b><br><br>Virtually toured both unis. NYU Engineering has more buildings than Purdue Engineering. Just saying.<br><br>", "<b>Username: ucbalumnus</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/KrishSC\">KrishSC</a> wrote:\"\"<br><br>Engineering is rigorous at any school (including those that are/were not that selective, such as Purdue and the former Polytechnic Institute that is now the NYU Polytechnic School of Engineering), so that anyone who <i>completes</i> an ABET-accredited (or accredited by a similarly recognized organization in other countries) engineering bachelor's degree will demonstrate the capability to handle rigorous study in engineering. Purdue does require first year engineering students to meet GPA requirements to enter their desired majors, so be aware that you need to do well (better than merely needed to stay in good academic standing) to be assured of your desired engineering major.<br><br>If you intend to work in India after graduation, have you asked engineering employers in India whether Purdue versus NYU matters for engineering hiring?<br><br>", "<b>Username: KrishSC</b><br><br>I'm not planning to work full time after graduation. I want to do my masters in electrical engineering.<br><br>", "<b>Username: DrGoogle</b><br><br>Are you planning to go back to India for work? Also NYU location is expensive. A parking space is $50 a day.<br><br>", "<b>Username: BatesParent2019</b><br><br>@KrishSC<br><br>At the expense of really making you angry, I am going to say what a lot of Americans observe with international students, mostly Indian and Asian. They are drawn like moths to a flame when it comes to status schools, or what they perceive as status schools. In this case, it is obvious how you are thinking.<br><br>They always deny it, but there is no other way to explain it.<br><br>Money aside, no prospective engineer would rationalize NYU the way you are vs. Purdue.<br><br>You want the name, not the best program. The better name for engineering is ironically Purdue.<br><br>For your own sake, be objective. If the decision is due to money then that is an objective reason.<br><br>", "<b>Username: KrishSC</b><br><br>I agree with you Bates. Hard fact is that I am in fact attracted by the reputation and I'm not going to lie. It's really hard to make a good Decision.<br>And I'm conflicted which is why I'm asking the cc community for views.<br>My other options:<br><br>UCLA (unaffordable)<br>UCSB (unaffordable)<br>Boston University w Honors College (unaffordable)<br>UMASS Amherst w hons(kinda affordable)<br><br>University of Manchester (solid overall ranking, reputation and engineering ranking) (same money as Purdue) and KCL, ucl etc.<br><br>I got WLd at Penn.<br><br>Rejected at MIT, Harvard, Yale obviously.<br><br>", "<b>Username: VMT</b><br><br>@KrishSC if you plan to attend grad school, I would contact both schools and inquire about grad school placement for engineering students. Also, in case you decide later on not to attend grad school, contact both career placement centers and find out where engineers work after their undergrad. I would suggest not focusing on salaries without context. If you work in New York City, you better make a lot more than if you work in the Midwest, except maybe Chicago.<br><br>I work for a global engineering company. We recruit at all the top Engineering schools in the country. NYU is not on our list. In addition to the obvious (MIT, Stanford, etc.) we recruit at most of the Big 10 schools, meaning Purdue, Illinois, Wisconsin, Michigan, Ohio State, Penn State, etc. I would not consider Purdue engineering and NYU engineering to be peers.<br><br>Yes, NYU is more selective in general. That does not tell you the whole story. Getting into Purdue isn't that hard. Succeeding in their engineering curriculum is.<br><br>I can't answer your question regarding your finances. I am simply pointing out that Purdue is widely respected as an engineering power house. NYU is not. I am not saying a degree from NYU is not valuable. I am not saying you would not find a job. I am just saying most of the world would rank Purdue engineering well above NYU engineering, and for good reason.<br><br>You have a lot of knowledgeable people on this forum telling you that Purdue is superior to NYU in engineering.<br><br>", "<b>Username: VMT</b><br><br>\"Hard fact is that I am in fact attracted by the reputation and I'm not going to lie.\"<br><br>If you are going to base your decision on reputation, make sure you know which one truly has the best reputation.<br><br>", "<b>Username: NoVADad99</b><br><br>I've never seen so much angst about a perceived slight to Purdue. Yes, it's an excellent school. But with COA the OP has at present, it doesn't make any sense to pay more for that education. Both schools will provide a good engineering education. There's a reason why Poly's graduates have such a high rate of return on their educational investment.<br><br>", "<b>Username: DrGoogle</b><br><br>Manchester is excellent for engineering. One of first office got a PhD in engineering. UCLA is good too, but Purdue is more affordable. But if you worry about prestige, why ask us about your choices. Just go with NYU period.<br><br>", "<b>Username: ucbalumnus</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/NoVADad99\">NoVADad99</a> wrote:\"\"<br><br>Prior to the full merger, Polytechnic Institute [of NYU] was pretty much all engineering majors, and had good financial aid (unlike NYU in general for those not getting merit scholarships), so its ROI as a standalone school was high.<br><br>NYU may very well be the better choice for the OP, but probably not for the reason the OP thinks it will be.<br><br>", "<b>Username: Chardo</b><br><br>\"\"NYU may very well be the better choice for the OP, but probably not for the reason the OP thinks it will be.\"\"<br><br>Exactly. He will pay less for NYU (btw, is that aid guaranteed?), and get a solid accredited education, but don't expect the \"NYU Engineering\" name to open any doors.<br><br>", "<b>Username: NoVADad99</b><br><br>@Chardo, NYU Poly has many foreign alumni who graduated decades ago and are now in high positions in those countries. There are active alumni networks in places like China, India, the Middle East, etc.<br><br>", "<b>Username: Chardo</b><br><br>^ But it was not NYU Poly decades ago. Those people went to Polytechnic Institute, a solid engineering school without the perceived prestige of NYU. The NYU name did not open any doors for those people, and they would enjoyed the same success from any number of other schools. My point is that NYU Poly is nothing more than a branding attempt to elevate an ordinary engineering school into something perceived to be better, and for NYU to show the world that they have an engineering school (even though it's 15 minutes away).<br><br>", "<b>Username: DrGoogle</b><br><br>OP, check out NYU Price Gouging thread in the parents forum.<br><br>", "<b>Username: ucbalumnus</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/Chardo\">Chardo</a> wrote:\"\"<br><br>Weren't financial difficulties the reason for Polytechnic agreeing to be merged into NYU? Of course, this reverses what happened decades ago, when NYU had to sell its engineering division to Polytechnic because of NYU's financial difficulties.<br>\"\"<a rel=\"nofollow\" href=\"/profile/DrGoogle\">DrGoogle</a> wrote:\"\"<br><br>Although NYU is expensive with poor financial aid in general (and significantly worse than Polytechnic had before the full merger), the OP has a scholarship that makes it significantly lower cost than Purdue.<br><br>", "<b>Username: DrGoogle</b><br><br>Post #49, why do they have to give merit money if NYU is more prestigious. My kid only got $10k per year from Purdue.<br><br>", "<b>Username: NoVADad99</b><br><br>@Chardo. I don't really care whether people call it NYU Poly or just Poly. Most of the alumni polled said they still refer to it as Poly, and were not in favor of the merger. IMHO the whole line of thinking about prestige is nonsense. But the result is still the same, a good education leading to good future earning potential. Given the OP has a scholarship, it's a no-brainer.<br><br>", "<b>Username: i012575</b><br><br>@KrishSC, I did my Mech Engg undergrad in the late 80s from one of the original IITs. Purdue was very well known then as it is now in India. From my graduating class, some of the highest achieving folks applied for their Masters/PhDs there.<br><br>I have been in the US since the early 90s (came here for an MBA) and can categorically tell you that Purdue is way up there when it comes to Engg., be it here or India. I had my D2 apply to Purdue last Fall, she is in GTech now for ChemE. Though I am not directly associated with the Engg. field, my associates and IIT classmates will give the thumbs up for Purdue over NYU Engg. Just coz it is easier to get into Purdue, does not imply that the competition or the competency of Purdue's Engg. students is any less. I live in Manhattan, BTW.<br><br>", "<b>Username: DrGoogle</b><br><br>Well, pick NYU because it's the most cost effective is fine as Novadad suggested but don't pick it because of prestige or if there is anything less about Purdue engineering.<br><br>", "<b>Username: NASA2014</b><br><br>If you're a reputation guy pick NYU, if not just pick Purdue.<br><br>", "<b>Username: LucieTheLakie</b><br><br>A \"reputation\" for what exactly, @NASA2014? And he should pay more for \"less reputation\"?<br><br>", "<b>Username: Chardo</b><br><br>It's a solid engineering school, as everyone has said. But I ask the OP, would you be interested in the school if it was still called Polytechnic Institute? Has the NYU badge, which is little more than marketing, clouded your opinion?<br><br>", "<b>Username: BatesParent2019</b><br><br>I would like to see the fine print on NYU's offer. Given that school's reputation he may give back the 15k differential a few times over.<br><br>", "<b>Username: KrishSC</b><br><br>Yes the NYU badge seems to have clouded my opinion for the reason that new faculty signings and the facilities ' quality increased only after the of merger. Apparently another friend of mine who's going to Purdue this year told me the estimated expenditure is 45k and yeah the 20k makes a difference. @iO12575 I'm sure of clearing the JEE advanced but I don't want to study in India. Would you say NYU Engineering is better than at least iit engineering even though it isn't as good as Purdue Engineering that even the ivies fail to match upto?<br><br>", "<b>Username: NoVADad99</b><br><br>I would not say NYU Poly engineering is better than IIT. Everything I've heard about IIT and the people I've met who graduated from there would lead me to think its equal in the US is MIT.<br><br>", "<b>Username: KrishSC</b><br><br>Oh my god. This is just heart breaking for me. I don't know what to do know. Reapply to better institutions next year and stay back in India?<br><br>", "<b>Username: KrishSC</b><br><br>Wouldn't that mean that iit is better than even Purdue fo engineering?<br><br>", "<b>Username: NoVADad99</b><br><br>Yes, that's what I think it means.<br><br>", "<b>Username: KrishSC</b><br><br>engineering.nyu.edu/news/2012/05/23/electrical-engineering-ranked-32-world-us-news-and-world-report<br><br>Is that inaccurate?<br><br>", "<b>Username: thatasiankid</b><br><br>Make the smart choice and go to Purdue. Both my parents work in engineering so I know that Purdue is most certainly a big name in engineering. I have no idea where you are getting the 100+ ranking.<br><br>", "<b>Username: i012575</b><br><br>@KrishSC, the short answer is No. I am biased of course but I would put the students of the original 5 IITs on par wit those of MIT/Caltech/Stanford and maybe a few others. My D2, who got into UCB/UMich (rejected from MIT and Stanford) and now at GTech would not have made it to the IITs. So I am pleasantly surprised that you are confident of making it to one and still debating whether to attend. I would strongly advise your doing your undergrad there if you get in... super value education! And if you do well in IIT, all roads (higher studies and jobs) are yours for the asking in the US. There are gazillion success stories of such cases. I did my MBA from HBS, my batchmate from IITB is the Dean of HBS now :-)<br><br>", "<b>Username: KrishSC</b><br><br>The quality of the IITs has declined since the 80s and 90s which is why I'm pursuing undergrad outside India.<br><br>", "<b>Username: BatesParent2019</b><br><br>@KrishSC<br><br>You asked for opinions without financial considerations. If there are indeed financial considerations you have to do what's best for you and your family.<br><br>I am a native NY area person but went to undergraduate and graduate school in the Midwest. I can tell you that over the course of each school year you will spend several thousand dollars more being in NY unless you eat every meal in the dining hall and dont go out. If you ever move out of NYU dorms you will spend 5 times what housing costs in West Lafayette. You may want to call or email Purdue and ask about work study. This could be worth a few thousand a year.<br><br>The one thing you have not mentioned is the whether the campus experience you will get at Purdue is worth anything to you. NYU has a huge commuter population and not much of a campus life. That is something you have to consider. Purdue has a vibrant campus and lots going on.<br><br>What are the terms of the NYU offer? Is there any risk the money goes away after the first year? NYU's reputation is very bad with financial aid and scholarships.<br><br>", "<b>Username: KrishSC</b><br><br>No the money is guaranteed for the four years.<br><br>", "<b>Username: BatesParent2019</b><br><br>Completely unstipulated?<br><br>", "<b>Username: KrishSC</b><br><br>There's a gpa requirement of 2 which I think is pretty manageable.<br><br>", "<b>Username: BatesParent2019</b><br><br>A 2.0 is all? Seriously?<br><br>", "<b>Username: KrishSC</b><br><br>That's what it says for me.<br><br>", "<b>Username: nycparent12</b><br><br>@KrishSC. I live in Brooklyn and while I would not say NYU Poly has a glorious reputation exceeding that of Purdue engineering, it does not deserve to be bashed, in my opinion.<br><br>Plenty of smart kids from NYC who can't afford to go away, or whose families would like to keep them close to home, consider it to be a good option. (Which does mean there are a lot of commuter students.) And there is a lot going on in Brooklyn. Maybe not on the NYU Poly \"campus\" if you want to call it that, but in many parts of Brooklyn, including near Poly, there are many places to eat, see music, etc. When people come to visit me from other parts of the US, they don't want to go to Manhattan... trust me, they want to go all around Brooklyn and see what the hype is all about.<br><br>Since you got a nice scholarship and money is an issue for you, and since you are planning for grad school, I think the biggest consideration is, as another has suggested, admission to grad school from Poly.<br><br>BTW, what about Umass Amherst w/honors? Why did you discard that option? Not shiny enough? Just curious.<br><br>", "<b>Username: DrGoogle</b><br><br>KrisSC, I second Novadad, you must be delusional if you think NYU is better than IIT.<br><br>", "<b>Username: NASA2014</b><br><br>I'm surprised he didn't apply to UIUC, which beats both Purdue and NYU in engineering<br><br>", "<b>Username: anaesabc</b><br><br>International parent here. I have not heard of Purdue University until my relative (government official] was sponsored by the government to study a master course in civil engineering at Purdue. I guess the engineering school must be very good otherwise he would not have been fully sponsored and taking full pay.<br><br>", "<b>Username: DrGoogle</b><br><br>Don't believe CC patents, google top graduate engineering, I think Purdue is in there.<br><br>", "<b>Username: Chardo</b><br><br>\"\"Yes the NYU badge seems to have clouded my opinion for the reason that new faculty signings and the facilities ' quality increased only after the of merger.\"\"<br><br>If you believe new faculty and better facilities make for a better engineering school, that would make University of Alabama one of the best. They have hired some esteemed faculty, and their new engineering complex is second to none. Should we now consider Alabama better than Purdue?<br><br>", "<b>Username: NoVADad99</b><br><br>But of course. Roll Tide!<br><br>", "<b>Username: Tigers01</b><br><br>For engineering, Purdue all the way and not even close.<br><br>", "<b>Username: KrishSC</b><br><br>I forgot to mention that I'll be taking Electrical Engineering. Googling NYU Engineering electrical engineering ranking I find it is number 32 in the world. Anyways, thanks to the cc community I've narrowed my choices down to NYU ENGINEERING, Purdue Engineering And University of Manchester. Please keep posting your views as this is really helpful to me. Thank you so much everyone.<br><br>", "<b>Username: KrishSC</b><br><br>My other insured option in University of Southampton but I chose University of Manchester for EE for other reasons.<br><br>", "<b>Username: KrishSC</b><br><br>Chose u manchester on the UCAS *<br><br>", "<b>Username: KrishSC</b><br><br>@Chardo, I don't know how this may sound to you but I haven't really heard of Alabama as well. But if it is getting amazing professors and brand new facilities it is bound to equal or surpass Purdue in the future, am I correct? Also can someone tell me if not for the facilities are the poly professors comparable or perhaps better than Purdue professors for electrical engineering after they check?<br><br>", "<b>Username: Chardo</b><br><br>^ Actually, no. Despite new professors and facilities, Alabama engineering is unlikely to ever equal or surpass Purdue.<br><br>", "<b>Username: Erin's Dad</b><br><br>That kind of thinking would mean UW Madison should be ranked #13 in the US. <url>http://web.archive.org/web/20070905010206/http://chronicle.com/stats/usnews/index.php?category=Universities&amp;orgs=&amp;sort=1983</url><br><br>", "<b>Username: DrGoogle</b><br><br>Madison is really cheap to for OOS, is it the same fee for internationals.<br><br>", "<b>Username: LucieTheLakie</b><br><br>@DrGoogle, $45,000 is \"really cheap\"? Maybe if you live in Minnesota!<br><br><url>http://finaid.wisc.edu/undergraduate-cost.htm</url><br><br>", "<b>Username: DrGoogle</b><br><br>Maybe a different major than. I thought @Madison posted that it costs $17k for pharmacy somewhere. Sorry I thought that was for undergraduate too. My bad.<br><br>", "<b>Username: KrishSC</b><br><br>I didn't apply to Madison. Most of my applications were made based on the overall rankings for the USA. Purdue was my safety.<br><br>", "<b>Username: KrishSC</b><br><br>That was kind of a mistake but no regrets. Want to make the best of what I have<br><br>"]}