{"title": "yale vs pomona and wes swat", "comments": ["<b>Username: judgemental</b><br><br>I really like Pomona and Yale. My mother really wants me to go to Yale. My father actually thinks I should go to an LAC over any larger school, including Yale, so there's some debate going on in my house.<br><br>", "<b>Username: jgraider</b><br><br>What would the cost be like for each?<br><br>", "<b>Username: judgemental</b><br><br>Aid isn't an issue. I don't expect to get much need-aid.<br><br>Oh, and I should also add that although my parents are rooting for me to go different places, the decision is ultimately up to me.<br><br>", "<b>Username: al6200</b><br><br>In terms of opportunities after graduation, I would lean heavily towards Yale. But if you're set on grad school or have connections, Pomona may very well offer a more personalized education.<br><br>", "<b>Username: blarghh</b><br><br>It's important not to get blinded by prestige when considering Yale.<br><br>If you truly believe that you'll get more out of a smaller, more attentive environment, go with an LAC. The academics are comparable, and might even be better for you if you like discussion-based classes and such.<br><br>Personally, I like Pomona's environment better than Swarthmore's (which has a reputation for being very intense). Wesleyan's is a bit harder to compare--since to me, it didn't feel like a classic LAC --it's more akin to a small university than a LAC, imo.<br><br>Also, if this is important to you, Wesleyan's dorms are vastly inferior to Pomona's. At least in the hall I stayed in, the bathrooms and walls were just plain terrible. Also, with Pomona, you get the benefits and variety of a small university (many different dining halls, 5000+ students from the 5C's, many more courses offered) but all the merits of a small LAC.<br><br>", "<b>Username: judgemental</b><br><br>I'm not huge on prestige, but Yale still offers a lot. And the school is very, very rich. I don't think I'd mind a gym, basketball court, and movie theater in my basement.<br><br>I do think I'll get more out of a smaller school, otherwise I wouldn't be considering Pomona. And the 5-C system is why I think it might be the best LAC to go to. At this point I can't imagine not going to some sort of grad school, and both schools seem to have great placement.<br><br>I actually liked Wesleyan's dorm setup (lots of theme-dorms, language dorms, etc). They also have a new freshman dorm that's very modern and nice. I really liked the Wesleyan students I met.<br><br>I've heard that about Swarthmore. I've also heard that a student that goes through Swarthmore and embraces the environment can get maybe the best education in the country. I'm not quite sure if I'd be willing to do that, though. Swarthmore also a 3 college consortium...and I really like Philly. I love the location maybe the best out of all the colleges I applied to, but I do not like the cold.<br><br>", "<b>Username: NuclearPenguins</b><br><br>What are you thinking of studying?<br><br>", "<b>Username: judgemental</b><br><br>Not sure. Maybe economics, maybe environmental science. My interests are pretty broad right now so I'm guessing I'll change my mind.<br><br>", "<b>Username: nazmom</b><br><br>FWIW, D is waiting to hear from Pomona, has been accepted to Williams (early write), MIT (EA), USC (still waiting on Yale, Stanford, and a few others) but Pomona is first choice because of well-rounded LAC environment, personal attention, lots of well-rounded students, and warm weather! I'm fairly sure that if she gets in to Pomona, she'll attend there...over some pretty great choices. She's also very keen on Williams, another great LAC.<br><br>", "<b>Username: engineerbill</b><br><br>Pomona is an incredible college.<br><br>Yale is one of the few colleges that I would consider over Pomona...<br><br>", "<b>Username: DunninLA</b><br><br>If the choice were Pomona v. Stanford, I'd say you'd get more personal attention at Pomona. However, with Yale I think you'll have a similarly focused and mentored experience to that of Pomona.<br><br>You have not articulated why you \"would get more out of a smaller school\". As I noted above, I don't think that would be the case with Pomona v. Yale. Unless you come to a point of clear preference, and not indifference, prestige is indeed a rational tie-breaker in favor of Yale.<br><br>I don't recall the details, but I read on this BB some comment about a more structured freshman year at Yale... almost a Core. Do you know about that?<br><br>", "<b>Username: engineerbill</b><br><br>Small Classes?<br><br>Student/Faculty Ratio:<br>6:1 - Yale<br>7:1 - Pomona<br><br>Classes with fewer than 20 students<br>79% - Yale<br>66% - Pomona<br><br>", "<b>Username: SISTOKID</b><br><br>Pomona is an incredible college.<br><br>Yale is one of the few colleges that I would consider over Pomona...\"<br><br>I 2nd engineerbill's comments<br><br>", "<b>Username: johnwesley</b><br><br>I have a funny feeling you'll be going to Yale. However, just to put things more into perspective, Wesleyan shares this much in common with Yale: both are located in the downtown sections of a small (by eastern standards) Connecticut city. In practical terms that means, there are places to eat and drink off-campus; places to purchase sundries. However much is going on during the school year, you never lose sight of the fact that Yale and Wesleyan are parts (fairly conspicuous parts, at that) of a larger community.<br><br>However, the history between Yale and New Haven has always been pretty rocky and beginning in the 1980s a lot of effort has gone into creating a gated community around Yale and puttiing as much distance as possible between it and the ordinary citizens of New Haven, many of whom are poor.<br><br>Middletown, perhaps because of its location, literally in the middle of a donut hole in the center of the state, has been able to dodge a good many of the urban problems that have marked its larger neighbors to the south and to the north. The neighborhoods around Wesleyan, are fairly middle-class; there are no gates separating it from Middletown. Kids from the neighborhood sled and snow board down the campus hill along with students.<br><br>This makes Wesleyan very different from Swarthmore and Pomona as well. At most elite LACs you can expect to spend all four years in the plush comforts of a dorm, mainly because that's all that is available; the surrounding communities are either too small or too expensive to support much in the way of student housing. However, dorm life also means four years of being dependent on dining hall food and, I have heard nothing good about the food at Swarthmore or Amherst. Not sure what it's like at Pomona.<br><br>Wesleyan students make the most of their downtown location by moving into university-owned \"wood-frames\", basically neighborhood bungalows that have been renovated and retrofitted with kitchens, college furniture and high-speed internet access. They are enormously popular and are made available through a lottery system where seniors are awarded the most points, then juniors and so-on and so-on.<br><br>So, yes, I would agree with the poster who said, that Wesleyan reminded them more of a small university than a LAC. I'd like to think of it as a small university with a strong sense of community.<br><br>", "<b>Username: bluebayou</b><br><br>Personally, I'm not a fan of college consortiums -- (what's the value in commuting somewhere else?), but Claremont's works really well. Of course, what makes it work well is the fact that the cross-registration makes it more of a mid-size Uni. While nice, a mid-sized Uni is not LAC-like. Of course, Pomona is top-dog in that town.<br><br>Yale is undergrad-focused, (and a mid-sized Uni)...not so much as undergrad-focused as Dartmouth, but still a lot more than H.<br><br>", "<b>Username: parent57</b><br><br>I believe the poster who asked what you will major in is asking an important question. For example, if you are interested in economics, finance or govt. and you think you want a career in these fields, in my opinion you would have a much better experience at CMC as opposed to Pomona. At the risk of getting attacked by all the Pomona aficionados, these departments are clearly superior, however should you want to major in the sciences or some other liberal arts areas then you can't go wrong with Pomona. I raise this issue because some students think they would prefer Pomona, but find out that CMC would be a better fit, given their personalities and academic preferences. Don't make this decision because of what other people think regarding which college is the \"top dog\"<br><br>", "<b>Username: judgemental</b><br><br>Thanks for the replies. I'm really changing my mind a lot.<br><br>@Dunnin- Pomona doesn't have a grad school. Yale has plenty of classes taught by TA's, which is why I hesitate. I also saw a lot of large classes while I was walking around, but maybe that was unlucky. All the Pomona classrooms were very small, and a lot of them just had a big table. I'd interested in discussion-based classes, not just listening to lectures. I feel like its more personal and I have a better chance of doing the things I really want to do. From the students I've spoken to it seems as if the administration and faculty will do a lot for its students. I'm not sure I get that feeling at Yale for undergrad. I've also heard that the intro classes at Yale can get pretty big, but I'm not sure if that's true.<br><br>@engineer- I'm not sure how to interpret your statistics- does that include the faculty and classes at the grad schools? How big are the intro classes? How many classes have more than 50 students?<br><br>@johnwes- I knew a lot of that already from my visit, which is why I disagreed earlier about the Wes dorm comment. I really like the Wes dorm setup. Not sure I agree about Middletown- I didn't like the location very much, but I don't love New Haven either for obvious reasons.<br><br>@blue- I'd expect the value in commuting somewhere else would be to take a class that you otherwise would be unable to take, and interact with students you otherwise would not interact with. I also got the feeling, though, that the Claremont consortium was much more integrated than the Amherst and Swarthmore consortiums. This is a little cliche, but I think it gives the best of both worlds- small LAC with a larger community of students.<br><br><br>@parent- I also applied to CMC and am familiar with the school. It seemed to me that CMC attracted a certain type of student- those interested in economics, government, and finance, like you said. My answer to the question about my major is a reasonable one, I think. And because my interests are broad right now, Pomona seems like a better choice than CMC. Even if I do decide to go into economics, the Pomona economics dept is still very strong. I think its the most popular major at Pomona. And even then, thats only like 6% of the student body, which shows how diverse academic interests are at Pomona. It's one of the reasons I like the school. CMC also requires a few courses, and I'm not big on requirements.<br><br>", "<b>Username: bluebayou</b><br><br>\"\"I'd expect the value in commuting somewhere else would be to take a class that you otherwise would be unable to take, and interact with students you otherwise would not interact with.\"\"<br><br>Yeah, I get the supposed value proposition, and to me its mostly spin. For example, when I toured Amherst the guide made a point of saying how her roomie was taking classes (plural) at UMass in Accounting. While of course, the tour guide was promoting it as a great opportunity, in the back of my mind I was thinking, 'hmmm, why pay private LAC (and Amherst) tuition to take classes at a large public?' Heck, for that matter, our local junior colleges offer great courses in accounting. My kid even came to that conclusion, 'Dad, if I wanted to attend class at a large public, I'll stay home and go to a UC.'<br><br>The same holds true for \"interacting with other students...\" If that is a desire, why not just attend a larger college in the first place?<br><br>And yes, a consortium works very well at the Claremonts, but in some respects, they are more like a mid-sized Uni. If that is the case, why not just choose a mid-sized Uni, i.e., Yale? What is the point of bothering with a collection of LAC's which form a mid-sized Uni?<br><br>Not trying to disparage LACs, which I think are wonderful. I just see little value in the consortiums per se.<br><br>", "<b>Username: judgemental</b><br><br>Right. So Yale has a lot more classes with 50 or more students. I'm guessing most of those are introductory classes, at least a few of which I'm likely to take. I know they split into TA groups, but I'm not very interested in that. I'm sure both Pomona and Yale and any other top school have plenty of small advanced classes.<br><br>And the second statement in that quote was just a general observation about smaller schools, not just smaller classes.<br><br>Basically my academic criteria includes few core requirements, small classes, and few TAs. I like to have things to do, though, so I like the social aspect of a larger school. Pomona seems to fit both those with its small size and the consortium. I highly doubt I would be disappointed with Yale's academics. I'm just not sure whether I would like Pomona's more (or less). My other concern about LACs is that there may be a limit of courses in something I'm interested in, but the consortium also takes care of that problem.<br><br>I'm also a little bit concerned about weather, because I'm from Florida and I've never been through a real winter. I generally don't like being in the cold. Pomona obviously wins there.<br><br>In my head all these are logical reasons for why I should prefer Pomona over Yale, but I really liked my visits to both and Yale was my top choice before I started visiting schools.<br><br>", "<b>Username: judgemental</b><br><br>I expect that Amherst, being Amherst, does not offer classes in accounting, haha. The other reason would be that UMass practically offers an unlimited number of courses, which small LACs obviously can't offer. Hampshire classes are very different from classes at the other schools (no grades, etc). I have an Amherst friend who is taking a Smith class and a Hampshire class...you don't necessarily need to take a class at UMass if you think its a waste of time.<br><br>From what I've seen of the Claremont Consortium, the schools integrate, but they are still very much individual schools. Pomona and CMC have a bit of a rivalry. Each school has its own personality. There's also a limit on cross registration at the schools, and I know at Pomona you can't major in something at another school. It's a bunch of small schools pooling resources so that they can offer their students more... CMC offers Arabic, for example. None of the other schools do.<br><br>Interacting with other students can be in desire, but not necessarily a priority. I'm interested in LACs for the academic benefit, even though I'd probably be more comfortable socially in a slightly larger place. I see a lot of benefit to a consortium.<br><br>", "<b>Username: bluebayou</b><br><br>There are plusses and minuses to each locale/school. Good luck with your decision.<br><br>", "<b>Username: Anonymous91</b><br><br>It should boil down to where you want to spend four years of college. Forget prestige, especially if you're going to grad school, where Pomona holds just as much prestige as Yale.<br><br>I am currently a sophomore econ major, EA minor at Pomona. Never had a class over 30 students. Its very possible that for every class you take at Pomona, the professor will know your name. Coming from a high school where every class was at least 34 students, I experienced quite a change having 7 kids in my French class and 10 in my American history class freshman year.<br><br>CMC's economic dept. is not superior to Pomona's unless you really want to go into accounting/finance, which they have more courses in. Other than that, the departments are at least equal, and I would argue Pomona's theory courses are taught at a higher level. There is a misconception that CMC's econ dept. is superior to Pomona's just because CMC basically revolves around econ, but thats like saying that oranges from a country that solely produces oranges are better than those of say, a more diversified agricultural economy that also produces oranges.<br><br>I know Pomona is an amazing place, and I really like the student body here. Mostly everyone is relaxed, friendly, and social. There is no competition whatsoever. There are problems with Pomona, as with any school, but I doubt I personally could find a better collegiate experience anywhere else (the food here is also amazing I might add).<br><br>I cannot comment on what I do not know, so I will not speak of Yale. Just giving a personal perspective. Best of luck!<br><br>", "<b>Username: parent57</b><br><br>I disagree with the previous poster regarding the comparative merits of the economic departments. If you look at the Spring course schedule for both schools, I think that will give you an objective basis to compare as opposed to our subjective opinions. You should also focus on the fit between your personality and the school. The kids at CMC tend to be very social and extroverted, probably because many of them were involved in leadership activities in high school. I sense that the kids at Pomona are not as social and may be considered a bit wonkish. CMC is known as the school where you work hard and play hard. Also, the CMC students are involved in many extracurricular activities, such as internships, student govt, research institutes, etc. The schools are quite different and you need to see which one is a better fit. Some kids visit, look at the buildings and make a decision without really understanding the inherent qualities of each of the schools<br><br>", "<b>Username: parent57</b><br><br>The statement by anon91 that CMC revolves around economics is absolutely false. The school has many other strong depts, such as english lit, psychology, history, international relations, asian studies, religious studies, PPE, philosophy, languages and a very good joint science program. The politics,philosophy and economics program is patterned after the Oxford tutorials and is considered one of the best in the country. The poster (anon91) who made the above statement is obviously clueless regarding CMC and should be ignored.<br><br>", "<b>Username: parent57</b><br><br>Engineerbill, maybe I didn't make myself clear but I was referring to anon91.<br><br>", "<b>Username: johnwesley</b><br><br>What is it exactly that CMC students do besides throw parties?<br><br>", "<b>Username: parent57</b><br><br>So Mr. Wesley you seem to be hankering for a fight. Rather than answer your smart aleck question, why don't you visit the campus and figure it out yourself.<br><br>", "<b>Username: johnwesley</b><br><br>I don't have to. The folks at CMC are busy enough tooting their own horn. I especially like the one where everyone's standing around, taking pictures of a car:<br><br><a href=\"http://www.youtube.com/watch?v=jYBiYW1yubA\" rel=\"nofollow\">YouTube - Claremont McKenna: Life as you don't usually see it</a><br><a href=\"http://www.youtube.com/watch?v=PRTegJSP9jU&amp;feature=related\" rel=\"nofollow\">YouTube - CMCNation: Claremont McKenna College</a><br><a href=\"http://www.youtube.com/watch?v=vyqBDgFmKTQ&amp;NR=1\" rel=\"nofollow\">YouTube - Claremont Mckenna College embraces 83seconds.com</a><br><a href=\"http://www.youtube.com/watch?v=DFOsOb6818s&amp;feature=related\" rel=\"nofollow\">YouTube - My Favorite CMC Moment</a><br><a href=\"http://www.bing.com/videos/watch/video/roller-force-tutorial/425550379029eeb6c8fd425550379029eeb6c8fd-763282129709?q=claremeont-mckenna&amp;FROM=LKVR5&amp;GT1=LKVR5&amp;FORM=LKVR18\" rel=\"nofollow\">Roller Force Tutorial - Bing Videos</a><br><a href=\"http://www.youtube.com/watch?v=BLCppbpIrpU\" rel=\"nofollow\">YouTube - Time Lapse of Green Beach</a><br><a href=\"http://www.youtube.com/watch?v=xziYvBfccTM&amp;feature=related\" rel=\"nofollow\">YouTube - Claremont Concours '05 - Ferrari 360CS</a><br><br>", "<b>Username: judgemental</b><br><br>^It looks like the car video is of a public car show (Concours)... I would think anyone interested in going to a car show would take pictures.<br><br>", "<b>Username: johnwesley</b><br><br>Yes. Near as I can make out, this was sponsored by the Claremont Colleges Automotive Enthusiasts Club (CCAEC) It was open to the public. The proceeds went to charity. VROOM, VROOM:<br><a href=\"http://www.youtube.com/watch?v=pChouwUvPrE&amp;feature=related\" rel=\"nofollow\">YouTube - Claremont Concours' 05 - Lamborghini Gallardo</a><br><a href=\"http://www.youtube.com/watch?v=yi7nG-ReyjI&amp;NR=1\" rel=\"nofollow\">YouTube - Claremont Concours '05 - Ferrari 360 Spider</a><br><br>", "<b>Username: cbreeze</b><br><br>\"\"The kids at CMC tend to be very social and extroverted, probably because many of them were involved in leadership activities in high school. I sense that the kids at Pomona are not as social and may be considered a bit wonkish. CMC is known as the school where you work hard and play hard. Also, the CMC students are involved in many extracurricular activities, such as internships, student govt, research institutes, etc.\"\"<br><br>Do you have any concrete examples that Pomona students weren't involved in leadership activities in high school ? Or that they aren't social? Wonkish? All of them? Did they acquire these \"senses\" when you stepped on Pomona's campus for 10 minutes? Or by hearsay?<br><br>I don't know whether you are a true CMC parent or not, but you are the first of any Claremont Colleges' parents who's biased to the point as to denigrate the other school in the same consortium.<br><br>", "<b>Username: cbreeze</b><br><br>parent,BTW, I am not hankering for a fight as you asked another poster. I do think some comments you made here are totally untrue and irresponsible.<br><br>", "<b>Username: parent57</b><br><br>Hi cbreeze, didn't mean to upset you. CMC emphasizes leadership and looks to admit students who exhibit these qualities. Many times they will reject students with better grades and test scores who don't demonstrate these leadership qualities on their application. Although I am sure Pomona is not indifferent to this aspect of a student's application, it is not explicitly emphasized to the same degree. Consequently, CMC students tend to be very social and extroverted and may have a more vociferous social life than Pomona students. If you go to the Pomona thread, many of the people there disparagingly criticize CMC ( unfairly, of course) for the party atmosphere. As for me being the first parent who has compared schools in a subjective manner, I suggest you research the Pomona thread. There have been countless examples of Pomona parents and students over the years who have belittled CMC in the many CMC/Pomona comparative threads. I can remember one Pomona parent who said that CMC is a macho school, whatever that meant. Just so you know, I think Pomona is a great school and a student will receive a great education there. The schools are different and some students will love one and not enjoy the other due to the all important \"fit\". Let's not rile up the jwesley poster, you never know what you are going to get with him.<br><br>", "<b>Username: parent57</b><br><br>Hey engineerbill, Beat up? I don't know - I think I give as good as I get. Didn't you know that CMC folks are well-known for their pugilistic skills. Since we have been accused of being macho by a Pomona parent, it must be so.<br><br>", "<b>Username: johnwesley</b><br><br>\"\"Let's not rile up the jwesley poster, you never know what you are going to get with him.\"\"<br>hey, you'll get no argument from me; there are plenty of bros at Wesleyan:<br><url>http://4.bp.blogspot.com/_XlLhnDRpOmc/RuxJnnVfHlI/AAAAAAAAAQw/5Qp5c281DvM/s400/pastedGraphic.jpg</url><br><br>", "<b>Username: parent57</b><br><br>You have a problem with those kids? I think you could use that picture as a recruiting poster for Wesleyan.<br><br>", "<b>Username: parent57</b><br><br>Okay guys, I had fun but I think I have better things to do now. See you on another thread in the future.<br><br>", "<b>Username: judgemental</b><br><br>I got into Pomona and CMC yesterday :)<br><br>", "<b>Username: cptofthehouse</b><br><br>Have you already been accepted to Yale?<br><br>Looking at the schools, all things equal, I would pick Yale. However, a visit might make all of the difference in the world. The schools have major differences in atmosphere. My son who is at a small LAC picked it over an ivy, hands down because he just loved the school. Loved everything about it and felt it was home. Didn't feel that way about other more selective, more well known colleges. And you might feel that way about some of the other schools, particularly Pomona which is very different from the east coast schools. If you spend a day at Yale and feel at home there, it's a fantastic pick. If you don't like it there, and, yes, there are kids who don't, see if you feel much better at the other schools. In your case, don't visit on Accepted Students Day, but on an ordinary day, and ask to shadow a freshman there that would have a schedule similar to what yours would be.<br><br>", "<b>Username: judgemental</b><br><br>Yale decisions haven't come out yet... I just posted this to fill the time. I'm not that worried about it now that I've got into a lot of great schools. I'm actually leaning towards Pomona right now. I think I'd be happiest there. But if I get into Yale I am going to try to overnight there.<br><br>", "<b>Username: judgemental</b><br><br>Accepted to Yale!!<br><br>Now I'm really stumped. Going to visit in a couple weeks.<br><br>", "<b>Username: johnwesley</b><br><br>Told ya. ;)<br><br>", "<b>Username: JackUK</b><br><br>Just a quick question - does anyone what the acceptance rates are this year at Pomona, CMC and the other Claremont colleges? Thanks.<br><br>"]}