{"title": "nyu vs northeastern vs bu", "comments": ["<b>Username: brxndon</b><br><br>Assuming I were to get into all three of these schools, which would you say is the most worth attending? My dream is NYU but my parents cannot afford it. Is it worth the loans? Any tips on affording NYU? Any scholarships you'd recommend I apply for (I am an NHRP finalist)? And if it were to boil down to BU & NU, which would you choose? Thanks<br><br>", "<b>Username: proudterrier</b><br><br>Go to the one that offers you the most money. Seriously. You can't go wrong with any of them, and I don't think ANY of them are worth massive loans. Now, one of them may be worth *some* loans (I think borrowing 5-10K a year can be reasonable, depending on what you plan on going into and if you have no better option, ie: no school option that is \"free\"), but you can't really make that decision until you have acceptances and financial aid packages in front of you. And in the event you ended up with all three (or two of them) in front of you with offers that are basically the same, it would totally come down to what you plan on studying, and what campus/social atmosphere you're looking for.<br><br>", "<b>Username: brxndon</b><br><br>@proudterrier well then that pretty much rules out NYU since their financial aid is known to be pretty bad. and I don't know if this helps but I plan on studying political science &amp; then going to law school. if not, perhaps majoring in psychology &amp; then going on for my masters. i liked all 3 of these colleges when I visited them. I look for a very liberal, city-like feel. I do not really dig the whole traditional, Boston College-y feel. I feel like BU has a good name but Northeastern is on the rise, especially with its co-op program that interests me a lot. but thanks for the info :)<br>P.S. your username is \"proudterrier,\" did u by any chance go to BU? haha<br>&amp; as far as \"free\" goes, there is a chance I may get a full ride to Fordham Lincoln Center but I do not think it is on par with these other schools. BU also already offered me a 20K scholarship.<br><br>", "<b>Username: proudterrier</b><br><br>Yep, I am a very happy BU alum :) So, you'd probably be happy at either BU or NEU if you like urban (I did too!), so you can get into the nitty-gritty of either or. BU can be harder to get a high GPA at, which can matter for grad school admission. That said, the course rigor at BU is really excellent, but those who are aiming for grad school should always be aware that BU has grade deflation. BU's study abroad options are better, IMO, and there are several programs that can be a boon to political science, especially the Washington D.C. program and the London Programme (they have internships with Parliament).<br><br>On the flip side, there's a real benefit to NEU's co-op system--the ability to do a whole semester internship, say, at the Boston State House would be amazing, or using that whole semester to go to D.C. for an internship. I would definitely look in depth to placement options for political science at NEU to see if they have relationships with places that speak to you. NEU is definitely on the rise, as you say, and I've heard they can be really competitive with aid--you may find yourself with a very attractive package.<br><br>Let me know if you have questions about BU!<br><br>", "<b>Username: brxndon</b><br><br>@proudterrier grade deflation is definitely something that worries me, especially since i am interested in grad school &amp; am also so used to maintaining a high GPA. how did u manage with the whole grade deflation thing? also, how r dorms? I saw one dorm and it was pretty tiny, not to mention i don't know how i feel about community bathrooms. i liked the brownstones but i realize they may be pricier and only available to upperclassmen. any recommendations on the best dorms to apply for frosh year? I like the idea of an apartment/suite style dorm.<br>P.S. I know this isn't academic related, but what is the party scene like at BU? frats? house parties? off campus clubs/bars?<br><br>", "<b>Username: suzyQ7</b><br><br>@brxndon You said BU already offered you 20K - that means you are an early decision candidate there then right? Doesn't that meant that you have to go there and withdraw your other applications?<br><br>", "<b>Username: brxndon</b><br><br>@suzyQ7 actually they e-mailed me saying that because I am an NHRP finalist that if I get in, they'd offer me a 20K scholarship for that.<br><br>", "<b>Username: suzyQ7</b><br><br>Ah- but you haven't applied yet? So, assuming you get in, you will get 20K. That's good. You will not get that much from NYU... sounds like NYU is just too expensive. Have applied to any Northeastern yet? I thought you needed to apply early to both BU and NEU in order to be considered for merit scholarships like that.<br><br>Assuming you get the NHRP merit at either BU or NEU, will you be able to afford the balance or will you still be eligible for financial aid? If law school is in the future, you really want to go to the cheapest school... these 3 schools are very similar in caliber and style. Follow the money...you won't regret it.<br><br>", "<b>Username: brxndon</b><br><br>@suzyQ7 haha lemme clear some of this up. I have already applied to NU &amp; BU regular decision (but I did before the December 1 date so I'm good for merit scholarships). and i see exactly what you are saying as far as law school. it is very expensive but who knows? maybe i can go to nyu for law school since it is top-ranked. but i think for now i should save money. and yes these scholarships for NHRP are aside from normal aid. I do not think there will be a huge difference in the aid i get between NU &amp; BU (again, this is what i think, we will have to see). so if it boils down to BU and NU, I am just wondering which would be better. it seems that BU vs. NU is a very popular topic here. they are like 5 minutes apart! but what is worrying me about BU is their grade deflation since I wanna go to law school or get my masters. also, i like the whole co-op thing and how u do not pay tuition when u r on it. the only way i would go to nyu is if i get a bunch of third party scholarships (which i will try my best to get). i do live in nj tho, which makes nyu pretty convenient. BUT ANYWAYS, sorry this response is all over the place lol but i appreciate your feedback :)<br><br>", "<b>Username: ClarinetDad16</b><br><br>Where else are you applying<br><br>", "<b>Username: suzyQ7</b><br><br>If you get third party scholarships, you should be able to apply them to any school, reducing what you will need to pay even further at BU and NEU. I don't know - being from NJ - it may be really nice to get a way from the NY metro area for a different experience in Boston. And save lots of cash. Love the school that loves you.<br><br>You'll have to go to revisit day at both BU and NEU to decide. They are similar, but the coop makes NEU different. You have to LOVE the coop - its ingrained in the school and the semesters are slightly different because of it. Which is great for kids who want that more mature college experience. BU is a little more traditional in their 4 year 'standard' schedule, but also a great school with great academics. I've heard about the deflation - not sure if that is the case for all majors or just hard science, CS, Bio, etc...<br><br>", "<b>Username: brxndon</b><br><br>@ClarinetDad16<br><br>1. Columbia (I do not really need to ask about this one since it is my reach &amp; if i get in, i do not see one reason why i would not go lol)<br>2. NYU<br>3. BU<br>4. Northeastern<br>5. Fordham Lincoln Center (I hear they give full rides sometimes to NHRP finalists)<br>6. UCONN<br>7. Pace University<br><br>", "<b>Username: brxndon</b><br><br>@suzyQ7 that is honestly a REALLY good question and could probably be a huge deciding factor for me. i'll have to ask and revisit. if you had to choose though, which would you choose? thanks for ur feedback again :)<br><br>P.S. if anyone knows if grade deflation exists if u major in poli sci or pysch, please tell me!<br><br>", "<b>Username: juillet</b><br><br>Where are you in-state? Are you in-state to UConn? Because if you aren't, and if money is an issue, you should add one or two in-state public universities to your list that you know you can get into and afford.<br><br>Boston University is one of the most expensive universities in the country - the cost of attendance for a full-time undergraduate student is estimated to be over $65,000 a year. If you get a $20K scholarship (which would be great!) that would still leave you with over $45,000 to pay per year. Can your family afford that? NYU is known for being stingy but BU isn't known for being particularly generous, either.<br><br>Fordham is a great school; if they offer you a full ride take a good look at it. I'd take a full ride at Fordham over paying $45K a year at BU any day of the week.<br><br>Are you first-generation? Even if you aren't, you are eligible for the Frederick Douglass Scholarship program at American University - check it out (<url>http://www.american.edu/financialaid/fdsprogram.cfm</url>). There are also other merit awards - they offer ones for students in the National Merit program. George Washington University also offers merit scholarships to NHS (<url>http://undergraduate.admissions.gwu.edu/scholarships</url>).<br><br>", "<b>Username: suzyQ7</b><br><br>I would pick NEU for the amazing coop and traditional campus. But, that's me... I love the idea of 6 months of work and 6 months of school for the last years of college. You could do a prelaw track, work coop in a law firm, and later decide \"I love law!\" or \"Law is not for me\"... All before junior year. Most people don't end up in the field they think they would at 18, NEU gives you an opportunity top experiment with careers.<br><br>", "<b>Username: brxndon</b><br><br>@suzyQ7 I agree completely, I am leaning towards NEU too but of course I will still revisit and keep an open mind :)<br><br>", "<b>Username: brxndon</b><br><br>@juillet Unfortunately, I am from NJ and to be honest, aside from Princeton, we have some pretty **** schools. I mean I guess Rutgers and TCNJ are not bad but still. I can def afford Pace though, and most likely Fordham (I will definitely keep and open mind with Fordham).<br>And I know BU would offer me the 20K but that is aside from NORMAL financial aid and plus I submitted my application before December 1st, which means I qualify for even more money.<br>I am leaning towards NEU now to be honest, but I am going to look into those scholarships (esp, at washington). I am also hispanic and already an NHRP finalist so if there r any other scholarships u can think of for latinos, let me know! thanks for the feedback :)<br><br>", "<b>Username: swimchris</b><br><br>@brxndon Just to let you know I believe NHRP finalists get $30k automatically at Northeastern (same as NMF). <url>http://www.northeastern.edu/admissions/cost-financial-aid/scholarships/</url><br><br>", "<b>Username: brxndon</b><br><br>@swimchris Yes! I've heard about that! BU offered me a 20K scholarship as well. Northeastern is looking very attractive to me to be honest.<br><br>", "<b>Username: NickFlynn</b><br><br>One issue with Northeastern is their 4 year graduation stats kind of suck relative to peer schools, and (anecdotally) I have heard this is because of the co-op program. Adding a 5th year of college will have a significant impact on your costs. I think it is something to think about, or at least get more information on.<br><br>", "<b>Username: brxndon</b><br><br>@NickFlynn yes i have heard this. I think the key is to not do too much co-op's, only like one or two. so i'll definitely talk with my counselor to make sure I graduate in four years. but thanks i'll def keep that in mind if i go there!<br><br>", "<b>Username: TomSrOfBoston</b><br><br>most programs at northeastern a=an be done in 4 years with 2 coops or 5 years with 3 coops. Their 6 year graduation rate is 84%, comparable to BU's 85%.<br><br>", "<b>Username: brxndon</b><br><br>@TomSrOfBoston yeah ideally i'd like to do two co-ops, at LEAST one! but I think two is a good number. thanks for the feedback! :)<br><br>", "<b>Username: stones3</b><br><br>just to inform you brnxdon, TCNJ is an awful lot better than \"not bad\" you really should do some research , its a better school by far than Pace and is right there in terms of undergrade programs with BU and Fordham for the most part.<br>heck depending on major its better!<br><br>", "<b>Username: TomSrOfBoston</b><br><br>\"\"is right there in terms of undergrade programs with BU and Fordham for the most part.<br>heck depending on major its better!\"\"<br><br>@stones3 Source of this claim?<br><br>", "<b>Username: brxndon</b><br><br>@TomSrOfBoston @stones3 i agree with pace but idk about fordham and bu..<br><br>", "<b>Username: TomSrOfBoston</b><br><br>Pace is not good. TCNJ is still Trenton State College with a new name and marketing campaign.<br><br>", "<b>Username: brxndon</b><br><br>@TomSrOfBoston lol I'm not actually going to pace it's just there as the ultimate safe. I'm not even considering pace, tcnj, rutgers.. any of them lol. lowest i'd go is uconn or fordham<br><br>", "<b>Username: ClarinetDad16</b><br><br>Why not add in a few Philadelphia based schools?<br><br>", "<b>Username: brxndon</b><br><br>@ClarinetDad16 I saw Villanova, Upenn, &amp; Drexel. I did not like Villanova. I did not like upenn (I prefer columbia &amp; yale). I liked drexel but northeastern is way better for co-ops.<br><br>", "<b>Username: ClarinetDad16</b><br><br>What about Temple?<br><br>", "<b>Username: brxndon</b><br><br>@ClarinetDad16 one of my best friends goes there. i guess that would be a good safe school but i hear the area is not very safe<br><br>", "<b>Username: ClarinetDad16</b><br><br>What is the anticipated ROI on each school.<br><br>If NYU costs 4x Temple (for Presidential Scholars), I would imagine it is worth a long look.<br><br>Campus Safety - you can review the published stats on each school. Temple campus is supposed to be very safe.<br><br>", "<b>Username: brxndon</b><br><br>@ClarinetDad16 I mean out of the schools on my list, NYU seems to be the only stingy one since BU offered 20K and Northeastern offered 30K (aside from normal aid). and fordham i have a chance at a full ride. but i appreciate the feedback and will def look into temple since i hear they give great aid! :)<br><br>", "<b>Username: wlester</b><br><br>@ClarinetDad16 True, the Temple campus is safe. The Temple police department is the 3rd largest in the state (behind the Pittsburgh and Philadelphia PDs obviously). However, there's no denying that the area around campus is really sketchy. Not just sketchy by white suburbanite standards. Most students still don't have any problems though, Temple is still definitely worth a look.<br><br>", "<b>Username: dessie411</b><br><br>Northeastern is a great school! I go there, absolutely love it! If you have any questions I'd be happy to answer!<br><br>", "<b>Username: brxndon</b><br><br>@dessie411 if you could briefly answer these q's that'd be great :)<br>1. How is aid? (both normal aid and scholarships -- i am qualified for the NHRP one)<br>2. What made u choose NU over BU (if u were even considering BU)?<br>3. How is the party scene? (not that i'm going to college to party but... frat parties? house parties? clubs?)<br>4. Have you benefited from co-ops? Does it shorten your breaks?<br>5. Let's say I were to take a co-op in california. i know i do not pay tuition for that time, but how would i go about paying to live in cali in order to work there? is this why i am not paying tuition? so i can come up with the money to live there? does NU cover it? this part confuses me.<br>6. I am very much interested in going to law school, perhaps northeastern or NYU law school. I was thinking of majoring in political science. do u recommend that? I am very much interested in the VOGUE magazine co-op so i was wondering if a minor in journalism would help me get it. i was thinking writing a lot for journalism might also prep me for law school. but i am open to any majors, minors, or co-op's you would suggest :)<br><br>sorry for all the questions haha<br><br>", "<b>Username: stones3</b><br><br>get tiresome to keep doing this but, #1 public in north by USNWR and #3 overall in north. Top 75 most competitive schools in the entire nation as per Barrons,. # 20 ranked accounting program in the entire nation as per accounting.com. top 71 schools as per money mag out of 736. #6 ranked natioanally for graduating the most students<br>fastest in the country. #63 ranked undergraduate business program in the nation. Also a Princeton review pick for top 200 best value schools in the entire nation. A freshman retention rate of just over 94%, also ranked as one of the happiest campuses in the country.:) The College of New Jersey will receive the first Campus-wide Award for Undergraduate Research Accomplishment (AURA) from the Washington, DC-based Council on Undergraduate Research (CUR). This annual award recognizes institutions that have devised exemplary programs providing high-quality research experiences to undergraduates and is one of only three schools to receive this award. TCNJ also has the #2 ranked ED program in the nation. Add to that the other numerous recognitions and the widely accepted fact that they have an outstanding STEM program which is even getting stronger with the new 100mm facility being built as we speak. Consider all this , one of the nicest campuses anywhere and a reasonable price. That enough proof?<br><br>", "<b>Username: Qwerty568</b><br><br>@NickFlynn, you don't pay tuition to Northeastern during your co op, so you are only paying for four years of college, not five. In fact, the fact that NEU has a fifth year would lower costs, as students make money during their co op. It won't make a huge dent in tuition, but it's something.<br><br>", "<b>Username: NickFlynn</b><br><br>I know there is no tuition during the co op, but there still are financial implications.<br><br>1) Your co op salary might not generate enough income to fully cover your living expenses.<br>2) Many students at non-co-op schools end up taking more than 8 semester to graduate - with the tighter schedule required under the co-op system, the odds of this are raised (less opportunity to take classes over summer, higher odds of missing required classes because you are on co-op, etc.)<br>3) Even if you get out on-time on a 5 year program, you lost one year of earnings.<br><br>Not saying any of these are necessarily deal-breakers or certainties, but they are something that merit some consideration.<br><br>", "<b>Username: TomSrOfBoston</b><br><br>\"\"higher odds of missing required classes because you are on co-op\"\"<br><br>The way Northeastern is structured around coop you do not \"miss\" anything while on coop, unlike at schools where coop is optional.<br><br>", "<b>Username: dessie411</b><br><br>1. If you're admitted, you automatically get the NHRP scholarship and priority consideration for the University honors program (which is a pretty good deal, considering that comes with a guaranteed scholarship if you choose to study abroad/do a co-op)<br>2. I looked at BU before I decided on nursing-I liked Northeastern's campus better. BU seems just to be a few buildings on the block-Northeastern has quads and grassy space.<br>3. Partying isn't insane here or a priority for most people, but if you want them, you'll be able to find them.<br>4. My first co-op begins in Summer II of next year. They do shorten your breaks, but I haven't heard many people complain about that. A lot of students fall in love with their co-ops and have a great time; you're also not taking finals or doing homework for that entire semester, so that's a benefit as well.<br>5. Most co-ops are paid. Northeastern tells you that that money will basically only be enough to cover housing. If you take an unpaid co-op, you will need to come up with a way to pay for housing (in areas where they have a lot of students on co-op, Northeastern has living space that you can rent, sort of like dorms.<br>6. Political science is a good major and a minor in journalism would probably help you get that particular co-op. However, we have co-ops all over the place, including in some law offices and the statehouse. You'll have plenty of opportunities to check out different options.<br><br>", "<b>Username: happy1</b><br><br>Between BU and NEU, I'd go to the school that gives the most money. If the money is the same, then go with your personal preference. TCNJ is definitely worth considering if you are from NJ as is Fordham if you get money from them. I would just wait and see how the acceptances and $ come in and then re-post if you want opinions.<br><br>", "<b>Username: achilles900</b><br><br>I think you should also keep in mind that New York is substantially more expensive to live in than Boston. New York has 7% percent sales tax, which makes day to day purchases a little pricey, and rental prices in New York are counted amongst some of the highest in the world. You could find cheaper rental prices by living in one of the 4 boroughs other than manhattan, which are cheaper but still pricey. Despite the higher costs, I would definitely choose New York over Boston if I were you. I admittedly have spent barley any time in Boston, but I am from New York, and therefore I am bias, but I do think it is the bigger and better city, which is reflected in the higher living costs.<br><br>", "<b>Username: 0000811135</b><br><br>Northeastern over NYU with all things being equal in my opinion. Amazing campus, co-op is great , school really on the rise. Regardless of aid I would say northeastern is a better choice and they are a lot more friendly on aid than nyu anyway.<br><br>", "<b>Username: warblersrule</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/brxndon\">brxndon</a> wrote:\"\"<br>Law school is primarily about your GPA and LSAT score. Your choice of major matters relatively little, and successful law students majored in everything from philosophy to math to ancient Greek. Co-op programs, extracurriculars, internships, and the like are all well and good, but they'll matter far less than your GPA and LSAT score.<br><br>NYU is definitely the strongest of the three universities and has quite a few top-notch programs, including political science. Unfortunately, as you know, it is notoriously hit-or-miss with financial aid. BU is relatively well-rounded but with fewer standout programs. Northeastern is still noticeably lopsided (its strongest offerings are in STEM), but it is a school on the rise with aggressive marketing and ambition.<br><br>Law school is extremely expensive, and job prospects are not as good as they used to be. Keep your costs down for undergrad. You can get into a good law school from nearly anywhere.<br><br>", "<b>Username: proudterrier</b><br><br>Totally quibbling here, but OP why would you go to Northeastern for law school? They're ranked 86, compared to NYU's 6 ranking (and BU Law is ranked 26, BTW). Northeastern is a much better bet/investment for undergrad, as opposed to law school. If you have a solid GPA and can nail the LSATs, aim for top twenty law schools. Rankings actually really matter for law school, way more than they do for undergrad.<br><br>Also, if you're seriously considering journalism in any permutation, if BU gives you a competitive package, seriously consider it. BU journalism is top notch, with unique study abroad/internship opportunities, to boot. (does Northeastern guarantee a co-op at Vogue? That seems like it would be hella competitive--would you get that co-op as a JO minor, over a student majoring in it? Is the co-op guaranteed for NEU kids every year? Don't decide to attend NEU b/c of one co-op opportunity! It's possible they promote a Vogue co-op b/c one or two students have done it in the past) Anyway, I've advised you before: go to the school that gives you the most money. I don't think it's worth agonizing over now until you get your acceptances and your fin-aid packages in April. Good luck with applications :)<br><br>", "<b>Username: SoulfuLemon</b><br><br>Back onto topic (and I hope I'm not too late), for undergrad, I'd pick NEU. Rankings have been flying in many sites over the years and it is now tied with BU at #42 in US News (and I predict it will rise even further). Given a 30k scholarship from NEU vs a 20k scholarship from BU I'd go NEU, even if the scholarship money was the same! I got into both these schools with no scholarship unfortunately :( but I'm happy to pay the full ride for Northeastern I'll be attending in the fall :)<br><br>", "<b>Username: philbegas</b><br><br>I apologize for resurrecting the thread, but I was curious what OP picked and why<br><br>"]}