{"title": "princeton vs mit", "comments": ["<b>Username: fretfulmother</b><br><br>Hi, there are only old-ish threads on this comparison. I'm asking in the P forum I guess because I have a bias for my DS in that direction...but would anyone like to opine on issues/questions to consider for a student lucky enough to have this choice to make?<br><br>", "<b>Username: renaissancedad</b><br><br>I presume you have eliminated Yale?<br><br>Your son knows MIT well. IIRC, he has done PRIMES, and you are an alum. It's a question of picking the environment that he knows well and which is in his backyard, vs. picking something different. I'm personally a fan of the latter in general. I grew up in the Boston area but went to Stanford partly because I wanted a different experience and a fresh environment, and that was definitely an added educational factor.<br><br>", "<b>Username: gormar099</b><br><br>Honestly, of all the schools your son's been accepted to, I'd probably choose Harvard, but between Princeton and MIT, it's hard to say. I'm sure you're aware Princeton is very undergrad-focused while MIT is less so. I'm fairly certain there aren't frats at Princeton, but there are eating clubs, whereas frat life is somewhat prevalent at MIT. With regards to drinking culture, it's probably about the same, maybe a bit more prevalent at Princeton. For any STEM major, both Princeton and MIT are amazing, and I really don't know if an employer would see a degree from one any different from a degree from the other. Whatever he chooses, don't look back, and know he has 4 amazing years ahead of him.<br><br>", "<b>Username: GnocchiB</b><br><br>\"\"I'm fairly certain there aren't frats at Princeton,\"\"<br><br>There are frats at Princeton, though they are not officially recognized/sanctioned. Students cannot join until fall of sophomore year. They really do not have a huge impact on the social life, especially compared to the eating clubs.<br><br>I think you already know which college I'd recommend : )<br><br>", "<b>Username: Cantiger</b><br><br>Congratulations on your son's admission to some really great schools!<br><br>A friend of my son's was in a similar position of choosing between MIT and Princeton and she ended up at Princeton. Neither she nor my son are into the partying culture and there is more than enough to do to keep busy and have fun without venturing onto the Street (eating club area) at all if you so choose. Both of them are engineers and now accepted to high level grad schools so it is certainly doable. In fact, most of their friends are going on to at least their Masters, and some into fully funded PhD programs. My son has already had job offers (not at the high Wall Street starting level but very good none the less) through some of his Princeton contacts. His friend had a job waiting at a firm she interned for over several summers.<br><br>You said your son is in STEM but didn't indicate which field. Engineering at Princeton tends to be highly theoretical but they absolutely teach their students how to think and problem solve. My son was shocked at how easy a related course was that he took at a nearby university so theory certainly does not mean easy.<br><br>Has your son looked at the integrated science program at all? It's extremely challenging and would certainly stretch those students who need an extra challenge.<br><br>If as a STEM major your son is interested in the classics as well I think he will find Princeton a better fit than MIT. This was certainly part of some of my son's friend's decision making...she liked the wide variety of opportunity to learn from top scholars in a range of fields at Princeton.<br><br>", "<b>Username: tellmecombo</b><br><br>\"Specific questions that I have are about employability, grad school admissions, research/job opportunities on campus (he is in STEM), and finding one's social place if one is very friendly and excited to hang out with new people, but not remotely into the \"partying\" culture in terms of alcohol or frats/exclusivity. (Is it socially awkward to have to work while in college, at either place?)\"<br><br>I had to make the choice a few years back (damn I'm old). I chose MIT. Most of those considerations were things that were high on my priority list also, so here's my input:<br><br>1. Employability: I think MIT wins over princeton, simply because tech is becoming more and more important. Technology will boom in the 21st century the same way physics experiened a boom in the early 1900's.<br><br>2. grad school admissions: No specifics, but all my friends who went academic and were serious students got into top schools in their field.<br><br>3. research/job opportunities on campus (he is in STEM): UROP's (research for undergrads @ MIT) are awesome. If your son is at all interested in EECS, there's now a super UROP. Basically a UROP, but more cool and better paid. It's pretty much as good as it gets.<br><br>4. Social: I'd say MIT is probably a more diverse place socially than Princeton simply because different cultures collect around different living spaces (froshes get to pick and develop their housing culture), and each diverge. You can pretty much find anything. I was never into the party scene @ MIT and had loads of fun and made many very good friends.<br><br>In short, I think MIT wins hands down for STEM.<br><br>", "<b>Username: tiger2468</b><br><br>How is the entrepreneurial/innovation culture at Princeton? I love how MIT is amazing in technology/STEM, but I also like the more diverse student body that you can find at Princeton.<br><br>Also, how do the research opportunities compare? I know that Princeton focuses more on their undergrads, but they seem to have fewer labs (especially in the physical sciences). On the other hand, at MIT, there are many labs but also many grad students.<br>I am interested in CS, chemical engineering, and physics as of now.<br><br>", "<b>Username: fretfulmother</b><br><br>Thank you so much @renaissancedad - yes I think Yale is out of the running because they offered so much less financial aid and I can't see them being better choices for DS than the others at this point. I totally see your point about the familiarity.<br><br>Thank you very much @gormar099 - that's interesting; why Harvard per se? And thank you for the advice not to look back because that is a worry of mine :)<br><br>@GnocchiB - thank you! :)<br><br>@Cantiger - thank you very much; I have read a lot of your answers on P threads and they are very insightful. My DS is leaning toward ChemE but also is slightly interested in ORFE after someone told him that's the mathy-est one. He did look at the Integrated Science sequence but I think it's not a great match for him because he would like to do the big humanities sequence instead and pick/choose his STEM courses in line with his APs in those areas.<br><br>@tellmecombo - thank you also! You are saying a bunch of things I know being an extraordinarily happy alum of MIT. :) Oh, it is so hard, as a mom hoping for the \"best\" decision. :)<br><br>", "<b>Username: gormar099</b><br><br>I'd choose Harvard just because of personal, subjective preference. There is something about the history behind it, knowing that you're on a campus that has been the pinnacle of education for nearly 400 years (although it's probably the same with Princeton), it's kind of hard for me to put it in words. I also love the house system as well as Harvard's architecture (that being said, Princeton's architecture is hard to beat). But, as a STEM major, I would only choose Harvard for Science or Math. I think MIT's CS would blow Harvard's out of the water and MIT and Princeton's engineering is also significantly better.<br><br>But back on topic, I think it sounds like Princeton is a better fit for him. The only way I think MIT would be a better choice is if he is 100% set on Engineering, just because I think MIT Engineering is unparalleled. I know ORFE has Engineering in the name, but my understanding was always that it was more like a Finance degree than an Engineering degree (please correct me if I'm wrong here). I think he'll fit in very well at Princeton, since the Math department there is amazing (ranked 3rd in the world on USNWR if that means anything to you). Also, I think humanities have a much greater emphasis at Princeton than at MIT. Just looking at the class of 2016, this link <url>http://tech.mit.edu/V133/N48/majors.html</url> says only 7 students enrolled in a degree in a humanity, arts, or social science other than Econ @ MIT. Has your son given an indication as to a preference? Please let us know what he chooses!<br><br>", "<b>Username: fretfulmother</b><br><br>@gormar099 - thank you for all those details!! I'm always so surprised and pleased about how internet strangers help each other. :) So yes, I can see the appeal of Harvard because of all that.<br><br>I think yes, my DS is set on engineering as his big focus (and major) - but he does like Classics. And Mandarin, and other kinds of subjects. One of the things he has loved most about HS (possibly second to his mathy stuff) is the deep discussions they get into when he's in History or his sociology-type units in humanities. I'm sure they do that also at MIT, but possibly more at Princeton.<br><br>He's going to CPW and to PP and possibly this decision might be down to the wire. (He will also go to Visitas but cannot make Bulldog Days due to Passover. One of his YES-W friends just committed to MIT, he found out tonight.) It's such a bummer that a person can only choose one college, in many ways!! And I know he is incredibly lucky and privileged to have this choice, so please don't think we are taking anything for granted at all.<br><br>", "<b>Username: critter</b><br><br>@fretfulmother - I'm sure as an MIT alum you already know this, but our S said that he was told over and over by the students that CPW was not at all representative of the real life of a student actually attending MIT. He was told that tests were not allowed during that time period so the atmosphere would be more relaxed. He said it was quite a production and he had a wonderful time. He also said he had the best food there of any of his visits (at the MIT frats)! Even if you have to choose one college, at least you will enjoy getting a 'taste' of each one and will have many well-deserved, happy memories. Good luck with your decision making!<br><br>Oh, and our S '13 did not choose MIT or an Ivy in the end, but he did go for a top-notch academic school on the other coast. He had non-STEM interests as well, which pushed MIT down his list. I know he would say to go for Princeton under the circumstances. He thought peers that were hyper-focused on STEM would be potentially better for grad school. He definitely made the right decision for him. His younger brother, S '16, is in the process of making a similar choice. But they both have friends that could not imagine turning down an acceptance to MIT. Which environment can your S not imagine giving a pass? And to be honest, none of our kids would have considered going to a college in their own back yard. They had too many other new experiences on their wish list, including location and peers.<br><br>", "<b>Username: fretfulmother</b><br><br>@critter that is very helpful! I didn't know that about tests not being allowed during CPW. When I went, there was a very different visit; it was just for women and minorities and did not have a zillion activities by every possible affinity group. You are right about a taste of each college! :)<br><br>In terms of \"which environment can your S not imagine giving a pass?\" - that is the hard one. (All of them??) :)<br><br>", "<b>Username: fretfulmother</b><br><br>I am very grateful for all the help here. I was thinking last night that part of this is that in my heart I loved MIT so much that it kind of represents the ne plus ultra of college in my life. And let's be honest, this point of view gets some support in real life and from CC. ;) Part of this process is the cutting of the umbilical cord enough for DS to be doing his own falling in love, even if we are very similar in certain ways.<br><br>In particular, there are two differences between me and him that are likely game-changers here. First, he adores studying and discussing history whereas I not only was thrilled not to have to take it in college, I also did a special program in high school to qualify for one semester less of social studies. Second, he is a lot more mature personally (and two years older) than I was going to college, so he is just more aware of world issues, current events, social justice...and really engaged in these.<br><br>I have a feeling that all of this is pushing toward P.<br><br>", "<b>Username: texaspg</b><br><br>There is one thing people always find odd about Princeton - exams after holidays. I know a few peopel who gave that as a reason for not going there.<br><br>", "<b>Username: midatlmom</b><br><br>As a Princeton alumna and the mother of two Princetonians, I think that the exams after holiday issue recedes well into the background if you matriculate at Princeton - not an issue at all.<br><br>Congratulations to the OP and her son on some wonderful choices. In terms of an interest in classics, Princeton has an amazing department and the professors are incredibly strong (joshua katz is just wonderful!). I also have a lot of knowledge about the history department- once again, professors are strong and caring and inspire the students. Your son can't go wrong, but all I can say is that Princeton has an extraordinary commitment to undergraduate education and the teaching in the history and classic departments is first-rate.<br><br>", "<b>Username: texaspg</b><br><br>Econ at MIT is supposed to be one of the best departments in the world. It sounds like it is being wasted if only 14 students do Econ.<br><br>", "<b>Username: fretfulmother</b><br><br>@midatlmom - Thank you! That is good to know (though also not surprising!)<br><br>@texaspg - I am fine with a nice girl finding my son as a husband while at Princeton. I think college is a great time to find a mate.<br><br>", "<b>Username: texaspg</b><br><br>@fretfulmother - based on @sbjdorlo's graduating son's experience at MIT, it can also happen at MIT. :)<br><br>", "<b>Username: Cantiger</b><br><br>My now-senior BSE son said there is no way he could have prepared for exams before Christmas with all the rest of his work load. He generally took a week or so off and then did some light study for the remainder of the holidays, coming in ready for reading week and feeling refreshed. Having a week off (or more depending on your exam schedule) at the end of January was great and he was always ready to tackle second semester in February.<br><br>", "<b>Username: sherpa</b><br><br>@fretfulmother - Your son sounds a bit like mine, who was a strong STEM student but whose interests went well beyond the sciences, for example having enjoyed all the history APs in HS. When he applied to Princeton he listed his possible majors as physics and philosophy; ultimately, he believes the topics are inexorably interwoven.<br><br>One attribute of Princeton that hasn't been mentioned is the writing seminar which is required for all freshmen. I thought DS was a very good writer coming out of HS, but the writing seminar was definitely beneficial for him.<br><br>As for the odd winter break schedule, my son liked it that way. He'd come home for a relaxing holiday with a little light studying knowing he'd go deep into finals prep during \"reading period\".<br><br>", "<b>Username: PtonAlumnus</b><br><br>I studied engineering at Princeton and went to grad school at MIT. Both are outstanding universities. I will attempt to provide some of my experiences at each university.<br><br>Pro features of MIT<br>MIT has the best engineering school in the country. There are more engineering students, more engineering professors, and more engineering courses. There is more of most things in ChE at MIT. His roommates will probably be studying STEM. Some of the liberal arts courses are far better than most people understand. Boston is the best college town in the US. MITs engineering contacts are outstanding. There are more MIT engineering alumni than Princeton engineering alumni.<br><br>Frat culture is alive and well at MIT.<br><br>Similarities<br>ORFE are very good at both universities. ORFE is a very popular major at Princeton; the Sloan School has been a leader in the field. Employ-ability is probably a wash. Tiger Trek is a sponsored trip to Silicon Valley to visit with companies such as Apple, Facebook, Google, Khan Academy, Telsa Motors, Twitter, Square, Juniper Networks, Hewlett-Packard, and several venture capital firms. Possibly more Wall Street at Princeton and more aerospace at MIT. Grad school acceptance would be similar; however, a student that loves MIT or loves Princeton may do better academically at that school and receive better faculty recommendations for grad school.<br><br>Pro features of Princeton<br>Princeton is focused on providing the best undergraduate experience in this country. The quality of the engineering professors and the quality of the engineering courses are very similar. Engineering education at Princeton began in 1875. The National Research Council has ranked Princeton as having top PhD programs in Chemical Engineering, Civil Engineering, Electrical Engineering, Mechanical Engineering, and Computer Science. At Princeton his roommates may be history majors, economics majors, public policy majors, and a STEM major. Princeton students love their on campus activities so much that they mostly stay on campus. Many Princeton engineering students start their careers as engineers and are promoted into general management positions. The MIT campus looks like it was designed by engineers; the Princeton campus is gorgeous and has many buildings designed by world famous architects. The Princeton campus has dozens of art sculptures around the campus to make art a part of campus life. Since Princeton is half way between the United Nations and Washington D.C. world leaders are constantly giving lectures on the Princeton campus.<br><br>The strength of the engineering program at Princeton is that STEM is very strong at Princeton AND students can take outstanding courses in philosophy, the classics, history, sociology and other liberal arts subjects. Google CEO Eric Schmidt discusses his reasons for attending Princeton over a STEM university in this video: <url>https://www.youtube.com/watch?v=o0gtoWwx5Is</url> Half of Princeton students change their major; the variety of strong majors entices students to switch to a new field.<br><br>Fraternities are a minor factor at Princeton. One-third of the students choose not to join one of the upper class eating clubs. There are substance free dorms. Your son can find many activities that do not involve partying or alcohol. Murray Dodge has free chocolate chip cookies at night.<br><br>", "<b>Username: fretfulmother</b><br><br>Thank you @PtonAlumnus ! Those videos are really interesting. I didn't know all those tech CEOs were from P. And thank you for laying out your thought process as well, very helpful!<br><br>", "<b>Username: PtonAlumnus</b><br><br>Both universities have long lists of Tech CEOs. Here are just a few more tech CEOs from Princeton.<br><br>About 5 or 10 years ago the CEOs of British Aircraft Corporation, Lockheed Martin, and The Boeing Company were all Princeton MAE alumni. I can only remember two or the three; Philip M. Condit MAE *65 was at Boeing and Norman R. Augustine BSE57 MS 59 was at Lockheed Martin. After he retired Norman R. Augustine taught engineering management at Princeton and currently serves on the MAE Advisory council. George Whitesides '96 is the CEO of Virgin Galactic and also serves on the MAE Advisory council. James McDonnell 21\twas the CEO of McDonnell Douglas. Andy L. Tung MAE 87 is the of COO Dragonair, Hong Kong. George B Rathman *51 was the founder and CEO of Amgen, the worlds largest biotechnology company.<br><br>The STEM students at Princeton and MIT are very similar. The SAT math 75th percentile at both Princeton and MIT is 800. Since less than one quarter of the Princeton students are engineers over half of the engineering students may have scored 800 on their math SATs. As might be expected Princeton students score higher on the 75th percentile in critical reading (800 at Princeton to 770 at MIT) and the 75th percentile in writing (800 at Princeton to 780 at MIT).<br><br>", "<b>Username: PtonAlumnus</b><br><br>I forgot about this link.<br><br>The Bloomberg Magazine rated the Top Ten Colleges for Tech CEOs. Bloomberg rated MIT as number 7 and Princeton as number 1. See <url>http://www.bloomberg.com/slideshow/2013-08-29/top-10-colleges-for-tech-ceos.html#slide11</url><br><br>", "<b>Username: fretfulmother</b><br><br>Thank you, @PtonAlumnus!<br><br>", "<b>Username: TheEisgruber</b><br><br>I'm a mechanical engineering student at Princeton. I will concede that MIT is the objectively better STEM school academically; however, I would choose Princeton again in a heartbeat given the choice between the two. For one, Princeton is a much smaller school, with a really strong alumni network that will help in your career throughout your life. Also due to the smaller size, research opportunities on campus abound.<br><br>Princeton's frat life is almost nonexistent, although the eating clubs somewhat take their place. However, many students choose not to participate in activities on \"The Street,\" and there are plenty of other ways to meet/hang out with friends on campus. There are many close-knit communities on campus that aren't into drinking/partying, and even in the eating clubs there are non-alcoholic groups and events. Even at parties, I have found that although there is definitely alcohol, there is less social pressure to drink if you don't want to, relative to other colleges I've been to. There are also substance-free dorms (which have the added bonus of being generally quieter/cleaner than regular dorms).<br><br>Princeton is perfect for the engineer with a passion for the arts and humanities. The university art museum is amazing, and frequently hosts mixers for students. Campus is gorgeous and in a great location - quiet and isolated, but just a short and inexpensive train ride from NYC and Philly. It also has an amazing history, and the surrounding town is safe and attractive.<br><br>", "<b>Username: fretfulmother</b><br><br>@TheEisgruber - thank you! Can you please say more about the substance-free dorm thing? (Do they have those at MIT as well?) Are they the same as the residence colleges and how does a person indicate a preference about that?<br><br>Thank you for your thoughtful answers; they are exactly the kinds of things that DS and we are thinking about. Do you mind if I ask: (a) did you apply to MIT and (b) where are you from originally?<br><br>", "<b>Username: PtonAlumnus</b><br><br>The substance free dorms are a section of the residential college. For example, one entry way may be designated as substance free. During the summer your son will receive a housing questionnaire. From this questionnaire the university assigns students to a substance free dorm and attempts to match compatible roommates.<br><br>", "<b>Username: TheEisgruber</b><br><br>@fretfulmother Like PtonAlumnus said, substance free dorms are within the residential colleges. They are generally a separate building or entryway. To be clear, substance-free dorms do not require that its residents abstain from any substances (alcohol, tobacco, etc.); those substances simply may not be inside the building at any time. Some students who do drink still prefer to live in sub-free housing.<br><br>I did apply to MIT; however, I committed to Princeton before hearing back. And I'm originally from California.<br><br>", "<b>Username: fretfulmother</b><br><br>@Boobyhatch - you make a great point. Ironically, since MIT would be a lot cheaper for us, I think DS would feel somewhat more pressure to do a STEM career if he goes to Princeton.<br><br>I myself ended up changing what I thought I wanted to do at MIT (though there was never any risk of me majoring in the Humanities, because of my distinct lack of talent).<br><br>We have had a very angst-ridden set of conversations since DS came back from MIT's CPW, which was 99% excellent in nearly every dimension for him. The two big drawbacks were the small Jewish community (relative to Princeton) and our sense that MIT might not stretch DS to grow as a person in the same ways that Princeton would. MIT kind of matches him already, if that makes sense.<br><br>One of DS's favorite aspects of MIT (and please tell me it also exists at Princeton...?!?) - was the really productive options that kids have to have fun, not just an alcohol scene, but e.g. exploring tunnels, or building stuff out of bubble wrap, having long conversations over board games, etc. DS felt like he was making potential friends at every turn, and that made a big impression.<br><br>(I should reassure any stereotype-holders about MIT that my DS is the type who plunges in and talks to new people and has a great time in almost any situation - exceptions being heavy drinking or heavy athletics.) So for instance, I was thinking that the new Princeton thing with the week of community service in small groups, will probably lead to lifelong friendships for him...are there other things like that?<br><br>", "<b>Username: texaspg</b><br><br>\"\"The two big drawbacks were the small Jewish community\"\"<br><br>I am not advocating for one or the other but I think this part is being overthought. If he is almost home, why does he need another jewish community at college when he has the entire town he is already used at his disposal?<br><br>", "<b>Username: fretfulmother</b><br><br>@texaspg - I understand your point, but I think it's important that DS have at least enough of a Jewish community at school that he can (1) get kosher food easily without having to cook all his own meals; (2) have services without having to be an integral part of them (i.e. \"if someone wants a Purim service, who can lead it?\"). MIT generally does have both of these, but it's borderline, which is to say - only dinners and some lunches are available kosher without a lot of effort, and many religious services happen but each student is called on for significant volunteering to make it happen.<br><br>I would not consider it ideal for him to have to still be part of our home synagogue community instead of really bonding to his new Hillel. I think there are different models for this, and certainly there are religious students of many faiths who do look to churches in their towns instead of campus communities, but I think it would be preferable for DS to have a campus community.<br><br>", "<b>Username: texaspg</b><br><br>@fretfulmother - have you checked with MIT about the food availability? I think the colleges should ensure people have this choice available irrespective of the size of the jewish student pool.<br><br>I am under the impression that even students of some other faiths depend on kosher food simply because it meets their requirements too.<br><br>", "<b>Username: fretfulmother</b><br><br>@texaspg - yes - there is officially kosher food. In reality, it is only dinners (with some lunches) and it is all \"meat\" or \"parve\" i.e. non-dairy, except for special events. This is more than some colleges offer, so I don't want to sound spoiled! :)<br><br>When I went from a small midwestern town to MIT in the late 1980s, they had kosher dinners and it seemed incredible to me to even have this option! So it's workable for DS, yes, but not optimal.<br><br>Most kosher-keeping college students are also ok with finding kosher ingredients like cereal, milk, fruit, yogurt in the general dining halls for breakfast. (Some would not be, but for our family it's ok.)<br><br>In comparison, Princeton (and about a dozen other colleges nationwide) has a full 20/week kosher meal availability.<br><br>BTW Caltech does not have kosher food available officially on campus. In the late 1990s, a girl told them that was why she was picking MIT instead, so Caltech wooed her by installing a kosher kitchen (for dinners only, in the residence halls). I was there for grad school and ate there occasionally while it existed. About ten (?) years ago, the kosher food was cancelled by Caltech, I think for lack of use. There are Jewish groups around Pasadena, like Chabad, that do try to do outreach and provide some kosher opportunities, but it would not be a comfortable place for an observant Jewish kid to live from what I can tell.<br><br>ETA I found this link from 2002 about Caltech's kosher food (which is now defunct as far as I know):<br><url>http://articles.latimes.com/2002/aug/10/local/me-kosher10</url><br><br>", "<b>Username: PtonAlumnus</b><br><br>If your son decides that he would like to attend Princeton you could appeal his financial aid package. Princeton does not match other university grants but have been known to reconsider Princetons financial aid. Princetons grants are often the most generous grants offered to a student. If you want to appeal I would show the Princeton financial aid official his letter from MIT. An appeal might or might not increase his grant. Since in 2014 Princetons per student endowment ($2,621,000) was about 2.5 times MITs per student endowment ($1,099,000). Princeton might be able to increase your financial aid package.<br><br>Princeton has had an active Jewish life for over 100 years. The Student Hebrew Association (SHA) hosted Albert Einstein in 1948. The SHA became an official member of the Hillel Foundation in 1947. In 1971 the first university sponsored kosher kitchen in the Ivy League opened. The Center for Jewish Life opened in their current faculty in 1993. The Center for Jewish Life houses an Orthodox Jewish synagogue. The university has developed jewelry and belts that incorporated keys to accommodate Sabbath-observant practices. In 2015 the university installed an eruv, or a virtual boundary to enable observant Jews to carry essential items outdoors without breaking the Sabbath. Ambassador Daniel Kurtzer has conducted educational trips to Israel. Marina Rustow the Khedouri A. Zilkha Professor of Jewish Civilization in the Near East won a MacArthur Fellowship for her use of the ancient Cairo Geniza texts to shed new light on Jewish life and on the medieval Middle East. She specializes in Jewish studies of the medieval Middle East. Rustow has analyzed Cairo Geniza, a collection of more than 300,000 folio pages of legal documents, letters and literary materials once preserved in an Egyptian synagogue. Kosher and halal meals available in all residential college dining halls.<br><url>http://hillel.princeton.edu/kosher-dining/</url><br><br>", "<b>Username: fretfulmother</b><br><br>@PtonAlumnus - thank you! You are right that P is super generous with need-based aid. However, my husband works (not faculty so no reciprocity) at MIT which makes it very discounted (not free) to attend MIT. :) The difference between P and M is something that we told DS we can manage, so we're trying not to let that be a huge factor (though it is a distraction, yes!).<br><br>I know about the wonderful Hillel, but thank you for more info on all the background and Jewish life! I notice that P also seems to be really committed to supporting diversity including religious diversity, in an open and helpful way.<br><br>Do you happen to know what the population is at a typical Friday night (sabbath) dinner at the CJL?<br><br>", "<b>Username: PtonAlumnus</b><br><br>From the CJL web site:<br>Shabbat is the highpoint of Jewish life at Princeton. Every Friday night, the CJL holds an amazing Shabbat dinner with nearly 200 students in attendance. Before dinner, there are weekly prayer services (Reform, Conservative, and Orthodox), in addition to other prayer groups that meet every month (such as our partnership minyan, Namer, and a musical indie minyan, Zamru). On Shabbat day, students of all backgrounds spend time at the CJL to eat together, go to services, and hang out.<br><url>http://hillel.princeton.edu/about-us/faqs</url><br><br>If your son can attend Princeton Preview he should fill out the prospective student form to request a host for his visit. <url>http://hillel.princeton.edu/about-us/visiting</url><br><br>", "<b>Username: fretfulmother</b><br><br>Thank you - he did already register for PP but didn't request a Hillel host particularly. Should he contact the official Princeton people to correct that?<br><br>", "<b>Username: PtonAlumnus</b><br><br>Princeton students volunteer to be a host to prospective students for PP. The admission office will assign a host to your son. To learn more about Jewish life at Princeton I suggest that he fill out the form found here:<br><url>http://hillel.princeton.edu/about-us/visiting</url> The Hillel hosts are arranged through Hillel.<br><br>You can call CJL at (609) 258-3635 or call Rabbi Julie Roth at (609) 258-6248. Princetons small student body enables personal contact. I believe that you will be pleasantly surprised how easy it is to find a friendly contact at Princeton.<br><br>If he does not make advanced arrangements he could visit the Center for Jewish Life building located near the Frist Campus Center at 70 Washington Road. For engineering majors it is more convenient to eat your meals at CJL than at a residential college.<br><br>", "<b>Username: fretfulmother</b><br><br>Thank you!!<br><br>", "<b>Username: NJMom97</b><br><br>I asked my freshman daughter whether the social life at Princeton revolves around the eating clubs, and she told me no, it does not. One of her friend groups is from one of her extracurricular activities. Sometimes they will go as a group to an eating club party, but they also socialize by hanging out in the common room in someone's dorm, playing board games, cards, or just talking. She is a non-drinker, and no one has ever pressured her to drink. She says some students drink, some don't, and no one cares what's in your cup.<br><br>Just about all undergrads at Princeton live in campus housing. Freshmen and sophomores are required to live in one of six residential colleges and are on the meal plan. Upperclassmen have additional housing options that don't require being on the meal plan. All campus housing is within walkable distance. An undergrad's friends all live close by which makes it easier to socialize and form study groups.<br><br>My daughter tells me that students at Princeton are serious about their studies and care about their grades. She loves living and learning in a community of students who are passionate about their academic interests.<br><br>I hope this is of help to you, fretful mother. I would like to PM you but I can't figure out how to do so on my phone. Please PM me, and I will respond.<br><br>", "<b>Username: fretfulmother</b><br><br>Thank you, @NJMom97! I will PM you. It's not easy on a phone but I believe it is possible - I can do it either if I choose \"view whole site\" or if I use the app which I believe is now officially \"unsupported\" so not available for download. (??)<br><br>"]}