{"title": "yale vs harvard", "comments": ["<b>Username: nondescript1</b><br><br>I know this kind of thread has been posted before, but I am really struggling mightily with this decision so any help is appreciated.<br><br>", "<b>Username: gibby</b><br><br>Congratulations -- what wonderful choices! See post #4. I stand by everything I said several years ago: <url>http://talk.collegeconfidential.com/yale-university/1483765-choosing-yale-over-stanford-and-harvard-p1.html</url><br><br>No matter which school you choose, you have make a leap of faith. Some Administrators at Harvard are trying to make it more like Yale, but there's been pushback from Harvardians. So, there are transitional issues at Harvard as well: <url>http://www.thecrimson.com/article/2016/3/2/final-club-yale-model/</url><br><br>The big plus for Yale IMHO is the four year residential college system (as opposed to Harvard's 3-year residential system, which really sucks for Harvard freshman as they are not included in house activities). I truly believe that Yale's Administration will continue that inclusion with the introduction of the two new colleges.<br><br>FWIW: My son, who graduated last year from Yale, didn't have any issues with the City of New Haven.<br><br>Enjoy Visitas and Bulldog Days! Let your gut tell you which institution feels like a home for the next four years!<br><br>", "<b>Username: T26E4</b><br><br>^ There's no better advice than what Gibby just wrote. Congrats! Go Yale!<br><br>", "<b>Username: nondescript1</b><br><br>Thank you both very much for your input! I am looking forward to visiting them both. I really think that I'm more of a Yalie at heart, and I probably would have made my decision already had it not been for some Yale Daily News articles expressing concerns from faculty members and students over the 800 student expansion. I will go with whatever school feels like home during my visits.<br>@T26E4 I recognize your profile picture as the JE Coat of Arms. We stayed there for YYGS over the summer, what an absolutely amazing place!<br><br>", "<b>Username: Memmsmom</b><br><br>You will find that the biggest differences are in the student climate and how they treat you. Are you on your own or are you part of a whole? Are you one who is a solo artist or are you a team player? Harvard fosters being on your own and can have a very competitive feeling to it. Yale is very community based and is more social in its overall appeal. Those were some of the bigger points my daughter dealt with. She also loved the 4 years of belonging somewhere rather than only 3. You only get 4 years and at Yale you are welcome everywhere. You belong to a residential college family before you even move in. The kids in your freshman dorm are your family. But you are still welcome to eat in any of the dining halls, study in any of the RC libraries and use any of the rooms in the basements. Everyone is welcome. Harvard on the other hand has a separate freshman dining hall, freshman housing where you only see freshman and you spend one whole year a little separate from the rest of the classes. Some people will like this fact because it gives you a chance to acclimate and some feel it exclusionary. As her close friend that attends Harvard said,\"What do you mean everyone is welcome at a Yale party?\" - apparently at Harvard they are all invitation only. LOL<br>So far my daughter LOVES New Haven, she feels very secure there and her favorite part of walking on campus is hearing the bells. As for the expansion issue, she is only a freshman and so far 3 of the classes she has taken only had between 5 and 15 kids in it. This isn't a single high school. It is a very large and experienced university. Im pretty sure they will be just fine with the growth.<br><br>", "<b>Username: Anonymoose3</b><br><br>@Memmsmom - I just wanted to let you know that you just convinced me not to chase after my Harvard waitlist when there's an amazing school that loves me back. :)<br><br>", "<b>Username: Memmsmom</b><br><br>You will literally think you are at Hogwarts...LOL - My daughter was obsessed with Harvard for years but then once she really had to look into things for real she was sold on Yale as her favorite. That was VERY hard for her to admit too because she really wanted Boston or even just to get out of CT. But she would not trade her school for anything now. It really boils down to what kind of a person you are and want to be.<br><br>", "<b>Username: proudparent26</b><br><br>Harvard it is far and away a much better school for STEM than Yale. It is not even close. Lots of people see the Harvard freshman housing as a plus where you get to know a large group of the freshman class rather than a small group of people at your house<br><br>", "<b>Username: gibby</b><br><br>\"\"@proudparent26 wrote: Lots of people see the Harvard freshman housing as a plus\"\"<br><br>Yes, some do, however administrators are contemplating changing Harvard's residential housing system to be more like Yale's to improve the freshman experience at Harvard: <url>http://www.thecrimson.com/article/2016/3/2/final-club-yale-model/</url><br><br>\"\"Discussions of Yales residential set-up have been particularly prevalent in the administrations communications with members of Harvards non-affiliated single-gender social clubs.<br><br>He (Schachar ) also suggested randomizing students into their house before freshman move-in, similar to how students are put into Residential Colleges at Yale, and, introducing more social activities for freshmen.\"\"<br><br>", "<b>Username: proudparent26</b><br><br>@gibby I think you are misconstruing what was said. One individual has said that some of what Yale does may be good. That is it. Nothing more<br><br>Also I am sure you have been to Harvard numerous times. The freshman housing is around the yard and that is done for a reason. It is done so the freshman are closer to campus and feel more part of the community. I doubt seriously they are going to change any of the freshman houses into residential houses. Also as I am sure you are aware some of the freshman houses don't house a lot of students nor do any of them have separate dining halls. So implementing the Yale system of housing is in reality a total physical impossibility. Personally I think the Harvard system of housing is far superior to Yales. At least with Harvard you get to make some choices and see different things.<br><br>Most people at Harvard think the housing is excellent<br><br>", "<b>Username: gibby</b><br><br>^^ That one person happens to be Harvard's Associate Dean of Student Life, David R. Friedrich, who has \"the ear\" of Dean Khurana, so we'll see what happens.<br><br>FWIW: Having one child graduate from Harvard and one from Yale, there are pluses and minuses to each residential house system, but I prefer Yale's model. I wrote the below several years ago and I stand by every word of it.<br>\"\"Another difference between the schools is housing. Harvard's residential college system is a three-year program that starts in a student's sophomore year. Harvard freshman live, eat and socialize together in Harvard Yard, but they do not belong to a residential house overseen by a Master and Dean. As a result, there is a lot of opportunity for freshman to bond with other freshman, but little opportunity for Harvard freshman to bond with sophomores, juniors and seniors, unless they meet through an extracurricular activity or a class.<br><br>Yale's residential college system is a four-year program. Yale freshman eat and socialize with sophomores, juniors and seniors in their residential college, so there's much more of a \"big-sib, little-sib\" atmosphere to the entire school. As a freshman, you can sit down next to an upperclass student and start up a conversation over a meal, or you can attend one of your residential college's events (ski trip, cruise, picnic, etc) and meet upperclass students. That just doesn't happen for Harvard freshman.<br><br>For our family, the biggest difference between the schools has been the \"social tone.\"<br><br>The \"social tone\" of a college results from decisions, large and small, made by the administration on issues such as physical space and its use, housing, how freshman are welcomed and integrated into campus life, what role upperclass students play as advisors and mentors, what role graduate students play, how readily faculty members volunteer to host events or trips, etc.<br><br>For our family, the \"social tone\" can be best summed up as, \"At Harvard, students are on their own. At Yale, students are all in it together.\"<br><br>Let's take move-in day, for example:<br><br>At Harvard, freshman move-in to their dorms on the first day the campus opens to students. The majority of sophomores, juniors and seniors move in several days later, so most upperclass students are not in residence when freshman arrive. Freshman, and their parents, unpack the car, lug stuff up to their room and get acclimated on their own and with the help of their roommates. At the end of move-in day, parents say their goodbyes, and freshman go off to a series of orientation meetings and freshman-only events.<br><br>At Yale, sophomores, juniors and seniors move-in to their dorms on the first day the campus opens. Several days later, freshman move-in to their dorms with the HELP of upperclass students. Freshman year at Yale during move-in day, our car was literally swarmed by 30 upperclass students who unpacked our son's belongings and carried them up to his room. In the afternoon, there was a student-parent reception at the master's house, followed by a dinner for freshman with upperclass students in their colleges, and in the evening, there was a one huge party for the entire campus.<br><br>That kind of welcome set the tone for my son's time at Yale -- and all of it was a well orchestrated plan by Yale's administration to create a vibrant campus environment that fosters hard work, unity and FUN. There's an old expression in Cambridge: \"Mother Harvard doesn't coddle her young.\" That's a positive way of saying \"Harvard's administration seems to lack the imagination or the desire to make the campus into a warmer and more inviting place.\" IMHO, Harvard's \"social tone\" would be much improved if the school were run by Yale's administration, or at the very least, Harvard adopted a more student-centric approach to campus life.\"\"<br><br>", "<b>Username: proudparent26</b><br><br>@gibby Your information must be a little dated or you were simply not provided all the information by your child. When my kid moved into the freshman dorms a couple of years ago at Harvard there were lots of upperclassmen there to HELP. I was literally shocked by all the upper class help. I went to UC where there was no help when I moved in. There was a sophomore or junior who was also specifically assigned as their upper class advisor for the whole year for my kid. He was there all move in day and even helped with the boxes much to my surprise.The advisor was in addition to the other upper classmen who helped. Each group of about 30 students had a resident assistant who lived in the building and helped with different issues that arose. The resident assistant I think was a graduate student. In addition there was a faculty member specifically assigned to my kid for guidance and help<br><br>There was a dinner for parents. I think it was move in day. I am not sure how Harvard could make it a more warm and inviting place. I don't think it is HUMANLY possible. Lets not forget Freshman Parents weekend two months later in November<br><br><br>As to events I know the entry way group went to red sox games and some other events as a group. The freshman class gets to know each other as a group at Harvard. They then get to choose their roommates for future years. The freshman also get to live close to campus and eat together the first year. They are not constrained to their one house. This provides more social interaction for the freshman year as well as years beyond. The kids have friends all over campus<br><br>From what I have heard and seen I much prefer the Harvard model<br><br>", "<b>Username: ReadyForTheWind</b><br><br>@gibby Is it possible that these changes, particularly \"randomizing students into their house,\" could happen for the incoming Harvard class of 2020?<br><br>", "<b>Username: gibby</b><br><br>@proudparent26: My daughter was a freshman in 2009, so possibly Harvard changed things around in the last several years. But back then, no upperclass students were on campus to help when we moved my daughter into Matthews. My daughter, son, wife and I had to lug everything up three flights of stairs by ourselves. And dinner was not provided for parents; it was for the students. Those kind of things you don't forget.<br><br>FWIW: I actually think Harvard freshman would have a much better experience if they were randomly assigned a residential house and moved directly into them with sophomores and juniors. That would allow the seniors to take over the Harvard Yard dorms. In that way, Freshman would immediately be embraced by their fellow Havardians and have all the benefits of house life, while the seniors, who by then are yearning for independence, might relish having their final year in the yard.<br><br>", "<b>Username: ReadyForTheWind</b><br><br>@gibby Do you think these changes will be implemented soon? Or no way to tell<br><br>", "<b>Username: gibby</b><br><br>The Harvard Corporation is a large bureaucratic machine which moves very slowly. For example, prior to 1999 women graduating from Harvard were given Radcliffe diplomas even though the two schools were merged 20 years earlier. (Men received Harvard diplomas, but not the women.) So, no I don't think the changes talked about today are going to be implemented any time soon, if at all. The changes would have to be talked about, debated and voted upon by the administration, faculty, alumni and current students, each having input. But only after a task-force was assigned to do a two-year study on the issue :-)<br><br>", "<b>Username: proudparent26</b><br><br>@gibby so your proposal is the seniors after living three years on the river are going to want to move into the yard and leave all their friends behind. That doesn't sound very realistic to me. I don't think changes like that will ever happen.<br><br>I think the current situation at Harvard works great. Lets not forget that seniors the last year in their house get to pick the best rooms. They are not going to want to give that up.<br><br>Some kids their freshmen year didn't bring a ton of stuff so they didn't have to worry about who was going to lug everything up multiple flights of stairs. I think my kid had two suitcases and 3 or 4 boxes we mailed in<br><br>", "<b>Username: prezbucky</b><br><br>How are they alike?<br><br>Both schools have done a pretty good job through the years of molding leaders.<br><br>Both schools are known worldwide for outstanding educational quality. Harvard/Yale is not just about football: this is the oldest, most blue-blooded academic rivalry in the US.<br><br>Both have venerable social and residential scenes.<br><br>Both have a plethora of outstanding academic programs at all levels, including the undergrad. If you work hard to earn your degree and are diligent when it's time to find internships/research spots (and ultimately, a permanent job), chances are good that you will be firmly on a path to vocational success.<br><hr><br><br>How are they different?<br><br>Dark red vs. dark blue<br><br>The three-year-dorm system (and/or Final Clubs, right?) vs. the residential colleges.<br><br>Relatively more STEM focus at Harvard vs. relatively more humanities/social sciences focus at Yale.<br><br>Possibly, Harvard might be a hair more focused overall on grad and PhD programs than Yale is. (While neither is quite Princetonian in undergraduate zealotry, we aren't debating Princeton here.)<br><br>New Haven vs. Boston -- Plenty has been written about both in a multitude of threads on this site.<br><br><br>Advice:<br><br>You say that you love Yale.<br><br>Unless something about Harvard really sweeps you off your feet at this point -- EG you visit and it just blows you away, or the FA is like $20k+ better than Yale over four years -- I think you should stick with your first love, as you described it: Yale.<br><br>Many preach fit here: as long as you can afford it (not an issue here, right?), go to the place that feels most like home academically, environmentally, socially and culturally.<br><br>", "<b>Username: skieurope</b><br><br>\"\"@gibby Is it possible that these changes, particularly \"randomizing students into their house,\" could happen for the incoming Harvard class of 2020?\"\"<br>\"\"Do you think these changes will be implemented soon? Or no way to tell\"\"<br>Not a snowball's chance in hell. <b>If</b>, and that's a <b>huge</b> if, there are any meaningful changes being contemplated for residential living, as @gibby indicated, an aircraft carrier reverses direction faster than Harvard implements change. Not that that is always a bad thing. :)<br><br>", "<b>Username: T26E4</b><br><br>In case y'all don't know, skieurope is currently a Harvard undergrad....<br><br>", "<b>Username: Hunt</b><br><br>I'm a Yale booster, but I agree that BDD and Visitas should give you gut guidance. By the way, my wife was an MB&amp;B major at Yale, and went on to Duke Med School. She thought it was pretty good back then.<br><br>", "<b>Username: Musicmom2015</b><br><br>Congrats on your acceptances! I agree with the advice to attend both accepted students programs and try to trust your gut.<br><br>We were not faced with this exact decision because my son did not apply to Harvard. He had a very long list of schools, our trip to Boston was cancelled due to weather, and based on everything he read and heard, he felt like Yale was for him. I'd love to visit someday though and see for myself!<br><br>I want to comment on some of the earlier comments that Harvard is much stronger in STEM than Yale. Is Harvard stronger? Maybe. But much stronger/ no comparison? I don't think so. Yale has been pouring money into STEM for years and the thousands of kids applying to STEM aren't expecting a subpar education. My son is a science major. He has already had one class with someone considered a leader in his field. The professor was willing to write recommendations for my son and help him find his freshman summer internship. He just found out he will be staying in NH for the summer to do research as part of the Freshman Summer Research Fellowship. The professor is world class and he excited to start working in this lab. So I'm not sure what he would be getting at Harvard that is better. I'm not saying you won't get an excellent education at Harvard, but you also will at Yale.<br><br>So, if you believe me, you can focus on the things like how you see yourself fitting in, what are the students like, and what other opportunities exist. One small anecdote... From my name you can see my child is a musician. When looking at schools, we always researched the music opportunities and tried to meet with someone in that area when we visited. Researching the availability of private lessons, Harvard's website says basically \" we do not offer lessons. Students should find their own teachers in the Boston area. \". For Yale under do you offer lessons, it says Yes! My son reached out to a student at Yale who plays the same instrument. He took our son to a quartet rehearsal and then one of the other students took us all to see his suite and swiped us into the dining hall for dinner. It made such an impact that it was mentioned briefly in one of his essays. This other student is now a friend. So I encourage you to think about the communities you wish to join and to try to meet those students at BDD and at Harvard. It may make your decision a little clearer. ( not knocking the music scene at Harvard, I'm sure there are lots of talented students :))<br><br>Good luck! Two fantastic choices.<br><br>", "<b>Username: Planner</b><br><br>@nondescript1 My son faced the same decision last year (and also had Princeton and Stanford, which he ended up choosing, in the mix)as I've written elsewhere, it was an extremely difficult choice. Think hard about what kind of person you are: Do you tend to be sentimental, and are you prone to regret? Try to imagine yourself a year or more from now wearing a Harvard T-shirt (with pride) and suddenly seeing someone in a Yale shirt. How might you feelwill there be a pang of regret? Now try to imagine the oppositewhat is your heart saying? If you're a bit sentimentaland it sounds like you might beand tend to regret things, choose Yale. Yale didn't not love you backit just needed to get to know you a bit better and decide. It loves you nowas does Harvard. Just because Harvard declared itself first doesn't mean it wants you any more than Yale does now.<br><br>", "<b>Username: proudparent26</b><br><br>Harvard is rated number 1 by US News and World Report in Biology. It is second place with Stanford in Chemistry. I have heard some horror stories regarding the CS department at Yale. Does that mean you will get a bad education at Yale. Probably not. But you are in the extremely fortunate position of having the opportunity to chose the best. Yale has been pouring money in science classes because they needed to upgrade just to be competitive<br><br>Musicmom mentioned music. In Boston they have the Boston symphony and the Boston Philharmonic. I venture to say they are a little better than the New Haven orchestra. The office of arts at Harvard also helps you find people to give music lessons and it provides subsidies for the lessons. Yale has a part time radio station. Harvard has a full time station If you like professional sports Boston has them New Haven does not<br><br>", "<b>Username: IxnayBob</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/proudparent26\">proudparent26</a> wrote:\"\"<br>We all hear stories. I have very personal knowledge of one Yale CS kid knocking it out of the park. :)<br><br>ETA: that same kid might have considered Stanford, but had zero interest in Harvard.<br><br>", "<b>Username: ReadyForTheWind</b><br><br>@musicmom49 Harvard is better at STEM, particularly the life sciences. You discuss the availability of private lessons at Yale versus Harvard and how Yale has much better musical opportunities? Sure, that's probably true. But the funding for that and all the other humanities programs that Yale offers trades off with funding for STEM. Just look the number of undergraduates in STEM fields at schools like Stanford/Harvard vs Yale, its much higher at Harvard.<br><br>Yes, both are great at stem, and there are excellent opportunities for research at both universities. That doesn't mean that one isn't better or even significantly better in STEM than the other.<br><br>", "<b>Username: proudparent26</b><br><br>@IxnayBob maybe you didn't hear about the petition signed by hundreds of Yale Students complaining about the CS department<br><br><url>http://www.businessinsider.com/yale-computer-science-petition-2015-3</url><br><br>or the extensive thread on CC<br><br><url>http://talk.collegeconfidential.com/yale-university/1699389-what-is-happening-with-computer-science-at-yale-p1.html</url><br><br>I am glad to hear that at least one CS student at Yale is doing well<br><br>", "<b>Username: IxnayBob</b><br><br>@proudparent26 , of course I heard of those. I previously said that I think the top 10% of Yale CS students are probably very well placed. I concede that the median CS student at Stanford is probably better off than the median CS student at Yale, but on the basis of my admittedly limited sample, I'm not prepared to say that for Harvard.<br><br>", "<b>Username: proudparent26</b><br><br>@IxnayBob I realize Yale is trying hard and they are to be admired for that . However John Paulson HBS gave 400 million to Harvard , Steve Ballmer gave 60 million, and Zuckerberg and Gates both went to Harvard. Also Yale chose to import CS 50 this year.<br><br>Perhaps an even more important problem is of the 100 or so CS students at Yale 85 per cent of them are male. There are about 3 times as many CS students at Harvard with an active recruitment process and support groups for women<br><br>", "<b>Username: skieurope</b><br><br><b>MODERATOR'S NOTE</b>:<br>I will assume the the OT conversation about CS and Stanford is over or will be relegated to PM's since the OP has mentioned neither of those, and this conversation serves only to derail the thread. Thank you.<br><br>", "<b>Username: Memmsmom</b><br><br>Something interesting my daughter mentioned to me the other day on this topic. When we visited Harvard every summer, we could not walk a certain way to the bookstore because we would avoid homeless sleeping along the wall and the smell of urine two or three doorways down from the Coop. She was saying how glad she is that she doesn't have to worry about this going anywhere on Yale's campus. For all the talk about how great Boston is and how crime is big in New Haven- There is just as much crime, larger amounts of it over a larger city and there are other elements directly affecting the campus. You will not find that at Yale because the police and security presence is felt everywhere. Just something to consider. You will really have to visit both to see more than what people who are obviously bias consider the better option. Like I said before, my kid was obsessed with Harvard from the time she was nine years old but in the end wanted Yale first and then Georgetown before Harvard.<br><br>", "<b>Username: Hunt</b><br><br>If you really want to compare departments, you have to do some research. I think it is true that CS at Yale has been controversial, and a person interested in that major should look closely. I don't think the same is true of the life sciences, although I'm sure it's true that they are rated more highly at some other top schools. But you have to get into the details. Thus, for example, nobody who really delved into the music departments at both schools would think that Harvard is a better choice because there are better orchestras in Boston.<br><br>", "<b>Username: Planner</b><br><br>@Memmsmom My son had a similar reaction to Harvardhe actually couldn't wait to leave the area. Too many homeless people (and way too many other people), too much traffic, too much noise, and too much construction. It was hard for him to envision living there, even though we did see other, quieter areas of the campus. Although he didn't apply to MIT, he much preferred that part of Cambridgefar less congestion.<br><br>", "<b>Username: canoe2015</b><br><br>Similar to what you said @Memmsmom and @Planner, my daughter just didn't like the area around Harvard either. In particular she was appalled at the tour bus groups walking through Harvard Yard, taking pictures of students, peeking into windows, etc. She wanted to get out of there fast. I was surprised at how strong her reaction was actually.<br><br>I don't mean to knock Harvard as obviously it's a fantastic school . . . just sharing one student's viewpoint.<br><br>", "<b>Username: Multiverse7</b><br><br>@memmsmom Did your daughter actually get into Harvard? I thought she didn't.<br><br>Also, I've always heard the problem with homeless was much worse at Yale. They used to sleep on the warm grates on campus during the winter months. Has this stopped?<br><br>", "<b>Username: Memmsmom</b><br><br>@Multiverse7 she was deferred scea which was why she looked much deeper into the different schools. She was wait listed from Harvard in the end but at that point she didn't care. It wasn't where she was focused on. And I don't personally attend there so I don't know- as far as I have ever seen they don't. And from what she has said about not seeing them around campus, my guess is that they do not. This was an actual conversation we had the other day because we were talking about safety between Georgetown and Yale- it was when she brought up that it was better than how she felt visiting Harvard.<br><br>", "<b>Username: gibby</b><br><br>\"\"Also, I've always heard the problem with homeless was much worse at Yale.\"\"<br><br>FWIW: About 20 years ago, Yale made a strong commitment to improve the area surrounding it's campus by buying commercial properties surrounding the school and selecting merchants it approved of to fill those stores. Today about 80% of the commercial property directly surrounding the school have Yale as their landlord (including the Apple Store), so things are quite safe around the school. In fact, Yale's success in cleaning up downtown New Haven has actually become a model for other cities. Here's a good blog about it: <url>http://bhambricks.com/lessons-from-new-haven-real-estate-and-recovery</url>. Both the New Haven Police and Yale Police departments patrol Yale-owned commercial properties and do not allow the homeless to gather by stores like the do in Harvard Square. That said, there are just as many homeless in New Haven as Cambridge -- you just don't see them as frequently.<br><br>", "<b>Username: proudparent26</b><br><br>Homeless people for the most part are extremely harmless. It is a tragedy how this country deals with them. If you don't like the homeless you shouldn't go to New York, Los Angeles or San Francisco. UCLA has a lot of homeless people in Westwood which is right next to Beverly Hills. Berkeley , the area around Columbia and Washington DC all have a lot of homeless people. Neither me nor my kids have any problems with the homeless<br><br>It doesn't sound like New Haven is doing a very effective job of dealing with their homeless. That makes me sad. They are not commodities that should be pushed out of sight for the convenience of the ivy leaguers<br><br><url>http://wtnh.com/2016/01/05/homeless-fight-the-cold-in-new-haven/</url><br><br>", "<b>Username: gibby</b><br><br>^^^ Unfortunately, Cambridge doesn't do a better job.<br><br>", "<b>Username: classicalmama</b><br><br>A couple of thoughts based on my Yalie's experience (and since this seems to matter to the Harvard parents on this thread, yes, he could have gone to Harvard. He also has several close friends from high school who attend Harvard).<br><br>Freshman dorms: There seems to be a misconception here about the freshman housing at Yale. In fact, the freshman are housed in dorms together on the centrally located Old Campus, similarly to Harvard. My son's dorm contained freshman from at least one other residential college, with suites were organized by college. There was plenty of opportunity to socialize with and meet students from other residential colleges, and many of his best friends from last year are now living in other residential college. Freshman screws--where freshman from one college invite other freshman on blind dates with their suite mates is one example of how they mix.<br><br>STEM: my son, who started out as a humanities oriented freshman but is now considering a math major with as much comp. sci as he can squeeze in, just brought up the Harvard-Yale STEM difference in a conversation the other day. Because many of his friends at Harvard are STEM majors, he was wondering out loud whether Harvard might not have been a better academic fit. But he has, for the most part, enjoyed his math and c.s. classes at Yale, and isn't having trouble finding other interesting classes to take (an undergraduate can only take so many!) . Some of his friends went in to college with particular interest and chose Harvard for the particular equipment or specific programs it had that Yale did not. On the other hand, Yale has offered my kid lots of cool internship opportunities-he has a spring internship right now doing statistical research and another this summer doing data analysis. One thing to ask about at Harvard is how competitive the kind of research opportunities you seek are, especially for undergraduates.<br><br>", "<b>Username: classicalmama</b><br><br>And freshman can eat dinner together, regardless of residential college. I think the only exception to this may be Sunday night \"Family dinners\" where members of the residential college eat together and occasional special events.<br><br>", "<b>Username: donnaleighg</b><br><br>^modulo Silliman and Timothy Dwight, where students live in their college all four years, and eat in their colleges (mostly) all four years.<br><br>", "<b>Username: Memmsmom</b><br><br>@donnaleighg They live there all 4 years but can eat at any college they want same as the rest of the students. Any student can eat at any RC except for Sunday dinner where it is called Family Dinner. That day the RC's eat dinner together. My daughter eats breakfast at Silliman 3 times a week because its on her way to class.<br><br>As for the homeless situation, I don't feel that cleaning up campus areas is pushing homeless aside. Its making a safer environment for young and impressionable students. They didn't force them out of the town, just focused on cleaning up and making secure the college campus which they should do. Loitering is loitering whether you are homeless or not.<br>I actually happened to be on campus last night to see a performance. I was walking back alone at 10:30pm and there was nothing but clear streets and lots of security. I made a point to even watch the park as I left Welch gate. The only obvious thing were police stationed all around it, new bright lights lit and nothing to make a mother concerned. However EVERY time we visited Harvard whether it was during the day or night there were clusters of homeless pandering right outside of the CO-OP. They are rude and imply that we are snobs if we don't fork over cash. It is not that I am above helping nor is my daughter. She participates weekly at BREAD which delivers food to the homeless shelter. It is just not something that I want my daughter to deal with every day while attending what could be inferred as a pretentious school. She comes from a humble beginning and is not always going to have spare change to give. I just don't want her to have to deal with that daily while trying to focus on class.<br><br>", "<b>Username: donnaleighg</b><br><br>^my point was only that students in TD and Silliman may tend to eat in their college rather than with other freshman. Just the nature of the colleges.<br><br>", "<b>Username: Hunt</b><br><br>It's much better to be assigned to the Old Campus dorms, unless you are assigned to TD or Silliman, in which case it's much better to be assigned there. ;)<br><br>", "<b>Username: Tperry1982</b><br><br>I will admit that I am biased, but as a graduate and a current Yale mom, I think that all that has been said about the Yale 'vibe\" is true. My sophomore D has friends at Harvard and they visit back and forth often. Quiet as it is kept, though her Harvard friends love their school, they do see a big difference in how the students bond with their school, especially from day one freshman year. You talk about New Haven. But due to the fact that Yalies tend to stay on campus or close to it for all their extra curricular activities, there is a sense of closeness with the student body at Yale that is not felt at Harvard where there is more to draw students off campus. But, if you read my posts, you will see that fit is most important. So, if you have the option, go to both Veritas and Bull Dog Days, and then follow your gut. You can't go wrong with either one academically, but you may have a better social experience at one over the other. You want your college years to be more than a competitive grind. Good luck in your choice and welcome to Yale!!<br><br>", "<b>Username: Tperry1982</b><br><br>@IxnayBob - I knew you were going to respond to @proudparent26 since I know your son is a sophomore at Yale in CS and we have had many conversations about his program. While we all know that my experience with STEM at Yale is non-existent, I was a Psychology major and my D is a Lit major now, I know that they commitment they are making is paying off in spades. Also, saying that Yale's STEM programs were somehow subpar before this expansion is somewhat myopic. It just shows that a liberal arts giant sees the trend toward STEM, and while they will not stray from their world class liberal arts roots, they can play very well in the STEM pond. It is Yale you know.<br><br>So, if you want good, current info about STEM and CS, I would suggest that some of you PM @IxnayBob and he will give you some good insights. (Sorry IB for throwing you out there like that but I think you are the perfect parent advocate).<br><br>", "<b>Username: Tperry1982</b><br><br>@Multiverse7 and others - why do people think that New Haven is such a pit? First of all, except for going back and forth home and maybe time spent volunteering in town doing community service, most students have no reason to be in \"actual\" New Haven. If a child is so sheltered that they don't want to see the real world, e.g. people of color, low income people, areas where you need to be mindful of crime, areas where homeless people live (dang, sounds like any large urban city in the USA), then maybe the better 'fit\" for them would be somewhere that is not in a urban environment. So many times students apply to schools like Yale, UPENN, U Chicago and then realize they are located in less than desirable areas. My kid knew from the beginning that she could never apply to a school in New York City so Columbia and NYU were out. I can remember when my mom flew me to New Haven from DC when I was 18 (1978) some mom from some small Midwest town was having a cow about the city, the traffic, the noise, the undesirables she saw all around. My mom and I just looked at each other since it was so tame compared to DC. To each his own but one needs to actually go to New Haven and feel the vibe there and not just go on other people's subjective and sometimes outdated, opinions.<br><br>", "<b>Username: learninginprog</b><br><br>Go to both school admitted students Day. My kid had your same choice. It was all about fit. Did not like the vibes at H, loved the vibes at Yale. No parent intervention. Your GUT is an awesome thing.....don't leave home without it. :-)<br><br>", "<b>Username: classicalmama</b><br><br>^This. Both my kids loved New Haven (as opposed to more \"bubbly\" campuses like Princeton's or Dartmouth's) because it was in integrated into a real city. I'd say the same about Harvard actually; I grew up close to Cambridge and still love it wit and for its grittiness. I well remember how appalled my small town children were when we first visited--I was glad they had the experience and that they made me see a problem I'd become complacent about with fresh eyes. At any rate, do we really want to argue about which city/campus is better at hiding its homeless people? Ugh...<br><br>", "<b>Username: RenaissanceMom</b><br><br>I have a good friend's son who was just accepted to Yale and will attend. He showed me the Yale admission musical video, which I originally saw when it came out, and the Harvard spoof of it, which was new to me. The conversation about reminds me of this Harvard spoof of Yale's video and this crimson article:<br><br><url>https://m.youtube.com/watch?v=RYRF5-zdY8Q</url><br><br><url>http://www.thecrimson.com/article/2010/11/23/yale-video-yales-harvard/</url><br><br>And here's the Yale video, for those who haven't seen it:<br><br><url>https://m.youtube.com/watch?v=tGn3-RW8Ajk</url><br><br>", "<b>Username: RenaissanceMom</b><br><br>Meant to write conversation *above*...hard to edit on phone. Although I have the edit wheel, when I tap, I just get a copy option.<br><br>", "<b>Username: gibby</b><br><br>\"\"@Tperry1982 wrote \"My kid knew from the beginning that she could never apply to a school in New York City so Columbia and NYU were out.\"\"\"<br><br>FWIW: My son was raised on the Upper West Side of Manhattan several blocks from Columbia's campus. The public schools he attended allowed him and his classmates to go out to lunch on the streets of NYC beginning in 5th grade. He rode the subways by himself to and from school beginning in 6th grade and stayed out to 1:00am in high school on Friday and Saturday nights going to parties in Brooklyn and Queens. And yet, even though he had a wonderful time at Yale, he found parts of downtown New Haven to be a lot more crime ridden than his hometown -- especially the areas around Columbia and NYU. So, I find your daughter's fears to be a bit overblown.<br><br>", "<b>Username: RenaissanceMom</b><br><br>@gibby, I was thinking the same. Columbia's and NYU's neighborhoods, in particular, are wonderful. My oldest son graduated from brown in May and now works at Columbia as a lab researcher until he attends grad school. Feels just as safe in NYC as he did in providence, and brown is located in providence's most upscale neighborhood. NYC is a lot nicer and safer now than it was when I moved here in 1985.<br><br>", "<b>Username: IxnayBob</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/RenaissanceMom\">RenaissanceMom</a> wrote:\"\"<br>... and quite possibly safer than 1978, when Tperry1982 was considering colleges.<br><br>", "<b>Username: Tperry1982</b><br><br>@gibby - clarification - she was not afraid of New York City. We spent and continue to spend many weekends there (my best friend from Yale lives there). She just did not like the congestion, the number of people, the hugeness of it all. I love New York too. But I could never live there. I know New Yorkers who would never leave. To each his own. So my comment was not about the crime or anything negative, it was just about our preference. She didn't want to go to school out in the country either so a Princeton or a Dartmouth was out of consideration too. New Haven was a lot like DC, except for the tourist parts downtown. So I guess it just felt more like home to her. That and her familiarity with the campus and town since she had been going there regularly since she was 1 years old.<br><br>", "<b>Username: RenaissanceMom</b><br><br>^Yes, true for sure. But by the time her daughter was looking, NYC safety wasn't much of an issue, particularly around Columbia and NYU. But I appreciate that kids, particularly those not brought up in a city, would prefer to take baby steps by first going to college in a smaller city. I felt that way myself. And I've known plenty of kids who grew up in NYC or its suburbs (but were in the city a lot to socialize, work and take classes during high school) who wanted the reverse. Most also thought that they'd end up in a city later, so it was their chance to live in a different environment.<br><br>One thing that's true about a college in a city like NYC or Boston is that the city does become part of the campus. There are obvious pros and cons to that; pros: lots of interesting fun things to do and great internship possibilities; con: campus community may not be as cohesive. I've always had the impression, though, that Harvard, uchicago and tufts have the best of all worlds...a distinct, cohesive campus only a short skip away from a major city.<br><br>", "<b>Username: RenaissanceMom</b><br><br>Sorry @Tperry1982, we cross posted and I was responding to ixnaybob.<br><br>", "<b>Username: Tperry1982</b><br><br>@RenaissanceMom - I understand. My kid grew up in DC- went to school in Georgetown. Both her parents work in law enforcement. Scary she is not. I used to live in Arlington, right outside of Cambridge while my best friend went to Harvard Law School. I had just gotten my graduate degree in Criminal Justice and was working in one of the prisons up there. So I know the Harvard campus and Boston pretty well - though it has grown quite a bit since my time there. I always preach fit. One of my D's friends went to UPENN. She grew up in the heart of DC so she is a city kid through and through. She does not particularly like UPENN or the city, not because of the surrounding environment, but because she does not like the impersonal environment (her words) of the campus.<br><br>", "<b>Username: DeepBlue86</b><br><br>Well, for what it's worth, Yale is one of the happiest schools in the country, and the happiest Ivy, according to the Princeton Review: <url>http://www.huffingtonpost.com/entry/colleges-with-the-happiest-students_us_55bfe207e4b06f8bedb5b584</url><br><br>", "<b>Username: astroknot</b><br><br>Hey @nondescript1, I know this thread is old but I'm wondering if you could share your matriculation choice. As a fellow Class of '20 Harvard-Yale cross admit (and one who ultimately chose Yale), I'd really love to know where you'll be heading and how you felt about the whole admittedly (pun, get it :P ) grueling process.<br><br>", "<b>Username: nondescript1</b><br><br>@astroknot It looks like we're classmates now! I ultimately chose Yale as well. It ultimately came down to my feelings when I visited both schools again. I felt that I could definitely find happiness at Harvard, but Yale just felt right immediately. Both schools would have given me more opportunities than I could possibly explore in 4 years. As my biology teacher put it \"it's like choosing between chocolate cake and vanilla cake.\" To be quite honest, I realized that the differences between the schools were merely academic, while the differences between my reactions to them respectively were not. In the end I wanted to have my cake and eat it too, so I did.<br><br>", "<b>Username: astroknot</b><br><br>@nondescript1 Thanks for the update! Couldn't agree more with your words on the choice. See ya round next year :)<br><br>", "<b>Username: xxluvforeverxx</b><br><br>Congratulations on being accepted into two of the best colleges in the world! It seems that you are leaning more towards Yale in your statement, but whichever choice you make will be a good choice.<br><br>"]}