{"title": "duke vs dartmouth vs grinnell", "comments": ["<b>Username: tastypotatofries</b><br><br>Hi everyone! Over the last two weeks, I've had the privilege of getting admitted into these amazing institutions.. Now, as May 1st quickly approaches, I'm so incredibly lost with which to choose. I've looked through almost all the Duke/Dartmouth comparisons during the wee hours of the morning when I should've been studying, but I'm still just as undecided.<br><br>", "<b>Username: juillet</b><br><br>Well first - no, it's unlikely that your choice will \"literally change the path of your entire life.\" I think thinking about it that way introduces a whole lot of unnecessary anxiety and pathos to the decision. You are choosing between three very excellent, well-regarded colleges. Students get jobs, go to grad school and have successful lives from all three. As long as you can be happy in the environment there, you can't go wrong with your choice. You could roll a dice and pick based on that and be absolutely fine. So don't assign this choice an inflated sense of importance - it's not that it's not important, but it also won't set in stone the course of the rest of your life either.<br><br>With that said:<br><br>There are downsides to everything - you're not going to find a single choice that doesn't have a downside. The goal is to choose a place where you love the upsides and the downsides don't scare you off. I'm sure that Hanover can sometimes be isolating - small towns tend to do that - but larger cities can be overwhelming and intense. And your other two choices aren't exactly in thriving metropolises anyway. (Durham's the closest thing to that, but as you mentioned, there are downsides to that too.)<br><br>You are 17 years old, almost an adult. You don't have to go along with what you have wanted since elementary school. Those were 'dreams' fueled by a child's perspective on things. Duke is an excellent school; no, it's not in the Northeast and it doesn't belong to the Ivy League athletic conference, but it's still a top-notch school that will give you an excellent education. It sounds like the only thing that's holding you back is your childhood dream of going to a specific set of schools.<br><br>Also, you are comparing three elite schools. I would be surprised if the atmosphere doesn't sometimes get competitive at all three of them.<br><br>Anyway, just from reading this post it sounds like you really want to go to Duke. The only things you have said about Dartmouth are negative things, and the only positive that you can put it for it is its prestige, which is true of Duke and Grinnell as well. On the flip side, your preference for Duke is pretty clear from the way you write about it.<br><br>Grinnell is a great bargain at only $5K a year, but you don't seem excited about it, and Duke isn't very much more. As long as your family can afford it, I would go with Duke.<br><br>", "<b>Username: Sunny66</b><br><br>Congrats on three great options. I agree with the above post, Duke seems like the best fit for you. Many people would find that Duke has more prestige than Dartmouth. But Dartmouth could be a great option as well. Is the 3.5k in loans and extra 1k in tuition at Duke per year or over four years? If per year, then Dartmouth will save you 18k, which could be an important consideration given your low income bracket.<br><br>", "<b>Username: tk21769</b><br><br>\"\"Though financially Grinnell would be the best option, I'm worried about the relative lack of a strong career center as that of Duke and Dartmouth.\"\"<br><br>I'd be inclined to go with Grinnell if that is the only drawback that concerns you.<br>You're likely to get more personal attention there, overall, than you would at Duke or Dartmouth<br>If you're turned off by the prospects of a \"fratty\" social scene, then consider the numbers:<br>46% of undergraduate men are in fraternities at Dartmouth, 30% at Duke, and 0% at Grinnell.<br>So, although you're likely to find your tribe at any of them, Grinnell may be best for the kind of atmosphere you seem to want.<br><br>Besides, Grinnell is significantly cheaper.<br>Although ... if you continue to be more excited by Duke, you might try to persuade them to improve their offer.<br><br>", "<b>Username: wisteria100</b><br><br>Even though Grinnell gave you the best financial offer, the offer at Duke is pretty darned good too. It sounds based on what you are looking for that Duke is the best fit. There will be more diversity there and the way you can combine majors and minors is also a plus.<br>Congrats!<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Only you can figure out the best community and environment for you. That means, being honest with yourself about what kind of environment you thrive in, personally and academically. All three are phenomenal schools with great reputations, there is no wrong choice.<br><br>Duke is a great all-around university -- big sports, big everything. There are actually more grad students than undergrads. As a big school, there will be plenty of students who share similar interests and goals with you, and you can find them by joining organizations focused on your interests. Consider reading back issues of the student newspaper online, look to see if you can follow the LBGTQ group on social media to get a feel for the community and the issues facing campus. (You do not seem excited about Dartmouth, so I won't address that).<br><br>Grinnell is one of the best LACs around and an entirely different experience from Duke -- classes are capped at 25 students, there are no gen ed requirements, the amazing science and athletic facilities are only there for you -- the undergrad -- there is summer funding for internships, student research etc. Grinnell is an extremely tolerant and inclusive community, we've been to campus 4-5 times for 2 kids' college search, and were impressed that there is no dominant type of student, I've said there is everything from blue hair to Vineyard Vines. The model of self-gov fosters a collaborative community. It is an amazing place with very impressive faculty. If you have concerns about career services, email admissions about getting connected to current students or career services advisor to get a better understanding of what it might look like for you.<br><br>As a parent, my view would be -- you've worked hard enough for the gold ring, doing what others expect you to do. Now, it is time to be honest with yourself about what environment is best for you for the next stage. Congratulations, and good luck in your decision.<br><br>", "<b>Username: NerdyChica</b><br><br>It sounds like you like Duke the most. Trust your gut.<br><br>It's also worth noting that recent Duke graduates earn $31,000 more on average.<br><br><url>https://collegescorecard.ed.gov/school/?198419-Duke-University</url><br><url>https://collegescorecard.ed.gov/school/?153384-Grinnell-College</url><br><br>Durham is a perfectly nice city and often ranks as one of the best medium sized cities in the US for food and career opportunities. The people who criticize it have likely never been there and are relying on outdated stereotypes. The research triangle (Raleigh, Durham, Chapel Hill) is one of the most educated regions in the country.<br><br>", "<b>Username: uesmomof2</b><br><br>Congratulations on three great options. Not to confuse you any more, but Duke is kind of heavy on the frats too. When I toured last spring with my daughter, 10 out of the 12 tour guides said that they belonged to a fraternity or sorority. However, they do have these alternative houses. But even if Durham is not exactly a Chicago or Boston or New York, it does feel less isolated than Hanover.<br><br>", "<b>Username: csdad2</b><br><br>Since you mention LGBT, you should be aware of the horrific anti-LGBT law that North Carolina just passed. There's been a lot of backlash against it, so it may get repealed (more likely only partially repealed, I'd guess), but it shows the environment/government there. Also, I'm surprised people aren't highlighting the cost differences more -- $6-7K per year, $24-28K overall. That's a significant amount, about the limit that people suggest having for debt overall. You don't say how you're going to cover that, and/or whether it'd have to be on top of other loans.<br><br>Sorry to make your decision more complicated, but these are important considerations.<br><br>", "<b>Username: brantly</b><br><br>^^^I was just going to chime in with the same information. If you are thinking about Duke, please take this into consideration. My vote is for Grinnell. No frats. Small classes. Liberal environment. Least expensive of your options.<br><br>", "<b>Username: uesmomof2</b><br><br>Just to be sort of contrarian, I don't think you can hold Duke responsible for the North Carolina anti-LGBT legislation, though the president of nearby UNC Chapel Hill had a bad track record in this regard. Last year Duke's mandatory read for incoming freshmen was \"Fun Home,\" which is a memoir by a lesbian writer/illustrator about growing up, coming out and her closeted father's suicide. There was very limited backlash to the choice by some uber conservative/Christian students but it was a handful students if that who objected.<br><br>", "<b>Username: goingnutsmom</b><br><br>It really does seem like you want Duke. And there is nothing wrong with that. I would consider someone who sees themselves at Grinnell having a hard time conceptualizing themselves at Duke or Darthmouth. That would be my daughter for example. She had a lot of interest in Grinnell and similar colleges and totally none in Duke.<br><br>OTOH, Duke and Darthmouth are more similar I would think in vibe.<br><br>BTW, Duke had a huge ad campaign last year supporting LBGTQ students. It was pretty cool. And their recent application had a question about what the student preferred to identify as. So there is definitely an effort there. And your presence there can make an impact on campus.<br><br>Go where you feel would be the best academic/social/financial fit. If you can swing it financially, do Duke.<br>I don't have any investment in this btw.<br><br>", "<b>Username: NerdyChica</b><br><br>Duke is a private university and the law has no bearing on Duke.<br><br>@csdad2, it would be very myopic to pick Grinnell over Duke because of the marginal difference in cost. Specially considering the fact that the difference in starting salaries is significantly higher than $24,000<br><br>", "<b>Username: NerdyChica</b><br><br>@goingnutsmom, Great post!<br><br>", "<b>Username: karlavvv</b><br><br>I'd talk with students at each of those schools about their experience. How much does money matter to your family? If it matters alot, go with Grinnell. Otherwise, go with Duke--if you can visit all the schools?<br><br>", "<b>Username: csdad2</b><br><br>The idea that Duke is a private university and isn't affected by this law is, frankly, nonsense. It still exists in that context, and is impacted by the laws and the environment surrounding it. And even if technically there was no legal impact, what are you going to do, tell LGBTs not to set a foot off campus or do anything that's not wholly part of the university? Remember, part of this law repealed local laws protecting LGBTs and restricted localities within the state from enacting such laws.<br><br>Likewise, it's nice that the campus and the city have shown that they don't approve of the law, but that really doesn't mean much. It might even be that the majority of people in the state think it's bad. What needs to happen is that this law is repealed in its entirety, and the people who voted for it/signed it voted out of office.<br><br>Regarding the cost difference, it would be myopic *not* to consider it. $28K is not marginal! And I'm even one who thinks that it's not unreasonable to pay more for certain schools, depending on the circumstances -- there are many on this site who are pretty adamant against it. The circumstances here aren't totally clear, but the OP suggests that they're lower income, that the Duke cost already includes some loans (will they even be able to cover the difference?), and that it may impact their family finances.<br><br>Further, I don't put that much trust in those salary surveys, especially without context, because it's not clear how they consider things like major/field and what part of the country people are living in (and hence COL/average salary).<br><br>Finally, @NerdyChica, I believe you're a Duke alum, and might have a bias here.<br><br>", "<b>Username: mamaedefamilia</b><br><br>Dartmouth: \"I'm not the party type, and as an LGBT student, I'm worried about finding the right group of friends among such a small group of people.\"<br><br>Duke: \"In addition, I've heard the students there can be rather competitive at times. Having endured being a part of a hyper competitive friend group during high school, this makes me anxious.\"<br><br>Maybe you should delve more deeply into what Grinnell has to offer? True it is smaller than Duke or Dartmouth, and Grinnell, IA is hardly a bustling metropolis. But it is LGBT friendly, no frats, lots happening on campus, and you'd get a lot of personal attention from faculty and be around intellectually-engaged classmates. The vibe is said to be more collaborative than competitive.<br><br>", "<b>Username: NerdyChica</b><br><br>If you really think that the Durham police department has nothing better to do than patrol bathrooms in restaurants around Duke's campus you are badly mistaken. The law will almost certainly be repealed in the next legislative session. It will not be enforced in the vicinity of Duke's campus and to suggest otherwise is wrongheaded.<br><br>This is NOT a salary survey. This is data that the federal government has obtained from tax forms. It is 100% accurate.<br><br>Also, there is no \"if\". The law has absolutely no bearing on Duke. That is a fact it's not a matter of opinion.<br><br>", "<b>Username: brantly</b><br><br>Duke is in the state of North Carolina. Many people and businesses do not want to go to NC or do business in that state because of the law. I am Jewish. If NC passed a law that said that Jews can't use the same bathrooms as non-Jews, I wouldn't care that Duke disagreed with the law. No way would I be attending any school in that state.<br><br>Also, as for the salary, doesn't Duke have an engineering school? I would assume that engineering grads raise the average early-career salary.<br><br>", "<b>Username: goingnutsmom</b><br><br>Has the president of Duke responded to the new law? I heard a report that UNC- CH's president said that it would be enforced on their campus. I think it would be advised to see what Duke opines on the matter.<br><br>I'm actually glad my kids were never interested in any NC school.<br><br>", "<b>Username: goingnutsmom</b><br><br>I don't really see anything in OP's post that is particularly excited about what Grinnell has to offer them. It was more about feeling honored that they were chosen for the award but nothing else.<br><br>Contrast that to someone who would be just gleeful and not hesitate to accept because they were sure it was a great fit.<br><br>So hence, the hesitation. And there is nothing wrong with that. You just need to be honest with what you feel is the right decision for yourself.<br><br>The difference between the earnings may have something to do with the kids each school tends to attract in the first place with Grinnell attracting a more laid back and academic minded student versus Duke attracting a more pre professional goal oriented type.<br><br>Both have bright kids but different focus. Grinnell may provide a more supportive environment to explore whereas Duke provides a place to hone in on skills.<br><br>", "<b>Username: goingnutsmom</b><br><br>Interestingly enough, I know of kids who went to both. Realize it's just a small sample but the parents who sent their kids to Grinnell were academic types and the parents who sent their kids to Duke were more business types.<br><br>Also, the Grinnell parents and kids strike me as not being interested in the prestige factor as much as the Duke parents and kids.<br><br>So if OP is interested in the prestige factor (again, nothing wrong with that if you can own it) Duke has the advantage there.<br><br>", "<b>Username: AboutTheSame</b><br><br>Dartmouth has a strong LGBT community, and the frat/sorority parties are open. It's not the typical Greek system.<br><br>", "<b>Username: goingnutsmom</b><br><br>^Good to know!<br><br>", "<b>Username: uesmomof2</b><br><br>With Bruce Springsteen canceling a concert and the NBA announcing that they will not hold the All Star game in North Carolina unless they repeal the law, I suspect that the pressure will grow to repeal it. But per this article in US News, Duke did issue a statement that \"its campus wont be affected, but went out of its way to condemn the bill.<br>\"Duke University values every individual. We are committed to equality, diversity and inclusion, which makes us a better and stronger community, according to the statement. For that reason, we deplore any effort to deny any person the protection of the law because of sexual orientation or gender identity.\" \"<url>http://www.usnews.com/news/articles/2016-03-24/the-long-reach-of-north-carolinas-lgbt-law</url><br><br>", "<b>Username: happymomof1</b><br><br>As others have written above, the difference in costs does add up over time. Here is a good calculator:<br><url>http://www.finaid.org/calculators/awardletteradvanced.phtml</url><br><br>Run the numbers with your parents. Talk about where the money would come from to cover the differences. Consider what that money could be used for if not for your college education. Look up transportation costs to and from all of the campuses, and talk about how often you would be able to get home.<br><br>Communicate with the financial aid offices at each campus, and find out how changes in your family income will affect the aid. Find out what you need to do in order to keep the merit scholarships for all four years.<br><br>", "<b>Username: tastypotatofries</b><br><br>Thank you to everyone who replied so far - I greatly appreciate it! :x The anti-LGBT HB2 law passed in NC has definitely been something I've been pondering about. Hopefully I'll get in touch with someone who is a student at Duke to discuss the issue with. I also see that I definitely have more research to do regarding Grinnell.<br><br>As silly as it sounds, I don't really think I know what I want... One day I feel like a small liberal arts school would be fabulous, another day I feel like a prime research university would be a better fit. However, future salary is something that is unequivocally important to me, considering I've seen my parents struggle over their financial burdens, so @NerdyChica 's post about Duke does seem enticing. The added student loans for Duke? - Not so much.<br><br>I'll keep you guys in tune with what I end up deciding. College Confidential has been such a welcoming, informative community over the past few months - I can't say thanks enough!<br><br>", "<b>Username: happymomof1</b><br><br>When you look at salary differentials, it really is important that you get a breakdown by majors. There may well be no differential for people with your major - or the differential may not be enough to make up for the difference in your costs within a reasonable amount of time.<br><br>", "<b>Username: goingnutsmom</b><br><br>One thing that has been researched is how a prestigious university can offer more to a lower socioeconomic student. But I don't know how these schools exactly fit into that category. My understanding was that at prestigious schools lower SES students make the connections and develop the social skill set to navigate the upper class environment.<br><br>Again anecdotal but may be worth mentioning is how the kids going to Grinnell from my experiences already had the connections through their parents and were able to get great career opportunities.<br><br>So it may be worth looking at what each school offers low SES students to shore them up in this area- supportive services.<br><br>", "<b>Username: insanedreamer</b><br><br>\"\"knowing that my choice can literally change the path of my entire life.. \"\"\"<br><br>No, it won't. So relax. These are all excellent choices. What you do with your time in college, the opportunities you take advantage of, connections you make, what you learn, how you change and grow as a person, will impact your future much much more than which of these 3 you attend.<br>\"\"As my family's source of income can very well fluctuate in the next four years, a full ride can give me the added sense of security.\"\"<br><br>This is a biggie. You don't want to have that hanging over you in addition to the challenges of college.<br><br>I can see the appeal of Dartmouth (\"ivy\") and Duke (\"ivy-ish\"), but honestly, I would advise you to go to Grinnell. The undergraduate education it provides is excellent, it's one of the top schools in the country in terms of the % of graduates who get PhDs (that tells you something about the student body), and it has a small focus with lots of attention, a welcoming atmosphere, cooperative, etc. Believe me, a degree from Grinnell is arguably just as likely to open doors for you, as one from Duke or Dartmouth, again, depending on how you use your college experience.<br><br>See: <url>http://www.thecollegesolution.com/the-colleges-where-phds-get-their-start/</url><br><br>", "<b>Username: SDonCC</b><br><br>Parent of a Grinnell student here. School offers amazing resources, individualized attention, connections to real-world experiences and learning, both on-campus and off. . For example, on campus, they offer short courses on \"Learning from Alumni,\" where alumni return to teach multi-week classes lessons on leadership, organization, etc. The idea that students who go to Grinnell succeed because they came in with connections is diametrically opposed to the school's vision and how it operates! Its commitment to social justice means that it puts its resources and attention into breaking down the barriers that have prevented an even playing field for many.<br><br>Grinnell also offers extensive opportunities for student research, and often the students win awards at the national levels, competing very well against students who attend universities.<br><br>I would not look at lists that report on what students earn after attending these colleges -- it reflects as much the student body, not what the school provides. Grinnell may graduate a greater proportion of students who go on to service / non-profits or grad school, so that is what is likely to drive these results. Many Grinnellians also go directly into business, too! Alot of the students are entrepreneurial-minded, and the school provides resources and attention to support this spirit. As well as resources for students interested in graduating directly into more established business opportunities.<br><br>I am not going to cast a vote here for which school is preferable for you -- these are very different institutions. I think that an on-campus visit is important to making a decision.<br><br>", "<b>Username: Sunny66</b><br><br>Also not casting a vote here, but I know someone who attended Grinnell and ended up graduating with Honors from Duke Law School.<br><br>", "<b>Username: mathyone</b><br><br>Have you also factored in travel costs to these schools? That can add up if you expect to go home for thanksgiving, xmas, and spring breaks.<br><br>If it's prestige you are concerned about, many people don't even know Dartmouth is in the Ivy League. I personally consider Duke to be a more prestigious school.<br><br>", "<b>Username: brantly</b><br><br>\"\"I would not look at lists that report on what students earn after attending these colleges -- it reflects as much the student body, not what the school provides. Grinnell may graduate a greater proportion of students who go on to service / non-profits or grad school, so that is what is likely to drive these results.\"\"<br>^^^This!<br><br>The college does not \"produce\" graduates who earn more, just as Liberty University does not \"produce\" conservative-leaning graduates. It's self-selecting.<br><br>", "<b>Username: csdad2</b><br><br>FWIW, there are threads on this site where people are discussing the new NC law, giving additional information and perspectives, e.g.:<br><br><url>http://talk.collegeconfidential.com/parents-forum/1879841-worried-for-lgbt-students-in-states-now-legalizing-discrimination.html</url><br><br>", "<b>Username: prezbucky</b><br><br>I think Grinnell is the best fit for the OP based on the OP's statements and, while it does not carry the overall cachet of Dartmouth or Duke, cachet won't make an unhappy student feel any better while he or she is there. It's four years -- choose the place that feels most like home.<br><br>Regarding the starting salaries, realize that the kids who make a lot of money coming out of Dartmouth and Duke tend to be doing it as Wall Street bankers or maybe as engineers. Grinnell is not exactly known as a hotbed of bankers and engineers. It's a comical argument. Besides, standard of living differences dictate that most areas of the Midwest pay less than most areas of the East Coast. $50,000 in Iowa buys the same stuff as probably $60-$70,000 in, say, Boston.<br><br>These are obviously all great schools. In your case, Grinnell might be the best fit:<br><br>- Lowest cost of the three<br>- No Greek life whatsoever<br>- Fairly laid back student body. People around here call it \"Iowa Nice.\"<br>- Top-notch academic quality, including all the usual pros of a LAC<br><br>Grinnell is rural. It's between, and not too far from, two cities (Iowa City and Des Moines), but the school itself is probably as rural as Dartmouth is. If that is a concern, take it into consideration.<br><br>If you have not yet visited them, try to do so.<br><br>", "<b>Username: NerdyChica</b><br><br>@csdad2 Keep resorting to these underhanded tactics. Your fear mongering is condemnable.<br><br>", "<b>Username: NerdyChica</b><br><br>@Sunny66, I know several people who graduated from Duke and attended YLS and Harvard Med. What's your point?<br><br>@brantly That's just speculation. You have absolutely no way of knowing whether or not it's true.<br><br>", "<b>Username: csdad2</b><br><br>@NerdyChica: This is potentially a very serious issue, and what is condemnable is to downplay it and not encourage the OP and others in a similar situation to gather what information they can and think seriously about how it might impact their college time.<br><br>Already over 100 businesses/business leaders have condemned the law, threatened to pull out business from the state or reconsider siting there (with some actually following through on that). Some cities and states have restricted travel to North Carolina. The NBA has indicated they will move next year's all-star game from the state. Bruce Springsteen has cancelled a concert there.<br><br>I suppose all these actions are condemnable as well!<br><br>", "<b>Username: NerdyChica</b><br><br>^ It is an issue that has no relevance to Duke.<br><br>Let us just agree to disagree. You can try to scare the OP into making a bad decision based on a law that will likely remain in place for a grand total of 3 months. I will educate him/her with the facts.<br><br>", "<b>Username: SDonCC</b><br><br>What might be interesting for the OP to consider looking into is how much / what the Duke students themselves are doing about the law. Are they being active in response? It would seem to me that this would be important information to have about the student body. So far, posters have talked about things the administration does to support issues of sexual and gender identity. Is it only top-down where the administration is leading the way or is it also bottoms-up, where student concerns are being raised and listened to?<br><br>", "<b>Username: Midwestmomofboys</b><br><br>@nerdychica -- While it may seem likely the law will be repealed in the next legislative session, those of us with experience living in states which have passed legislation seemingly at odds with the weight of public sympathy have seen that the intelligent relief people expect, doesn't always come to pass.<br><br>Here in Indiana, our Governor promoted and the legislature passed a state law which purported to be similar to the federal RFRA, but in fact, was a far more \"conservative\" piece of legislation. After a public relations disaster, with companies, major sporting events etc. threatening to bail out, the legislature amended the statute, but no one is quite clear what it means or what the impact has been on the state. Plus, that particular legislative fight turned out to be a warm up for this year's legislative session, with a series of additional \"culture wars\" type legislation. Similarly, in Wisconsin, when Gov Walker launched his attack on the UW system, many -- including myself -- thought the budget cuts and limits on power would not go through. They did. When a conservative governor has a conservative majority in the legislature, there are no guarantees about \"fixes\" going through. From the experience of someone who has watched in disbelief at some surprising legislative action, thinking the \"grown ups\" would step in and fix it -- there aren't necessarily \"grown ups\" in the NC legislature willing to tackle this issue.<br><br>For a student who travels in and out of NC, is engaged in internships, research, or community service off campus, for the time being, this is a real consideration.<br><br>", "<b>Username: spuding102</b><br><br>Don't listen to these people. Don't choose a college based on some law that has nothing to do with the school. I go to duke and can tell you that there has been absolutely no difference before or after this law. Objectively, I would pick duke. 28k difference in money is relatively nothing compared to life earnings difference. As objectively as I can say this, Duke is on the up trend while dartmouth is on the down trend.<br><br>", "<b>Username: hebegebe</b><br><br>Actually, I recommend that @csdad2 continue preaching high and low.<br><br>I want him to drive down admissions to all North Carolina colleges ... so that my D can apply to Duke next fall with less competition. ;-)<br><br>", "<b>Username: NerdyChica</b><br><br>It's just so annoying that people are exploiting a law that has absolutely no impact on students' lives to further an agenda. If you were to attempt to dissuade someone from attending UNC based on HB2 that could be legitimate (because UNC is within the ambit of the law) but you simply cannot make the case against Duke (in good conscience).<br><br>Try to promote Grinnell by pointing out an area in which it is superior to Duke. If you cannot find any data to make a compelling argument in favor of Grinnell, let the OP make the decision that is likely to secure his/her family's future. It's one thing to tell a wealthy student to go to Grinnell even though he/she is likely to make significantly more money as a Duke graduate. It's quite another to tell a student from the OP's socioeconomic background to make a decision based on completely irrelevant factors. Specially if you know that he/she is likely to regret the decision when it's time to get a job and support a family...<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Duke, as a private institution, is not an arm of the state like UNC, so has more latitude in enforcement. We went through something similar in Indiana last year with RFRA, and that law would have a potential impact on students the minute they walked off campus at Notre Dame, or Butler or any other private institutions in the state. As the OP specifically said they are concerned about inclusion in terms of LBGT issues, this is a relevant consideration.<br><br>More substantively, for a student with high need, Grinnell is the least expensive option, and Grinnell is a community and institution which is committed to socio-economic, racial, ethnic, LGBT inclusion. The President of Grinnell is a gay man, married, with children. I, and others, have encouraged the OP to research the options rather than, as the OP has stated they are trying to move away from, simply getting carried away by prestige and reputation.<br><br>What is the best choice for this student? With close faculty mentoring, phenomenal resources for student funding for research, internships, travel abroad, Grinnell could be a great option. Of course, Duke is a superb school. The question is, where will the OP flourish, academically, personally, without financial burden. Only the OP can decide that.<br><br>", "<b>Username: NerdyChica</b><br><br>^ Just to be clear (and put this to bed) there is no \"latitude\" in enforcement because there is no enforcement. The law doesn't apply.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>I'm referring to the part of the law which provides that local ordinances banning discrimination against LGBT community are invalid.<br><br>So, if local communities such as Raleigh or Durham had laws protecting against LGBT discrimination, those are now invalid and unenforceable under state law. Students who might venture forth off of campus of a private school cannot rely on local ordinances prohibiting LGBT discrimination.<br><br>", "<b>Username: Pizzagirl</b><br><br>The law doesn't apply ... until the student steps off Duke's campus.<br><br>NerdyChica, there is not a single one of your 458 posts where you have not just constantly pushed Duke down everyone's throat. It's a bit much. This student has 3 excellent choices - trying to portray Duke as the best is just so insecure on your part.<br><br>", "<b>Username: csdad2</b><br><br>Wow. @NerdyChica would love to put this to bed, getting the last word in. She will educate the OP with the facts, no one else need bother offering their comments. But really what she's offered is more unsubstantiated claims than facts.<br><br>As has been stated, the idea that this law isn't relevant to Duke is nonsense.<br><br>Easy example. Duke LGBT person tries to find an apartment in Durham. After initial agreement on a place, the landlord discovers they are LGBT and denies them the apartment. Later they are looking for a job, but again are refused because they are LGBT. What to do. Wait, Durham has an ordinance that forbids such discrimination. But wait again, the new North Carolina law overrules that ordinance. Duke LGBT person is out of luck.<br><br>Further, take a look at the statement that Duke came out with:<br><br>@Midwestmomofboys says is significant. Don't just assume this law will be repealed soon completely and that'll be the end of it. The Republicans tried to sneak it through, and will do simlar to minimize any repeal. They've already been downplaying the backlash, blaming it on the media. Even if they end up feeling they must do something, they can just make slight adjustments to the bill, and make a big deal that they've dealt with it, as they did in Indiana. Then they'll just make other anti-LGBT laws. What we need to see is a *complete* repeal of this law, and the people who voted for it voted out of office. Talk to me when that happens.<br><br>", "<b>Username: NerdyChica</b><br><br>^ I can come up with nonsensical hypotheticals as well. Easy example. Grinnell LGBT person tries to find an apartment in whatever random part of Iowa Grinnell is in. After an initial agreement is in place, the landlord discovers that they are LGBT and does not deny them the apartment. The student is thrilled but is struck by lightning on the way back to Grinnell.<br><br>That scenario is about as likely as the one you described.<br><br>This has nothing to do with Duke's statement. It is the way the law was written. \"McCrorys office says businesses arent limited by the bill, and that private companies and private universities can adopt new or keep existing nondiscrimination policies.\"<br><br><url>http://www.charlotteobserver.com/news/politics-government/article68401147.html</url><br><br>", "<b>Username: NerdyChica</b><br><br>@Pizzagirl Come at me with facts please. Make a case for Grinnell. Dispense with the theatrics.<br><br>", "<b>Username: Pizzagirl</b><br><br>I don't need to \"come at you.\" It's just ... very interesting that it seems to be impossible for you to say, when faced with a student who is deciding between Duke and any other similar elite school, \"those are all great choices, choose whichever one most speaks to you.\" There have been other Duke boosters who have done the same. It just looks so ungracious and odd that you have to insist on Duke's superiority on every dimension.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>Right, private entities are not required to implement the bathroom portion of the law, but the rest of the legislation provides that NO local anti-discrimination ordinances/protection are valid.<br><br>So the hypothetical about apartment hunting, internships etc. are all valid. Discrimination because a person is LGBT is legal in NC, even if local jurisdictions want to provide otherwise. So, Durham, Raleigh etc. can't just choose to be discrimination-free zones, because the State law says their laws banning LGBT discrimination are unenforceable. There is no remedy for LGBT discrimination, even if the local laws would otherwise allow it.<br><br>Back to the OP -- who is trying to decide between the more affordable option of Grinnell -- a highly regarded LAC -- and Duke -- a highly regarded private research university. The OP said they are concerned about not being swayed by prestige and reputation, are very concerned about finances, and want an LGBT-friendly community. Many of us said Grinnell is a great option, and that just because it is cheaper or in Iowa does not make it less desirable. As I noted earlier, the President of Grinnell is a gay man, married to his partner, with kids. Grinnell is one of the most diverse and tolerant LACs out there, with a $1.5 billion endowment which allows it to pour money into undergrad experiences and opportunities.<br><br>The OP has two (three, really, but Dartmouth seems to have fallen off their list) options, all of which will provide a superb education and experience, but they are different. None of them are obviously the \"right\" choice, most of us here are just offering our insight and advice about factors to consider.<br><br>", "<b>Username: NerdyChica</b><br><br>@Pizzagirl I have said that when I believe that both schools are equally good. I've said it about Chicago and if I was asked to choose between Duke and Stanford I'd probably choose the latter.<br><br>", "<b>Username: midnightpizza</b><br><br>At the end of the post, there is a statement about family financial flux.<br><br>\"As my family's source of income can very well fluctuate in the next four years, a full ride can give me the added sense of security\"<br><br>Peace of mind is a powerful thing.<br><br>And an extra $28,000.00 at the end of 4 years is a lot of money to most college grads.<br><br>Grinnell is an incredible school... no sacrifice there.<br><br>There are differences between these 3 excellent schools. But they have one thing in common...THEY ARE ALL GREAT.<br><br>If it were me, I would make sure I had as little to worry about as possible.<br><br>", "<b>Username: wisteria100</b><br><br>The OP says he will discuss the potential impact of the new law with students at Duke. No further need for us here to speculate on what it does or doesn't mean for this student.<br>We are also not privy to his finances, so can't really opine on whether the $28k is a deal breaker or not. That's for him and his family to work out.<br><br>", "<b>Username: NerdyChica</b><br><br>@midnightpizza \"No sacrifice there\" ... except for the fact that we've already established that recent Duke graduates make nearly twice as much money.<br><br>@wisteria100 Solid post!<br><br>", "<b>Username: Much2learn</b><br><br>I would want to investigate more to decide whether you are comfortable being LGBT in the south. I would proceed with caution.<br><br>", "<b>Username: NerdyChica</b><br><br>^ Yes, Duke's big bad campus is very dangerous for LGBT individuals... What a farce.<br><br>Duke is such a bastion of conservatism (insert sarcasm):<br><br><url>http://stanfordreview.org/article/following-money-stanford-faculty-overwhelmingly-fa/</url><br><br>\"Broadening the results to the entire election, the Stanford faculty donated $568,720 to Democratic candidates, and only $15,650 to Republicans. To compare to some other elite schools, Harvard donated $542,720 to Democrats and $30,551 to Republicans. Looking at a non-Ivy elite school, the faculty at Duke University donated $149,347 to Democrats and $23,850 to Republicans. While each of these schools exhibits an overwhelming preference for Democratic candidates, it is worth noticing that the ratio of Democrat to Republican donations was the most extreme at Stanford.\"<br><br><url>http://www.cbsnews.com/news/duke-faculty-gifts-overwhelmingly-favor-dems/</url><br><br>", "<b>Username: NerdyChica</b><br><br>In other news:<br><br>NC Governor issues executive order that partially repeals HB2<br><br><url>http://www.wsj.com/articles/north-carolina-gov-pat-mccory-vows-to-revise-transgender-law-1460491573</url><br><br>", "<b>Username: AboutTheSame</b><br><br>Governor's executive order does squat: <url>http://www.slate.com/blogs/outward/2016/04/12/north_carolina_governor_gov_pat_mccrory_issues_executive_order_on_hb_2.html</url><br><br>Oh, and please explain what provision of the North Carolina constitution allows a governor to\"repeal\" a law passed by the Legislature that he then signed.<br><br>", "<b>Username: midatlmom</b><br><br>Nerdychica - The governor cannot repeal a law that he just signed. Executive orders can clarify certain sections potentially, but the governor's executive order did not really change any of the main provisions of the law.<br><br>"]}