{"title": "stanford vs yale", "comments": ["<b>Username: ASJU9511</b><br><br>(Cross-posting from the other forums.)<br><br>", "<b>Username: debate4ever</b><br><br>Yale!!!!! It's definitely better in humanities and social sciences and catching up in stem. Stanford calls its stem students techies and humanities kids softies.<br><br>", "<b>Username: Lagging</b><br><br>@debate4ever It sounds like you don't go to Stanford because I've never heard of calling humanities kids \"softies\" (although yes, those in tech are sometimes called \"techies\" it's more because we like to abbreviate everything). I've been here four years in the humanities/social sciences.<br><br>OP - As far as your intended fields, both are outstanding academically and probably pretty comparable. US News ranks Stanford #2 and Yale #4 for Political Science. For Economics Stanford is ranked #5 and Yale #7. Really that difference is probably negligible. Stanford has outstanding non-STEM areas and as you can see, unlike debate4ever specified, Yale is not \"definitely better in humanities and social sciences.\" Both are generally outstanding.<br><br>Can't speak to Yale, but Stanford has a very collaborative atmosphere that leads to a greater sense of community than competition with one another. If you are interested in law school then keep in mind that having a high GPA is one of the most important components of your application. Some colleges have grade deflation (although again, I don't know if Yale is one or not). Stanford is generally considered to have slight inflation and certainly not deflation.<br><br>Weather - Stanford has very warm weather almost year-round. It very rarely rains and it's not uncommon for students to work outside in fall and spring (and also play pick-up soccer games or sand volleyball or frisbee).<br><br>Brand name - both are widely recognized. Alumni networking - again, I can't imagine they're that different. Stanford has a large and active alumni network.<br><br>Also, it's worth noting that Stanford has an outstanding education department (ranked #1, while I don't believe Yale is in the top 25). If you are interested in a few years of Teach for America or some other education-related gap then there are some great related courses you can take. There are also quite a few student volunteer groups on campus that tutor kids from East Palo Alto.<br><br>", "<b>Username: Lagging</b><br><br>Also, definitely attend both schools' admitted students weekends to get a feel for the campus!<br><br>", "<b>Username: ASJU9511</b><br><br>I'm definitely planning on attending both schools next week on their respective admit days.<br><br>", "<b>Username: ASJU9511</b><br><br>@Lagging that sounds really cool! So there actually isn't a social divide between STEMs and Humanities/Social Sciences majors?<br><br>", "<b>Username: Lagging</b><br><br>I don't think so - some of my closest friends are CS majors and pre-med. Most of your friends, at least initially, will be those who live with you in the same dorm or those in clubs with you regardless of major. You'll probably make some friends after sharing classes with them in your major, but that's more major/class specific than STEM vs humanities/social science.<br><br>Most students here try to take an intro CS course (usually 106A) for just the experience. CS/engineering majors are usually very supportive (and excited about!) their humanities friends trying out CS and vice versa.<br><br>", "<b>Username: fredthered</b><br><br>I know a little about the economics departments, especially at Stanford. Both Yale and Stanford have good econ departments. Stanford has recently had some very high profile hires. There was an interesting article in the NY Times. I will try to link to it:<br><br>Here it is:<url>http://www.nytimes.com/2015/09/13/upshot/how-stanford-took-on-the-giants-of-economics.html?_r=0</url><br><br>I would probably give the edge to Stanford, but Yale is good as well.<br><br>Both departments are technical in the sense of being mathematical. Historically, Yale was very mathematical, but now all of the top econ departments (including Stanford) are mathematical. To be an econ major at Stanford you must get at least a B in Math 51. A lot of kids take Math 51. I think all pre-meds do. It is a tough course, however. Yale also requires math, but it seems to be of a less advanced level. You should check out their website. I think as a result of the Math 51 requirement, you get pretty strong students majoring in econ at Stanford. At some schools econ is one of the weaker majors (e.g. it attracts a lot of jocks). This clearly is not the case at Stanford. I don't know about Yale.<br><br>Stanford has a great summer research program for economics (as well as many other majors). You work 10 weeks and get paid $6,400. Half the time is doing research for a faculty member, and half the time is doing your own research. The program is structured to help you start down this road. There are weekly meals and seminars for those who participate. I've heard great things about this program. There is more info on the Stanford econ department's website. Again, I don't know about Yale.<br><br>Hope this helps you. Good luck with your choice.<br><br>", "<b>Username: debate4ever</b><br><br>@Lagging I was wrong about softies. The term at S is fuzzies<br><br>", "<b>Username: ewho</b><br><br>Math 51/52/53 is also the lowest track for math major, so there are some math students in there too.<br><br>", "<b>Username: sbballer</b><br><br>Stanford has already eclipsed Yale and Harvard in many metrics... selectivity.. fund raising... number of faculty nobel prizes awarded this century Yale is a great school and is strong in humanities.. but no school matches Stanford's academic excellence in all disciplines engineering, tech, law, arts and humanities, medicine, education, biz etc.. btw.. Stanford was ranked by Higher Ed as also having the number one arts and humanities program in the world for what that's worth.. All rankings are subjective and full of bias so take everything with a serious grain of salt.<br><br>Stanford has interdisciplinary programs that merge humanities and STEM... not sure where you heard of a great divide but that doesn't sound like Stanford at all. In addition Stanford just spent 300 million on a new Contemporary Arts Museum, Arts building and a new concert hall.. whose acoustics were modeled after the Walt Disney Concert Hall in LA.<br><br>bigger problem for Yale is New Haven which is... IMO very depressing. the campus is nice but the surrounding area is unsafe, economically depressed with average incomes &lt;30k = not good.<br><br>definitely visit both schools... talk with the students and figure out which one is a better fit culturally. at the end of the day it's not going to matter if Stanford eclipsed Yale or Yale is better or this or that. it's about where you are going to be most happy so you can fully take advantage of the opportunities that each school affords.<br><br>", "<b>Username: sbballer</b><br><br>one other thing if you're interested in Teach for America last I heard Yale sent some crazy number of folks to that program - around 15% of the class in some years - if I'm not mistaken so Yale would have the edge there.<br><br>and of course Yale has the nobel prize winning prof Robert Schiller.. who is a giant in econ. I've seen his class videos on youtube and I think he's a fabulous professor. so something else to think about.<br><br>", "<b>Username: myyalieboy</b><br><br>Both of my kids got into Stanford and Yale. One chose Stanford and one Yale. You will not miss out at either place. Both kids chose the student body they liked the best. Both are perfectly happy. One doesn't care about not being Ivy (after years of chasing it) and the other does not regret not accepting the *new* top school.<br><br>", "<b>Username: renaissancedad</b><br><br>^ That's basically the right approach, IMO. Both are superb schools. Pick the one where you fit in best, and don't look back. Yale will be the right choice for one person, Stanford for another.<br><br>", "<b>Username: ASJU9511</b><br><br>@sbballer That is really cool to know!<br><br>Yeah, I'm definitely going to decide this week when I visit both schools.<br><br>", "<b>Username: Anonymoose3</b><br><br>Yale and Stanford are - for all intents and purposes - equivalents when it comes to academic prowess and prestige. Anyone arguing otherwise is splitting hairs and likely has some agenda or other.<br><br>Visit both schools or read about them - they have very different lifestyles. West Coast vs. East Coast? Four seasons or always sunny? Residential college system or moving around? Huge sprawling campus or no? City or self-encapsulated campus? (I've heard S students don't tend to go out to Palo Alto - it's not much of a college town - while Y students go into New Haven a lot.)<br><br>I think most people would be happier at one school over the other. I just chose Yale over Stanford, but it's very much a decision rooted in personal preference. Good luck!<br><br>", "<b>Username: sbballer</b><br><br>great choice.. although in terms of academic prowess and prestige Stanford is on the rise and Yale is fading or treading water especially internationally predominately because Yale is weak in STEM. I do think New Haven is a problem for the university.<br><br>", "<b>Username: Penn95</b><br><br>@Anonymoose3 i think the schools are on the same bracket for sure, but I don't think it is true they are equivalent for all intents and purposes. Stanford has the edge imo, because it is really strong in practically all fields whereas Yale is relatively lacking in certain fields.<br><br>", "<b>Username: Abbybearf</b><br><br>Stanford has that second best business school in the country, and their YouTube channel is very inciteful you should definitely check it out!<br><br><url>http://youtu.be/_Nq4Z5i7lcs</url><br>A student who attends: <url>http://youtu.be/KKXHKQ1i_Iw</url><br><br>", "<b>Username: Anonymoose3</b><br><br>People saying Yale is \"fading\" as an institution need to get a grip. People saying Stanford is not good enough to be art of the Ivy League need to get a grip. Both are among the ****very best and most well-respected schools you could go to****. When you say you went to HYPSM to a stranger or a future employer, the reaction will likely be \"Wow! You get an interview. O.K. now let's see what you can <i>do</i>.\" One school isn't substantially more prestigious than the other, and if you are trying to argue this you are (A) splitting hairs (B) likely not acquainted with the world - in which HYPSMC elicits an \"oh, OK, you're one of us\" (C) probably pushing some agenda or other. I say stop quibbling over which of these top four schools in the nation is the most academically prestigious because there are huge expansive gulfs of difference in other areas that will affect the rest of your life.<br><br><br>That is not to say there is no difference:<br><br>CS entrepreneur? Stanford<br>Want to live on the West Coast in the future? Stanford<br>Finance/Wall Street/Law School? Yale<br>Want to live on the East Coast in the future? Yale.<br><br>", "<b>Username: Penn95</b><br><br>@Anonymoose3<br><br>You are speaking in very broad terms here when you mention prestige. Also the division you do at the end is not completely correct.<br><br>No one is saying that Yale is way less prestigious than Stanford, of course not. However the fact remains that Stanford is super strong in all fields across the board while Yale is definitely relatively lacking in some STEM areas. For example, an engineering degree from Stanford and an engineering degree from Yale are worlds apart in terms of perception and prestige. A person interested in tech would prob not even consider turning down Stanford for Yale.<br><br>On the other hand, Stanford is a very viable option for Finance, Wall Street and Law school given its great strength in these areas. (Stanford has a better Econ department and much better business school than Yale, while its Law school is right behind that of Yale, and also Stanford is ranked the same or higher in most other humanities, social science fields). Also one could argue that there are higher chances of braking into Wall Street from Stanford since not as many students view than as the ideal job as at Yale --less competition.<br><br>Also no one ever says that Stanford is not good enough to be Ivy league. That would be laughable since Stanford has surpassed all of the Ivies in many metrics, including Harvard, let alone Yale.<br><br>No one is pushing an agenda. These are just the hard facts.<br><br>", "<b>Username: dfin2013</b><br><br>@ASJU9511 How were the admitted student days? Did you pick Yale or Stanford?<br><br>", "<b>Username: renaissancedad</b><br><br>^ This is a really silly conversation.<br><br>In my personal opinion, the only thing that should determine whether someone lucky enough to get in to both Stanford and Yale should be which collegiate environment appeals to them more. Anyone at either school with have plenty of opportunities and resources to do what he/she wants. And there will be accepted students for whom neither school is the preferred environment, which is equally valid.<br><br>", "<b>Username: sbballer</b><br><br>the conversation would have been very different even a decade ago. back then it was HYP.. no MIT or Stanford. Stanford has strengthened in many metrics fund raising, selectivity, nobel prizes... Yale is fading based on those metrics.. it's weak in STEM.. it's an old school humanities school. hopefully students like you will pressure Yale into doing an over haul.. it's getting left behind IMO..and getting bogged down by all the controversy surrounding college names, Halloween dress codes and the like. Meanwhile Columbia and Cornell are seriously beefing up their STEM departments as is Harvard which is building an engineering school (stanford of the east).. the game is different..the renaissance ideal has passed.. sitting around discussing Plato and Socrates and waxing about summers in the Hamptons went the way of the dodo bird. that's reality.<br><br>", "<b>Username: SAY</b><br><br>This qualifies as one of the silliest threads in CC history. The only decision is west coast versus east coast and weather.<br><br>", "<b>Username: bluewater2015</b><br><br>Obviously the OP has already decided at this point, but I have to agree that some of the comments on here are silly. Both are great institutions and it comes down to personal preference.<br><br>sbballer, if you are a Stanford student, why don't you ask some of your professors if they think Yale is fading and going the way of the dodo bird.<br><br>", "<b>Username: sbballer</b><br><br>weakness in stem and inability to innovate and adapt is going to affect the long term prospects for a school.. fund raising... selectivity.. ability to recruit faculty. may not be so obvious now but looking out 20-40 years it will be. I don't think anyone at Stanford thinks of Yale as being a competitor... harsh to say but that's the way it is. Yale is a great school yes.. but it's lost a couple notches this decade. It's not even the top five in fund raising or top 10 in nobel prizes in the past 15 years. It's selectivity has dropped to 4th.. you can say it's silly.. I say Yale needs an overhaul and a new vision or it's going to be left further behind. yes Yale has done a fantastic job with its endowment and hopefully the university will use some of its vast resources to invest in STEM and innovation. Being just a liberal arts school is not going to cut it. that's reality.<br><br>", "<b>Username: Waiting2exhale</b><br><br>The president of Stanford, John L. Hennessy, spoke to the admitted students at the most recent admitted students days and had no trace of the tone of condescension and embattled rise for positioning among its peer institutions that are rife in your comment above, @sbballer.<br><br>", "<b>Username: sbballer</b><br><br>the metrics speak for themselves. interpret them as you want. surprised that Yale is not making a big push into STEM...continuing to ignore or not place top priority for STEM is hurting them now and will be even more detrimental to the university in the future.<br><br>", "<b>Username: ASJU9511</b><br><br>Hi guys! I picked Yale over Stanford. To give you the brunt and truth of it, it didn't come down to weather or coastal geography for me. It came down to the people. I loved Yale because there was a great balance of STEMs and Humanities students. I adored the air of seriousness that the students had for their passion. At Stanford, I definitely felt a bit more left by the wayside since every student I talked to, current and pre-frosh, all seemed to be going into the STEMs. Plus my being didn't agree with the lack of community that Stanford had compared to Yale. And, to be perfectly honest and I mean no offense to any students going there, it felt more like a corporation than an actual school.<br><br>", "<b>Username: renaissancedad</b><br><br>@ASJU9511, that sounds like exactly the way decisions should be made. 2 great institutions, but one clearly felt more comfortable to you and resonated more with you. Screw all the talk about rankings in specific departments. There's plenty of opportunities at either school to do whatever you want.<br><br>Congrstulations on your choice, and good luck!<br><br>", "<b>Username: Planner</b><br><br>@ASJU9511 Congratulations, and thanks for letting us know! Your perspective on Stanford was interesting, and I'm sure you'll have a wonderful time at Yale (which, despite the increasingly prevailing perception of it as no longer being a true peer of Harvard and Stanford, is every bit as great overall, in my opinion)!<br><br>", "<b>Username: ewho</b><br><br>@OP, congrats and good luck.<br><br>Agreed with @Planner for your comments on the school that accepted you.<br><br>Our pink-noise minds react to the brown-noise exponential changes in a linear fashion. So, the results of the acts appear as white-noise events. Nothing is good or bad but different.<br><br>", "<b>Username: Waiting2exhale</b><br><br>What does that mean?^^^<br><br>", "<b>Username: SAY</b><br><br>sbballer I have a child at Stanford and a child at Yale but your comments about Yale are nonsensical. It's like arguing that a 20 dollar bill is much better than two tens. HS students should refrain from such sweeping statements because things will look very different when you are older.<br><br>", "<b>Username: sbballer</b><br><br>the best school is the best school for you. congrats!<br><br>", "<b>Username: texaspg</b><br><br>@ASJU9511 - Congratulations on being able to make a decision but don't look back. There was a parent last year whose son committed to both schools in a span of one week (I think he reversed his decision twice). :D<br><br>@waitingtoexhale - I went to two parent weekends just to listen to Hennessey. He is one of the best speakers I have ever heard. The first year he told a parent who was worried that her liberal arts student will not fare well in the job market that all he needed was to add the beginner CS course to his resume and most companies will hire him. I think the logic was that most tech companies also need many liberal arts majors but they need to feel comfortable that they understand the business. Hennessey has supported the liberal arts programs a great deal and expanded and built all of the right things (Bing, Art Musuem etc) that provide a great future. The growth in the endowment during his term has been phenomenal and Stanford will miss him at the top.<br><br>", "<b>Username: sbballer</b><br><br>actually the Stanford endowment has been lagging and the returns have been relatively poor. Stanford changed their endowment team last year and brought in a new team headed by a Robert Wallace who used to work at the Yale endowment.<br><br>what you may be referring to is that Hennessy was a master at fund raising. Stanford has been the top fund raising university 10 of the past 11 years (last year raised more than Harvard and yale combined).. even more remarkable considering other universities including Harvard and USC are in major capital campaigns and formal fund raising drives and Stanford is not.<br><br>Hennessy is staying at Stanford though.. he's going to be leading the Knight Hennessy scholar program which will be the rhodes scholar equivalent (2x as large as rhodes) at Stanford with a 700 million dollar endowment. - Phillip Knight donated 400 million to the cause 2 months ago.<br><br>Yes Hennessy has been an incredible force at Stanford and his achievements during his tenure are too many to list here. suffice it to say he's probably been one of the most transformative university presidents in the US.<br><br>", "<b>Username: texaspg</b><br><br>@sbballer - growth can happen just by putting more money in. They have been adding new money at billion dollar clips each year.<br><br>", "<b>Username: cttwenty15</b><br><br>@ASJU9511 - Congratulations and Welcome to Yale! I just finished my first year there, and the residential college system, the professors, my classmates, the extracurriculars, the course offerings and flexibility, and the campus have exceeded my expectations. You will love it!<br><br>"]}