{"title": "columbia vs princeton", "comments": ["<b>Username: chesterstreet</b><br><br>Any ideas?<br><br>", "<b>Username: kappachino</b><br><br>none, except I'm in the same situation as you! try admit weekend?<br><br>", "<b>Username: japanoko</b><br><br>hey guys, two great universities, congratulations<br><br>you just can't go wrong with each<br><br>here is a thead that discusses Princeton v. Columbia v. a couple of others:<br><br><url>http://talk.collegeconfidential.com/princeton-university/1116931-princeton-vs-mit-vs-yale-vs-caltech-vs-columbia.html</url><br><br>", "<b>Username: randombetch</b><br><br>Princeton vs Columbia isn't even close, come on. If you really want to be in NYC and don't care about all of the advantages that Princeton offers, then maybe.<br><br>", "<b>Username: cmburns14</b><br><br>well, I live in California and here, Princeton and Columbia have the same rep. IMO, Princeton can be a better learning environment for undergraduates because there are a lot less grad students and virtually no professional students on campus.<br>Columbia is kind of dominated by grad and professional students.<br><br>That said, for pre-meds who want to assist in research at a world-class medical center, Columbia would be far preferred. Also, for pre-Wall Street types, studying in NYC is a decided advantage to secure school-year internships at investment banks, hedge funds, private equity firms, etc.<br><br>Wall Street recruiting and law, med prospects should be excellent for students at both schools. Both are at the very top for new hires at places like Goldman Sachs, Morgan Stanley, etc. (along with Wharton and Harvard of course).<br><br>Engineering is comparable at both schools with a slight nod to Columbia.<br><br>", "<b>Username: randombetch</b><br><br>\"Also, for pre-Wall Street types, studying in NYC is a decided advantage to secure school-year internships at investment banks, hedge funds, private equity firms, etc.\"<br><br>Lol Princeton is so far superior to Columbia when it comes to Wall Street it's not even remotely close. We have major players in every investment bank doing interviews of Princeton students. Princeton, Harvard, and Wharton are widely regarded as the best three schools to go to for pre-finance. Columbia is considered under Yale, Stanford, and MIT which come after HPW.<br><br>Princeton's also a lot better than Columbia when it comes to engineering. I have no idea how you formed these reputation ideas. Fu is not really considered that good. Princeton is usually ranked pretty highly when it comes to engineering despite the fact that we have a much smaller engineering school (and for some reason USNews uses # of PhD's awarded per year as a major criterion).<br><br>", "<b>Username: cmburns14</b><br><br>Engineering- Columbia is ranked slightly higher than Princeton:<br><a href=\"http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-engineering-schools/eng-rankings\" rel=\"nofollow\">Best Engineering School Rankings | Engineering Program Rankings | US News</a><br><br>Wall Street- well, I worked at Merrill Lynch in sales and trading before grad school. In the banking division, night analysts are Columbia and NYU juniors with high GPAs who come in at 5 and leave around midnight three days a week. It's a lot of work but these people have a huge advantage getting into Summer Analyst programs. Same thing with GS Principal Strategies and GS structured products desks- check Linked In- Columbia grads have greater total representation than Princeton. Maybe on a relative basis your assertions are true. I didn't go to either school.<br><br>", "<b>Username: randombetch</b><br><br>I don't know why you would use Linked In representation as a measure of how good a college is for Wall Street jobs. I'm sure NYU Stern has a very high representation too since they simply have way more people going to Wall Street than Princeton, but it would be ridiculous to say Stern is better for Wall St. than Princeton.<br><br>How many Columbia students are night analysts? Sounds like a not very efficient program from the point of view of the firms. Maybe they have a huge advantage over the Columbia students that don't do this program, but probably not any advantage at all over Princeton students. When you look percentage wise, I'm sure the hiring rate is a lot higher for Princeton than Columbia.<br><br>You know what else gives an advantage? Having a really strong sophomore year internship, which many Princeton students are able to secure.<br><br>", "<b>Username: chesterstreet</b><br><br>Well I'm hoping to do Pre-med, with an interest in neuroscience. So I'm looking for opportunities for research, work experience, etc.<br>Any comments? I'm not completely career-focused as many maybe. I just want to go to a place where I can pursue my academic interests.<br>I know Columbia has its affiliated hospital and great medical opportunities. But what's the Princeton pre-med scene like? Where do Princeton pre-meds go for work experience and research?<br><br>", "<b>Username: japanoko</b><br><br>\"\"Engineering- Columbia is ranked slightly higher than Princeton:<br>Best Engineering School Rankings | Engineering Program Rankings | US News\"\"<br><br>cmburns, Columbia is not even close to Princeton in Engineering. The graduate school rankings for engineering from USNWR that you quote use a methodology that is erroneous by using overall Research Expenditures as a measure instead of Research Expenditures per engineering student - thereby punishing the smaller engineering departments.<br><br>Within those rankings, however, the peer assessment and recruiter assessement segment of the rankings tell a better story - resulting in Graduate school engineering rankings of 10th for Princeton and Columbia 21st. In the USNWR undergraduate rankings, purely based on peer assessment, Princeton is ranked 11th and Columbia 26th......<br><br>More imporantly, if you review the extensive NRC rankings that recently came out, you will find that Princeton Engineering is ranked 2nd, 2nd, 4th, 6th and 9th in the five core engineering areas of EE, CS, Civ.E., ChE and MechE, respectively. Columbia, on the other hand FAILS TO MAKE THE TOP TEN in any of these five core engineering departments.<br><br>Additionally, this link will show you a comparison of Princeton and Columbia Engineering worldwide:<br><br>Top 50 Engineering and Technology Universities 2010<br><br><a href=\"http://www.timeshighereducation.co.uk/world-university-rankings/2010-2011/engineering-and-IT.html\" rel=\"nofollow\">Top Universities for Engineering &amp; Technology 2010-2011</a><br><br>As you can observe, <b>Princeton Engineering is ranked 4th worlwide</b>, behind only Caltech, MIT and Stanford. <b>Columbia Engineering fails to make the top 50.</b><i> (note: this is not a misprint, Columbia Engineering fails to make the top 50</i>)<br><br>", "<b>Username: japanoko</b><br><br>randombetch, you are correct, for Investment Banking, Private Equity, Hedge Funds and top Consulting Firms, Harvard, Wharton and Princeton form a top tier. Columbia is stationed in the middle of the next tier.<br><br>", "<b>Username: japanoko</b><br><br>Finally, if you want to compare the quality of undergraduate education at Columbia v. Princeton, all you have to do is read this:<br><br><url>http://talk.collegeconfidential.com/12334505-post93.html</url><br><br>and this:<br><br><url>http://talk.collegeconfidential.com/12335245-post99.html</url><br><br>nothing else needs to be said.<br><br>", "<b>Username: cmburns14</b><br><br>Japanoko,<br>I don't care as much as you do- anyone who knows engineering knows Princeton has excellent faculty across the board. I don't think Princeton is a smaller engineering school than Columbia so you're off in that respect. Some departments at Columbia like ChemE are really small. Alot of Princeton students who study engineering seem to do ORFE as a major for Wall Street. Not saying there is anything wrong with that. At Columbia, these same sort of people do IEOR, also for Wall Street recruitng. Neither school produces the cadre of talented engineers for industry that UCB, Stanford and MIT do.<br><br>By research productivity, it really depends on the metric. You can look at members of the NAE (Princeton 28, Columbia 16) or Nobel Prizes (Columbia 97, Princeton 32). I didn't have the patience to narrow the Nobels down to science prizes.<br><br>Also, the THES rankings are one ranking. According to ARWU, Princeton and Columbia are pretty similar.<br><br>Let me reiterate I didn't go to either.<br><br>University Profiles Resources Contact<br>Academic Ranking of World Universities - 2010<br><br>1 Harvard University Americas<br>2 University of California, Berkeley Americas<br>3 Stanford University Americas<br>4 Massachusetts Institute of Technology (MIT) Americas<br>5 University of Cambridge Europe<br>6 California Institute of Technology Americas<br>7 Princeton University Americas<br>8 Columbia University Americas<br>9 University of Chicago Americas<br>10 University of Oxford Europe<br>11 Yale University Americas<br>12 Cornell University Americas<br><br>", "<b>Username: cmburns14</b><br><br>hmm,<br><br>Columbia is middle tier for Wall Street?<br>I don't know- checking Wikipedia- Warren Buffett, John Kluge, Henry Kravis, Leon Cooperman, David E Shaw, Noam Gottesman, Louis Bacon, Dan Loeb, Vikram Pandit, Mario Gabelli, Stephen Friedman, James Gorman, Raanan Agus, Mark McGoldrick, Richard Ruzika-<br><br>that's quite an alum list for one university.<br><br>", "<b>Username: japanoko</b><br><br>\"\"hmm,<br><br>Columbia is middle tier for Wall Street?<br>I don't know- checking Wikipedia- Warren Buffett, John Kluge, Henry Kravis, Leon Cooperman, David E Shaw, Noam Gottesman, Louis Bacon, Dan Loeb, Vikram Pandit, Stephen Friedman, James Gorman, Raanan Agus, Mark McGoldrick, Richard Ruzika-<br><br>that's quite an alum list for one university.\"\"<br><br>cmburns, seriously?<br><br>we are discussing undergradute schools and you are putting Columbia graduate school students instead to prove your point<br><br>are you serious?<br><br>", "<b>Username: cmburns14</b><br><br>well good point to clarify-<br><br>randombetch said:<br>Lol Princeton is so far superior to Columbia when it comes to Wall Street it's not even remotely close. <b>We have major players in every investment bank doing interviews of Princeton students.</b><br><br>It looks like Columbia has \"major players\" as well- someone who did an MBA at Columbia or HBS or Wharton will probably look favorably at an undergrad from those places... sometimes the slightest edge is all that matters in a competitive job market.<br><br>Anyway, I am only taking Columbia's side on this one because a lot of people at Princeton drink the kool-aid. The real world doesn't care about educational pedigree anywhere as much as people on CC think.<br><br>", "<b>Username: japanoko</b><br><br>\"\"by cmburns:<br>I don't think Princeton is a smaller engineering school than Columbia so you're off in that respect.\"\"<br><br>cmburns, listen, why in the world would you want to defend a department at Columbia that you know nothing about?<br><br>Columbia has 3 times the number of engineering students than Princeton<br><br><br>Engineering Students<br><br>Columbia<br>1,459 - Undergraduate<br><u>2,004 </u>- Graduate<br>3,463 - total Columbia Engineering Students<br><br>Princeton<br>845 - Undergraduate<br><u>535</u> - Graduate<br>1,380 - total Princeton Engineering Students<br><br>", "<b>Username: japanoko</b><br><br>\"\"Also, the THES rankings are one ranking. According to ARWU, Princeton and Columbia are pretty similar.<br><br>Let me reiterate I didn't go to either.<br><br>University Profiles Resources Contact<br>Academic Ranking of World Universities - 2010<br><br>1 Harvard University Americas<br>2 University of California, Berkeley Americas<br>3 Stanford University Americas<br>4 Massachusetts Institute of Technology (MIT) Americas<br>5 University of Cambridge Europe<br>6 California Institute of Technology Americas<br>7 Princeton University Americas<br>8 Columbia University Americas<br>9 University of Chicago Americas<br>10 University of Oxford Europe<br>11 Yale University Americas<br>12 Cornell University Americas\"\"<br><br>cmburns, I am sorry, but we are discussing Princeton Engineering v. Columbia Engineering<br><br>would you care to discuss what part of the rankings that you posted above relate to the Engineering departments of these two colleges?<br><br>", "<b>Username: japanoko</b><br><br>\"\"Alot of Princeton students who study engineering seem to do ORFE as a major for Wall Street. Not saying there is anything wrong with that. At Columbia, these same sort of people do IEOR, also for Wall Street recruitng. Neither school produces the cadre of talented engineers for industry that UCB, Stanford and MIT do.\"\"<br><br>cmburns, wrong again<br><br>the Princeton ORFE department is only about 24% of the overall Princeton Engineering department in terms of number of students....<br><br>and<br><br>you are wrong about Princeton Engineers, they are at the level of MIT, UCB and Stanford engineers for industry<br><br>", "<b>Username: cmburns14</b><br><br>OK, well I stand corrected about the size of Columbia engineering- it's a little misleading because both schools draw on graduate research groups with a PI and a ton of post-docs who are not counted in your stats. Also, you have to look at it department by department. At Columbia, IEOR has to be the biggest (at least from anecdotal info).<br><br>Also a larger school = more faculty = more research opportunities and more peers. This is why the Big 10 schools are generally the best places to study engineering.<br><br>Do you agree or disagree that the typical career path for both a Princeton BSE and Columbia BSE is a career in financial services, law or non-technical consulting rather than an R&amp;D role at a technology company?<br><br>It's getting a little late here but I'd be happy to carry on with this discussion in the future.<br><br>", "<b>Username: japanoko</b><br><br>\"\"Anyway, I am only taking Columbia's side on this one because a lot of people at Princeton drink the kool-aid. The real world doesn't care about educational pedigree anywhere as much as people on CC think\"\"<br><br>cmburns, seriously there is no kool-aid here.<br><br>Princeton is simply a much better school than Columbia and provides a much bettern learning environment for undergraduate school, which is why the cross-admit ratio is about 90/10 in favor of Princeton and will continue to be so in the future....<br><br>", "<b>Username: japanoko</b><br><br>\"\"It's getting a little late here but I'd be happy to carry on with this discussion in the future.\"\"<br><br>cmburns, there is no conversation here<br><br>you have only posted false and misleading information and I have posted the factual data that has proven you wrong...that is all<br><br>", "<b>Username: cmburns14</b><br><br>Princeton is simply a much better school than Columbia?<br><br>huh? at least I'm objective since I don't have a horse in this race.<br><br>Unless you are one of the top 5 math students at Princeton, competitve to place as a Putnam Fellow, I highly doubt you would have the academic background to draw such a distinction.<br><br>If your writing is indicative of a typical Princeton student, it suggests a place of tremendous undeserved superiority complexes.<br><br>", "<b>Username: GeraldM</b><br><br>For undergraduate education, Princeton is certainly better, as it's main focus are undergrads. Regarding prestige: both are extremely prestigious, but Princeton is slightly -?- more prestigious: it's one of the \"Big Three\", and everyone knows that it provides probably the best undergraduate education in the US. It should cause no surprise that most likely you will have better chances on the workforce with a Princeton degree.<br><br>The settling of course differs heavily: one suburban paradise (not just the Princeton campus is gorgeous, but the town is pretty good too, the safest in the Ivly League, together with Ithaca) in contrast with some of the...interesting parts of NYC. You can't go wrong choosing either.<br><br>", "<b>Username: FightTheTide11</b><br><br>When you talk about the top 10 universities worldwide, it's pretty tough to draw large distinctions at an undergraduate level in just about every field other than perhaps math and maybe physics. Chesterstreet, if you want to do neuroscience research, there might be no better place to do so than at Princeton's brand spankin' new neuroscience facility, scheduled for completion in 2013. And if you want to pursue the neuroscience certificate, not only is research an option, it's a requirement for independent work: <a href=\"http://www.princeton.edu/ua/departmentsprograms/nup/\" rel=\"nofollow\">Undergraduate Announcement</a><br><br>I don't know much about the pre-med program here, but maybe this link to the health professions advising site will help you out: <a href=\"http://www.princeton.edu/hpa/\" rel=\"nofollow\">Health Professions Advising</a><br><br>I never really read into Columbia because the core curriculum was a big turn-off for me, and I really didn't want to live in NYC. I'm sure there are plenty of big things to consider between Princeton and Columbia that don't have to do with miniscule differences in engineering rankings.<br><br>", "<b>Username: randombetch</b><br><br>I don't understand how people can even argue Columbia and Princeton are similar when it comes to a career in engineering or finance because Princeton is so clearly better. The difference isn't dramatic (ie: Columbia won't prevent you from have a successful career, Princeton won't guarantee it), but it's clear. Of course this is just my opinion, and I can't objectively prove my opinion.<br><br>As far as pre-med, I've heard pretty bad things about Columbia pre-med classes being cut-throat and gigantic. I was pre-med for 2.5 years here, so I took all my pre-med requirements and I really enjoyed all my pre-med classes here. Our organic chemistry class is open notes, open book because the professor says straight up \"organic chemistry is not about memorization\" - the class is all about problem solving and application of concepts.<br><br>", "<b>Username: beautifulday</b><br><br>My absolute favorite description of Princeton is \"suburban paradise.\" Sounds delightful.<br><br>", "<b>Username: PtonAlumnus</b><br><br>Chester, I apologize to you for the rants about which is a better school. There are pluses to both Columbia and Princeton. Rather than say which is better I will attempt to provide YOU with information so that YOU can decide which is better for YOU.<br><br>Where do Princeton pre-meds go for work experience and research?<br><br>Princeton pre-meds stay on campus to conduct medical research. Medical research is not done off campus at a medical center a mile away. Review the program of study for molecular biology students: <a href=\"http://www.molbio.princeton.edu/index.php?option=com_content&amp;task=view&amp;id=44&amp;Itemid=99\" rel=\"nofollow\">Princeton University - Department of Molecular Biology - Research Opportunities</a> and the the paid summer research jobs available: <a href=\"http://www.molbio.princeton.edu/index.php?option=content&amp;task=view&amp;id=321\" rel=\"nofollow\">Princeton University - Department of Molecular Biology - Summer Undergraduate Research Program</a><br><br>Medical research is conducted all over the Princeton campus. The Princeton Neuroscience Institute offers a plethora of courses and summer research opportunities. See: <a href=\"http://www.princeton.edu/neuroscience/education/undergraduate-education/\" rel=\"nofollow\">Undergraduate Education *Princeton Neuroscience Institute</a> The Lewis-Sigler Institute for Integrative Genomics is researching the frontiers of quantitative biology. See: <a href=\"http://www.princeton.edu/genomics/\" rel=\"nofollow\">Genomics</a> The Chemical and Biological Engineering Department is doing interesting bioengineering research. See: <a href=\"http://www.princeton.edu/cbe/research/bio/\" rel=\"nofollow\">Bioengineering -*Chemical and Biological Engineering</a> If you like physics the Princeton Physical Sciences-Oncology Center is conducting National Cancer Institute research on cancer on the Princeton campus. See: <a href=\"http://www.princeton.edu/psoc/\" rel=\"nofollow\">Physical Sciences-Oncology Center</a><br><br>More than 20 percent of Princeton's engineering faculty are engaged in health-related research. I will provide just one example. Professor of Electrical Engineering Claire Gmachi, a MacArthur genius Fellowship winner, is working to develop a key chain size quantum cascade laser to detect breath chemicals to guide clinical treatment without blood tests. The laser is expected to detect diabetes, kidney, liver, and lung disease. Professor Gmachi has received a grant from the Schmidt Fund to develop a mid-infrared cascade laser to enable diabetic patients to conduct non invasion continuous glucose monitoring. The goal is to develop a clip-on sensor for the fingertip or earlobe that can serve as a prototype for commercialization.<br><br>If you like mathematics consider the research conducted by Professor Floudas. Christodoulos Floudas, a member the National Academy of Engineering, combined concepts from optimization theory with those of computational biology to develop a method of discovering new drugs for a range of diseases by calculating which physical properties of biological molecules may predict their effectiveness as medicines. Out of millions of possible peptides, the Princeton researchers used their formula to narrow their search to five promising drug candidates, each 12 amino acids long, one-third the length of Fuzeon. Their collaborators at Johns Hopkins then tested whether the peptides were truly effective at preventing HIV from entering human cells. The Johns Hopkins scientists found that four of the five designed peptides inhibited HIV and that one of the peptides was particularly potent, even against strains of HIV that are resistant to treatment with Fuzeon. They also found that peptides designed by the Princeton researchers were nontoxic to cells. \"One could never test all the possible peptides to see if they are effective against HIV,\" Floudas said. \"But this model was able to sort through millions of possibilities and identify just a few that show promise.\"<br><br>Visit Princeton during the Princeton Preview days. You will find that medical research is being conducted on the main Princeton campus in almost every scientific and engineering department!<br><br>", "<b>Username: FightTheTide11</b><br><br>policoco, Buffett graduated from Nebraska, Gorman went to Xavier, Bob Stevens went to Slippery Rock, and Mike Duke went to Georgia Tech. We're talking about undergrad study here, not business school.<br><br>", "<b>Username: BioE91</b><br><br>Hey guys,<br><br>so i was just skimming this thread and was just blown away by how awesome (&lt;---soo the right word) you guys are @ getting these acceptances; I'll be starting my 3rd year at UCSD but when i was in high school, Princeton and Columbia were not even realistic, and for you guys to be discussing Harvard v Princeton v Columbia, is just so sick;<br><br>i just wanted to stop by and congratulate all you guys for doing soo incredibly amazing these past years to get into such amazing schools as these;<br><br>kudos guys and keep up the great work!<br>-BE<br><br>", "<b>Username: GeraldM</b><br><br>beautifulday: I am painfully aware of the nature of the Columbia neighbourhood, while, in contrast with many NJ cities, Princeton is a fine town...<br><br>", "<b>Username: chesterstreet</b><br><br>FightTheTide11 and PtonAlumnus ---<br><br>Thank you so much for all your advice. Thanks for taking the time.<br>This is all very helpful<br><br>", "<b>Username: chesterstreet</b><br><br>BioE91---<br><br>Thanks!! But seriously, if I can do it, anybody can. Personally I feel very privileged to be able to go to college, stunned at getting to Pton and Columbia and am honestly a bit intimidated at the thought of studying alongside these geniuses. I'm going to try to make the most out of my opportunities.<br><br>", "<b>Username: randombetch</b><br><br>Buffet went to Wharton and U of NE... Plenty of Princeton grads went to Columbia b-school...<br><br>Princeton graduated 3 of the 9 current supreme court justices, CEOs of Google, Amazon, and eBay.<br><br>", "<b>Username: japanoko</b><br><br>\"\"On average, Columbia graduates are far more successful than Princeton graduates.<br>e.g. President Obama, Warrent Buffet, Citi Bank CEO, etc.<br><br>Why ? Because Columbia is more selective school.\"\"<br><br>so konradph, why don't you take the time to show us the proof that Columbia undergraduates are far more successful than Princeton undergraduates...<br><br>oh, and by the way, when you list alumni of Columbia, please list undergraduate alumni, not the graduate alumni that you have listed above..<br><br>thanks<br><br>", "<b>Username: japanoko</b><br><br><url>http://wsjclassroom.com/pdfs/wsj_college_092503.pdf</url><br><br>1. Harvard - 21%<br>2. Yale - 18%<br><b>3. Princeton - 16%</b><br>4. Stanford - 11%<br>.<br>.<br>.<br>.<br>.<br>.<br><b>11. Columbia - 7%</b><br><br>", "<b>Username: japanoko</b><br><br><url>http://talk.collegeconfidential.com/12392038-post18.html</url><br><br>antonia7<br>New Member<br><br><br>Join Date: Oct 2010<br>Posts: 18<br><br>I visited Columbia for an official visit (athletic recruit) a couple of months ago, so I don't know that much, but I will share what I do know.<br><br>The campus is pretty small (still nice), but extremely crowded/busy with people who don't even go to Columbia. People who work in Manhattan continuously cut across the campus to use it as a short-cut to get to wherever they're going. And there are tons of graduate students sprawling about the place.<br><br>Classes are HUGE! I sat in on three classes, each with around 200 students. The professor had to use a microphone, lol. I felt a real disconnection between teacher and student, but maybe I just visited the wrong classes. A lot of focus seemed to be on graduate students, but I'm sure you've already heard that.<br><br>The dorm I stayed in was pretty crappy: the bathrooms were old/dirty, the main television was broken, and they were extremely small (again, I can only talk about the dorm I visited. I don't know about the rest).<br><br>The food was awful! Haha, this may sound trivial, but I thought I should point it out. For the 3 days that I was there, I lived on granola bars and fruit. Even the students told me, \"Don't judge us by our food.\"<br><br>I didn't get a sense of school pride. The athletic facilities are a 20/25 minute bus ride from campus, so games don't get packed. That said, there is a nice underground facility on campus that has gyms and stuff.<br><br>A lot of the students do go out into the city instead of staying on campus, but I'm assuming that's a reason why they chose Columbia. On the floor I was staying on, pretty much every person was out on Friday night at a baseball game, restaurant, clubbing, etc. My host told me that's pretty common.<br><br>In the end, I chose Dartmouth over Columbia because it seemed a better fit in terms of focus on undergrads (Teachers recognized their students by name walking around campus. The 2 professors I met even stopped me on the green to tell me that I should go to Dartmouth), opportunities, love for the school, etc. Don't get me wrong, I love Columbia! They were my top two choices, and it was an extremely difficult decision.<br><br>All three of your choices are fantastic, and you should choose the one that you feel the most comfortable in. I get the sense that you will be happier at JHU (or maybe Penn?), but that's just me lol.<br><br>I really hope I helped, and let us know what you decide. Good luck! and Congrats!<br><br>", "<b>Username: japanoko</b><br><br>\"\"WSJ used wrong number. about 1200 graduates from Columbia College/Engineering.<br>Columbia GS shouldn't be included. E.g for some reason WSJ excluded Harvard extension.\"\"<br><br>konradph, now why would you lie?<br><br>As per Columbia Univesity themselves, Columbia College and Fu Engineering are about 1,400 students per class, not 1,200:<br><br><a href=\"http://www.studentaffairs.columbia.edu/admissions/applications/stats.php\" rel=\"nofollow\">Admission Statistics | Columbia University Office of Undergraduate Admissions</a><br><br>and Columbia's school of General Studies adds another 25% of the undergraduate class.<br><br>Why would an undergraduate school that makes up 25% of the Columbia undergraduates, takes the same classes with the same factulty and uses the same facilities (and receives a Columbia Bachelors Degree) not be included as Columbia undergraduate students in the Feeder Rankings?<br><br>", "<b>Username: japanoko</b><br><br>\"\"Clearly Princeton is manipulating the admission statistics to protect yield. e.g. record high number of waitlist,\"\"<br><br>konradph, wrong yet again.<br><br>Once Princeton added its waitlist students to the final Class of 2014 count, it reported the final acceptance rate of 8.8%, up from the initial 8.2%. Columbia, on the other hand, even to this very day, STILL REPORTS its initial Class of 2014 acceptance rate of 9.16% as the final acceptance rate, instead of the final acceptance rate of 9.44%, after the 75 waitlist applicants are added to the class.<br><br><url>http://www.studentaffairs.columbia.edu/admissions/applications/stats.php</url><br><br>It is Columbia that continually fails to report the correct figures, something that is underscored by the FACT that up to this day, Columbia fails to issue a Common Data Set - something that most major high ranking colleges do.<br><br>This lack of transparency on Columbia's part is something that might fool a few people, but will eventually have a very negative effect on Columbia. In fact, Columbia's cross-admit rates with HYPSM are in the neigborhood of 10/90, losing about 90% of its cross-admits to these schools.<br><br>", "<b>Username: pbr</b><br><br>Japanoko, your relentless attempts to accuse Columbia of duplicity in its admissions reporting is tiresome. I encourage you to do some research into the GS program and its history. I applaud Columbia for making this program available, for the benefit of both the late bloomers and former soldiers, artists, entrepreneurs and other second-career students who participate, and for the \"traditional\" college students (like my son). The GS program makes Columbia unique among its peers, and is one of the reasons my son loves Columbia. It is much more difficult to have an older friend who was a sniper in Iraq at schools other than Columbia.<br><br>More importantly, why should high school kids care what the admissions stats for GS are? Those kids are not competing with GS applicants when they apply to the college or SEAS. Do Harvard applicants care what the admissions stats are for the extension school? Do Yale applicants care about the Whitney stats?<br><br>If you want to be a Princeton homer, go for it. There are many great qualities surrounding Princeton, but its \"pristine\" admissions reporting protocol is not one of them.<br><br>", "<b>Username: japanoko</b><br><br>sorry konradph, but Harvard Extension School students take their courses online or at night school..<br><br>Columbia's School of General Studies undergraduates (25% of all undergraduates) take the same classes, with the same faculty as the other undergraduates.....<br><br>", "<b>Username: japanoko</b><br><br>\"\"More importantly, why should high school kids care what the admissions stats for GS are? Those kids are not competing with GS applicants when they apply to the college or SEAS. Do Harvard applicants care what the admissions stats are for the extension school? Do Yale applicants care about the Whitney stats?\"\"<br><br>pbr,<br><br>The school admissions stats should be presented on a comparable basis to other schools that an applicant is comparing Columbia to, and the fact is that a student that attends Columbia as an undergraduate will be taking the same classes with the same faculty and in the same facilities as these 25% other undergraduates - he has the right to know what the metrics of his fellow undergraduates are, including SAT/ACT's, GPA's, high school class ranking, etc. (100% of the undegraduates, not just the top 75%) He has the right to know that his fellow undergraduates that attend the same classes where not selected on a 7% basis, but were admitted on a 30-40% basis and in, fact, that Columbia was much much less selective in choosing these students that make up a significant percent of the undergraduates.<br><br>Columbia FAILS to supply these metrics for the applicants to make an apples/apples choice in colleges. Columbia also FAILS to supply these metrics to the ranking entities that applicants sometimes use to gauge the quality of education of its undergraduate programs...<br><br>Columbia is misleading the applicants in this manner, but based on losing 90% of its cross admits to HYPSM, it appears that the lack of transparency for Columbia is having its effect, and not many people are being fooled here.<br><br>", "<b>Username: pbr</b><br><br>Japanoko, you (and many other Princeton \"fans\") seem to view admissions stats as scores in a sporting competition. I, and many other parents, view admissions stats reporting as a tool for applicants to gauge admissions odds. This is not an arms race. Princeton fans would perhaps undertake less hand-wringing over Columbia surpassing Princeton in the almighty selectivity race if they understood this.<br><br>It is very difficult to gain admission to both Columbia and Princeton. If GS admissions stats (admittedly lower than those for traditional student admits at both Princeton and Columbia) were included in Columbia's College/SEAS admissions stats, you, or some other Princeton advocate would complain that Columbia's reporting was misleading.<br><br>Why don't you also accuse Columbia of duplicity in not including Barnard numbers in its reporting?<br><br>Why? The new admissions rate would again (perhaps temporarily?) be higher than Princeton's, but would not be helpful to applicants and, possibly, given the the perceived increased access to Columbia, would cause even more than 35,000 people to apply to CC/SEAS, resulting in a further reduction in Columbia's admissions rate.<br><br>", "<b>Username: soomoo</b><br><br>^Japanoko is a ****. It's best to ignore him.<br><br>", "<b>Username: monydad</b><br><br>\"The new admissions rate would again (perhaps temporarily?) be higher than Princeton's, but would not be helpful to applicants ..\"<br><br>The admissions rate that is most helpful to applicants is the admissions rate to the one college there that they are actually applying to. Not any amalgamation.<br><br>However if one was trying to rationalize an amalgamation, it would be to describe the university community in its entirety, including all the people who are enrolled and are in fact there, in the classrooms of the university. From this latter perspective there is no rationale for excluding GS.<br><br>", "<b>Username: japanoko</b><br><br>\"\"Nope. Harvard extension students take classes at harvard campus and sometimes with Harvard College students.\"\"<br><br>konradph, when you say \"sometimes\" with Harvard College students, how many is that?<br><br>about one ever ten classes?<br><br>one ever 20 classes?<br><br>because the commuting part-time 30-something 550 SAT 3.0 GPA Columbia School of General Studies undergraduates take most of their classes with the Columbia College and Fu Engineering undergraduates with the same professors and at the same facilities.<br><br>", "<b>Username: japanoko</b><br><br>\"\"Why don't you also accuse Columbia of duplicity in not including Barnard numbers in its reporting?\"\"<br><br>pbr, good point and that can easily be calculated since Barnard,<b> unlike Columbia GS</b>, reports their acceptance rates, their SAT/ACT's, the GPA's and other metrics such as top ten percent ranking.<br><br>In addition, Columbia GS undergraduate students fall under Columbia University in the City of New York and Barnard does not. So that when you are reporting undergraduate students of Columbia University inthe City of New York, the School of GS undergraduates should be included<br><br>", "<b>Username: monydad</b><br><br>I think one can in fact make an argument for including Barnard's numbers, if you are trying to get the full picture of who is there and attending classes there. Barnard students take on average 30% of their classes at Columbia, they are certainly present in many Columbia classes. There is virtually seemless cross- registration between the schools, and Columbia students take approximately the same number of courses at Barnard. A few Columbia majors are actually housed at Barnard, taught by Barnard professors. My guess is Barnard students are as relevant to Columbia College as Cornell Hotel students are to Cornell Arts &amp; Sciences students.<br><br>So for the purpose of some sort of global assessment of the university community as a whole, and who will actually be there with you- which is the only vaguely rational argument for looking at any consolidated statistics in the first place, if there is one- I think one can legitimately include Barnard, if Cornell Hotel has to be lumped in with Cornell Arts &amp; Sciences.<br><br>For the purposes of assessing admissions chances it is of course ridiculous to lump them together, because they are part of a different admissions pool. But for that purpose it is likewise ridiculous to lump any group of colleges of the university together, since application is made only to particular colleges there. All that is relevant for that purpose are the stats for the one particular college there that you are actually applying to.<br><br>\"..take most of their classes with the Columbia College and Fu Engineering undergraduates with the same professors and at the same facilities. \"<br><br>Moreover, their grades all count for GPA calculation at all the university's colleges, I imagine. If a Harvard College student takes a course at Harvard Extension school, does that grade count in the Harvard College GPA computed by the registrar on his transcript? I don't know, but I doubt it. At Columbia, as I understand it for the most part they are just various sections of the same courses, which anyone at all the colleges can, and often do, take. And so can Barnard students, with of course some limitations. So for example my nephew took a Chemistry class at night that was relatively more populated by GS students. I'm sure the grade appeared and was counted in his FU transcript.<br><br>", "<b>Username: FightTheTide11</b><br><br>konradph, you ought to quit posting statistics that aren't true. 25% of Columbia engineering grads (again, you're comparing Princeton as a whole against Columbia Fu, which is misleading in itself) who take jobs go into the financial industry. That equates to 10% of Fu graduates as a whole.<br><br>", "<b>Username: japanoko</b><br><br>fightthetide read you post again. Columbia engineering is Fu.<br><br>", "<b>Username: japanoko</b><br><br>\"\"by konradph:<br>According to Princeton Career Services<br><br>Princeton University - Career Services - Online Publication<br><br>24% of Princeton grads are unemployed<br>10% got INTERNSHIP jobs<br>Only 10 % are working in Financial Industry.<br><br><br><br><br>From COLUMBIA<br>[url]<url>http://www.careereducation.columbia....CCSEAS_u_0.pdf[/url]</url><br>43% ACCEPTED JOB OFFER<br>27% plan to attent grad school.<br>25% work in Financial Industry (Investment Banks Hedge Funds)<br><br><br><br><br>Princeton's placement record is really embarrasing. Columbia grduates are more likely to be successful and wealthy working at prestigious financial firms, while Princeton graduates are likely to be unemployed or get low-paying jobs like 'internship'.\"\"<br><br><br><br><br><br><br>geesh, you would think that konradph would do a little more analysis in support of his comments in Columbia v. Princeton.<br><br>From the very same documents that konradph has provided:<br><br><br>Princeton Class of 2010 response rate = 98.2%<br>Columbia Class of 2010 response rate = 69.4%<br><br>One would assume that the students that did not respond, about 2% of Princeton and 30% of Columbia Class or 2010, are not in graduate school or employed.<br><br><br><b>now lets look at Columbia's own figures from the 69.4% that reported</b>:<br><br>14.5% - Applied and am awaiting, or decding<br>3.1% -- Have not started the job search process<br>5.2% -- Will take time off<br><u>3.7%</u> -- Other<br>26.5% - Total<br><br>26.5% of the 69.4% that responded = 18.4% of the total Class.<br><br>+30.6% that did not respond<br><br>= 49.0% of Columbia Class of 2010 that is not in graduate school or employed<br><br><br><b>For Princeton</b>:<br>23.8% - Seeking employment<br><u>2.4%</u> -- Travel and other<br>26.2% - Total<br><br>26.2% of 98.2% that responded for Princeton = 25.7% of the total class.<br><br>+ 1.8% that did not respond<br><br>= 27.5% of Princeton Class of 2010 that is not in graduate school or employed<br><br><br>so,,,, to sum up:<br><br><br><b>Percent of Class of 2010 That is not in Graduate School or Employed</b><br>27.5% - Princeton<br>49.0% - Columbia<br><br><br>oops!<br><br>", "<b>Username: FightTheTide11</b><br><br>It's honestly not a fair assumption that those did not respond were not employed. We have no idea what the circumstances were.<br><br>", "<b>Username: japanoko</b><br><br>^^^^it is the nature of the beast. There is a good probability that the lack of responses is due to a of lack of good news to report. In addition, this is Columbia you are talking about, remember?...Columbia University, the one that refuses to release a common data set, and almost a year later after letting 75 kids in from the waitlist, still fails to show an acceptance rate for the class of 2014 that shows the effect of accepting those kids into the school (still using the pre-waitlist 9.16% acceptance rate instead of the correct 9.44%).<br><br>", "<b>Username: confidentialcoll</b><br><br>After 4 years at Columbia I can guarantee that GS will not bother you or detract from your in and out of class experience in any way. It was actually refreshing to make friends a fire fighter, a war veteran and real estate broker. They weren't coming to our parties, living in our dorms nor were they in most of our classes, but their perspective was great to have around. I'd meet GS students once in a while in class, in the gym or in a club.<br><br>re: arguments about SAT and grades: There are no published statistics, because those stats are just not relevant to a GS applicant's ability to succeed and contribute to campus. Columbia GS will gladly reject a top scorer with a mediocre record post college and will gladly take someone with a 1700/2400 who has really excelled in their job and shown leadership. Who is more likely to be successful afterall? Freshman year in college your SAT scores become more or less irrelevant, how about 5-8 years after graduating from high school? Heck, by that standard, why don't MBA programs publish and compare SAT scores of their applicants?<br><br>This entire discussion has drifted completely away from the OP's point.<br><br>To the OP: if you can visit the campuses, all these stats and arguments about GS or acceptance rate couldn't be less relevant. Seeing the way this discussion has gone, I'm quite content to have gone to Columbia rather than Princeton.<br><br>", "<b>Username: japanoko</b><br><br>\"\"They weren't coming to our parties, living in our dorms <b>nor were they in most of our classes</b>\"\"<br><br>confi, so are you saying that the 2,000 General Studies undergraduate students (25% of all Columbia undergraduates) are missing, no where to be seen in your undergraduate classes (except for a few)?<br><br>Columbia states that they take most of their classes with the other Columbia undergraduates from Columbia College and Fu Engineering. Was Columbia lying when they said this?<br><br>Is Columbia issuing Columbia University Degrees to the GS students without requiring them to attend classes?<br><br>I find this very odd<br><br>from Columbia:<br><br><a href=\"http://www.gs.columbia.edu/admissions-faqs\" rel=\"nofollow\">FAQs | General Studies</a><br><br><i><b>Are the courses the same as those taken by students at Columbia's traditional undergraduate colleges</b>?<br><br>Yes. GS students take the same courses with the same faculty, are held to the same high standards, and earn the same degree as all other Columbia undergraduates.<br><br><b>Who will be in my classes</b>?<br><br>Students from Columbia's two other undergraduate colleges and Barnard College students will be in the classroom.<br><br><b>Who teaches my classes?</b><br><br>GS students take the same classes with the same professors as students in Columbia's other undergraduate colleges. Undergraduate courses are taught by members of the Columbia University Faculty of Arts and Sciences.<br><br>The Faculty of Arts and Sciences at Columbia University consists of twenty-nine departments in the social sciences, humanities, and natural sciences. The Arts and Sciences also includes six schools: Columbia College, the School of General Studies, the Graduate School of Arts and Sciences, the School of the Arts, and the School of Continuing Education, as well as numerous institutes and centers.<br><br></i><br><br>", "<b>Username: phantasmagoric</b><br><br>monydad makes good points. I wonder what Columbia's acceptance rate would be if it included GS and Barnard; even including GS alone would bring up its acceptance rate considerably. Anyone know that number?<br><br>I know that Stanford includes non-traditional students in its general acceptance rate (I think others, like Yale and Princeton, do as well); of course, they are few in number, but that doesn't mean that since Columbia has more of them, it can just exclude them.<br><br>", "<b>Username: japanoko</b><br><br>^^^^phanta, the more transparent of the major universities is Cornell in that it includes all 7 of its schools for undergraduate stats and yet only its School of Arts and Sciences and Engineering school are comparable to other colleges. This by itself, hurts its stats - leaving many people to underestimate its strong academics. For example, the school of engineering has a 25/75 SAT Math range of 720-800, a very impressive figure.<br><br>Oh, by the way, Cornell also issues separate stats for each of the 7 colleges.<br><br>on Columbia, I would imagine the 25/75 SAT's and acceptance rate can be calculated for the combined 3 Columbia undergraduate schools (and maybe 4 with Barnard), if we assume certain SAT's and accepatance rates for the GS school.<br><br>I will do that exercise sometime this week, but it is going to get real ugly for Columbia.<br><br>", "<b>Username: Smart Guy</b><br><br>\"\"I will do that exercise sometime this week, but it is going to get real ugly for Columbia.\"\"<br><br>What will it take for me to convince you not to do this? Aren't you busy these days watching Jersey Shore or something! I think the new season starts this week...<br><br>", "<b>Username: pbr</b><br><br>japanoko, make sure you also include the admissions stats for all transfer students. Come to think of it, my Columbia son also has quite a few classes that include graduate students, so you'd best include the graduate students' admissions stats as well. Have fun!<br><br>", "<b>Username: monydad</b><br><br>pbr has made a good point again, this time regarding transfer students.<br><br>Columbia Fu has something like 150 students enrolled, typically, who are admitted merely via agreement, based on getting a 3.0 GPA, + rec letters at a host of mostly less selective affiliated colleges: <a href=\"http://www.studentaffairs.columbia.edu/admissions/engineering/combined\" rel=\"nofollow\">Combined Plan Program | Columbia University Office of Undergraduate Admissions</a><br>These students were not admitted to Fu upfront, they were admitted only into their mostly less selective colleges, then had to attain only a 3.0 GPA there.<br><br>Here's what one CC student had to say about the program:<br><br>\"I know someone who completed 3 years at Bates and is now at Columbia for engineering. He would have had essentially a zero chance of being accepted to Columbia straight out of HS, so he is extremely excited and satisfied.\"<br><br>Indeed, why wouldn't he be....<br><br>IIRC Princeton takes essentially zero transfers in most years, and none that are admitted per agreement like this, correct me if I'm mistaken.<br><br>They both have grad students that probably share some advanced classes, so let's call that a wash.<br><br>Japonoko it should be easy to guesstimate stats for those combined plan students, based on the entrance profiles of the affiliated colleges and making some assumptions.<br><br>", "<b>Username: japanoko</b><br><br>\"\"Columbia Fu has something like 150 students enrolled, typically, who are admitted merely via agreement, based on getting a 3.0 GPA, + rec letters at a host of mostly less selective affiliated colleges: Combined Plan Program | Columbia University Office of Undergraduate Admissions<br>These students were not admitted to Fu upfront, they were admitted only into their mostly less selective colleges, then had to attain only a 3.0 GPA there.<br><br>Here's what one CC student had to say about the program:<br><br>\"I know someone who completed 3 years at Bates and is now at Columbia for engineering. He would have had essentially a zero chance of being accepted to Columbia straight out of HS, so he is extremely excited and satisfied.\"\"\"<br><br>geesh, this is terrible<br><br>and this is the Columbia Fu Engineering that was being compared to the highly ranked Prienceton engineering in another thread?<br><br>no wonder Columbia makes it almost impossible for Fu Engineering majors to transfer over Columbia College undergraduate school.<br><br>", "<b>Username: japanoko</b><br><br>from a current Columbia student:<br><br><url>http://talk.collegeconfidential.com/12417169-post34.html</url><br><br>beard tax<br>Junior Member<br><br>Join Date: Nov 2006<br>Posts: 157<br><br>I think your decision should be made by asking older students, not freshman. Days on Campus at all schools are ridiculous. My friends and I mentioned that it was the literally the first time this entire year that the fields had been opened, and they're closed again today and probably will be for the entire week until the prospies come on campus again. I can't recall how many people I heard wondering why the fields were open at all and then concluding \"It's for the prospies.\"<br><br>Columbia is for a certain type of person. You need to be quite independent and sure of your ability to socialize. I didn't believe much of what sophomores and juniors said to me as a freshman, that you stop hanging out with people and you spend a huge portion of time in your dorm doing work or screwing around by yourself. I wondered how this could be the case, I mean we're literally 2-3 blocks away from everyone. The lack of space on campus and the lack of any student center really kills the social scene, there's no central hangout spot, no central place to eat lunch, and the bustle of the city and the graduate students and local residents really kills the undergraduate experience. Definitely not a traditional college experience or a community oriented one at that.<br><br>My friends had HS friends who went to Penn. For some reason, the school is able to instill loyalty; most of the people I know at Columbia either put up with it or hate it. It's the fact that Penn has a campus life and the administration does fun things like a spring week. Columbia puts on 2-3 campus events all year and standing in line takes up half the time. Make the decision on where you'll be happy, because the career prospects and educational quality are good at all schools (engineering is terrible at Columbia but you're a JJ scholar so you're in CC).<br><br>", "<b>Username: Smart Guy</b><br><br>\"\"geesh, this is terrible\"\"<br>Terrible for whom? I actually just met someone who did the combined program from SUNY Geneseo, and he is doing very well in financial services. He told me that he found the level of discussion and capabilities of the students like night and day--and this particular SUNY supposed to be the jewel of the system.<br><br>At the time, I was unaware of it, and yes, I concede that it seems like a backdoor way of getting a Columbia education. haha I am rather shocked that the minimum gpa is a 3.0 -- although I suspect the people enrolled in the program have much higher gpas...<br><br>Japanoko,<br>In any event, you have your work cut out for you. I am certain you don't have the time to compile the stats of all schools partnering with Fu and then breaking down the percentage of Columbia College students having to take classes with such folks, right?<br><br>", "<b>Username: japanoko</b><br><br>A suggestion for applicants that are going to be visiting Columbia this month:<br>\"\"well, I'm off to visit columbia this weekend. that's probably the only way I can make a decsion.\"\"<br><br><br>nil, this is a great idea. check out the campus, ask the students questions, get to know what it is all about<br><br>but do yourself a favor<br><br><br>at about a reasonable time at night, not too late - say 9:00pm, walk on campus over to the Mudd Building, it faces 120th street and is at Amsterdam on the north east part of campus.<br><br><url>http://www.columbia.edu/about_columbia/map/schermerhorn.html</url><br><br>From there walk only a couple of blocks north on Amsterdam, to about 125th street and make a left. Walk only a couple of blocks. Talk a look around. Take your time - observe observe observe. Take in what you see. Then, walk back through the same route.<br><br>and tell us, did you enjoy the walk?<br><br>is this the neighborhood that you want to go to college in?<br><br>if you would be kind enough to post your reactions of this brief, but lovely, 30 minute walk, we would all appreciate it.<br><br>thanks<br>.<br>.<br>.<br>.<br><br><br>^^^^^^geesh, forgot to mention. Since the Columbia supporters continue to claim that the area that Columbia is located at is among the safest in New York, then you can make this trip by yourself. HOWEVER, if you do not feel comfortable while standing at the corner of Amsterdam and 120th on the Columbia campus at the beginning of your 30 minute walk, then please please please go back and get about 1/2 dozen of your Columbia buddies to make the trip with you.<br><br>", "<b>Username: japanoko</b><br><br>\"\"Terrible for whom? I actually just met someone who did the combined program from SUNY Geneseo, and he is doing very well in financial services. He told me that he found the level of discussion and capabilities of the students like night and day--and this particular SUNY supposed to be the jewel of the system.<br><br>At the time, I was unaware of it, and yes, I concede that it seems like a backdoor way of getting a Columbia education. haha I am rather shocked that the minimum gpa is a 3.0 -- although I suspect the people enrolled in the program have much higher gpas...\"\"<br><br>SmartGuy, terrible for the brilliant engineer type that applied to Columbia and Princeton Engineering and got into both, then decided to go to Columbia, thinking that he would be taking classes with equally brilliant undergraduates to learn at a high level, but realized that many of his classmates were not at the level to even get admitted to Columbia Engineering under the normal admissions process.<br><br>So instead of the Columbia engineering professors teaching at a level for him to learn the most possible (and be thoroughly challenged), the professor has to lower the quality of work to those that are not as \"brilliant\".....and we aren't even talking about the 25% of the undergraduates that enter under the General Studies program...that is another sad story for the \"brilliant\" engineer and the challenging environment that he was hoping for....<br><br>this is just terrible I tell ya!<br><br>", "<b>Username: camathmom</b><br><br>Moderators:<br><br>Is it possible to moderate Japanoko? I look to CC to get some balanced info on colleges. I have no connection with Columbia, although it is one of 5 colleges that my daughter is considering. But, the personal vendetta that Japanoko has with Columbia makes it impossible to garner any useful information from this thread.<br><br>Please moderate Japanoko. Thank you.<br><br>", "<b>Username: japanoko</b><br><br>\"\"Moderators:<br><br>Is it possible to moderate Japanoko? I look to CC to get some balanced info on colleges. I have no connection with Columbia, although it is one of 5 colleges that my daughter is considering. But, the personal vendetta that Japanoko has with Columbia makes it impossible to garner any useful information from this thread.<br><br>Please moderate Japanoko. Thank you.\"\"<br><br>camathmom, here is a thought, just <b>don't read what japanoko has to say about Columbia</b>. In fact, go over to the Columbia board and listen to the people posting there that say only positive things about Columbia and based on these positive things about Columbia, please send your daughter there.<br><br>After all, why would you like to read any factual posted messages that say anything negative about a college that you are going to send your daugther to eh?<br><br><br>here is an example:<br><br><url>http://talk.collegeconfidential.com/parents-forum/1123961-will-you-pick-college-shows-you-most-love.html</url><br><br>you asked what would be considered not an unreasonable question, but over 2 dozen reponses all told you that your way of thinking about the college was wrong, very wrong.<br><br>Should you get all those that spent the time to correct your thinking on this matter banned from collegeboard because you did not like their negative attitude towards this college?<br><br>of course not!<br><br>the sad part is that you just stopped posting on that thread that embarrassed you and never even thanked the posters for the good advice that they gave you.<br><br>", "<b>Username: vivawasabi</b><br><br>Hey everyone,<br><br>Thanks for all the in-depth responses! I just came back from visiting Columbia for the day, and my experience really impressed me despite the rainy weather. First thing I did was sit in on a physics class, and the teaching was not drastically as poor as some have mentioned before. The students in the class were mostly enjoying it by asking/answering questions or laughing at the professor's jokes. I know this class could have been an anomaly though, but the engineering student who I ate lunch with said she was satisfied with all her classes. The relatively small size of the campus also has its plus. I like how everything is within reach and doesn't require too much walking, and how nobody is ever idle. Students were also saying hi to each other while walking around, and it seems like the campus size makes the community more close-knit.<br><br>What really got me was the Egleston Scholar designation (Rabi Scholar equivalent for engineering). Only about ten students or 1% of the class receive it. It was started last year so that's why it is pretty unknown. I don't know how prestigious this designation will become in the future, but from what I've heard, the opportunities it offers are amazing: eating lunch with the Dean, chatting with the CEO of Boeing, guaranteed research with $10000 for use, among others. I ended my day talking to a current Egleston Scholar who is a freshman but already with a job in NYC. Unlike what some people have said about the effect of NYC on social life, he rarely goes out into the city and is very involved on campus. He was also very persuasive on the availability of jobs right in NYC, with a lot of friends already working. However, he was a financial engineering major and I don't know how good Columbia's name is for MechE or Compsci. I'll be visiting Princeton tomorrow and I'll be sure to post my thoughts afterwards. I really love the Princeton name (everybody who I ask thinks it's a no-brainer to choose Princeton) but we'll see. My main concerns about Princeton are grade deflation and whether it can top the Egleston Scholar advantages. For now, I'm still undecided.<br><br>Thanks guys!<br><br>", "<b>Username: vivawasabi</b><br><br>^oops meant to post that in the engineering thread<br><br>", "<b>Username: japanoko</b><br><br>viva, congratulations on your wonderful visit to Columbia<br><br>Hopefully Princeton's visit will be just as nice.<br><br><br>A little curious, however - from what you wrote about the Eagleston Scholar program, all of those advantages are already part of the Princeton University experience. Am I missing something here?<br><br>Also, please come back and tell us how your Princeton visit went, good or bad.<br><br>thanks<br><br>", "<b>Username: pbr</b><br><br>Absurd. Morningside Heights is the second safest neighborhood in Manhatten. Do a google search.<br><br>Moreover, the neighborhood \"action\" at Columbia is south (below 116th), not north.<br><br>If you enjoy pristine wealthy suburbs, japanoko, great. Go for it. You own your personal preference, but those who want the option of living in a vibrant urban neighborhood are not delusional or misguided.<br><br>", "<b>Username: pbr</b><br><br>Sorry about my confusing post above. It appears the japanoko post to which I was responding was deleted by the moderators.<br><br>", "<b>Username: japanoko</b><br><br>\"\"Absurd. Morningside Heights is the second safest neighborhood in Manhatten. Do a google search.<br><br>Moreover, the neighborhood \"action\" at Columbia is south (below 116th), not north.<br><br>If you enjoy pristine wealthy suburbs, japanoko, great. Go for it. You own your personal preference, but those who want the option of living in a vibrant urban neighborhood are not delusional or misguided.\"\"<br><br>pbr, I am sorry so are you saying that 125th street, only a few blocks from the Columbia campus is in Morningside Heights and is a safe area?<br><br>after all, this is only 5 short blocks from the Columbia campus..<br><br>", "<b>Username: japanoko</b><br><br>\"\"Sorry about my confusing post above. It appears the japanoko post to which I was responding was deleted by the moderators.\"\"<br><br>pbr, are you talking about this post?<br><br><url>http://talk.collegeconfidential.com/12417639-post64.html</url><br><br>", "<b>Username: monydad</b><br><br>Actually japanoko I think you're a bit off base about the neighborhood thing, my D2 lived there for three semesters and didn't suffer from any huge safety concerns. Obviously it is near some not so safe areas and there are places to avoid. But it seems pretty easily navigable. For the most that is, there are the occasional incidents. But it is the city, after all, that's to be expected to an extent, it's part of the deal.<br><br>", "<b>Username: japanoko</b><br><br>\"\"Actually japanoko I think you're a bit off base about the neighborhood thing, my D2 lived there for three semesters and didn't suffer from any huge safety concerns. Obviously it is near some not so safe areas and there are places to avoid. But it seems pretty easily navigable. For the most that is, there are the occasional incidents. But it is the city, after all, that's to be expected to an extent, it's part of the deal.\"\"<br><br>so are you agreeing with pbr that says that the neighborhoods surrounding Columbia are among the safest in NY?<br><br>would you kindly copy/paste any of my posted messages that are off base in terms of the dangers of the neighborhoolds surrounding Columbia?<br><br>thanks<br><br>", "<b>Username: monydad</b><br><br>That claim sounds familiar regarding Morningside Heights proper, not neighboring Harlem obviously. So they just avoid the dangerous areas, to the extent possible.<br><br>It was the same when I lived in the city, there were housing projects just a few blocks from us. So we didn't walk around there. The students in Morningside Heights are much better off than we were, safetywise, because where they live is more heavily policed, so their unwelcome neighbors are more successfully discouraged. Probably.<br><br>There was an incident at my nephew's frat, I now recall, regarding some unfriendly neighbors...<br><br>", "<b>Username: Smart Guy</b><br><br>\"\"I really love the Princeton name (everybody who I ask thinks it's a no-brainer to choose Princeton) but we'll see.\"\"<br><br>At this level of schools, I would choose base on fit rather than any slight perceived notion of prestige. Also, for engineering neither one is exactly MIT or Caltech. Just because Harvard is more prestigious than P or C shouldn't sway a student go there. You should base the decision on fit. Japanoko will tell you that Columbia is more prestigious anyway.<br><br>I actually enjoy reading Japanoko's 600 posts. He's making Tigers proud everywhere.<br><br>", "<b>Username: beard tax</b><br><br>@vivawasabi<br><br>Congrats on the admissions and good to hear that you enjoyed Columbia. Just wanted to tell that you visiting campus in a structured setting is not a good way to experience what the college is actually like. It's akin to asking Bill Gates what he thinks of Microsoft; there are a ton of problems but they're going to be glossed over. Definitely speak to real students you see in the library or friends that you know who actually attend school.<br><br>It just reminds me of the information sessions for banks that come on campus. \"Why Morgan Stanley/Goldman Sachs?\" Answer: Because it's a great work environment with people you can learn from. People never say anything about the cutthroat nature of financial services, the ridiculous hours, or the brain-numbing work, instead focusing on the learning experience and \"the ability to work with the most sophisticated companies on complex and exciting deals that help the client solve their most pressing problems.\"<br><br>The answer from a friend who has no incentive to sell you on their product would be much more truthful. They'd tell you about the great learning experience, the pay, and the exit ops but wouldn't BS you on the hours, facetime, stress, and pressure.<br><br>", "<b>Username: beard tax</b><br><br>The Columbia campus itself is very safe. This encompasses down to 109th street all the way up 117th street on the Broadway side. The Amsterdam side is extremely sketchy, we're talking about stores with dim neon lights, little to no street lamps, and generally poorer people walking around (my stereotypes, sorry, broadway is just much whiter and nicer than Amsterdam avenue).<br><br>I think that the area is considered safe because students are smart about where they go. Girls don't walk on Amsterdam Avenue by themselves at night, it's unsafe and scary. Guys don't walk around in Morningside Park unless they're in a group smoking certain substances. In general, people stay in the safest areas of Columbia and don't head out of the Columbia bubble at night. If they do head out, it's to take the subway to a much safe part of the city, essentially below 80th in UWS or further downtown.<br><br>No one gets shot or murdered because there's safety provided by police and local residents, students aren't going to rob or murder each other, and students don't travel off campus that much. It's just not right to assume that Columbia is in a safer part of town, rather the Columbia security bubble provides ample security as long as you're not too adventurous or stupid. However, there are definitely times I've felt sketched out walking to 109th and Amsterdam to pick up beer or Domino's. Even though Columbia is safe, I had 2 friends who were mugged in relatively safe areas and there are a constant string of bike robberies or theft each month. It's a big city and a densely packed area so statistically, it's nothing to worry about.<br><br>"]}