{"title": "unc chapel hill vs boston college", "comments": ["<b>Username: SwellyBelly</b><br><br>Hi everyone,<br><br>", "<b>Username: happy1</b><br><br>Honestly I'd just stay one more year and graduate from ND even if you don't love being at the school.<br><br>", "<b>Username: HopefulHoya1103</b><br><br>@unc2307<br><br>", "<b>Username: HopefulHoya1103</b><br><br>If you are leaving ND because of the weather, Boston wouldn't be much improvement. It really depends on what type of school you want. Student vibes, size, and location should decide for you! :)<br><br>", "<b>Username: garvey</b><br><br>If the goal is to be able to better access the sorts of internships that will be most relevant for your career, I'd think that Boston would be the better fit.<br><br>", "<b>Username: twogirls</b><br><br>I agree with @happy1<br><br>", "<b>Username: LBad96</b><br><br>I would advocate for UNC Chapel Hill. It's a better school than BU.<br><br>", "<b>Username: twogirls</b><br><br>@LBad96 it's UNC versus BC.... not that it matters. I think the OP should stay at ND regardless.<br><br>", "<b>Username: LBad96</b><br><br>@twogirls ohhhh. BC. My bad haha. More or less equal, honestly.<br><br>", "<b>Username: SwellyBelly</b><br><br>Bump. Also, any future responders, just know that staying at current school is out of the question. Thanks!<br><br>", "<b>Username: crazyasianbae</b><br><br>Definitely UNC over Boston College. The environment is much better, you'll graduate with no loans, and it is better for your intended degree.<br><br>", "<b>Username: WildestDream</b><br><br>UNC is a much better school academically, and especially for business.<br><br>", "<b>Username: prezbucky</b><br><br>BC is not worth $10k more than UNC unless you feel like the fit is much better there. If you'd strongly prefer being in the Boston area, the private school feel, and other pros for BC make it the much better choice, then spend the extra money.<br><br>If they are tied or close to it, I'd suggest UNC based on the savings.<br><br>I think they are a wash academically and rep-wise for undergrad -- and both are really solid in business -- so either way, you should be fine academically.<br><br>", "<b>Username: Alexandre</b><br><br>How is BC different from ND? They are identical! You cannot get two mot similar universities. Both are Catholic, both have 9,000 undergraduate students and 4,000 graduate students, both have a proud football tradition, both have loyal alumni and both have equally cold winters. Boston College is close to a mid sized city while Notre Dame is not, and that's where the differences end.<br><br>UNC would be a different experience. Secular school in warmer weather.<br><br>I agree with those who recommend you wait it out and graduate from Notre Dame.<br><br>", "<b>Username: SwellyBelly</b><br><br>Sorry, ND stands for North Dakota:p<br><br>", "<b>Username: gearmom</b><br><br>Absolutely UNC. Will be a great experience after 3 years in North Dakota and why, why, why would you take on 10k of debt if you don't have to. Touring doesn't give a complete picture of your future experience. It will be the people you meet that shape that.<br><br>Boston will be a lot more fun later in your life when you have the money to enjoy it.<br><br><url>http://business-schools.startclass.com/compare/299-415/University-of-North-Carolina-Chapel-Hill-Kenan-Flagler-NC-vs-Boston-College-Carroll-MA</url><br><br>", "<b>Username: SwellyBelly</b><br><br>Hey everyone,<br>Forgive me as this is my second time posting this, but I think I included too many irrelevant details in my last post that people took into consideration. I am transferring to either UNC or BC. Both will be Economics majors, but UNC will have the option of applying to be in Kenan Flagler business school. UNC is offering enough aid to graduate with no loans, BC is offering enough to cover tuition, but I will have to take out loans for cost of living. MY NUMBER ONE REASON for transferring is better job placement opportunities (interesting in I-Banking). That's where Boston wins. What do you think?<br><br>", "<b>Username: gearmom</b><br><br>^And you are transferring in from the University of North Dakota? as a Senior or Junior?<br><br>", "<b>Username: Alexandre</b><br><br>UNC is your best option.<br><br>", "<b>Username: SwellyBelly</b><br><br>@gearmom as a senior, but will be taking my junior year over again because no school accepts senior transfers.<br><br>", "<b>Username: LBad96</b><br><br>Like we said before, UNC > BC in every aspect. Go to Boston after graduation if you're able to get a job there.<br><br>", "<b>Username: mom2collegekids</b><br><br>&lt;&lt;&lt;<br>UNC is offering enough aid to graduate with no loans<br>>>><br><br>This^^<br><br>Taking out loans for the cost of living in Boston would be cray cray.<br><br>", "<b>Username: happy1</b><br><br>A few comments:<br><br>--You need to understand that investment banking jobs are few and far between for undergrads. You should expand your horizons in terms of jobs you would be looking for.<br><br>--You should look at the core requirements for both schools (can be found online). Chances are at BC you would have to spend a great deal of time taking classes like theology, philosophy etc. to complete the Jesuit core.<br><br>--I'd consider the schools to be academic peers. I'd go to UNC and avoid debt -- being debt free will give you more options down the road.<br><br>", "<b>Username: leanid</b><br><br>Posters who summarily dismiss BC as not even being in the same 'league' as UNC (actually they are in the same league -- the ACC!) need some comparative facts, and here they are:<br><br>USNews rank - UNC-30 BC-31 (last year I believe the positions were reversed)<br>Forbes rank - UNC-47 BC-22 -- but who goes by Forbes?!<br>Niche rank - UNC-44 BC-80 -- ah, this must be the right ranking!<br><br>SAT/ACT score range - UNC 1280-1460 and 27-32 BC 1340-1510 and 30-33<br><br>Student population - UNC ~ 29,000 BC ~ 14,000<br><br>Endowment - UNC ~ 3billion BC ~ 2billion<br><br>Endowment per student - BC>UNC<br><br>So, this business of UNC being soooo much better than BC shows merely simple ignorance.<br><br>And, by the way, the theology requirement is, I believe, any two courses available from the extensive offerings (intellectually stimulating, thought-provoking subjects -- none of which try to ram religion down one's throat) that are one term each.<br><br>And philosophy?! No requirement that I know of, but if philosophy is a turn-off then it raises the question of whether one should be in college at all, as it is perhaps the only time in life where one is exposed to the great thinkers through the ages. Should be required of all students!<br><br>", "<b>Username: gearmom</b><br><br>@leanid It is an unnecessary 20,000 dollars of debt for OP to go to BC. That is the hard stop for most especially when grad school seems likely.<br><br>", "<b>Username: Alexandre</b><br><br>leanid, Do not forget that UNC receives $200 million from the state annually. That is the equivalent of $4 billion in endowment. So UNC's endowment, if you were to compare it to that of a private university, is more like $7 billion.<br><br>But I agree that UNC is not necessarily far better than BC. However, the OP has expressed an aversion to cold winters.<br><br>", "<b>Username: leanid</b><br><br>gearmom - fine, if money is the problem, but let's not misrepresent UNC as superior to BC when clearly it is not.<br><br>Alexandre - I don't follow your numbers there on the endowment.<br><br>", "<b>Username: SwellyBelly</b><br><br>Hey, OP here. Just a few extra notes and responses:<br><br>I have been trying to get some questions answered about transfer credit and academic paths. UNC has transferred my call to voicemails every time without fail, I leave a message and have never gotten a response. Extremely unhelpful and seems like they could care less if I end up there (I know, they are a larger school). But Boston College has their head of transfer admissions giving me tailored advice within minutes of me emailing. Just a thought.<br><br>I will also have quite a few core requirements to retake at BC.<br><br>@gearmom Loans has been a major piece of controversy for me. What do you think of this: I am guessing I will only need 15k. I feel like it is close to unheard of to obtain a degree from BC with 15k in loans coming from a family who can't afford to contribute.<br><br>@happy1 IB isn't the only route I am open to, it is just a quick way of saying I plan on going into investments with a competitive attitude and impressive resume.<br><br>@Alexandre I am from North Dakota. Two more cold winters are far from an issue, lol.<br><br>@leanid Thanks for the numbers and sparking discussion. It was incredibly surprising to me to see the amount of people that immediately proclaimed UNC as superior.<br><br>", "<b>Username: leanid</b><br><br>You're welcome. Yes, the UNC bandwagon was rather overloaded. Holdovers from days gone by?<br><br>", "<b>Username: gearmom</b><br><br>But @SwellyBelly BC isn't more special than UNC. And Boston is an expensive area. Would you have pocket money? You're probably looking at grad school. I wouldn't take on the debt. UNC is a HUGE gift in a great area. And you'd be in a great position for KF grad school.<br><br>", "<b>Username: leanid</b><br><br>Ah, but that's where you are wrong, gearmom, BC IS more special than UNC, it strives to instill the Jesuit ethos of \"men and women for others\", a guiding principle which is applicable throughout life, long after one forgets academic lessons. UNC has...?<br><br>", "<b>Username: gearmom</b><br><br>@leanid Oh my goodness. Do you think people at UNC don't care about others? OP has an ENTIRE LIFETIME to help others. Something he'll be in a better position if he if he isn't saddled with an unnecessary $20,000 of debt. He can go to BC for grad school without undergrad debt.<br><br>And if he hasn't sufficient developed his character by age 21, then two or three classes surely won't make a difference. I doubt his parents did such a poor job. He wants to hear BC. However, the smart and practical choice is UNC debt free and then have real choice for grad school. It is only two years for goodness sake.<br><br>", "<b>Username: Dontskipthemoose</b><br><br>@leanid I really like BC and I also liked the Jesuit aspect of the school, but I honestly wouldn't say it instills people with the principles of helping others to the point that it makes it any more special than other schools. I have friends at BC and they could care less about service for others. There are people all over different schools who are passionate about helping others despite the lack of a Jesuit education. The simple fact is that people who are dedicated towards helping others will do so with or without a Jesuit education, and people who don't care won't change just because they went to a Jesuit school.<br><br>By your logic, non Jesuit schools are automatically inferior to Jesuit schools?<br><br>", "<b>Username: SwellyBelly</b><br><br>Thanks @gearmom I am actually starting to lean back towards UNC. I am going to do a little more research on job placement before I submit my deposit (which is due today, lol). But ultimately it looks like UNC might be the place I go.<br><br>", "<b>Username: gearmom</b><br><br>@SwellyBelly You must be an outstanding student to have such opportunities. The best of luck to you on your future though I don't think you need luck because you must be a hard worker.<br><br>", "<b>Username: SwellyBelly</b><br><br>Also, I think the concern for a Jesuit environment and emphasis on an atmosphere that tries to instill a common sensical code of ethics is getting a little out of hand. I am not worried about that, nor would it go into my decision making - interesting, philosophically engaging course options, maybe. @gearmom was right on that. And I will be pretty well seasoned by the time I attend school in the Fall, no need for lessons on how to be nice (please recognize the moderate satire).<br><br>", "<b>Username: WildestDream</b><br><br>@leanid Lol. EVERY school strives to instill a service ethic and social justice orientation in its students. (at UNC, this is HUGE btw) I don't think this makes BC unique. If you want to get involved with community service at UNC, you will have many opportunities. Claiming a school has to be affiliated with a particular sect (Jesuit) in order to care about social justice seems rather arrogant IMO.<br><br>Also, OP here are the undergrad business rankings from US News (2014). While they are both solid programs for business, UNC is a step above.<br><br>1. University of Pennsylvania<br>2. Massachusetts Institute of Technology<br>2. University of California-Berkeley<br>2. University of Michigan-Ann Arbor<br>5. New York University<br>5. University of Virginia<br>7. University of North Carolina-Chapel Hill<br>8. Carnegie Mellon University<br>8. University of Texas-Austin<br>10. Cornell University<br>10. Indiana University<br>10. University of Notre Dame<br>13. Emory University<br>13. University of Southern California<br>13. Washington University<br>16. Georgetown University<br>16. University of Illinois-Urbana-Champaign<br>18. Ohio State University<br>18. University of Maryland<br>18. University of Minnesota<br>18. University of Wisconsin<br>22. Boston College<br>22. Penn State University<br>22. Purdue University<br>22. University of Arizona<br>22. University of Washington<br><br>", "<b>Username: leanid</b><br><br>gearmom et al - of course there are people at UNC who care about others. Never said there weren't. I am talking about the institutional culture that sets BC apart from UNC and many other colleges. And, it isn't by a matter of \"one or two classes\", it is, instead, by a wide range other, non-academic, programs and activities through which this ethos is instilled. Also, it is NOT obligatory that all or any students participate in that endeavor -- but it is there for those who are interested. My god, I am in my sixties and I am still \"developing character\", but if this student of 21 or under already has all the character he needs then more power to him for he is a rare individual.<br><br>", "<b>Username: leanid</b><br><br>WildestDream - The Jesuits are an 'order' of the Catholic Church, not a \"sect\". That is disappointing as normally you are somewhat well-informed.<br><br>", "<b>Username: twogirls</b><br><br>FWIW giving back to the community is huge at UNC. It is weaved into the culture of the school.<br><br>I think these two schools are academic peers. If UNC means no debt, that's where I would go.<br><br>", "<b>Username: leanid</b><br><br>Glad to hear UNC does that. I didn't mean to imply otherwise. The difference comes down to it being the MO at BC, at least from the administration's point of view.<br><br>And, yes, they are \"academic peers\". Just tired of the rampant ignorance regarding BC's quality.<br><br>", "<b>Username: prezbucky</b><br><br>I will reiterate my belief that these schools are academic peers. Each has advantages and disadvantages but I think that overall, there is little difference in quality, if any.<br><br>You should decide, then, based on fit (social vibe, environment, etc.), cost, and specific job markets/opportunities you are interested in and how well each school does at drawing recruiters.<br><br>", "<b>Username: WildestDream</b><br><br>If you use the term \"academic peers\" very generally, then yes. However, from those among the know (i.e. academia), UNC is generally seen as a tier above.<br><br>UNC's peer assessment score is 4.2, while BC is 3.5. This is a pretty significant difference. This is not to say BC is not a very good school, but UNC is one of the best in the nation.<br><br>", "<b>Username: prezbucky</b><br><br>BC makes up for its lack of research (...which impacts that academic rep score...) with smaller classes, which means more interaction with profs.<br><br>Over half the classes at BC have fewer than 20 students and just 2% of classes have 100 or more.<br><br>At UNC, 42% are under 20 and 7% are 100+. That's pretty good, but BC has the edge.<br><br>I take little things like that into account when I call them undergraduate peers.<br><br>", "<b>Username: gearmom</b><br><br>@prezbucky OP is a junior so will likely have small classes but that could be important for other students. I get the impression that OP is resilient and driven and could thrive regardless.<br><br>And @SwellyBelly if you happen to know younger students going into engineering, WPI was specifically looking for a student from ND two years ago (the only state not represented in their incoming Frosh class). They might get a great aid package.<br><br>", "<b>Username: happy1</b><br><br>Don't forget that UNC will be debt free and BC will be about $20k in debt for the two years.<br><br>", "<b>Username: prezbucky</b><br><br>Absolutely true -- both schools probably feature small(ish) upper-level classes.<br><br>I guess my main point is that the OP can make this choice based on fit and cost without having to worry about rep or academic quality.<br><br>They're within five places of one another in the US News undergrad ranking, which implies the same thing.<br><br>", "<b>Username: leanid</b><br><br>Right on, prez! And, it doesn't help UNC's claim to be \"one of the best in the nation\" when poor, ol' BC outdoes it on SAT/ACT scores. \"This is not to say that [UNC] is not a very good school, but...\"<br><br>", "<b>Username: SwellyBelly</b><br><br>I also want to note:<br>One of the reasons I was so enthusiastic about BC is because their transfer acceptance rate was 5% (according to my decision letter) vs UNC with 30%. Regardless of rankings, BC is much more likely to be boasting a more competitive program with that acceptance rate.<br><br>", "<b>Username: WildestDream</b><br><br>UNC has to accept a majority of applicants from in-state, which accounts for its lower SAT/ACT.<br><br>Also, I don't think there is a strong correlation between a school's transfer acceptance rate and quality of programs. I would not pick a school based on \"transfer acceptance rate\"<br><br>", "<b>Username: Dontskipthemoose</b><br><br>@SwellyBelly the transfer acceptance rate wasn't 5%. The number 75 out of 1,400 is supposed to be their estimate of the incoming transfer class, so that means they accepted more than 75. Their transfer yield is around 40%, so that means they accepted around 200 kids, making the transfer acceptance rate 15%. Still a very low number and definitely a harder transfer round than in the past.<br><br>Someone explained it in the BC transfer thread, but apparently, Boston College over enrolled the freshmen class, thus limiting the spots for transfers. Their transfer acceptance rate has been on average 27% in the last 4 years.<br><br>"]}