{"title": "usc tops ucla in rankings", "comments": ["<b>Username: ModernMan</b><br><br>Gone are the days when UCLA out ranked USC in every ranking....<br><br>", "<b>Username: ModernMan</b><br><br>Forgot some others<br><br>NICHE<br>USC# 17<br>UCLA #34<br><url>https://www.****/colleges/search/best-colleges/</url><br><br>", "<b>Username: UCBUSCalum</b><br><br>Keep in mind that these rankings are generally undergraduate rankings. If you looking at graduate studies and professional schools, generally, and almost always, UCLA outranks USC.<br><br>", "<b>Username: WWWard</b><br><br>Out here on the east coast, we never even understand the points of comparison. Maybe it is a California-centric thing or simply based on their geographical closeness &amp; the sports rivalry, as both colleges are in Los Angeles, but neither of my kids (both now Trojans) ever even considered UCLA. Last night, there were many teens here at my daughter's birthday party, and the topic of college of course arose. But none of them ever considered or will be considering UCLA either. So... at least in Florida, they are generally not even considered in the same category of colleges. UCLA is thought of as a very good, if not excellent, state school... and certainly better academically than the state/public universities in Florida. But USC &amp; Stanford are the only California schools I have ever heard of in terms of being on the wish lists of Florida teens. USC is thought of as an elite university on par with Duke, Vanderbilt, Rice, Emory, Northwestern, UChicago, etc. &amp; just one step below (in most people's opinions) Stanford, MIT and the better known Ivies (Harvard, Yale, Penn, Brown, Princeton, Columbia). In my younger daughter's case, USC was her dream school though from the beginning, and even an admission to Princeton could not sway her from attending. So USC being consistently ranked higher does not seem at all surprising to us. It not being ranked even higher though is a bit surprising.<br><br>", "<b>Username: UCBUSCalum</b><br><br>In the West Coast, it is a toss up whether high schoolers will choose UCLA vs. USC for undergraduate studies. Generally, more will choose UCLA over USC, perhaps because of costs. However, for law school, MBA, medical, dental and many PhD's and masters programs, most will choose UCLA over USC unless they are compelling reasons like a great financial package from USC. Anyways, these programs at UCLA are ranked higher than USC. USC is a great school, but when it comes down to graduate work, UCLA is generally ranked higher.<br><br>", "<b>Username: sushiritto</b><br><br>\"\"Out here on the east coast, we never even understand the points of comparison.\"\"<br><br>And that's why we Californians think California should be its own country. #calexit =))<br><br>If my D18 were to get into both UCLA and USC, then UCLA would win hands down. And then there's the location...<br><br>", "<b>Username: CALSmom</b><br><br>@sushiritto, aye! That's a whole other thread there :-)<br>That's why perception is everything to some people when it comes to choosing colleges. I also think that we are very sports-centric especially in SoCal where we have a lot of athletes in football, basketball, baseball, track...you name it...choosing their school based on recruitment.<br><br>", "<b>Username: CADREAMIN</b><br><br>The better school depends on each individual. To say \"most\" will choose UCLA or USC because of this or that is just a defensive response. This seems like such a silly argument to me and rankings shmankings - both are great schools but offer very different environments - private/public, urban/suburban, blue/red - both boast great Socal location and athletes/athletic programs. We turned down UCLA three times for USC (each applied so they could decide what they liked best) and I'm sure there are others that would do the reverse for their own reasons. I don't think costs come into play as much as people think in the choice - we did the math - 5 years at UCLA isn't that far off USC in four when adding to that ability to double major/minor in 4 and get to work earning money a year faster. I think the public v. private is a big factor for many. One of our biggest turnoffs at UCLA was probably a little thing to others - the triples with basically random room mates versus knowing you only had two in a room that they matched at USC (they do a really good job at this). Others will have their own reasons - like choosing UCLA because its in a better neighborhood - we chose USC because of the urban environment. Point is, if you go to either of these schools, consider yourself very fortunate.<br><br>", "<b>Username: WWWard</b><br><br>Well I guess that these further replies help to cement the California resident impact on such comparisons. It seems very common for a high-achieving high school senior living in California to apply to most if not all of the following schools... USC, UCLA, Berkeley and/or Stanford. But... it just seems that the eastern U.S., and maybe even the vast majority of the U.S. not hugging the pacific ocean, has a very different take on things. That is likely good for those of you who are California residents. Doesn't UCLA already get nearly 100K applications each cycle? They really do not need any more applicants.<br><br>It does though seem to mainly be a public vs. private bias. The only public university that the same high-achieving high school seniors all seem to aim towards (from the eastern U.S.) is UVa... with Berkeley in a distant second... followed by UTexas. UCLA is just never mentioned.<br><br>Very few seem to have much faith in public universities generally (applying only to their local ones as back-ups or safeties)... or maybe they dislike the extra GE requirements associated with such.<br><br>The UC system is widely considered the best, so I am quite sure our take on things would have been different had we lived in California. Of course, neither USC or UCLA can compete with Stanford's 80% yield rate. Both languish around 35%.<br><br>", "<b>Username: sushiritto</b><br><br>\"\"But... it just seems that the eastern U.S., and maybe even the vast majority of the U.S. not hugging the pacific ocean, has a very different take on things. That is likely good for those of you who are California residents.\"\"<br><br>So are you attempting to summarize \"the take\" of college students and their parents from across America?<br><br>Rankings are just rankings. But you missed one, \"Best Global University Rankings\":<br><br><url>https://www.usnews.com/education/best-global-universities/rankings</url><br><br>Cal is #4<br>UCLA is #10<br>USC is #53<br><br>", "<b>Username: UCBUSCalum</b><br><br>I am not downgrading either school. Both USC and UCLA are great schools. I was just pointing out the fact that from a graduate school prospective, UCLA is generally ranked higher than USC. In this past year's graduating class from the local high performing high school in my local area, there were 12 graduating seniors going to UCLA and 4 to USC. I live in a well to do area and it is not an affordabilty issue. A similar type of ratio or higher ratio choose UCLA over USC in other high schools in the area. USC, UCLA and UC Berkeley are all about equal in terms of admission standards. In CA only Stanford and Cal Tech have more stringent admission standards.<br><br>Cal and UCLA are ranked high globally because of its excellent professional and graduate schools.<br><br>Also see this link which supports the US News global rankings.<br><br><url>https://en.wikipedia.org/wiki/Academic_Ranking_of_World_Universities</url><br><br>", "<b>Username: WWWard</b><br><br>Our college research experiences/discussions were limited to online and in-person contacts involving only a few 100 individuals and also going back only 7 years or so. But... I am basically only saying that the entire on-going comparison between UCLA and USC... or between any UC and USC seems to be more driven by those who live in or grew up in California. Most often, it seems to be specifically driven by someone who attended an UC school.<br><br>Elsewhere, USC &amp;/or Stanford are more often compared to different private schools or to each other, and UCs are simply discussed far less often. I have had this same general conversation with friends, family members and colleagues in Florida, Georgia, Virginia, Maryland, New Jersey and New York. Those are still admittedly limited conversations. But such discussions and my online take from those who live &amp; work in the east vs the far west seem to support my own personal conclusions. It is simply more of a west coast concern or point of contention.<br><br>Many do of course trumpet their support for UCs over USC. I have just never personally met anyone so far who did so and who did not also grow up in or currently live on the pacific coast.<br><br>And the same sort of comparison dynamic does not really happen as often here with the schools in are own area. People may compare and contrast state schools... but they usually do not do so with the private universities in the area. They just seem to take it at face value that public vs private is a whole different matter.<br><br>Personally, I care very little about rankings as any form of definitive guidance. I instead advise prospective applicants to research each college of interest very carefully, visiting there in-person and then deciding what best fits their individual wants and needs. Any form of ranking should thus be only one of many tools to consider.<br><br>I will be the first to admit that I was very impressed with UCLA's campus and location. To me, its location especially is far superior to USC's... but it was still not enough for either of my daughters to consider it. They had zero interest in attending any public university... even one of the best among them.<br><br>Thankfully there are a wealth of quality colleges to choose among... both public and private. I advise future applicants to choose well and then to also leave themselves with quality options among the admits... applying to a good mix of reach, match and safety colleges. While I did clearly favor my two daughters attending a private university vs a public, and while I was also super pleased to see them both pick USC, if any applicant's final choices came down to Cal, UCLA and USC, they would be very lucky indeed. In our case, it would just mean a decision in favor of USC. But I can clearly not criticize anyone who would choose to attend Berkeley or UCLA. Thank goodness today's applicants all have a plethora of diverse higher education options to choose among.<br><br>", "<b>Username: CALSmom</b><br><br>@WWWard just curious, did you visit or consider the Claremont Consortium? If so, what did you and your daughters think?<br><br>", "<b>Username: whatisyourquest</b><br><br>As I recall, at USC, students couldn't live on campus for all four years. I believe that only two years were guaranteed. I personally feel that private universities should provide on-campus housing for all four years, so that was a deal breaker for us. I don't have such expectations of public universities.<br><br>", "<b>Username: WWWard</b><br><br>@CALSmom Yes... both considered them, especially Pomona. In the end, neither applied to any LACs however. They both wanted more of the overall college experience vs what they considered fully possible at any LAC. Plus, their desired majors did not really align well with what the Claremont schools offered.<br><br>@whatisyourquest While USC technically only guarantees college-owned housing for the first two years, it is now possible for a student to spend all fours years housed within USC housing if they really prefer it. Most upperclassmen though voluntarily choose to look elsewhere and secure private accommodations... and mainly to save money. The private apartments are often larger too. My older daughter had USC housing for years 1-3, but will be living with my younger daughter (a new freshman) at a private apartment a block from campus. And the savings related to housing and board are considerable vs. the costs in prior years.<br><br>", "<b>Username: UCBUSCalum</b><br><br>As an alum of both UC and USC (wife and her family are mostly USC alums with one family member graduating from both USC and UCLA), I had no intent to offend anyone. I was just stating the facts to respond to the original posting. In the UCLA blog in this forum, it would be hard to find postings that UCLA is better, etc. Both UCLA and USC are great choices for high school seniors going to college.<br><br>", "<b>Username: stardustmom</b><br><br>These rankings as they apply to undergrad level are no surprise. USC has nailed the undergraduate experience. From campus safety, advising, class size, to housing, everything is carefully considered and you can see improvements continually being made. USC and the UCs are not what they were twenty plus years ago, when I attended them.<br><br>", "<b>Username: blueskies2day</b><br><br>@whatisyourquest Your point validates what others have said, the choices made is an individual thing - my students were ready to get off campus after a year - they would not considering staying in a dorm at any college. They wanted the freedom and responsibility of off campus housing, it was time to grow and move on (and out). They didn't even consider schools that required staying on campus after the first year. My guess is that parents want that option probably more than the students, and is understandable, but if mine had to stay in a dorm at UCLA, USC or any school more than a year, well, they wouldn't have gone there.<br><br>", "<b>Username: IWannaHelp</b><br><br>\"\"USC is thought of as an elite university on par with Duke, Vanderbilt, Rice, Emory, Northwestern, UChicago, etc. &amp; just one step below (in most people's opinions) Stanford, MIT and the better known Ivies (Harvard, Yale, Penn, Brown, Princeton, Columbia).\"\"<br>With the exception of Emory, USC's test scores are not really on par with others. Maybe your view is a bit inflated?<br><br>", "<b>Username: WWWard</b><br><br>@IWannaHelp Well, USC turned down over 3,000 applicants in the 99th percentile as it relates to test scores. Thankfully, USC judges applicants holistically and does not simply try to inflate their freshman survey #s. They strive to create a well-rounded and diverse freshman class. And those who choose to attend USC, applicants like both of my daughters, also do not simply select a college based on rankings or the average test scores of their peers. But my \"view\" is just that... my view and those of whom I know well and interact with often.<br><br>The teens that I know well are looking to attend an academically respected and challenging college, but also one that is big enough to offer all of the elements of the overall college experience... successful athletics, an active social or greek life as an option, many options to choose among regarding majors and minors, a wealth of student organization to choose among, ample internship and job opportunities, a growing and robust city surrounding it, great weather, a nice campus and a strong alumni network to support them after they graduate. There are not that many colleges that offer all of this to prospective college students. Many of the colleges traditionally considered Top-25 fall short on some of these fronts. Both UCLA and USC fit with these goals. This can be evidenced also by the tens of thousands applying annually.<br><br>As @stardustmom suggests above, USC is truly excellent these days at all of the things that matter most to both students and their parents. My younger daughter just turned down Princeton, Emory, Rice and others to attend USC. To her, it was clearly #1. And that is what it is all about... each applicant's individual decision. And at no point in her decision-making process did she consider any of the factors that may later appear in her freshman class survey. I doubt that there are very many freshmen arriving next week who chose USC because of the average test scores of their peers or any other nonsensical qualifiers. These are personal decisions about wants, needs and fit.<br><br>The only kind of rankings that likely impacted most of the final decisions to attend USC instead centered on factors detailed within the Niche rankings where USC was #1 out of over 1300 colleges in the following factors: College with the best student life in America &amp; Best big college in America. It was top 10 in seven categories and top 20 in nineteen categories. Being considered the best overall college in terms of the quality of student life is not a fluke. And things like that are far more important to the average 17-18 year old versus being able to brag about their collective SAT scores as a freshman class. There are frankly other colleges for that. I know... I unfortunately chose poorly in my day and attended one.<br><br>", "<b>Username: WWWard</b><br><br>As @stardustmom suggests above, USC is truly excellent these days at all of the things that matter most to both students and their parents. My younger daughter just turned down Princeton, Emory, Rice and others to attend USC. To her, it was clearly #1. And that is what it is all about... each applicant's individual decision. And at no point in her decision-making process did she consider any of the factors that may later appear in her freshman class survey. I doubt that there are very many freshmen arriving next week who chose USC because of the average test scores of their peers or any other nonsensical qualifiers. These are personal decisions about wants, needs and fit.<br><br>The only kind of rankings that likely impacted most of the final decisions to attend USC instead centered on factors detailed within the Niche rankings where USC was #1 out of over 1300 colleges in the following factors: College with the best student life in America &amp; Best big college in America. It was top 10 in seven categories and top 20 in nineteen categories. Being considered the best overall college in terms of the quality of student life is not a fluke. And things like that are far more important to the average 17-18 year old versus being able to brag about their collective SAT scores as a freshman class. There are frankly other colleges for that. I know... I unfortunately chose poorly in my day and attended one.<br><br>", "<b>Username: koletang</b><br><br>I think you captured what a lot of students are thinking, @WWWard - speaking as an incoming USC freshman. I chose USC because it took seriously the need for great student life, while offering a rigorous academic program. As several people mention, UCLA has better-ranked graduate programs in many fields. As an undergrad, my top consideration is certainly not grad school bragging-rights. Simply put, the overall undergraduate experience probably matters to the majority of undergraduates most. The private education, school spirit, and downtown-proximity are examples of that offering at USC.<br><br>", "<b>Username: WWWard</b><br><br>Thanks, @koletang Well you certainly seem to mirror the thinking of my own kids and their friends.<br><br>Good luck there at USC. Make the very most of all that it may offer for you...<br><br>", "<b>Username: IWannaHelp</b><br><br>\"\"Well, USC turned down over 3,000 applicants in the 99th percentile as it relates to test scores. Thankfully, USC judges applicants holistically and does not simply try to inflate their freshman survey #s. They strive to create a well-rounded and diverse freshman class. And those who choose to attend USC, applicants like both of my daughters, also do not simply select a college based on rankings or the average test scores of their peers. But my \"view\" is just that... my view and those of whom I know well and interact with often.\"\"<br>@WWWard Every school in the top 50 or even top 100 claims its admission is holistic. How do you know others are less holistic? Let's look at the difference in scores for applicants and admits at USC vs UCLA (the larger the difference, the more important test scores are):<br><br>At the 25th percentile:<br>USC 300<br>UCLA 270<br>UCLA (OOS) 250<br><br>At the 75th percentile<br>USC 130<br>UCLA 170<br>UCLA (OOS) 120<br><br>USC doesn't seem to be any more holistic than UCLA for admission; they look pretty similar to me even though UCLA is presumably more focused on test scores as a public university and can't practice affirmative action. Moreover, based on a quick scan of \"decision threads\" on CC, those other schools you mentioned (Duke, UChicago, Rice) seem to reject applicants with high test scores at a more frequent and random basis.<br><br><url>https://about.usc.edu/files/2016/10/Freshman-Profile-2016.pdf</url><br><url>http://www.admission.ucla.edu/Prospect/Adm_fr/Frosh_Prof16.htm</url><br><br>", "<b>Username: WWWard</b><br><br>@IWannaHelp I simply made a statement in support of the manner in which USC handles their admission process. They could clearly only accept legacies if they chose to... as around 10K apply annually and only 9K are admitted. They could have also accepted the 3K they turned down who were in the 99th percentile with regard to standardized test scores as a means of boosting their freshman survey results. But they did not do so. I am thankful for their methodology. That is all that I said.<br><br>I did not comment on other colleges or question their admission methodologies. I did not try to compare holistic practices of admission.<br><br>You, like any poster, are of course welcome to share your thoughts, as you did above - comparing USC to UCLA, for example, but you do not need to do so as if you are replying to a point entered or made by me - when such is not the case. You even quoted me, which shows that I did not address what you then chose to argue against or comment about.<br><br>That CC practice of quoting others and then trying to make your own counterpoint is one of the worst traits of the CC community in my opinion. I have noticed over the years that a # of CC members consistently do so... often even arguing against points never even made by others.<br><br>I instead try to use CC as a tool to encourage and empower future applicants primarily. I also try to provide info to those seeking it, especially about the topics where I may have some personal experience - like involving USC. You are all free to make what you will of CC &amp; to engage others as you choose to, but I have grown weary of the argumentative tone that too often gets interjected when more than one college is being discussed. I will thus no longer comment on such threads - including this one.<br><br>For the record, I have no idea how UCLA handles admissions. It is a public university that neither of my kids ever even considered applying to - so there has never been any reason to look into their practices or methods. Over the past few years, many posters have jumped on to various USC threads to make \"yeah, but UCLA\" statements or to draw comparisons between USC and UCLA. I certainly hope that the opposite is not true. Hopefully there are not USC supporters posting on UCLA threads. And I get it. As I stated above, it is apparently an L.A. or California thing that most of the nation does not get or really care about. In my circles, UCLA does not come up much and is not considered in the same manner that USC is. I am sure that UCLA supporters find that hard to understand, but that has been my experience.<br><br>Anyhow, this will conclude my involvement on this particular thread. I have already said all that I intend to above &amp; will not comment here further, regardless of any new comment/posting.<br><br>Good luck to this year's entering freshman class at USC - which includes my daughter. And for future USC applicants, I suggest reading through the following very helpful insider's guide to USC admissions...<br><br><url>https://tfm.usc.edu/a-guide-to-uscs-college-admissions-process/</url><br><br>Best wishes... and Fight On!<br><br>", "<b>Username: preppedparent</b><br><br>Interesting, UCLA, Stanford and Berkeley are considered the pinnacle schools for most California residents.<br>3 out 4 in our house go or went to UCLA, Berkeley and Pomona College. Stanford being considered for grad school. Not one even thought of or considered applying to USC. Never crossed our mind to add it to our list of elite colleges which included the likes of Harvard and Yale.<br><br>", "<b>Username: Studious99</b><br><br>Agree with @preppedparent . To add another data point, my Pacific Northwest family (admittedly not the most informed about colleges until the last few years) always viewed Stanford, Berkeley, and UCLA as the best schools in California, and thought of USC as fitting in with schools like Pepperdine and Santa Clara U.<br><br>", "<b>Username: sushiritto</b><br><br>\"\"As I stated above, it is apparently an L.A. or California thing that most of the nation does not get or really care about.\"\"<br><br>You continue to make generalizations about CA and the nation, but around my circle, USC isn't discussed in the same breath as UCLA. For the high stat kids around my little section of Silicon Valley, USC is thought of as almost a \"safety school.\" Even though, I surely know it's not. I'd be very happy, if D18 went to either school, but as I mentioned earlier, UCLA would be the choice in our house, if she had a choice.<br><br>For the record, I didn't attend either institution, but I do have a relative and a friend's daughter attending USC. I'm giving my perspective as a long time CA resident who's going through the college process with D18.<br><br>FWIW, Naviance's scattergrams for the Class of 2017 at my D18's large public high school shows that USC (18%) has a slightly higher admit rate than UCLA (16%). And UCLA gets 2x as many applications as USC, from her large public school. But I'm sure some/alot of that is to be expected since UCLA is a public school and is cheaper for \"full pays.\"<br><br>", "<b>Username: preppedparent</b><br><br>In regard to UCLA being a public university, so somehow it equates to inferior to any private school. It just is not the case. UCLA and Berkeley are commonly cited as world class research universities, frequently rated in the top 10 and top 20 in both US and World rankings including, USNWR, Forbes and others.<br><br>", "<b>Username: scotlandcalling</b><br><br>This discussion always goes round and round. Frankly, and in general, since I moved to CA, the UCLA people I encounter are very defensive when speaking about the school, maybe it's an insecurity about going to a public school versus being able to go to a private school, whether it's getting in or not being able to afford it. (There seems to be great status with private schools from grade school on in certain areas of the country, where public schools are for those that can't afford privates.) What I find odd, is while there is much touting of UCLA, there seems to be no support for each other out in the real world.Those who favor USC seem more secure, maybe cause they know they are already successful. idk. Their alum are a tight group, there is something they do well to continue that tradition there.<br><br>I personally know a lot of people that would never consider UCLA because of the impersonal overcrowded underbudget UC system, and people that don't consider USC because of the area it is in or they can't afford it. Who cares, every school has positives and negatives, both are great schools that are a match for someone.<br><br>", "<b>Username: JenJenJenJen</b><br><br>This is one of the funniest threads I've seen here in a while.<br><br>", "<b>Username: aunt bea</b><br><br>Why does all of this matter? Next week/month/year, the ranking will change.<br><br>Students are going to go where they get in and where they want to go and will hopefully get a job.<br><br>", "<b>Username: jcwjnw99</b><br><br>I live in VA and my daughter will be attending USC in Fall 2017. Threads like this one sure seem to confirm the whole USC/UCLA rivalry.<br><br>My daughter chose USC for several reasons. First and foremost, UCLA likely wouldn't have given her financial incentive as an OOS student. USC did offer her a good financial package.<br><br>USC also appears to be using the money they have raised for not only infrastructure and faculty but to improve financial support across the board. They are one of the big Pell Grant schools so it's filtering down to low-income students as well. I understand USC has a rich kid reputation but that doesn't appear to be the case anymore. Believe me, UVA is much worse with the snobbery. You wouldn't think so, especially comparing the high net worth individuals in CA who I'm sure have students at USC. Out here in VA, some people get a little money and become insufferable. When my daughter was in middle school, one of her friends had a party and the parents actually had bouncers at their front door and the invitations said something like \"popular students only\"; in MIDDLE SCHOOL?!?! Daughter wasn't friends with her not too long after that display. Besides, it will cost less for her to attend USC than if she went to UVA (UVA notoriously cheap with in state students).<br><br>She wants to major in Neuroscience. Both USC and UCLA have highly rated neuroscience programs. At USC, the Dornsife family seems to be very interested in this based on what's being built with their donations and USC is really focusing on their infrastructure to support this major. Not to mention their recruitment of Dr Toga and Dr Thompson from UCLA (not trying to ruffle any UCLA feathers here) and Dr Aisen from UCSD.<br><br>As far as location, I understand that UCLA is in a better area. That's why we visited. I lived in San Diego for a few years and have worked in LA over my career but haven't been there recently. I needed to get a look at the area. Frankly, being raised in Detroit, I didn't anticipate any problems, but still wanted to get a look around the area because I'm not attending, she is, and she needed to see it as well.<br><br>When we visited, she loved the campus, everyone was very friendly, and she's excited about all that LA has to offer.<br><br>Honestly, if we were CA residents, maybe she would have chosen UCLA. Being in state would qualify her for in state tuition and that would have been hard for USC to match. The differences between the schools seem minor overall and both are great schools.<br><br>USC - smaller classes, graduation in four years, great timing with opening of USC Village, higher ranked undergraduate school, money for infrastructure, aid and faculty, proximity to LA, Trojan network<br><br>UCLA - better area, still close to LA, higher ranked graduate schools, lower tuition (if in state)<br><br>Who knows, maybe she'll undergrad at USC and go to UCLA for graduate school. She's smart enough to always evaluate every opportunity.<br><br>", "<b>Username: jcwjnw99</b><br><br>Also, thought worth mentioning. There are a number of great schools in CA. CA residents should feel great about all the options; Stanford, CalTech, USC, UCLA, Harvey Mudd, Pomona, UC Berkeley, UCSD, UC Davis, etc.<br><br>I don't think anyone truly knows what the admissions rates are at some of these schools. USC and UCLA both were around 16% this year. Both accept transfer students, mainly CA residents. I believe it's around 1500 for USC and 3500 for UCLA.<br><br>", "<b>Username: 555State</b><br><br>Bruins, Trojans &amp; Loyalists on both sides: celebrate Los Angeles's good fortune in being home to both UCLA and USC. It's time to stop slamming each other -- the fact is, depending on the specific field, both universities can claim top shelf reputations and credentials. And yet, snobs in other cities/regions laugh at this discussion because they regard both universities as upstarts less worthy those in their own backyards. Rivalry can be a good thing -- driving each university to excel -- but it's time to acknowledge that both UCLA and USC are competing on a larger stage.<br><br>", "<b>Username: CALSmom</b><br><br>It's interesting to get an east coast POV from @WWWard about the whole UCLA/USC perception and I agree with her post #24.<br><br>I have to say USC alumni is something else. You really can't compare that to Berkeley, UCLA or Stanford IMO (and I'm a Cal alum). Even the SC branding is in a class of its own. I can't tell you how many people I know who are die hard Trojan fans and they have no connection to the school! Growing up, SC was considered for the wealthy and thus earned the nickname University of Spoiled Children. I think that has changed a lot with USC really making an effort to diversify and make it financially accessible to deserving kids from lower SES<br><br>", "<b>Username: sushiritto</b><br><br>While this is a USC-UCLA thread, I live in proximity to Stanford (and not all that far from Cal either), and I can tell you, in my little \"hamlet,\" you cannot cough and not get a Stanford-educated venture capitalist/startup founder sick around here. =))<br><br>I've got two Stanford alums in my office that won't stop bending my ear about how great Stanford is/was. A very strong alumni presence locally.<br><br>Fear The Tree. ~X(<br><br>", "<b>Username: zettasyntax</b><br><br>One of my favorite professors at USC is a UCLA alumna, so I have no problems with UCLA :P In fact, when I was younger, it was even my dream school. I had a terrible orientation experience at UCLA where I felt like just a \"number\" and relatively felt ignored most of the day. My orientation advisor was basically telling me what classes I was allowed to take and that I shouldn't even bother trying for classes with a waitlist because \"nobody ever gets into those\". I withdrew from the school a few days later and decided to attend USC for the spring. Compared to the orientation I experienced at UCLA, the one at USC was in a different league. Everything just felt more personal and I was free to register for any classes that I wanted - even those that weren't part of my major. I had no issues with any of the classes being full and was basically able to create the perfect schedule. The whole private vs. public experience is what ultimately sold me. However, I definitely wouldn't mind going to UCLA for my graduate degree someday as their program for my major is ranked quite high. I was technically \"Bruintized\" during the UCLA orientation, so I guess I'm a part-Bruin anyway despite having graduated from USC :P :)<br><br>It was also fun seeing how UCLA and USC trash talked each other. I remember UCLA saying things like they're a far superior school because they have their own police department and frequently referring to USC as \"ketchup and mustard\".<br><br>", "<b>Username: chillbrah</b><br><br>wait why did someone choose ucla over usc? maybe didn't hear about sc before applying? i'm scratching my head :-?<br><br>", "<b>Username: IWannaHelp</b><br><br>@WWWard I was replying to a point made by you. You were clearly responding to my observation that USC's scores are not on par with Duke/UChicago. Maybe you didn't intend to imply other schools are less holistic but your message was interpreted as such under the context. I have no dog in this fight and I have no affiliation with UCLA.<br><br>", "<b>Username: ScienceGirlMom</b><br><br>As the old saying goes: my two favorite teams are UCLA and whoever is playing USC.<br><br>Go Bruins!<br><br>", "<b>Username: scotlandcalling</b><br><br>Another UCLA post that adds nothing to the topic, pretty typical response from the blue side (no substance) and perfect example of UCLA insecurity. I have never toured a more impersonal school than UCLA - just masses of people segregated into racial glumps. For as big as it is, it came off like a lonely place for many of the students we saw. It will only go down in rankings because they don't have the resources USC does (and alumni, donations, supporters, etc) to ever get better. Given budget constraints and requirement to serve the masses, they are in long term \"try to maintain\" mode, while USC keeps rising.<br><br>", "<b>Username: 18yrcollegemin</b><br><br>Like @WWWard, we are also from Florida and have two children attending USC. We just moved my daughter into McCarthy this week. My son originally was interested in USC due to the CS Games program (which is consistently rated tops in the nation) and the automatic half-tuition for NMF acceptees. He was lucky enough to get in and has completely enjoyed his time there. He never considered UCLA. For my daughter, we also visited UCLA (as well as UCSB, UCB, Stanford, UCSD and the Claremont schools). She wasn't thrilled with the Claremont schools and none of the others gave any significant merit aid to OOS students. The publics don't even give need-based aid anymore. The merit scholarship from USC was substantial enough that she turned down several \"more prestigious\" universities including Yale, Columbia, Johns Hopkins, Duke, Vandy, WashU, UVa, etc.<br><br>Over the last 4-5 years, I know that my kids' HS has typically sent about 4-6 students to USC. Maybe they'll send 1 to UCLA. USC may have been known to Cali residents as the University of Spoiled Children at one time, but now, at least to OOS kids, it is often much more affordable than the publics. I think that may be why @WWWard feels that USC is more attractive to east coast (or at least FL) kids.<br><br>", "<b>Username: ModernMan</b><br><br>Add another one to the list, USA Today/College Factual. BTW, they consolidated LACs and Research Unis.<br><br>USC #33<br>UCLA #44<br><br><url>http://www.collegefactual.com/rankings/best-colleges/p5.html</url><br><br>", "<b>Username: ModernMan</b><br><br>Well well well.... 2018 US NEWS has USC tied with UCLA and CAL at #21. That's a still a plus in my book.<br><br>", "<b>Username: GoldenState99</b><br><br>I live in SoCal. I have no family members who attended either UCLA or USC (or who work for either institution). I know graduates of both schools. So I have no dog in this fight.<br><br>The perception in my West L.A. community, and more broadly among my professional and social circle, is consistently (without exception) that UCLA is somewhat better academically than USC. At best, USC is considered to be roughly comparable to UCLA--i.e., they're both very good schools. I have never in my life heard anyone say that USC is better academically than UCLA; whereas it is routine to hear people characterize UCLA as one of the premiere universities in the country (and indeed the world), academically, and not even consider USC in the same category (vs., say, Stanford and Berkeley, in California). Of course, if your metric is NCAA Division I football process, then obviously USC has the better track record, vs. UCLA.<br><br>On the West Coast, UCLA would be considered the top choice, for those who are academically most ambitious, as between the two schools. Both Stanford and Berkeley would rank higher (not much, but definitely higher--though Berkeley and UCLA are more closely comparable in recent years, since both schools now require \"tippy top\" stats to gain acceptance). That being said, if you have the money for top-tier tuition rates (or if you have little family money or income, so that you'll likely get need-based aid), then, if you don't get into UCLA, then USC certainly is an excellent school to attend--and you can be proud to have gone there.<br><br>USC also benefits from having a very enthusiastic and supportive alumni community in the SoCal region. On the other hand, Westwood (UCLA) is clearly located in a much nicer part of the city (vs. downtown L.A., where USC is located). Westwood is safer, nicer, and less boiling hot in the summer.<br><br>All of the foregoing being said, I think it's funny (albeit annoying) to have just read one of the earlier posters on this thread who is clearly a USC booster and who indicated (laughably) that UCLA students or grads are somehow \"insecure\", vs. their cross-town rivals. I believe that the insecure USC-boosters are the ones who should relax: USC is indeed a very fine school (albeit not quite on par with UCLA).<br><br>The objective ranking organizations consistently place UCLA among the best institutions in the world. For example, see the current Times Higher Education ranking, where UCLA is at #15 in the world (!)--an incredibly high ranking. USC is at an excellent #66 on the QS ranking (but still 51 points lower than UCLA). (Likewise, separately, the current QS global university ranking puts UCLA at #33 in the world, while USC is at a relatively low--but still excellent--#132.) As I say, I have no dog in this fight. But it irks me to see misinformation (that is, biased and misleading). Don't worry about your school, USC alums! You've indeed got a very fine school. But please don't create \"fake news\" that somehow USC is anything better than \"roughly comparable\" to UCLA. On a more precise analysis of the reputation of both schools, both locally in SoCal and among the various ranking organizations, the leader, academically, as between the two schools, is, pretty clearly and consistently, UCLA.<br><br>", "<b>Username: observer12</b><br><br>@GoldenState99<br><br>I don't live in California at all. Last spring, the only dog I had in this fight was that my teenager had been admitted to Berkeley, UCLA and USC and liked all of them. So we spent the month going back for visits and talking with lots of people -- academics in California, parents of students in good California high schools, journalists who covered California higher education -- who also had no particular dog in this fight except to give us the most honest information they could.<br><br>Not one of them told us that USC was academically inferior to UCLA or even Berkeley. Not one person believed that, including the parents of high school students, although they all acknowledged that in the past that may have been the case. By the end of the process, what was clear is that while all of the schools were excellent, that USC was the better choice for our child.<br><br>I suspect that the reason that Berkeley, UCLA and USC are tied in those silly rankings is that there is not a lot of difference. They are all great schools. For an in-state student who will save tens of thousands of dollars choosing a public university instead of a private one, it makes sense to choose UCLA or Berkeley.<br><br>But the choice is different when you are out of state. USC offers incredible financial aid to attract the strongest out of state students and most of the incoming freshmen (56%) are out of state. It is a private university, which means (for better or worse) that it is less of a sink or swim atmosphere and more help if a student falters. It has a lot of money and has been recruiting interesting new faculty and many are accessible to undergrads.<br><br>There is little difference in the abilities of incoming students. If anything, the 25-75% SAT scores are higher at USC than at UCLA and more similar to Berkeley. Same with ACTs.<br><br>I learned a lot when we researched those schools. As an out of stater, I was very surprised to learn that UCLA was considered as good as Berkeley. One person who covers higher ed with no axe to grind thought the undergrad education at UCLA was even better than at Berkeley. Who knew? (I'm sure other people believe the opposite.)<br><br>GoldenState99, I don't think a lot of people were claiming that USC was superior. I understand that your friend and associate group believes that USC is inferior -- not equal, but inferior --,but that doesn't mean it is true.<br><br>", "<b>Username: TTdd16</b><br><br>I live in SoCal too, with no family members who have attended either, and I'll agree wholeheartedly with @GoldenState99. In state, UCLA is absolutely considered a stronger school academically and harder to get into. And yes, although it didn't used to be, it's now generally considered the equal to Berkeley. Certainly USC's academic reputation is much better than when I went to college in the 70s, as the moniker really did seem to fit back then.... However, the scandal with the dean of its med school and the lack of response at the top hasn't helped USC's reputation any.<br><br>", "<b>Username: observer12</b><br><br>@TTdd16<br><br>I suspect that your perception of UCLA being a stronger school academically as compared to USC is similar to my perception that Berkeley is a stronger school academically as compared to UCLA. They are both out of date.<br><br>Just compare the Common Data Set of UCLA and USC. The incoming freshman class of USC has higher test scores than UCLA. Test scores are only one small measure and I am not arguing that USC is better. I'm just pointing out that your certainty that UCLA is much stronger academically isn't true anymore. They are both equally strong. In the past that wasn't true. But in the past UCLA wasn't considered as strong as Berkeley. Things change.<br><br>", "<b>Username: sushiritto</b><br><br>\"\"Of course, if your metric is NCAA Division I football process, then obviously USC has the better track record, vs. UCLA.\"\"<br><br>@goldenstate99 This next comment is said a bit tongue-in-cheek and also for everyone in general, but I wish we'd stop focusing in on the prowess of USC Football versus Cal or UCLA, even though USC squeaked out a victory over Texas and dropped in the rankings today. More importantly outside the CFP. :))<br><br>But I digress. Does anyone remember John Wooden and UCLA basketball? Does anyone remember last year's UCLA basketball team with Lonzo Ball, TJ Leaf, etc., which went to the Sweet 16 and does so on a far more regular basis than USC. USC Basketball has been virtually non-existent over the decades.<br><br>And don't get me started on soccer. USC doesn't even have a men's soccer team? Soccer (futbol), the world's most popular sport? What's up with that? Cal and UCLA have men's soccer teams. As we say nowadays, \"Just saying.\" \\:D/<br><br>", "<b>Username: TTdd16</b><br><br>@observer12, I think doing a direct comparison of test scores is difficult because USC superscores and UCLA doesn't. But other than general perception where we live is my knowledge of several of my daughter's high achieving friends who graduated last year. Of the three who wound up going to USC, each was rejected from UCLA (and at least two from Cal--not sure if the other applied. I've heard that two are really happy at USC so far, and that''s what ultimately matters.) There's no doubt at my daughter's very rigorous parochial school that the stronger students are going to UCLA. It's not that the other students going to USC aren't strong-they absolutely are excellent students. They're just not the tippy-tippy top ones who got into UCLA. Completely anecdotal, I understand, but yes, it colors my perception.<br><br>", "<b>Username: Veronica02</b><br><br>@TTdd16 - the same is true at my D's competitive public HS. Of the three, UCLA accepts the fewest applicants, followed by Cal and USC. Not to say all three aren't excellent institutions; its just harder to get into UCLA from our school. Cant argue with Naviance data.<br><br>", "<b>Username: blueskies2day</b><br><br>What a silly conversation. One's friends or social circle is not any kind of sampling. All the upper income friends of mine prefer USC and would never send their kid to an overcrowded public school with budget issues. That doesn't say one school is better any more than someone else's social circle or limited high school naviance system. From our private high school, virtually no one applies to any UCs so I could say with certainty that more get into USC on our naviance system. It is all irrelevant data and just ways to push an agenda.<br><br>", "<b>Username: simba9</b><br><br>UCLA has long had a better rep than USC. I think USC has pulled even with UCLA academically, but it takes time for reputation to catch up to reality.<br><br>That said, I also find these kinds of threads silly. This one makes it seem as if people associated with USC lack self-confidence, and are trying to convince themselves that USC's academic gains are legit. You don't see people from Stanford or Harvard fretting about their schools' academic reputation. I'm personally pleased - almost amazed - that USC has managed to pull itself into the same tier as schools like UCLA and Berkeley. We'll know USC has arrived when alumni, students, and parents of students stop feeling the need to bash other schools in order to make USC look good.<br><br>", "<b>Username: ReallyOk</b><br><br>You have to be careful in looking at test scores when comparing these schools. As public schools, UCLA and Cal have a mission to take the best and brightest from all the high schools in CA and especially those from less privileged backgrounds. USC no doubt cares about diversity, but like all private schools can pick and choose without the same mission as the UC schools. Of course, the rankings don't account for these distinctions, which penalize public schools.<br><br>", "<b>Username: observer12</b><br><br>@ReallyOk I agree with you that test scores aren't a good criteria to use. That's why rankings are silly. The same is true about other criteria -- acceptance rates, etc.<br><br>@simba9 Generally people who lack self-confidence need to insist another school is inferior. I'm not seeing that from USC - most posts here are just noting that all 3 schools are equally excellent. I'm not sure why anyone is disputing that innocuous statement! Maybe it's a California thing.<br><br>", "<b>Username: kcheves</b><br><br>I also live in SoCal and my D17 is applying to both USC and UCLA, with UCLA as her first choice. I'll echo what others have said about there being a long standing perception in CA that UCLA (and Cal) are better academically than USC. My personal bias dates to the early 80's when I graduated high school and had several friends who attended SC with average grades. But going through the admissions process with my daughter and visiting the USC campus several times has changed opened my eyes, and I'd be happy if my D was selected to USC. She's an excellent student (4.0 UW, etc..) and MNSF, but is applying to the Viterbi school and it is not a slam dunk.<br><br>", "<b>Username: CaliDad2020</b><br><br>Sorry, USC is clearly superior. My kid goes there. UCLA was superior when they took a summer school course there, and Cal will be superior if they do grad school there. Hope I've cleared this up.<br><br>", "<b>Username: sushiritto</b><br><br>Actually, I think we need a \"cross admit\" study similar to HYPSM. That'll solve this mess.<br><br>", "<b>Username: GoldenState99</b><br><br>.<br><br>", "<b>Username: stardustmom</b><br><br>I was recently at a dinner where a UCLA professor bashed USC students. It just came off as desperate. The USC professor who was there kept his lips politely sealed. I think UCLA is feeling the heat.<br><br>", "<b>Username: nauidiver</b><br><br>Honestly I think UCLA is overrated. My Daughter went to Cal Poly SLO, and her best friend to UCLA. Hearing them talk about their experiences was an eye opener. SLO had more smaller classes, more personal interaction with faculty, more hands on learning experiences and a more tight knight community - like USC. USC has the added benefit of vast resources for things like undergraduate research and educational programs outside the classroom, to name a few. Coupled with USC's weaving community service programs into the learning environment, its hard to beat the overall experience you get at USC.<br><br>Someone mentioned UCLA ranked higher in the \"objective\" Times Higher Education ranking, which is not only heavily weighted towards a subjective reputation survey, but is primarily focused on research output. Other rankings that are more focused on student experiences and outcome - WSJ/Times version has USC 17/UCLA 28; Niche Rankings: USC 19, UCLA 36; College Factual: USC 33/ UCLA 44 - clearly have USC ahead of UCLA. So rankings, like statistics, can be manipulated to prove anything.<br><br>I'm sure UCLA is a fine public school, but the experience you get there just doesn't seem to compare to the more intimate attention you get at a private school like USC - and surprisingly like Cal Poly (which IMO is one of the best educational experiences you can get in all of the public California universities).<br><br>", "<b>Username: kcheves</b><br><br>+1 on Cal Poly SLO. I took the Engineering school tour with my daughter earlier this year and was blown away by their \"learn by doing\" approach.<br><br>", "<b>Username: nauidiver</b><br><br>I just want to add one more thought<br><br>The old stereotype of USC as an inferior school for rich kids that couldn't get into UCLA is a myth. One only has to look at a little history to understand myth vs reality when it comes to USCs reputation.<br><br>USC was founded as a university to educate professionals Los Angeles needed when it was just a small frontier town. Los Angeles needed doctors, lawyers, business people, architects, dentists and USC was THE university that provided the leaders and professionals it needed. USC maintained this focus on educating professionals for Los Angeles, and Southern California into the late 60s when it made a decision to become a nationally recognized research university.<br><br>The 70s and part of the 80s represented a time of major transition for USC. Raising money to build out its campus and attract nationally recognized faculty to transition from a very good, regional university focused on training professionals to a more traditionally academic focused research university. The students going to USC at this time were primarily focused on getting professional jobs.<br><br>This focus on jobs vs scholarly pursuits was a major factor in other local schools deriding them as inferior academically (yet the acceptance rate at UCLA in 1980 was 75.4% while USCs was 69%). Further, there is no proof to back up the assertion that USC students were primarily from rich families, and yet USC was given the label University of Spoiled Children.<br><br>From the early 90s on, USC made a concerted effort to integrate its very strong professional programs with a more academically focused and stronger college to provide a unique blend of professional education with scholarly pursuits. Raising billions of dollars along the way helped continue its attracting top faculty, and students. Today, USCs acceptance rate is 16%.<br><br>If you look at history, USC was never a bad college or a weak college, it was just focused on a different mission. Now, it would be very hard to argue that USC doesnt meet the criteria for a top notch, nationally recognized research university.<br><br>", "<b>Username: rgosula</b><br><br>My son chose USC over UCLA in 2014, and does not regret it.<br><br>", "<b>Username: CALSmom</b><br><br>SC is a great school and I'd personally rank it above all the UCs. I don't have a kid going there either. My S goes to a different private U and that's where I notice the difference, having gone to two CA public unis myself. Private Us are better with resources, class availability and size and alumni network/support. My youngest kid is going to college soon and with great grades hopefully he'll find a good fit with a private school in CA. They are actually more affordable than the public universities in a lot of cases.<br><br>", "<b>Username: WWWard</b><br><br>From this new article...<br><br><url>http://news.usc.edu/128521/usc-ranks-no-15-nationally-in-journaltimes-higher-education-survey/</url><br><br>\"USC ranks No. 15 nationally in the second annual Wall Street Journal/Times Higher Education survey of more than 1,000 U.S. colleges and universities released this week. Among all California institutions  public and private  only USC, Caltech and Stanford University ranked within the top 20. Of 150 universities surveyed in the western U.S., USC ranks No. 3.\"<br><br>This correlates exactly with how all of my east coast peers see things.<br><br>", "<b>Username: CaliDad2020</b><br><br>FWIW: Was very skeptical of SC (Viterbi) when my kid said it was their first choice, but have been extremely pleasantly surprised since. Have nothing recent to compare it to, but my kid has more options, opportunity and support than they know what to do with (and way more than I had in my \"higher ranked\" east coast school 35 years ago.) They are academically challenged and have found a very supportive, fun (non-greek) social crew that perfectly fit my kid's lifestyle, goals and interests. Very surprised, in a good way.<br><br>", "<b>Username: CaliDad2020</b><br><br>BTW, irrespective of rankings, this is one of the things that really attracted my kid to USC/Viterbi. And it's only getting better. She loves that Viterbi has as many women students as it does. Makes the experience much more interesting and fun for her, she thinks.<br><br><url>https://viterbischool.usc.edu/news/2017/09/women-welcome-here/</url><br><br>", "<b>Username: zettasyntax</b><br><br>@stardustmom I ultimately wound up at USC, but when I went to orientation at UCLA, one of the speakers kept touting the fact that UCLA has its own police department. It came off to me like the speaker was trying to say that you're pretty much toast on USC's campus if you want a quick response from police. It did seem a little desperate to attack the safety of USC. That being said, I wouldn't mind attending grad school at UCLA. I just didn't like what I saw when I was going to do my undergrad there.<br><br>", "<b>Username: jmek15</b><br><br>Odd. USC has it's own department of public safety. Officers go through the same training as LAPD. They also have a specific team of LAPD officers that are assigned to the area so they know the neighborhoods and consistently work with the USC.<br><br>", "<b>Username: stardustmom</b><br><br>There have been a couple of false \"active shooter\" reports on SCs campus, which have given me a good indication of USCs level of preparation. One occurred last week the day after the Vegas shooting. A professor had a breakdown claiming that four of her friends were at the concert and she was telling students to call 911 because there was a campus shooter. I only heard about this through my son who is thoughtful enough to text me that he's fine, in case I hear something on the news. According to him, SC has been very prompt in their response to any scare, and their campus security seems well trained. In this last case, the students were sent a text alert to shelter in place, and the entire campus was searched with nothing found, except the distressed professor.<br><br>Every time I have been on SCs campus, I have seen security stationed throughout the school, which is fenced and has cameras. There is also security positioned in the surrounding neighborhood, which I have found reassuring. Both UCLA and USC have had incidents in the recent past. I can only comment on USCs security efforts, which seem strong to me. I am looking at colleges for #2 son and as I tour campuses, I consider their safety measures for small as well as large incidents. I am not sure any college is immune from potential problems these days.<br><br>", "<b>Username: Defensor</b><br><br>U.S. News Global Rankings<br>UCLA #10<br>USC #53<br><br>Wall Street Journal/Times Higher Education World Rankings<br>UCLA #15<br>USC #66<br><br>QS World Rankings<br>UCLA #33<br>USC #132<br><br>ARWU World Rankings<br>UCLA #12<br>USC #54<br><br><br>But hey, kids from Florida, parents of kids going to USC and O.J. all think USC is better, so it must be better!<br>:))<br><br>", "<b>Username: CaliDad2020</b><br><br>Picking a school based solely on rankings is a huge mistake, as @defensor post points out.<br><br>Depending on what rankings take into account you can pick the WSJ/Times college rank that puts USC at #15 and UCLA #25, or the WSJ/Times World ranking that puts UCLA @ #15 because they measure completely different things in a summarial form (THE World University Rankings focus on universities research performance, the US table measures institutions student engagement, student outcomes and learning environments.)<br><br>Anyone who tells you 100% the \"overall\" experience at USC is better than UCLA or visa-versa is lying.<br><br>Each student's major, interest, financial situation and personality will determine which is \"higher ranked\" for that student. In the \"real world\" across most industries, employers, and post-grad institutions, there is no \"real\" overall difference in the two school's rep.<br><br>", "<b>Username: WWWard</b><br><br>Yes, @Defensor ... kids from Florida or basically anywhere east of California, parents of kids going to or who went to USC, various ranking sources like US News, Niche, Forbes, Wall Street Journal, etc., everyone I know personally who went to an Ivy or to any Top-25 school (albeit none of them grew up in California) and especially anyone who favors a private university versus a public college all think that USC is better. Thankfully, we all have choices. UCLA is an excellent choice for many. 61% of those applying are from California though. Another 18% are International applicants. Only 21% are from the other 49 states. (By comparison, USC's #s are: 44% from CA, 14% International and 42% all other states) And as for public universities, I will concede that UCLA is likely the second best public college in California and clearly among the 5 best public colleges in the U.S. So give yourself credit, California, your public universities are generally the best in the nation.<br><br>", "<b>Username: zettasyntax</b><br><br>@jmek15 My aunt used to work/talk at USC orientation awhile back. She deals with ID fraud (so parents loved talking to her afterwards) :P When I told her that UCLA boasted they have their own police department, she also seemed surprised by the comment. Dunno. Maybe UCLA didn't bother to research the security at USC. I always felt safe when I was on-campus and walking around late at night. The security even intimidated me sometimes. I swear they were following me one time too. Maybe I looked suspicious that day :P<br><br>", "<b>Username: simba9</b><br><br>I've always thought that people who use rankings to brag that their school is better than another do it because they lack the confidence that their school really is better. They're going through an exercise to convince themselves that it's true.<br><br>", "<b>Username: Defensor</b><br><br>'The Princeton Review' 2017 student \"Top 10 Dream Schools\" - based on a survey of 8499 college applicants from all 50 states, D.C. and more than 20 countries:<br><br>UCLA came in at #5, Stanford #1, Berkeley #8. USC failed to make the list.<br><br>Three California schools in the Top 10, but no USC.<br><br><url>https://www.princetonreview.com/college-rankings/college-hopes-worries</url><br><br>", "<b>Username: KTJordan78</b><br><br>Weird that @WWWard is so insistent that USC is regarded as a generally better school than UCLA on the east coast. In the late 90's US News ranked UCLA right around where it is now (low 20s), but USC was ranked somewhere in the 60s (yes, the 60s) with an acceptance rate around 75%. At that time they really weren't competing for the same students, and everyone knew it. The GPA and SAT scores were nowhere near the same. I even remember in the original \"Barron's Top 50 Guide to America's Best Colleges\" UCLA had its own chapter. USC was not included in the book at all. Obviously USC has sunk a LOT of money since then in raising their stats for US News, and the effort has paid off.<br><br>This year, the World Reputation Rankings (which, obviously, ranks universities based on their international reputations) placed UCLA at #13 right after Columbia, and USC somewhere in the 70s (they don't give specific rankings beyond the top 50.) But you do you, Florida!<br><br>", "<b>Username: blueskies2day</b><br><br>So that's a study of 170 kids per state, sounds like valid real scientific data and results from that study. lol. Could it be marketing by PR which is what most of these rankings are - which marketing and PR people know.... But if insecure UCLA people need to find these obscure studies to feel better, so be it.<br><br>", "<b>Username: thinkingfastslow</b><br><br>As a current senior applying to colleges in California, it's been very interesting to read @WWWard 's description of the East Coast perspective on UCLA. I am a National Merit Semifinalist, likely finalist, and as a result will probably get at least a half-ride from USC. Nevertheless, the thought of applying to USC has never even remotely crossed my mind - with in state tuition, UCLA is just so much cheaper for what virtually everyone in my surrounding environment considers to be an equal if not superior academic experience. 70k base tuition is hard to swallow.<br><br>I do know of several students at my high school that have USC as a dream school (especially several prospective film arts majors... obviously, UCLA cannot compare in the arts), but UCLA is undoubtedly the college that more hopes ride on. Every year, at least one or two of our most talented students (2400, fantastic ECs, beloved by teachers, etc.) turn down admissions to Ivy League/similarly elite colleges to become a Bruin. I would imagine that in most public high schools across California, UCLA is synonymous with excellence.<br><br>", "<b>Username: WWWard</b><br><br>We live and I work in Florida, but my personal client base includes the Southeast and Mid-Atlantic states. I personally went to JHU and its grad school, but my friends and main peers went to a # of Ivies and also to schools like Vanderbilt, JHU, Ga Tech, MIT, Northwestern, Emory and Duke. Almost all of them grew up in locations that were east of the Mississippi River. So Northwestern was the college the furthest west that any of them ventured to. That is the extent of my personal sphere of influence (the people I know well and their kids and kids' friends)... but it is broader by far than just Florida. It extends from Miami to Buffalo, NY and now into Eastern Canada... and as far northwest as Chicago and as far due west as Texas.<br><br>There are tens of thousands of high school seniors all dreaming of going to their in-state flagship university... whether it be the U. of Alabama or U.F. / FSU or U. of Georgia or UCLA, etc. California, Virginia, North Carolina, Michigan and Texas are some of the states where such a decision to attend an in-state flagship public university would also equate to attending an elite / well-respected college. In the case of most states, including Florida, that is really not the case.<br><br>My experience has just been that those (albeit from Eastern states) looking to attend an elite / well-respected university tend to name the Ivies and colleges like Vanderbilt, Duke, USC, UVa, Ga Tech, Emory, Rice, Northwestern, MIT, Carnegie Melon, CalTech and Stanford. Those open to attending public universities mention UVa, Ga Tech, U. of Michigan, U. of Texas, U. of N.C. and sometimes Berkeley. I have only recalled UCLA being mentioned once during the past 10 yrs or so... by a current high school senior who was friends with my daughter. She recently toured USC, UCLA, Berkeley and Stanford on her trip out west. So - to her - all four colleges are on par with each other.<br><br>I have repeatedly witnessed the shock here on CC that this seems to cause some California residents. They seem to think that everyone outside of California looking west and thinking about elite universities have to consider UCLA or at least think more favorably of UCLA than USC. That has simply not been my experience at all. But take heart... as a state, you at least do have one of the very best (in my opinion, likely the very best) public university system. I certainly would have preferred my daughters choosing to attend Berkeley or UCLA over U. of FL or FSU. Neither even considered any other colleges in California other than Stanford and USC however. And thankfully they each love attending USC.<br><br>Good luck @thinkingfastslow Hopefully you land at the right college for you. That is really all that matters. Outside opinions, rankings, etc. are all just \"white noise\" from beyond that will not have any impact on your individual college experience. So my advise is visit your finalists and choose what is best for you and you alone.<br><br>", "<b>Username: KTJordan78</b><br><br>@blueskiestoday - What survey talks to 170 kids per state? Also, what is an obscure study? The World Reputation Rankings are probably the largest and most prominent international ranking of global universities in the world. So confused by your response...<br><br>", "<b>Username: KTJordan78</b><br><br>WWward - I think the shock comes from the fact that UCLA has been the most applied-to college in the country for 20 years, UCLA is ranked in Princeton Review's top five \"dream schools for college applicants\", and usually in the top 10 \"dream schools for parents\", and last year, Niche reported that UCLA was it's #1 \"most interested in\" school for high school students, based on their online Niche profiles.<br><br>I get that you don't like public universities much, but I find it hard to believe that no one you have ever spoken to thinks of UCLA in the application process. Every piece of national data seems to indicate the exact opposite. Having said that, UCLA's mission is to educate Californias, so they probably do not do much recruitment of Floridians (understandably). There may be a lot happening outside of your sphere that you are not aware of.<br><br>", "<b>Username: WWWard</b><br><br>@ktjordan78 Obviously, we are each limited to our own spheres of influence. All that I have ever offered are my own impressions and experiences. But - they are as stated... regardless of how strange such seems to Californians. And I have been to California many times. I have seen first hand how Californians in general perceive themselves vs the rest of the nation. So \"the shock\" makes sense given the spheres prevalent to the average Californian. But while you are the biggest state in terms of population, you are still only one of 50.<br><br>Yes, there is no denying the raw # of applications received by UCLA. It is the most by any public or private university.<br><br>There is also no denying that USC receives more applications overall than any other private university.<br><br>Thankfully, those looking to attend a college or university, whether public or private, all have choices. There are literally 100s of excellent potential choices. Between my two kids, 22 different colleges were applied to.<br><br>UCLA is an excellent choice for many. But... let's not forget that 61% of those record #s who are applying are also California residents. And another 18% of those record #s who are applying are International applicants. Thus, only 21% of those applying to UCLA are from the other 49 states. And that breakdown really seems to be the part that most CC comments via stunned UCLA supporters are overlooking.<br><br>79% of all UCLA applicants are not from those 49 states that Californians seem to overlook. And if you split the nation generally into West vs East, it is likely then that less than 10% of UCLA's applicants come from the Eastern half of the U.S. I actually suspect that the # would be closer to 5% or less... as the western states bordering or near California likely account for more than their fair share of UCLA applications.<br><br>By comparison, USC's #s are: 44% from CA, 14% International and 42% from all other states (double that same percentage for UCLA - 21%). So, as a percentage of its total application pool, USC is twice as attractive to non-California residents. The points that I have been alluding to thus seem to be supported by the actual #s supplied by each institution.<br><br>Sorry if that still seems shocking...<br><br>", "<b>Username: sushiritto</b><br><br>\"\"So, as a percentage of its total application pool, USC is twice as attractive to non-California residents.\"\"<br><br>You fail to realize that UC's limit non-CA admittees/acceptances, so that does put a damper on the amount of non-CA applicants to UC's. USC has no limitation as far as I know as a private school.<br><br>", "<b>Username: KTJordan78</b><br><br>@WWward I don't know how this diverted into a numbers game about the percentage of CA applicants vs East Coast applicants. You made a statement about how UCLA doesn't have the same reputation elsewhere as it does in California. I provided data that UCLA was ranked high above USC for many years by US News (who at the time was the only group providing such rankings). Only once has USC be ranked one spot above UCLA in those rankings. Every other time it has been below (and I think twice tied). Other international reputation rankings place UCLA's academic reputation globally far, far ahead of USC (#15 vs the 70s)The Princeton Review recently released its \"Hope and Worries 2017\" report, listing the top 10 \"dream schools\" for students, in order:<br>1. Stanford<br>2. Harvard<br>3. MIT<br>4. NYU<br>5. UCLA<br>6. Columbia<br>7. Princeton<br>8. Berkeley<br>9. Penn<br>10. Yale<br><br>Another Princeton Review \"Hopes and Worries\" list of dream schools for parents went as such:<br>1. Stanford<br>2. Harvard<br>3. Princeton<br>4. Yale<br>5. MIT<br>6. NYU<br>7. Columbia<br>8. Michigan<br>9. Notre Dame<br>10. UCLA<br><br>Now don't get me wrong. USC is a wonderful school, and has done a LOT to be more competitive with UCLA in recent years - including having a stellar football team, which high school students definitely respond to. But to give an impression that UCLA's academic reputation is in any way below USC's is, to be blunt, just Trojan tr0lling at its most petty. You have definitely drank the cardinal and gold kool-aid!<br><br>", "<b>Username: sushiritto</b><br><br>\"\"There is also no denying that USC receives more applications overall than any other private university.\"\"<br><br>Sorry, that distinction would go to Boston University with 54,190 applications. USC is #2.<br><br><url>https://www.usnews.com/education/best-colleges/the-short-list-college/articles/2015/09/17/10-colleges-that-receive-the-most-applications</url><br><br>", "<b>Username: KTJordan78</b><br><br>Another note: Due to the vast cost differentiation between UCLA (and all UCs) and USC for Californians, I do know that USC recruits *quite* hard in other major markets like Texas, New York, Illinois and Florida. I am sure your perceptions of USC are direct reflections of successful recruitment and marketing campaigns over the years.<br><br>Cheers<br><br>", "<b>Username: sushiritto</b><br><br>\"\"She recently toured USC, UCLA, Berkeley and Stanford on her trip out west. So - to her - all four colleges are on par with each other.\"\"<br><br>I'm not an alumnus of any of these fine institutions, but I don't know of anyone anywhere, other than your D, who would say that Stanford is \"on par\" with USC, UCLA or Cal. No one.<br><br>", "<b>Username: jjalfonso1</b><br><br>What do a global research ranking or a publication from the 90s have to do with how east coast families perceive USC/UCLA today?<br><br>", "<b>Username: ucbalumnus</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/thinkingfastslow\">thinkingfastslow</a> wrote:\"\"<br><br>The cost differences probably account for some of the California versus non-California views on UCLA versus USC.<br><br>For California residents, UCLA appears to be less expensive than USC for all family income levels, based on their net price calculators. The difference increases greatly at high income levels (where USC keeps getting more expensive while UCLA tops out at California resident list price), and for those whom CSS Profile (used by USC but not UCLA) leads to unfavorable financial aid calculations. Note that even the half tuition scholarships at USC still leave a net price higher than UCLA's California resident list price.<br><br>For non-California residents, UCLA offers no need-based financial aid, so USC is less expensive at most family income levels (particularly at the lower end), except for the highest income levels where USC's net price exceeds UCLA's non-resident list price.<br><br>", "<b>Username: KTJordan78</b><br><br>I see The Higher Times 2017 ranking UCLA at #15 in their World University Rankings, with USC at 66....<br><url>https://www.timeshighereducation.com/world-university-rankings/2018/world-ranking#!/page/0/length/25/sort_by/rank/sort_order/asc/cols/stats</url><br><br>", "<b>Username: KTJordan78</b><br><br>@jjalfonso Perception is almost a complete result of reputation. International reputation, historic reputation, and so on. But you are right - no one should base their opinion of a school on any one ranking - or really any rankings at all!<br><br>But if you want to go around saying that USC has a universally agreed-upon better reputation than UCLA, I'm gonna call your bluff. It simply isn't true.<br><br>", "<b>Username: stardustmom</b><br><br>Rankings offer only one part of the picture (and as has been pointed out, they are often manipulated). You will only know if a university is right for you when you actually visit and spend time on campus. My son got into several wonderful UCs. Berkeley would have been the best for him given his CS major, but after spending a day on campus and sitting in several massive, overcrowded lecture halls with other recent admits, he decided on USC. He has no regrets.<br><br>UCs are a great bargain for California residents, but you get what you pay for.<br><br>\"I'm not an alumnus of any of these fine institutions, but I don't know of anyone anywhere, other than your D, who would say that Stanford is 'on par' with USC, UCLA or Cal. No one.\"<br><br>Perhaps, but Stanford's rep has taken a big hit thanks to the Brock Turner scandal. The judge, a Standford alum, who heard the case is about to removed. Even before that case hit headlines, I was touring the campus and struck by the chalk walk decrying rapes in the community.<br><br>", "<b>Username: jjalfonso1</b><br><br>Have any posters made universal claims? Maybe I missed it among the 7 pages of this thread...<br><br>Someone stick a fork in this.<br><br>", "<b>Username: sushiritto</b><br><br>\"\"Perhaps, but Stanford's rep has taken a big hit thanks to the Brock Turner scandal. The judge, a Standford alum, who heard the case is about to removed. Even before that case hit headlines, I was touring the campus and struck by the chalk walk decrying rapes in the community.\"\"<br><br>Stats as of 2014, but Brown, Dartmouth and Harvard had more incidences of rape reports:<br><br><url>https://www.washingtonpost.com/news/grade-point/wp/2016/06/07/these-colleges-have-the-most-reports-of-rape/?utm_term=.5a2cd69063c5</url><br><br>Living in proximity to the Stanford campus, I know of no slip in their reputation.<br><br>", "<b>Username: WWWard</b><br><br>@sushiritto U.S. News is likely just not that up to date with its info. USC actually had over 56K applications this most recent cycle... so still #1. But clearly BC is close behind, as you suggest. Even if USC is #2 vs #1, my point remains the same... USC being one of the most sought after private universities in terms of the # of total applicants... and with a higher percentage of those total applications coming from across the nation.<br><br>@KTJordan78 Well, various ranking sources like US News, Niche, Forbes, Wall Street Journal, etc. rank USC higher. And you have mentioned other sources ranking UCLA higher. I really could not care less about such rankings. My kids and their friends have never cited a single ranking source when explaining where they wanted to attend -- other than Niche's, as those student reviews do seem to sway them. None have ever mentioned the Princeton Review - period. Many applicants care a great deal more about the perceived quality of student life than any ranking related to comparative academic standing. Yes.... they do want it to be at an elite / well-respected school... - of course, but then they also care about weather, campus, dorms, school infrastructure and resources, school spending on improvements, school spirit, athletic reputation, greek life, alumni network strength, internships/jobs, etc. And most that I am aware of also want it to be a private school. When all those considerations get melded together, that is how schools like USC, Duke and Vanderbilt start seeming a lot more appealing than the Ivies and schools like Carnegie Melon that fail to provide all that they are seeking... all the elements that combine together to generate the total college experience. It certainly factored in to my own daughter choosing USC over Princeton, Emory, Rice, etc. I attended Johns Hopkins and visited friends while in college at many similar schools. I certainly wanted more for my kids than the limited college experience I received. I purposely urged them to consider schools like Duke, UVa, Northwestern, Vanderbilt and USC instead.<br><br>But overall... I have been talking about the \"perception\" of USC vs UCLA in terms of my spheres of influence in the Eastern U.S. I am not hung up on rankings or comparisons. But those who are can clearly cite where USC does well too. Or those UCLA-backers who feel compelled to are free to continue citing rankings that favor UCLA if that is your thing.<br><br>If you are a current applicant or future applicant, my advice is to barely consider rankings at all. Sure... maybe you would like your future college to be deemed Top-50 or maybe Top-100. But other than some general benchmark, the real factors influencing your decision should be extremely personal. Visit your finalist schools in-person. Think about it all... academic reputation - especially in your field of interest, campus, climate/weather, social life, extracurricular options/activities, the arts, athletics, alumni networking, career placement, etc., etc., etc. And then choose wisely based on factors important to you and/or your family. Four years is a long time, and you only get one shot at making those four years the best possible. So please choose wisely. And good luck...<br><br>", "<b>Username: KTJordan78</b><br><br>@jjalfonso1 Direct quote from @WWWard: \"Yes... kids from Florida or basically anywhere east of California, parents of kids going to or who went to USC, various ranking sources like US News, Niche, Forbes, Wall Street Journal, etc., everyone I know personally who went to an Ivy or to any Top-25 school, and especially anyone who favors a private university versus a public college all think that USC is better.\"<br><br>That, my friend, is what you call a universal claim. Totally unfounded and out of touch with reality.<br><br>WWWard is a two time USC mom (I believe. Could be a dad) and the rivalry is real, kids! Good to have school spirit!<br><br>", "<b>Username: WWWard</b><br><br>Exactly, @jjalfonso1 Indeed.<br><br>@ucbalumnus Good points... especially how that could impact the financial viability of attending UCLA as a non-resident.<br><br>And Dad, not mom.<br><br>", "<b>Username: sushiritto</b><br><br>@WWWard You're right that article was old, but USC is still #2 in terms of private universities. BU (not BC) received over 60,000 applications. Just making sure you have the correct information, before you state that it's \"undeniable\" USC is #1 in applications for private universities.<br><br><url>https://www.bu.edu/today/2017/record-60000-applicants-to-bu/</url><br><br>", "<b>Username: WWWard</b><br><br>@sushiritto I stand corrected then. Thanks for taking the time to prove yourself correct... lol.<br><br>@KTJordan78 And your comment takes us full circle back to my very first comment on 8/7, page 1 of this thread... and my dismay from here on the east coast that it is even perceived as a rivalry other than in California.<br><br>My original statement was...<br><br>\"Out here on the east coast, we never even understand the points of comparison. Maybe it is a California-centric thing or simply based on their geographical closeness &amp; the sports rivalry, as both colleges are in Los Angeles, but neither of my kids (both now Trojans) ever even considered UCLA. Last night, there were many teens here at my daughter's birthday party, and the topic of college of course arose. But none of them ever considered or will be considering UCLA either. So... at least in Florida, they are generally not even considered in the same category of colleges. UCLA is thought of as a very good, if not excellent, state school... and certainly better academically than the state/public universities in Florida. But USC &amp; Stanford are the only California schools I have ever heard of in terms of being on the wish lists of Florida teens. USC is thought of as an elite university on par with Duke, Vanderbilt, Rice, Emory, Northwestern, UChicago, etc. &amp; just one step below (in most people's opinions) Stanford, MIT and the better known Ivies (Harvard, Yale, Penn, Brown, Princeton, Columbia). In my younger daughter's case, USC was her dream school though from the beginning, and even an admission to Princeton could not sway her from attending. So USC being consistently ranked higher does not seem at all surprising to us. It not being ranked even higher though is a bit surprising.\"<br><br>Nothing added since Aug 7th here on this thread has or will sway me from my own perspective (granted that it is unique to my life and contacts and prior experiences on the east coast), &amp; regardless of how strange such an eastern perspective may seem to Californians. So I shall again retire from this thread... leaving the rivalry and defense of UCLA to the rest of you.<br><br>Go Bruins! (if that's your thing) And good luck to those applying to either school this cycle...<br><br>", "<b>Username: UCBUSCalum</b><br><br>I would like to interject a couple of items already mentioned. First, @KTJordan78 mentions that UCLA is the most applied college the past 20 years in the US. That may be true, but many (maybe most) of these applicants also had applied to UCB. All UC applications are done in one document. It is just a matter of checking the appropriate box for which UC one is applying to. A person can check all the boxes for all 9 campuses if the person chooses. The more UC's checked, the more there are in application fees. We don't know how many applied to UCLA or UCB as their primary choice or another campus like UCSD or UCSB as the first choice.<br><br>Secondly, @KTJordan78 mentioned USC's status in a late 1990's version of the US News Rankings. I am a hoarder of old US News Rankings (will have to follow up on this) and I am almost positive that this fact is incorrect and @KTJordan78 is cherry picking and may be distorting facts.<br><br>Bottom line is that both UCLA and USC are fine institutions with great programs. In CA, we are very fortunate to have great private and public colleges.<br><br>", "<b>Username: sushiritto</b><br><br>\"\"But I do know of kids who got in to Stanford &amp; then turned Stanford down to go elsewhere.\"\"<br><br>Yep, but with a yield rate of 80% +/-, Stanford doesn't lose many. Even schools like Harvard, MIT, Yale, etc. are turned down. Every college gets turned down, including USC.<br>\"\"I also doubt that many non-Californians even realize that UCs limit non-CA acceptances. I certainly was not aware of such. But then again, my kids were not interested in applying to any UCs. Most applicants apply thinking that they will get in or hoping so. I doubt that those truly interested in attending UCLA are refraining from applying simply out of fear of being denied due to some cap related to them being residents of other states.\"\"<br><br>You make many assumptions. UC's offer no financial aid to OOS and little to no merit aid. It's quite the news out here, and maybe folks on the East Coast don't read the news, but they do cap OOS enrollment at UC's.<br><br><url>http://www.latimes.com/local/education/la-essential-education-updates-southern-uc-regents-approve-first-ever-limit-on-1495123220-htmlstory.html</url><br><br>", "<b>Username: sushiritto</b><br><br>@WWWard The entire 15-30 seconds was well worth it. :)) We all must stay vigilant and fight against \"alternative facts.\" :)>-<br><br>", "<b>Username: KTJordan78</b><br><br>@UCBUSCalum<br><br>@wwward 's claims that USC has this mysterious better reputation with students, and that US News \"ranks USC higher\". It does not.<br><br>", "<b>Username: KTJordan78</b><br><br>SIDE NOTE: for 2018 US News has Berkeley, UCLA, and USC all tied at #21 nationally....<br><br>", "<b>Username: KTJordan78</b><br><br>@ucbalumnus True that all UCs have the same application, much like how most other universities (including USC) accept the Common Application. Your comment is neither here nor there.<br><br><b>MODERATOR'S NOTE</b>: Deleted a link that is not allowed.<br><br>", "<b>Username: stardustmom</b><br><br>@sushiritto Not sure why you are on this thread trashing USC. You stated earlier that you did not graduate from any of the fine CA institutions. Do you have a child at UCLA who is feeling the heat?<br><br>It is foolish to pick a university based solely on rankings. There are so many other factors involved in making such an individual choice. I've known Stanford and Harvard grads who went on to lackluster careers, and graduates from no name schools who had amazing career success. Students should pick the right environment for themselves.<br><br>", "<b>Username: sushiritto</b><br><br>@stardustmom Please show me where I trashed USC. I'll save you some time and I tell you what I did say.<br><br>1. BU has the most applications of any private university, which is a true statement contradicting another poster.<br>2. UCLA, USC and Cal are NOT \"on par\" with Stanford. They're simply not. Stanford is #1 among that grouping.<br>3. IMO, the reason why USC has more OOS applicants is because OOS enrollment to UCLA and other UC's are capped. Also, OOS students receive no financial aid, thus, I believe limiting prospective applications. I don't know this to be fact, but as a parent or student, I might NOT send an application to a UC because we'll get no money and our chances are limited by enrollment caps.<br><br>Do I have to have graduated one of these \"fine institutions\" (my quote from earlier), to comment on them? Do I have a child at UCLA \"feeling heat\"? What does even mean? :-O And why is that even pertinent to the discussion?<br><br>For the record, as previously mentioned, my D18 will probably be applying to each of these wonderful schools among many others in-state and OOS. And I have the results of the \"Sushiritto Rankings\" right here in front of me. :-bd<br><br>", "<b>Username: stardustmom</b><br><br>Your posts read like someone who has an ax to grind with USC. Thanks for the clarification.<br><br>", "<b>Username: KTJordan78</b><br><br>@stardustmom But WWWard's posts don't sound like they have an ax to grind with UCLA??? :-/<br><br>", "<b>Username: USCAlum05</b><br><br>Threads like this get tiresome after a while because of the UCLA fans who hop on here and immediately start bashing USC. At some point, that says more about them than it does about USC.<br><br>Nearly all of the UCLA grads I know nowadays only went there because it was the highest-ranked UC campus they were admitted to or because they thought that Berkeley was full of fruitcakes. With only a handful of exceptions, they were all California natives as well.<br><br>By contrast, the USC alums I know came to California from all over. There's a critical mass of people from Orange County and the Bay Area, but otherwise the USC people come from all over. What gets glossed over by all of the UCLA grads in their endless bashing of USC is that the UC schools are almost as expensive as USC and Stanford out of state, but typically offer ZERO financial aid to out of state students. USC also offers a lot of merit aid, which sweetens the deal for going to that school.<br><br>USC's film school has an 80% yield rate and has been ranked #1 in the world by the Hollywood Reporter for the last 5 years in a row. I was fortunate enough to be admitted to every single school I applied to and am grateful to have had the opportunity to attend that institution. My competition partner on one of USC's academic teams was also admitted to Harvard (really) and chose USC over that school.<br><br>What also seems lost on the UCLA grads bashing USC on here is that the rankings that put UCLA ahead generally all focus on research, while the rankings that put USC ahead focus on quality of life. To directly quote one Bruin alum I know, \"UCLA is a factory.\" The student/faculty ratio at USC is around 9:1. At Stanford it's 7:1. At Caltech it's 3:1. At Berkeley and UCLA, it's around 18:1. At Cal State Northridge it's 24:1. No one questions the excellence of UCLA students, but people are absolutely right to question the quality of the educational experience, as most UCLA and Berkeley grads I know resented being endlessly stuck in lecture classes with 500 students. By contrast, my film production and writing classes typically had 12-20 students at most, and my thesis class had 6 students.<br><br>USC and UCLA are both great schools and I've never had a problem recommending either school to any kid looking for advice on college. But it's telling that you always have UCLA students and grads on here bashing USC. I only visited the UCLA page on here a few days ago for the first time just for comparison and never saw any USC people bashing UCLA. That endless need to bash USC should tell prospective applicants all they need to know.<br><br>", "<b>Username: skieurope</b><br><br><b>MODERATOR'S NOTE:</b><br>Closing thread. There's just nothing else to say.<br><br>"]}