{"title": "notre dame vs mit vs the others", "comments": ["<b>Username: rowswim</b><br><br>K1 is very strong academically and is finishing up the athletic recruiting process. Has passed academic pre-reads from MIT, Cornell, Columbia, Duke and Notre Dame. Notre Dame just made an offer. MIT coach gave thumbs up and will write letter. The other officials went very well and calls from the remaining schools are being scheduled in the first part of this week.<br><br>", "<b>Username: FarmerMom</b><br><br>Daughter is currently a freshman at ND majoring in Engineering. The ND network is not regional. It is national and international. A friend whose daughter is a recent graduate (2014) decided to follow her boyfriend out west for his residency program. She called ND career placement office. In less than a week she had 5 interviews set up in the West Coast city where her boyfriend is doing his residency. She had 2 job offers within a month. Fit is so important in picking a college. It's hard to imagine someone loving MIT and ND equally. They are very different schools in terms of campus culture.<br><br>", "<b>Username: blossom</b><br><br>My kid is an MIT grad (but not engineering although most of his friends were). The environment is not for everyone but our son loved it- start to finish- and found it an incredible source of networking, professional help and advice, etc. even now (graduated a decade ago). He has been able to help younger grads which is always gratifying.<br><br>Notre Dame is considered very prestigious in my neck of the woods, although I don't know that anyone would describe the environment as especially intense-- certainly compared to places like RPI, MIT, Cal Tech, etc. So I think it's more about what he wants and what he's comfortable with.<br><br>I can tell you that the workload at MIT is not an urban myth... nobody skates by. But if it's a fit with what your kid is looking for, it is an incredible experience.<br><br>", "<b>Username: ucbalumnus</b><br><br>Catholic?<br><br>", "<b>Username: ucbalumnus</b><br><br>MIT does have heavy general education requirements. That can contribute to the academic intensity.<br><br>", "<b>Username: HootieA</b><br><br>Notre Dame has one of the most powerful and influential alumin networks in the United States and I believe standardized test scores are on par if not higher than MIT. Last year the average ACT score was a 34.<br><br>Notre Dame engineering graduates also earn more money on average than MIT graduates.<br><br>", "<b>Username: northwesty</b><br><br>What sport? Catholic? Price no object?<br><br>You are really talking apples and oranges.<br><br>D1 athlete experience at ND is obviously a completely different world from D3 MIT.<br><br>ND's culture and alumni network is extremely strong. It is up there with Army, Navy and Princeton imho. But not tech focused as MIT would be.<br><br>Depends on the student experience your kid is looking for and which would fit. I know a kid who turned down a sports offer at Harvard for a athletic scholarship at ND. For that kid, Harvard didn't have a chance. ND tends to attract kids who get what ND is about and who just really really want to be ND students.<br><br>Similar to the service academies, many kids look at ND and say no thanks while others say sign me up.<br><br>Nice problem to have.<br><br>", "<b>Username: sybbie719</b><br><br>Is money a factor? Remember Columbia and Cornell only give need based financial aid. There will be no athletic scholarships coming from them<br><br>", "<b>Username: northwesty</b><br><br>Engineering major plus D1 athlete at ND would be a very intense schedule.<br><br>Maybe more intense than MIT engineering plus D3 sport.<br><br>", "<b>Username: jzducol</b><br><br>Like the Ivys MIT dose not offer athletic scholarships. If ND has scholarship while MIT doesn't it could mean well over $100k in expense.<br>When it comes athletic programs different schools have different emphasis. I know MIT's athletic coaches do not push for time commitment nearly as hard as some D1 schools'. My friend's son is in MIT swimming team and he is able to pursue his full academic schedules without worrying too much about varsity commitment. I don't think you can say the same about the Ivys and other D1 schools. Other D1 couches during the interviews told him that if he didn't have time to study for tests and finals it was his problem, not theirs.<br>In terms of hiring if the field is engineering MIT and ND are not in the same league. No offense to ND, but alum network will only get you so far. Over 90% time no alum will be involved in hiring and school reputation in the field matters a lot, especially for the first few jobs out of school.<br>IMO, if money is a big factor and your kid would not mind a strong focus in sports in college ND would be a better choice. Otherwise MIT college is one of the best programs for an engineering career.<br><br>", "<b>Username: rowswim</b><br><br>@FarmerMom - Great feedback. This is very helpful to know what happens in the world beyond graduation.<br>@blossom - No doubt about it, MIT is very intense and K1 is aware.<br>@ucbalumnus - We're protestant. K1 felt like that wasn't such a huge deal after the official visit at ND, but it you know differently please share.<br>@HootieA - We actually thought the opposite was true - that MIT engineers earn more than ND at the first hire. Do you have a good reference to share?<br>@northwesty - Yes, apples and oranges. K1 is an excellent student and high reaching athlete, so ND seems to have it all. K1's sport is actually D1 at MIT, but it does not compete at the same level as ND or the other schools on the list.<br>@sybbie719 - Very aware of the financial differences between the schools. It should never be disregarded no matter how carefully you've planned but we're just trying to get a handle on the fit for K1 at this point.<br><br>", "<b>Username: suzy100</b><br><br>@rowswim, my D is a junior at ND and is not religious, much less Catholic. It has never been an issue for her.<br><br>", "<b>Username: ucbalumnus</b><br><br>Here are the ND and MIT career surveys:<br><br><url>http://careercenter.nd.edu/students/success-stories-data/first-destination/</url><br><url>https://gecd.mit.edu/resources/survey-data</url><br><br>", "<b>Username: AlwaysLearn</b><br><br>First of all, congrats to your son.<br>Notre Dame does have a national reputation, so I wouldn't worry about that aspect.<br>Yes, MIT is...well, MIT. However, fit and happiness are important IMHO.<br>I assume he has had official visits at both. I don't think he can make a bad decision here.<br>Do finances come into play? (No need to answer; am just saying this is something I would consider as well.)<br><br>", "<b>Username: turtle17</b><br><br>As noted above, the \"culture\" of the two schools is pretty different. A visit, especially an overnight, would I think tend to help a kid decide between the two. They are both places with strong advantages and which can probably accurately be described as \"not for everyone.\"<br><br>", "<b>Username: newHSmom</b><br><br>totally agreed with @turtle17. Visited both schools, ND has beautiful campus and impressive stadium, MIT has a very industrial look. ND is strong in accounting. MIT is overall engineering giant...<br><br>", "<b>Username: wis75</b><br><br>Forget prestige as you mentioned in your original post. It should NOT be the reason to choose one school over the other. Look at the different campus cultures. Your son needs to determine which one most suits him, he will do best there. There are many excellent colleges that give a top education but it is the other variables your son now needs to consider. Finances is one of them, btw.<br><br>", "<b>Username: HootieA</b><br><br>Yes 30 years ago, not anymore. MIT is a top school but there is virtually no edge now.<br><br>", "<b>Username: blossom</b><br><br>MIT's edge is in entrepreneurship, especially for engineers.. My son (not a millionaire, sadly) has several friends who have now started and sold successful businesses. The kid in his frat with the lowest GPA (or so they claimed) was a multimillionaire by age 28. The level of incubation that goes on with help from grad students, professors, the local investment and scientific community is unbelievable.<br><br>Whether the OP's kid wants or cares is another matter entirely.<br><br>", "<b>Username: mathmom</b><br><br>Many years ago we went to a local MIT event which had a lot of alumni. Every alum had majored in engineering, but was now doing consulting or international banking. Now of course being in the NYC area, I'm sure there was a huge selection bias, but that is something to be aware of at both schools - and I saw plenty of non-engineering outcomes at both schools. It's hard to tell if we are comparing apples with apples, but it sure looked like MIT initial salaries are higher. (That may reflect more jobs on the coasts as well as more consulting and IB jobs.)<br><br>I think you can get a the education you want at either school, but that the atmospheres of the two schools - especially the sports culture - are completely different. I can't imagine liking both equally.<br><br>", "<b>Username: northwesty</b><br><br>All the stuff about millionaire entrepreneurs and prestige and starting salaries is really noise. These two schools are both great but are just soooo different.<br><br>Your kid should pick the one she likes and wants to attend. Urban/northeast/Boston vs. midwest semi-isolated campus. Greeks vs. Stay Hall system. Uber geeks vs. a rah rah old fashioned college experience. Catholic/community oriented culture vs. secular. Big time sports school vs. a school where sports could not be less important. And on and on.<br><br>", "<b>Username: northwesty</b><br><br>\"We are from New England, and honestly Notre Dame is a bit of an unknown entity.\"<br><br>This is a ridiculous statement. Did you not notice the sold out football game over at BC this past weekend? Or the sold out game in 2015 that was played in Fenway Park? I bet more people in Boston know ND than know MIT.<br><br>ND has a HUGE national brand. Like Duke hoops, it started with sports but is now way bigger than football.<br><br>", "<b>Username: luloobee</b><br><br>My daughter had to decide between ND and an Ivy. She said she had to ask herself if the latter school were not an Ivy would she like it better than ND--and that settled it for her--very happy at ND. The \"legendary\" alumni support and networking is very real.<br><br>", "<b>Username: thumper1</b><br><br>If your kid wants the better college sports culture...ND all the way!!!<br><br>", "<b>Username: SAY</b><br><br>Honestly rowswim you and your daughter need to decide what she wants. Of the schools mentioned MIT is the outlier by far because of the much lower level of sports. With your chosen name it seems she is a rower which might not matter as much. But in most sports Duke and ND are many levels above MIT. The Ivies are somewhere in-between. The decision between MIT and the others should be rather straightforward. The decision between the D1's has no right answer and all choices are superb.<br><br>", "<b>Username: rowswim</b><br><br>@luloobee That's a great exercise for clarity on the matter. Thanks for sharing.<br>@northwesty ND definitely has a big brand for sure. First thing many people think of is football. I meant unknown entity in terms of its academic rankings. And perhaps one should never generalize, so I'll clarify and say ND's academic reputation was unknown to my family initially.<br><br>", "<b>Username: IxnayBob</b><br><br>@rowswim, I only have anecdotal evidence, and, as often noted, anecdote is not the plural of data. DS has interned twice at prestigious employers who recruit heavily for interns. The interns are a varied bunch, and include students at UChicago, CMU, Cornell, Harvard, etc. To the best of my recollection, he didn't have a single ND intern working alongside him. The number of MIT interns was probably higher than Harvard, and for sure higher than the number at any other school, including Yale (his school).<br><br>These internships and jobs were in Chicago and NYC, which might affect the results. Additionally, they were software engineering / financial engineering positions.<br><br>My personal work experience (I'm old, btw) is that MIT <u>hugely</u> outranked ND in terms of reputation in the fields that I worked in (consulting, software, banking). I worked with many MIT grads. The ND grads that I knew were very successful, financially, but seemed to be more in the sales and marketing areas.<br><br>No disrespect to ND, but if it were my kid, it would be a no-brainer to favor MIT (assuming that the finances are workable).<br><br>", "<b>Username: RightCoaster</b><br><br>The biggest edge, aside from top academics and world renowned reputation, that MIT has over ND is that it is located in a vibrant city with proximity to a lot of cool stuff, while ND is in Indiana.<br><br>", "<b>Username: suzy100</b><br><br>You can hop on a train at ND and be in Chicago in about an hour and a half.<br><br>", "<b>Username: moscott</b><br><br>@rowswim Keep in mind the academics will come a distant 2nd at ND. MIT will be academics 1st and sport 2nd. At MIT IF your S drops his sport he is still able to continue his education. IF he goes to ND and drops his sport what happens? The big difference in time dedication to sport at ND vs MIT is night and day. This includes scheduling of classes, practice times etc...<br><br>", "<b>Username: northwesty</b><br><br>For female rowing, MIT is D1 in the Patriot League. ND is D1 in the ACC. But is a pretty obscure sport at either place. At the Power 5 schools (like ND), female rowing exists mostly as a title ix offset to the headcount and scholarships used up by football. ND rowing might be a little more serious than MIT, but it likely has a lot better support structure for the athletes since ND's athletic department is one of the best and wealthiest that there is. So in terms of the sports team, I'd say it is close to a wash. But very well played by the kid to find and excel at an obscure sport that can be used to open so many doors at such great schools.<br><br>MIT is the probably the best engineering school in the world. If that's what the kid really wants, easy decision. Since this question is being asked, it sounds like that isn't what the kid obviously wants.<br><br>ND is a top 15-20 school overall with a tight knit and passionate community and alumni network. The engineering program is good, but it is no MIT. That's way more than enough to get the kid pretty much wherever the kid wants to go.<br><br>As former ND football coach Lou Holtz says, you go to Notre Dame for two educations, 1) An education on how to make a living, and 2) An education on how to live. The whole person student experience is the place where ND excels, although that student experience is not for everyone. If the kid really digs ND, then encourage the kid to pick ND. One of the buildings at ND has this inscription \"God, Country, Notre Dame.\" Does that elicit an eye roll or a \"hell yeah\" from your kid?<br><br>If the kid picks ND and your friends bug you about turning down higher ranked MIT, give them this Holtz quote as a response: \"For those that know Notre Dame, no explanation is necessary. For those that dont, no explanation will suffice.\"<br><br>", "<b>Username: thumper1</b><br><br>When I think of ND sports...I think of women's basketball! Just saying.<br><br>This student needs to make a pro and con list...right now. What are the pros of each school for what he wants to do? What are the cons?<br><br>Are there any \"deal breakers\".<br><br>They are both excellent universities.<br><br>", "<b>Username: northwesty</b><br><br>\"The biggest edge, aside from top academics and world renowned reputation, that MIT has over ND is that it is located in a vibrant city with proximity to a lot of cool stuff, while ND is in Indiana.\"<br><br>No one goes to ND to experience South Bend or have a cosmopolitan college experience. The ND student experience is almost entirely focused inside the campus boundaries. Some kids think that is stultifying. Other kids think that is what makes for a great community. Depends on what you like and what you are looking for.<br><br>", "<b>Username: tatecollege</b><br><br>@ rowswim: all of the schools you mentioned are all top notch and prestigious. I am not sure if one can compare and ask if one is \"better\" than the other. They each have its unique positives and negatives. Your son will get an excellent education and be prepared for the job market at any of those schools. Given that your son is a very hard worker he will do well no matter where he goes. What's more important is where will he thrive as a person the most? Where will he feel \"at home\" and enjoy his college experience? Where can he best balance sports, academics, social life, etc? Where can he meet people that he can be friends with for life? College decision cannot be about prestige or the starting salary of recent graudates. Many of fortune 500 CEOS did not attend top schools. Besides, who really cares what your neighbors think if your child is not as happy as he can be?<br><br>", "<b>Username: wis75</b><br><br>Very different campus cultures at the two schools. He should look at the course offerings in subjects of interest to him to see differences/similarities. He should also look at noncompetitive rowing at each school since this seems to be his sport. There may come a time when a club sport, not the team, is what he wants. The boat house at UW-Madison is huge, btw.<br><br>Being \"only\" 1 1/2 hours to Chicago is not a selling point. College students will be spending the vast majority of their time on/near campus- they simply do not have the extra 3 hours travel time (or transportation) to be going to a city. UW students do not make that same time trip to Chicago- plenty to do on/near campus in Madison on weekends. Serious students look closer to campus for fun.<br><br>His life path will in part be determined by where he chooses to go to college. Not all good paths need to be east coast or in the uppermost tier to have a satisfying life. Many top CEO's come out of different places, I'm aware of my alma mater and I'm sure many other schools can boast those who do well on the big stage for business.<br><br>", "<b>Username: northwesty</b><br><br>FWIW, the kid appears to be a female rower being recruited as a D1 varsity athlete. With recruited varsity athlete being the hook that is opening so many doors. At many non-Ivy schools (like ND), for title ix reasons only womens rowing is a recruited varsity sport. MIT is a D3 school for sports, except that it does rowing up at the D1 level.<br><br>", "<b>Username: shuttlebus</b><br><br>I was surprised to read that MIT conducted a pre-read. If your daughter does not have a clear favorite, I would factor in the amount of pull the coach will have with admission in making your decision. Some schools give their coaches slots while other schools don't. Unless the rules are different for D1 sport at MIT, MIT falls in the latter category.<br><br>Good luck to your daughter.<br><br>", "<b>Username: sushiritto</b><br><br>IMO, depends on how important rowing is to your child. For me, rowing would be a means to end. If it were my D, I'd tell her that it's not basketball or soccer, larger and more competitive D1 sports, both with professional leagues available both in the US and overseas. I think ND is a wonderful school, but it would be MIT for me.<br><br>", "<b>Username: northwesty</b><br><br>I always feel you should pick the school that you'd like to attend assuming you didn't play the sport. Use the sport to get in, then continue the sport (or not) once you get there.<br><br>But rowing at MIT might actually be a bigger deal than rowing at ND. Rowing is MIT's only D1 sport and rowing is a bigger deal in Boston/Charles River than almost any place else.<br><br>Womens-only rowing exists at big time football schools primarily to provide headcount to offset the football team for title ix. ND reported 66 team members to the government. Oklahoma reported 93! And most of those heads are walk-ons who never rowed before college and who are likely to drop off once the title ix reports are filed. So rowing is probably the smallest fish in the big ND sports pond.<br><br>", "<b>Username: FLMomof3</b><br><br>@rowswim - does she need to commit to ND by a certain date? If so, that's a big consideration. She may not hear from MIT for a long time, and the news may not be good. My daughter was recruited by MIT last year and did not get in. It's extremely tough to get in, even if recruited. My daughter was NM, Valedictorian, 4.0 UW, etc., etc... Just something to keep in mind - good luck with the process, it's an exciting time!<br><br>", "<b>Username: Mastadon</b><br><br>Regional D1 Rowing rankings<br><br><url>http://www.ncaa.com/rankings/rowing/d1/regional-rankings</url><br><br>", "<b>Username: Much2learn</b><br><br>The way I read the career surveys, MIT students earn a lot more!<br><br>", "<b>Username: thumper1</b><br><br>@Much2learn<br><br>It's very possible that employers who pay more are doing more recruiting at MIT. That is likely why the average salary is higher. But the reality is...an entry level person at a job is not going to get paid more simply because they graduated from MIT.<br><br>", "<b>Username: HootieA</b><br><br>@northwesty Notre Dame has big-time nationally ranked ladies rowing, 16th nationally last year. MIT was not ranked even in D3, where Bates, Williams and Wesleyan seem to dominate.<br><br>", "<b>Username: Much2learn</b><br><br>@thumper1 \"an entry level person at a job is not going to get paid more simply because they graduated from MIT.\"<br><br>On Wall Street or in computer science, starting salaries can vary a lot.<br><br>MIT is also more intense and students should be learning more in that process, so saying it is just because they went to MIT isn't really accurate.<br><br>", "<b>Username: northwesty</b><br><br>Hootie -- MIT rows at D1 even though its other sports are D3.<br><br>Sure ND ranks higher in D1 than MIT. My point was that ND rowing would likely be the smallest time sport that exists at ND; while rowing is a featured sport at MIT.<br><br>", "<b>Username: Sue22</b><br><br>I would second the advice to look at the school aside from rowing, then consider the sport secondarily. Lots of kids are injured or just decide they can't or don't want to continue with their sport beyond high school.<br><br>That said, when considering rowing one suggestion I would make is to see how many kids continue with the sport from year to year. If there are as many seniors as freshman on the larger team you know they're probably pretty happy with their experience. If there's a sharp drop in participation after the first or second year it may indicate they're not. It doesn't mean the coaching is bad but it may mean it's hard to row and keep up with academics and that there could be a lot of turnover in her boat.<br><br>I'd also see if she can ask someone on each team about the practice schedule. Are they doing two-a-days year round? If they're out on the water for morning practices what time do they get back and does it work with a civilized breakfast schedule? Do regattas ever interfere with academics, and how does each school handle conflicts?<br><br>Any chance she's rowing in the Head of the Charles? It might be possible to meet some girls from both schools if she's able to find some time over the weekend when she's not busy with her team. The students may be more willing to be candid with her when she's not on an official visit and you could talk with any parents at the races to get the inside scoop from them.<br><br>", "<b>Username: JHS</b><br><br>1. I'm really tempted to say that if you are in a corner of the universe where Notre Dame and MIT seem worth comparing, you should go to Notre Dame. Kids love it, the kids there are smart, it has a great alumni network and name recognition, and it offers quality education and first-rate sports.<br><br>MIT? It's just the pinnacle of the field, the center of the world, the best there is. Not everyone needs or wants that. If you do, Notre Dame is barely on the map.<br><br>2. Actual-factual story, from one of my law school classmates, who grew up in the same near-Midwestern city I did. She went to Notre Dame before it was really co-ed. There were a few years when it was admitting a handful of women to its engineering school, because St. Mary's didn't offer engineering. So she was a female Notre Dame engineer when fewer than 100 of such people existed anywhere in the world.<br><br>Anyway, during Christmas vacation she was hanging out at a well-known bar in our city, one that was more or less themed for former Catholic high school football players and the women who loved them. A nice-looking guy started to chat her up. She was interested. He made clear he was in college; she asked him where. Notre Dame. At that point, she knew perfectly well he was lying, because she knew everyone in our city who went to Notre Dame, certainly everyone as good-looking as he was, and she had never seen him before. (He, of course, didn't bother to ask her about college, because most of the women in that bar in those years would either not have gone to college at all or gone to one of a handful of small Catholic women's colleges in the area.)<br><br>She decided to play cat and mouse. She widened her eyes and looked really impressed. I have some friends who go to Notre Dame! She proceeded to ask him a series of ever more detailed questions about which dorms he had lived in, what classes he took. Within a few minutes, he realized she was completely on to him, and gave up. He had been lying about going to Notre Dame to impress her.<br><br>Who was he? The starting quarterback at Yale. First string all-Ivy. A molecular biology major. Really, truly smart. (And very cute, no lying about that.) At that bar in our city, though, being a generic student at Notre Dame was much better chick-bait than being a genius football hero at Yale. He wasn't wrong about that; he just happened to pick the only woman in the room who knew anything about Yale to talk to. If he had gone to MIT, she might have married him.<br><br>The shaggy-dog point: The relative prestige of Notre Dame and MIT depends a lot on context.<br><br>", "<b>Username: SwimmingDad</b><br><br>I live in the Boston area and understand what you say about ND. Both of my nieces who grew up in this town have gone to ND. The oldest had several investment banking offers and is an analyst now in NYC. No problem getting interviews at the top places. Seriously strong alumni network. Youngest is a junior and is finding the same experience though she wants to do marketing.<br><br>Your son needs to answer this question: if the sport went away for whatever reason (injury, loss of passion) and he was just a student there: would he be happy? This happened to my nephew; ended up transferring because when the basketball went away he didn't really like the school.<br><br>All of the schools your son is looking at are fantastic. Have him pick based on fit....the job and the rest will follow. College is about pushing himself and learning and having some fun.<br><br>Best of luck!<br><br>"]}