{"title": "umich vs gt vs mit vs cornell vs vatech vs rpi engineering which one", "comments": ["<b>Username: monydad</b><br><br>FWIW at least one former CC poster who was an aerospace industry insider recommended a mechanical engineering degree, with aerospace electives, for undergrad rather than an aerospace major.<br><url>https://talk.collegeconfidential.com/discussion/comment/12851062#Comment_12851062</url><br><url>https://talk.collegeconfidential.com/discussion/comment/11116006#Comment_11116006</url><br><br>", "<b>Username: Alexandre</b><br><br>If money is not a concern, MIT followed by Michigan. If money is a concern, GT.<br><br>", "<b>Username: Knowsstuff</b><br><br>I would say MIT, Georgia tech then Michigan then Cornell. People are going to have different opinions here. I would really talk to your daughter and see what your daughter is looking for in a program? What type of 4 years does she want to experience? This will help her decide and go visit the campus you narrow down to. They all have their pluses and minuses. She doesn't have a bad choice.<br><br>", "<b>Username: VABeachDad</b><br><br>Congratulation. I am sure you are proud. Something to think about. If you are to use NROTC to pay for college, then commit to 5 years. She will come out the back end with major work experience under her belt when applying for places to work. Additionally, the Navy offers many programs for Officers as they serve. i.e. Tuition assistance, graduate school... Does she want to fly? Locking in a guaranteed flight contract with the Navy would be a solid way to go. 5 years of flying, combined with a Degree in any of the schools is a solid start. Plus.. no debt.<br><br>Finally, if it is NROTC. The dollar amount is not really a factor. Is it?<br><br>For prospective, I am a 22 year Naval Officer. Just retired. So, from the military aspect I have a solid understanding. Also, look at it this way... If this is the hard decision.. you are sitting in a good place. Where she wants to attend and feel safe and happy will make her experience all the better. Not forcing a place just for the name.<br><br>Best of luck.<br><br>", "<b>Username: VABeachDad</b><br><br>Sorry. One more thing. Check with the Navy recruiter. There should be a stipulation to cover a 5 year masters program and/or post four year college. i.e. fulbright scholars.<br><br>", "<b>Username: CT1417</b><br><br>Will the size of the ROTC program on campus impact her decision? Does she have time to revisit the schools to sit in on classes and also meet with some of the other ROTC students?<br><br>", "<b>Username: AroundHere</b><br><br>If she has NROTC, you aren't paying those prices, though, right?<br>Military service is great for future astronauts, too.<br><br>", "<b>Username: TooOld4School</b><br><br>That's actually a very difficult decision. I have personal experience (very recent) as a student at Michigan and GT. My son attends Michigan (engineering). Other family members have attended MIT. So if your daughter is someone who thrives on pressure, MIT. Cambridge is a wonderful town for students, and MIT is very international. Michigan is unusual for a state school in that 45% of the students are international or OOS, and it has lots of kids studying different subjects, so your daughter is likely to make a wider variety (non-STEM) of friends. (The engineering school is only about 15% of the students). Michigan is also the largest, with 40K students. GT &amp; MIT have a slight gender imbalance (40-45% female) , Michigan is 50-50. Campus wise, GT &amp; MIT are very compressed, Michigan has a lot more space, and the North Campus has woods and deer. At Michigan you have to bus (5-7 min) between the North, Central and South (athletic) campuses.<br><br>All of the schools are academically challenging. She should expect to be up very late at night with homework. Maybe a few more all nighters at MIT.<br><br>All are super convenient, less than 30 min from a major airport by bus or train.<br><br>So in order (cost not considered)<br>MIT<br>Michigan<br>GT<br><br>If Naval arch/Marine engineering is considered:<br>Michigan<br><br>", "<b>Username: monydad</b><br><br>AFAIK Cornell does not have an undergraduate aerospace engineering major, does it?<br>However it does have mechanical engineering which is recommended anyway per the links in my #16 above.<br>and courses in it, I imagine, It does have a graduate program. (Or did, anyway, when I paid attention).<br><br>To me, MIT is special. It would be hard to turn down MIT, if one feels they are up to the challenge.<br><br>As for the others:<br>If there are multiple choices are similar in cost, and she can evidently achieve her objectives from any of them,<br>Then my question is where does she feel more drawn to in terms of social and non-academic factors? ie where would she rather spend the next four years, classes for her major aside?<br><br>", "<b>Username: Greymeer</b><br><br>\"Campus wise, GT &amp; MIT are very compressed\"<br><br>Main Campus Acreage, Enrollment<br>============================<br>Michigan 3200 45k<br>Purdue 2600 42k<br>Virginia Tech 2600 31k<br>UIUC 1800 44k<br>Cornell 750 22k<br>Princeton 500 8k<br>Georgia Tech 450 21k<br>RPI 270 7.5k<br>MIT 170 11k<br><br>", "<b>Username: blevine</b><br><br>Congrats. I have a son at RPI and another at Cornell.<br><br>I can tell you I am as or more happy with RPI for an undergrad education.<br>As far as the Navy, note that after the USNA the 2nd largest set of alumni in top Navy positions are RPI grads.<br>Admirals, ship captains etc, likely due to the strong ROTC program, and nuclear engineering program.<br>They do have a very strong Aerospace engineering program, kids get jobs at Boeing.<br>Also note RPI is well known for its involvement in the space program. One of the Apollo 13 crew was from RPI, and other astronauts, plus the head of the entire Apollo program was an RPI grad.<br><br>I dont think taking that scholarship is a compromise, but I can see how tempting it would be to pay for those other schools too.<br><br>", "<b>Username: greenfrogmemes</b><br><br>MIT without a doubt.<br><br>", "<b>Username: 5Dis</b><br><br>I didnt see in previous comments whether or not youve visited the campuses. My son visited Michigan, MIT, Georgia Tech (also aerospace but does not want to be an astronaut) &amp; had strong reactions based on what hes looking for in a college experience. If you go purely on reputation/program, then MIT would be the winner. He was 100% for MIT until we visited the campus. His words: there is no way I am spending 4-5 years here. Other kids fall in love with the school.<br>Your daughter has great options and I dont think theres a wrong choice to be made. I do think she needs to spend a day at each campus to make the best decision. Congratulations to her!<br><br>", "<b>Username: blevine</b><br><br>I went to school in Boston and spent some time on campus at MIT, had many friends there and colleagues in the working world since. I agree with @5Dis MIT is a pretty depressing place, but the physical campus, and the obsessive compulsive work ethic. While people say \"U of Chicago is where fun goes to die\", I think MIT should be in the running for that title. That said RPI has a nice campus in a lousy city, also not a great place to spend 4 years.<br><br>If you want urban, maybe MIT is not so bad, but there are better urban campuses.<br>If you want rural, can't beat Cornell's campus anywhere.<br>Academically they will work you to death at Cornell Engineering just like MIT, but at least<br>be in a very pretty place while doing so. Career wise you can't beat the Boston metro area to make<br>contacts for internships and ultimately when you graduate, but since being an astronaut is the goal,<br>GT, MIT and RPI have both put people in space many times (many more at MIT but some of the biggest names<br>come from RPI). Cornell had one astronaut.<br><br><url>https://en.wikipedia.org/wiki/George_Low</url><br><br><url>https://www.google.com/search?client=firefox-b-1-ab&amp;ei=eZu1WsCuK8qc5gLznJnYBw&amp;q=rensselaer+polytechnic+institute+astronauts&amp;oq=rensselaer+polytechnic+institute+astronauts&amp;gs_l=psy-ab.3...2456.4508.0.4668.12.10.0.2.2.0.110.880.7j3.10.0....0...1c.1.64.psy-ab..0.11.816...0j0i22i30k1j0i67k1j33i21k1j33i160k1.0.Pz-OYDoxcOg</url><br><br><br>We visited Princeton Engineering, tiny school without the engineering specific resources of others on your list.<br>My son didn't apply after the visit.<br><br>", "<b>Username: nw2this</b><br><br>MIT is work hard, play hard, but I wouldn't pick it sight unseen. Visits are a must to assess fit.<br><br>", "<b>Username: GoBlue81</b><br><br>Which university has an alumni association chapter on the moon?<br><br>", "<b>Username: blevine</b><br><br>Only one option gave a large scholarship AND alumni already in space....<br>UM is expensive for OOS students. If you live in Mich, then yes Mich.<br><br>", "<b>Username: blevine</b><br><br>And the boss for those 3 UM astronauts.... RPI alumni and later President of RPI.<br><br>", "<b>Username: rjkofnovi</b><br><br>\"And the boss for those 3 UM astronauts.... RPI alumni and later President of RPI.\"<br><br>....and his boss could have been Gerald Ford......<br><br>", "<b>Username: Knowsstuff</b><br><br>I know someone that is graduating from Rpi and getting a job at Tesla. Maybe there is a connection for SpaceX from there.. Lol<br><br>", "<b>Username: 3XImpossible</b><br><br>I think DD has decided to cross off RPI. We visited Umich and were impressed by the facilities and Ann Arbor. But it did feel a bit impersonal; tour guides were clear you had to be aggressive in order for your professors to know your name. North Campus is definitely off the central area, not sure if this is to DDs liking. Still, definitely staying high up on DDs list.<br><br>", "<b>Username: harp84</b><br><br>As a current student at University of Michigan in the CoE I'd have to say that tour guides (probably in LSA) might not have the full picture of professor engagement with students in Engineering. Most of my professors have made an effort to learn students' names, even in the large lectures with two sections of ~150 students. If your daughter participates in class (answers questions) then the professor will certainly know her name, and it's still likely for the professors to try even if she does not.<br><br>", "<b>Username: RPIchemEson</b><br><br>I second those you mention, plus there are many other advantages at RPI if it's the right fit for your student. They have program strengths not so prominent, or non-existent at many of the other schools. If you want strong programs and options with excellent post-graduation outcomes ($$$ - check out the NYT Interactive article), are there to learn and don't care to be swallowed up in a big city and a huge student body and giant D1 sports programs, perhaps care more about these things than prestige or name recognition or the weather or entertainment, check out RPI! It's footprint in the real world before (co-ops, internships) and after graduation (strong recruitment and hiring) is significant.<br><br>", "<b>Username: RPIchemEson</b><br><br>My son also visited Princeton and was not interested after he saw it. Though he was not accepted at MIT or Stanford, he (and we) is (are) very excited to be going to RPI in the Fall. It's a great school currently going through a revitalization, that shouldn't be overlooked.<br><br>", "<b>Username: rjkofnovi</b><br><br>\" If you want strong programs and options with excellent post-graduation outcomes ($$$ - check out the NYT Interactive article), are there to learn and don't care to be swallowed up in a big city and a huge student body and giant D1 sports programs, perhaps care more about these things than prestige or name recognition or the weather or entertainment, check out RPI!\"<br><br>What a ringing endorsement to attend RPI! Sounds like a blast to attend!<br><br>", "<b>Username: GoBlue81</b><br><br>56% of the students at RPI are in engineering, and over 72% in STEM (63% and 80+% for Georgia Tech). Personally as an engineer, I'd prefer a more diverse college experience.<br><br>", "<b>Username: RPIchemEson</b><br><br>My son will get a deep and rigorous engineering education at RPI -- there is also plenty to do on and around campus, on internships and co-ops -- but one must face facts, engineering students don't have a lot of time to be goofing off during the semester. He will still have a fine college experience there. I've never understood kids and parents picking \"destination\" colleges for the weather, amenities, local attractions -- as if they're signing up for a 4-year cruise. As for \"diverse\" -- my son prefers focus, part of the reason for his choice. I appreciate that he will not just be a student ID number among other tens of thousands at a larger school -- I think that will be important to connections to professors and within the departments, both when it comes to learning the most he can while there, and when it comes time get \"out there\" on internships/co-ops, and the job market.<br><br>", "<b>Username: yikesyikesyikes</b><br><br>@RPIchemEson<br><br>I think the ease of making faculty connections point is exaggerated.<br><br>RPI student:faculty ratio = 13:1<br><br>Michigan student:faculty ratio = 15:1<br><br>That is not much of a difference at all. Also, while it is perfectly fine for your son to want \"focus\" and a school with few \"distractions\" (aka mainstream social opportunities), that is not necessarily what the OP wants.<br><br>", "<b>Username: 3XImpossible</b><br><br>My DD has been accepted to all of these institutions (and a few others, smh). How do you figure out which one to attend? Assume there is no scholarship $$ to be had at any of these except RPI with covered about 40% of tuition costs. 1 year attendance costs with room and board as follows:<br><br>", "<b>Username: 098123Student</b><br><br>Here is kinda a backward thought...<br><br>Who does she want to work for?<br>What university do they hire from?<br>Will the job cover the expense of the education in the long run?<br><br>", "<b>Username: Publisher</b><br><br>Intended major ? Was she a direct admit to any or all schools/majors ?<br><br>", "<b>Username: 3XImpossible</b><br><br>I don't know what direct admit means...we are out of state for all of them, except RPI. She was early admit to GT and UMich, and a \"Likely Letter\" to Cornell. She applied RD to VT, MIT, and RPI.<br><br>She wants to major in aerospace engineering. (Also interested in Naval Architecture/Marine engineering double major, perhaps). her ultimate goal- right now- is to become an astronaut. She is a US Naval Academy applicant, with 2 nominations, but still waiting for an appointment. She has received an NROTC scholarship so she can attend a civilian college with NROTC unit (all these schools have a unit there) and the Navy covers full tuition and fees for her undergrad degree- after which she would owe the Navy 5 years of active duty after undergrad graduation but she would be an officer upon commissioning (she's not enlisting).<br><br>", "<b>Username: gandalf78</b><br><br>@3XImpossible: Has your daughter visited these schools? If so, which one(s) did she like the most? I have found with my kids that usually one or two schools just \"feel right,\" more than the others; and, all other things being equal, my suggestion is to go with the one where your daughter feels more comfortable. She will get a great education in engineering at all of them; but because there is likely to be a lot of stress involved in attending these schools -- some more than others -- you want to make sure that your daughter is going to be happy, or at least fairly comfortable, at whichever school she attends.<br><br>So, consider visiting the respective schools on \"admitted student\" days, which most universities have in some form or fashion; that helped in our family. If you can't do all, then attend the ones that your daughter has the most interest in attending.<br><br>Also, \"direct admit\" means that an applicant is admitted directly to the college of engineering, or to a specific department/major within the college of engineering. This is in contrast to a \"single door\" university, where you are admitted to the university -- not a specific college -- and once you are admitted to the university you can choose what major you wish.<br><br>", "<b>Username: Publisher</b><br><br>Aerospace Engineering majors ranked by US News:<br><br>1) MIT<br>2) Georgia Tech<br>3) Michigan<br>4) Stanford<br>5) Caltech<br><br>Focus on MIT, Georgia Tech &amp; Michigan since these are the three best undergraduate programs for your daughter's major.<br><br>", "<b>Username: gandalf78</b><br><br>^ Cornell is ranked #10 and Virginia Tech ranked #14 in the US News aerospace engineering rankings, here, <url>https://www.usnews.com/best-colleges/rankings/engineering-doctorate</url>. Your daughter can get an excellent education in aerospace engineering at any of these schools; and I suspect that whatever marginal differences there are among the rankings of the schools do not justify the price differential between some of them.<br><br>", "<b>Username: 3XImpossible</b><br><br>thank you, I have seen the usnwr rankings. but beyond those rankings.....<br><br>She was a direct admit to all the schools, all of them admitted her into their college of engineering, and her 1st choice major (if they don't do \"general engineering\" the first year-like at Purdue and VaTech)<br><br>", "<b>Username: billcsho</b><br><br>They are all great schools. I would not spend the extra $80k for the same degree while you can get it from GT or VaTech for less.<br><br>", "<b>Username: kjake2000</b><br><br>I think MIT is one of the few schools thats worth the extra money/year.<br><br>", "<b>Username: Knowsstuff</b><br><br>#1 Big congratulations!!!!<br><br>She only has good choices. But what kind of college experience does she want to go to and how intense does she want the program to be? Only GT and Michigan will give her a top college urban feel with great sports. VT will be more military but good student base. MIT more intense. Also what can you realistically afford? I agree that visiting is key if money is not an issue. If she got into all these schools she will be successful where ever she goes.<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"Also interested in Naval Architecture/Marine engineering double major, perhaps\"\"<br>Which of these schools offer naval architecture/marine engineering?<br><br>", "<b>Username: ucbalumnus</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/gandalf78\">gandalf78</a> wrote:\"\"<br><br>However, some schools which admit to the engineering division have an additional admission process later to get into a specific major. VT is such a school where engineering frosh take the frosh-level courses and then apply to their majors. A 3.0 college GPA assures admission, but it is otherwise competitive for those with lower GPAs.<br><br>Michigan also admits to the engineering division, but declaring an engineering major only requires passing the prerequisites and a 2.0 college GPA.<br><br>Students entering such a school outside the engineering division may face an additional admission process to get into the engineering division if they enroll there.<br><br>", "<b>Username: gandalf78</b><br><br>^ That is correct. I have a child who applied to Purdue, with a direct admit as a FYE but who would have to select a specific major after the first year, with admission to that specific major based on meeting GPA requirements (3.2 or above will get you into the major you want); to Cincinnati, with a direct admit to mechanical engineering; and to Case Western Reserve, which has a \"single door\" policy.<br><br>The additional internal \"secondary\" admissions process at schools like Purdue or Virginia Tech can certainly up the ante for an engineering student, and be an additional stressor.<br><br>", "<b>Username: TooOld4School</b><br><br>These schools are all so good that it is a matter of fit. MIT is the most intense of the group, too intense for some (my son immediately discounted it because students are very stressed out). MIT students can take classes at Harvard should they choose. Michigan and Cornell will offer a full traditional college experience in a smaller city, and are quite similar. GT has the urban campus in a fun and warm city. Michigan has an excellent Naval architecture program, so that should also be a consideration.<br><br>I'd probably look at MIT, Cornell, GT and UMich as the best four. The extra $28K for GT over RPI is worth the difference IMO. An additional $100K for MIT is harder to justify, unless the money matters less than the prestige to you. All will get your daughter into an excellent graduate school, should she want to, which is what actually matters in terms of future earnings.<br><br>You may want to check into the 5 year BSE/MSE programs offered at some of the schools. There is a pretty substantial pay premium for a masters, and a higher ceiling for jobs for only a year's extra cost.<br><br>", "<b>Username: 3XImpossible</b><br><br>@TooOld4School<br>would you feel the same if there was no financial consideration needed--if all the schools would cost exactly the same amount of money?<br><br>"]}