{"title": "stanford vs oxford", "comments": ["<b>Username: dreamer9</b><br><br>I got into both... Stanford SCEA and Oxford to study Politics, Philosophy, and Economics. I'm leaning a LOT towards Stanford, but still a bit torn. Any views?<br><br>", "<b>Username: nngmm</b><br><br>You could go to Stanford, and do the study abroad at Oxford... Anyway, that is SUCH a big difference, that you must be able to decide, which one you like better...<br><br>", "<b>Username: paulhomework</b><br><br>Both universities are academically first-class. You cannot go wrong w/ either one.<br>United States or England? THe answer should guide your decision!<br><br>", "<b>Username: dreamer9</b><br><br>haha yeh... I mean I'm in love with Stanford, I think it's just the fact that I have to give up Oxford...<br><br>", "<b>Username: paulhomework</b><br><br>Oxford might have a bigger \"wow\" factor, but if you love stanford, then you should pick stanford!<br><br>", "<b>Username: cmh500</b><br><br>which college at oxford? Your college will have more of an impact on you and your daily life at oxford than actually being part of the university.<br><br>", "<b>Username: ubermensch</b><br><br>Stanford definitely has a much bigger wow factor than Oxford. To compare the two in prestige is like comparing Harvard to UPenn. Stanford beat Oxford in \"wow factor\" a long time ago. Right now Oxford is comparable to UC Berkeley if anything.<br><br>", "<b>Username: marlgirl</b><br><br>The big plus about Stanford is that you can change your mind about your major and take many classes outside of your concentration. Are you likely to change your mind about what you want to major in? Do you plan to go to grad school?<br><br>", "<b>Username: collegebound123</b><br><br>marlgirl - Yeah that's why I like Stanford (well... just one of the many reasons) because I feel like I have more options. I felt constrained by other schools where you had to apply to a specific college, like Columbia with the college for applied science and engineering.<br><br>", "<b>Username: siavash7h</b><br><br>ubermensch, you have no idea what you are talking about...<br><br>\"Right now Oxford is comparable to UC Berkeley if anything.\" That's an unbelievable statement!<br><br>", "<b>Username: paulhomework</b><br><br>ubermensch, you are entitled to your opinion. However, if you take a survey of people around the world, most would say that Oxford is more prestigious than Stanford.<br><br>Oxford is comparable to UC Berkeley??? well, that's not a bad thing at all, considering that Berkeley came in second in a world-wide ranking a few weeks ago.<br><br>", "<b>Username: aim78</b><br><br>uber is a dummy.<br><br>College life is the only factor you should be concerned about.<br><br>", "<b>Username: Sam Lee</b><br><br>paulhomework, I am not sure if that's the case. Oxford is more prestigious in the old days for sure. However, I came from Hong Kong and it seems like Stanford is more prestigious (maybe the word \"hot\" is more appropriate) in Asia these days. Stanford definitely benifited substantially and became very visible to the world by the the success of Silicon Valley in the 90s. Stanford is also considerably harder to get in than Oxford if you are from Hong Kong. In Europe, I guess Oxford is more prestigious. I also think if you are talking about things like english and philosophy, Oxford would be better intuitively simply because it has the tradition and long history while Stanford, being young and so good in science/engineering, just doesn't register in people's mind that it's great in humanities/classics even in reality, it's very strong. In engineering/computer science, Stanford simply leaves Oxford in dust.<br><br>", "<b>Username: AnyCollege'09</b><br><br>you're basically picking between seat 1a and 1b of first class. you'll get a great education either way. whichever you have a better time at, (visit them again if you can) and whatever your gut (NOT CCers!!) tells you at the end of the day is the best choice for you.<br><br>", "<b>Username: dreamer9</b><br><br>i like that analogy anycollege... the thing that I really like about Oxford is the tutorial system. Which is basically a few classes every week with only about 2-3 students and a proffessor, who monitors essays and discusses lectures etc. That's what really appeals to me about Oxford, but I guess I'll visit if I can and check out the college life there. I'm pretty much set on Stanford, apart from that tutorial system thing.<br><br>", "<b>Username: juzam_djinn</b><br><br>you are so awesome for getting into both<br><br>", "<b>Username: eiffelguy87</b><br><br>Acceptance to Stanford and Oxford! That is a \"wow\" factor in itself. Congratulations.<br><br>Both have great reputations and are internationally renowned. (However, I do not believe that Oxford is any less reputable than Stanford).<br><br>Assuming you live in the U.S., living abroad for the next four years can be expensive (I think). But if you like England, the atmosphere, the campus and can afford it, then by all means do go to Oxford. If you like Stanford, the atmosphere, the people, etc. then go to Stanford.<br><br>Either way, I have no doubts that you will do well at both. Again, my congratulations.<br><br>", "<b>Username: turtle</b><br><br>Living abroad might be expensive, but so is living in California. I think the only substantial difference financially (besides tuition, I don't know about that) is transportation.<br><br>", "<b>Username: chibearsfan17</b><br><br>Well guys, I think the fact that people from stanford and other major universities still apply for Rhodes scholarships tells you that Oxford is still considered very prestigous. I mean, they could probably go to their current university for 2 years for free if they got a company to pay for it, yet they still choose to go to Oxford. just food for thought<br><br>", "<b>Username: dreamer9</b><br><br>thanks eiffelguy. I'm really excited but it hasn't completely sunk in... I expected to be rejd from both! I actually live in Singapore, so they're both about the same distance away. Hmm just getting quite confused... half the people I speak to think Oxford is the clear choice, the other half think Stanford! I personally like Stanford a lot because of its atmosphere, and the fact that I can take loads of different classes in different subject areas, but at the same time, I love London and Oxford!<br><br>", "<b>Username: Avalon</b><br><br>Flip a coin and decide. If you don't like your gut reaction from your result, go with the other choice. Good luck, and congrats on your admission to both!<br><br>", "<b>Username: kakka</b><br><br>wow. You've gotten into both... amazing. nice job.<br>I'd say choose stanford - awesome weather, awesome school, and I might go there so it will rock :p<br><br>", "<b>Username: salsa</b><br><br>ughh i can imagine wat ure going thru rite now dreamer9, im so very very confused myself, so ure in singapore huh? interesting...did u ask for aid at stanford? and btw oxford is pretty expensive rite, its wat 20grand a year, and with the new pound rate too!!!<br>did u go there for the interview..i went and its soooo beautiful, its like love at first sight..hehe :P ive never seen stanford so cant say much thr...<br><br>", "<b>Username: dreamer9</b><br><br>yeh I've been to Oxford but not for the interview (they actually send their tutors to Singapore for that because there are so many applicants here). Both campuses are beautiful... seen Stanford too! I didn't apply for aid at Stanford. I actually did GCSE and IGCSE's too, but did IB instead of A levels.<br><br>", "<b>Username: sicarii</b><br><br>um. Oxford is the oldest university in the world, and probably the most prestigious. but you could go to stanford and just become a Rhodes scholar or Marshall scholar and study there for two years, no big deal. =)<br><br>o. and Oxford is waayyyyyy more than 20grand per year. more like 50+grand<br><br>", "<b>Username: Gilead</b><br><br>Actually, Oxford costs significantly less than most US universities, as long as you're not depending on financial aid.<br><br>Definitely place a deposit at a US school. Speaking from experience, you want to have a back up that you feel good about in case your IB scores don't come through for you. If you miss it by a point, odds are they won't keep your place for you (true story). Good luck!<br><br>", "<b>Username: Sam Lee</b><br><br>\"\"Oxford is the oldest university in the world, and probably the most prestigious.\"\"<br><br>I think we have Harvard, if not couple others, ahead of them in prestige. Anyway, as much as I like Stanford, SF/Palo Alto is nowhere close to London. :)<br><br>", "<b>Username: rooster08</b><br><br>SF is the best city in the world to me. And I've been to London, Paris, Beijing, Shanghai, Munich, Berlin, NYC, Philly, Chicago, and Seoul. Nothing comes close to the beauty and culture of San Francisco in my opinion. There's something about the friendliness of the city that cannot be matched.<br><br>", "<b>Username: salsa</b><br><br>sicarii, i meant 20 grand brit pounds..its that for international students, but if ure british depending on ure family income its 1500 to 5000 pounds approx, i mean suppose ure parents earn below 15000pounds a year then the govt finances u completely, and thr are oxford bursaries, hardship fundds n all tht...<br>so even tho stanford has given me loadza aid studing in the us will still be so much mr expensive than the uk, for me..<br>i think in US state unis do the same thing rite, lower fees for instate students, higher for out of state...rite?<br><br>", "<b>Username: salsa</b><br><br>and anyway london is abt 100 miles i think, from oxford, it costs 16pounds (return ticket) to go to london, which is NOT an affrodable price wen ure a student - so as a student at oxford, u wudnt go to london durin the term...wen the term breaks then the college no longer accomodates u and u hv to find ure own lodging for the holidays, thts wen ppl decide to go to london, generally cuz family is thr n temporary lodging is cheaper.....<br>and ive heard a plane ticket from stanford to LA costs 30dollars...which is cheaper rite?<br><br>", "<b>Username: sicarii</b><br><br>yeah your right about state schools giving local students lower fees, especially for schools in the california system. also travel from palo alto (stanford) to LA by plane is really, but even cheaper by train.<br><br>", "<b>Username: silver_wavez</b><br><br>lol rash, just go to stanford......<br><br>stanford beats oxford any day!<br><br>", "<b>Username: cybero16</b><br><br>Hey Dreamer9, sorry a little off topic...you wouldnt have happen to have attended the JSA summer School at Stanford this summer and studied Comparitive Government?<br><br>", "<b>Username: silver_wavez</b><br><br>yeh she did.... she went to that.<br><br>", "<b>Username: dreamer9</b><br><br>yeh i did! how come?<br><br>", "<b>Username: silver_wavez</b><br><br>o dude. u know someone just imed me.. this girl jennifer who did JSA.. we're jus talking now.. but umm yeh she said she was in potter?<br>she's half korean half white..<br>do u remember her? she says she doesn't recall you but will probably remmeber u if she looks at the book<br><br>", "<b>Username: Yalebound72</b><br><br>Does Oxford accept American high school grads. I don't know of any Americans who apply to Oxford out of high school.<br><br>", "<b>Username: silver_wavez</b><br><br>ive heard of some that do.. oxford does their own tests and interviews so i think american HS people can apply there.. i dont see why not.<br><br>", "<b>Username: cybero16</b><br><br>Small World Dreamer9, I was in your class...LoL (try to remember the one Persian in the class)<br><br>", "<b>Username: pixiedanzer</b><br><br>ahhh this is so weird...this whole college confidential place. I went to JSA as well and i did AP Government, cybero I remember you (hah now that i've talked to you.) Rashna, I don't remember you, but your roomate Preethi was in my Congressional house thing.<br><br>It's funny you got into both Oxford and Stanford---cuz that's exactly how i spent my two past summers. Sophomore year I went to Oxford and loved it. I did the Oxford Tradition program and I lived at Pembroke College. I have family in ENgland so I ended up spending a longer time there---and the country is awesome, but of course I think the USA is better any day. The university is a lot more upbeat and bustling with activity. There's sooo much history there and I bet you'd discover something new about the place everyday. The one downside is, I heard undergraduate education is not the best there---while graduate education is? Anyhow, that's about all I know just from going to a summer school, and not the actual college.<br><br>Stanford, well you already know the campus, the atmosphere. It's just a very well rounded good school, and I bet you'd be really happy there. If i were you, I'd choose Stanford. It has good undergrad programs...and it's in Cali, and I live in Cali and love it and don't want to leave. The weather is beautiful as you remember, while in England it rains all the time. And obviously, jsut comparing the two countries, I think there'd be plenty more opportunities available to you in this country than in England.<br><br>You seem really smart, so why don't you go to Stanford for the time being and then be a Rhodes Scholar at Oxford? haha<br><br>", "<b>Username: silver_wavez</b><br><br>Yeh.. I have to say it's not like im the biggest fan of the US.. but I'd choose the US over England any day...<br>Besides, NYC is in America.... not England hehe :)<br><br>And although I didn't apply to either Ox of Stan.. Stan sounds soooooooo much betterrrrr<br><br>", "<b>Username: applesatyr</b><br><br>Congratulations on your admission<br><br>", "<b>Username: dreamer9</b><br><br>hey you're omeed right? christina told me you were talking to her on AIM? hahaha I do remember you... try remember the only singaporean in your class!<br><br>thanks pixiedanzer, that's really good advice. (btw im not really that smart just very lucky!) where did you apply? I'm definitely leaning a LOT towards stanford because I think I'd have a better overall experience there!<br><br>Also Yalebound: American high school grads can definitely apply to Oxford for undergrad. The only difference is they might have to fly to Oxford for the interview, unless Oxford itself arranges for their tutors to interview in certain states. So yeh... it's definitely possible.<br><br>", "<b>Username: silver_wavez</b><br><br>hahaha that's what they all say.. rashna is smart..... very lucky too, but she's still very smart! - why else would S and O want her!!!!!!!!!<br><br>", "<b>Username: dreamer9</b><br><br>pixiedanzer: wow this is so cooL! its like JSA reunion! do you know anyone else from there that got into Stanford EA? we probably don't know each other because we weren't in any classes together... or in the same dorm. It's still cool though! Oh by the way, whats a Rhodes scholar? People on here talk about it a lot but I actually don't know what it is.<br><br>", "<b>Username: salsa</b><br><br>who's rashna u guyzz? id love to meet sum1 else whose gotten into both ox and stan<br><br>", "<b>Username: pixiedanzer</b><br><br>LoL I bet if i saw you i'd recognize you though....did you keep your JSA memory book thing? The \"monthbook\" (like a yearbook only not) haha. Mine's under my bed somewhere.<br><br>", "<b>Username: pixiedanzer</b><br><br>oh here's all the info on rhodes scholarships.<br><br>The Rhodes Scholarships, the oldest international fellowships, were initiated after the death of Cecil Rhodes in 1902, and bring outstanding students from many countries around the world to the University of Oxford. The first American Scholars were elected in 1904.<br><br><br>American Rhodes Scholars are selected through a decentralized process by which regional selection committees choose 32 Scholars each year from among those nominated by selection committees in each of the fifty states. Through December 2000, applicants from more than 300 American colleges and universities had been selected as Rhodes Scholars. In most years, a Rhodes Scholar is selected from an institution which has not formerly supplied a successful applicant.<br><br>Intellectual distinction is a necessary but not a sufficient condition for election to a Rhodes Scholarship. Selection committees are charged to seek excellence in qualities of mind and in qualities of person which, in combination, offer the promise of effective service to the world in the decades ahead. The Rhodes Scholarships, in short, are investments in individuals rather than in project proposals. Accordingly, applications are sought from talented students without restriction as to their field of academic specialization or career plans although the proposed course of study must be available at Oxford, and the applicant's undergraduate program must provide a sufficient basis for further study in the proposed field. Through the years, Rhodes Scholars have pursued studies in all of the varied fields available at the University of Oxford.<br><br><br>Rhodes Scholars are elected for two years of study at the University of Oxford, with the possibility of renewal for a third year. All educational costs, such as matriculation, tuition, laboratory and certain other fees, are paid on the Scholar's behalf by the Rhodes Trustees. Each Scholar receives in addition a maintenance allowance adequate to meet necessary expenses for term-time and vacations. The Rhodes Trustees cover the necessary costs of travel to and from Oxford, and upon application, may approve additional grants for research purposes or study-related travel.<br><br>* The most well known American Rhodes Scholar is Bill Clinton (hey i don't like the man, but he is very very smart) hehe! so yeah it's just a very prestigious and VERY selective thing.<br><br>", "<b>Username: dreamer9</b><br><br>salsa: i'm Rashna... both stan and ox!<br><br>", "<b>Username: golubb_u</b><br><br>Wow, if you got into Oxford....it's tough! Of course, Oxford has much more of a wow-factor, but stanford is considered to be Ivy-caliber, and it also has its own wow-factor. I'd stay close to the US and go to Stan....Oxford is nice, but it's too far away, and the difference in prestige may not be large enuf to make the transition.<br><br>", "<b>Username: ubermensch</b><br><br>Dude, I don't know what age you are living in but Stanford has a bigger wow-factor than Oxford.<br><br>", "<b>Username: golubb_u</b><br><br>\"Dude, I don't know what age you are living in but Stanford has a bigger wow-factor than Oxford.\"<br><br>What??? No way man dude. Ask anybody in Europe, Asia, India, etc! Sure, American football is more popular in your neck of the woods, but soccer is far more of a sport to the other 6 billion people...same with Oxford. It has at least double the wow-factor to my knowledge.<br><br>", "<b>Username: rooster08</b><br><br>People in Asia and India certainly think Stanford is more prestigious because of Stanford's unparalled strength in science and engineering, which those countries in that region tend to emphasize. I can't speak for Europe, but a guy in my dorm was accepted to Oxford and Stanford and he basically said that Oxford is not as highly regarded as Stanford and so he came here. Also, his sister got into Cambridge and Harvard, but she ended up going to that school in Cambridge, Massachusetts lol.<br><br>", "<b>Username: dreamer9</b><br><br>I live in Singapore and I've gotten really mixed opinions. Americans (and American-educated/based people) think Stanford is the clear choice, British people = Oxford. It's quite confusing really... It doesn't matter to me about prestige anymore because I personally think they have about the same 'wow factor' and it just depends who you're talking to! I'm pretty sure I'm going with Stanford though...<br><br>"]}