{"title": "uw vs whitman vs ups vs lewis and clark vs willamette", "comments": ["<b>Username: marleyr</b><br><br>Accepted to all but having a hard time choosing.<br><br>", "<b>Username: mmaah</b><br><br>Whitman will offer you the strongest academics among the smaller schools and a much warmer community and more access to faculty than you may find at UW.<br><br>", "<b>Username: bopambo</b><br><br>There are some rankings that put Whitman ahead of UW in academics also, but of course the relative sizes and locations are very different. Have you visited any of these places? It sounds like you live in the NW, try to get to admitted students days and get a feel for the individual schools. That's the best way to decide. Since this is the Whitman forum, do you have particular questions about Whitman?<br><br>Congratulations on having so many good choices.<br><br>", "<b>Username: seattle_mom</b><br><br>My D has almost the same choice -- except she did not apply to UW, and has just about eliminated Lewis &amp; Clark.<br><br>Some questions to ask yourself: what about finances? What do you want to major in? Take a look at the online course catalog and distribution requirements. Do you have a sport or hobby? Check out the opportunities to pursue it at each school. And visit if you can.<br><br>", "<b>Username: sunmachine</b><br><br>Watching thread with interest, since S2 is interested in all of those schools, save UW. BTW, why is your D eliminating L&amp;C?<br><br>", "<b>Username: lauriene17</b><br><br>Also going to keep an eye on this as I'm looking at Whitman, L&amp;C and WU.<br><br>", "<b>Username: bopambo</b><br><br>Well, with all these eyes on this thread, I hope something happens. LOL.<br><br>Of course, I think you should all go to Whitman because that's the choice my son made. He's very happy there. It's academically challenging, and fits him socially. The administration is responsive and caring, and the faculty is very involved with the students. My son is progressive politically, loves outdoor activities, plays club sports, and is social but also a serious student. He loves his fraternity, but has friends who are independents. Whitties seem to do a lot of bonding. The atmosphere is relaxed. My son is ever so slightly preppy, in a west coast sort of way. You don't see a lot of dreadlocks or piercings. People look healthy.<br><br>Whitman offers many ways for the students to get involved with the inner workings of the school and they pick students who are willing to get involved. S is running for sophomore class senator and has been picked as a scramble leader for an incoming freshman pre-orientation backpacking trip this summer. He prepared for that by taking a Wilderness First Responder (first aid and rescue training) course over the holiday break for 2 college credits.<br><br>Walla Walla is a nice little town, with shopping and necessities within walking distance. There are some nice restaurants and coffee places, as well as an ice rink, a bowling alley, movies and a local symphony. It's wine country, so the town puts on cultural events. The farmer's market is popular with students. Because there are not the big city attractions of Portland, the school brings in a huge number of visiting scholars, authors, and interesting people. Students support each other's plays, concerts, games and art shows. Walla Walla is probably why students become so close to each other.<br><br>Someone else will have to sing the praises of the other schools because I've never been to them. My husband and son visited L&amp;C and Willamette, but they didn't have the draw that Whitman did for our son.<br><br>It would be interesting if someone else offered why they are attracted to the others. Anybody?<br><br>", "<b>Username: MOMBaritone</b><br><br>Looking at the same schools. Wondering what people think about Whitman for the shy kid...who warms up especially with nice kind people. Does choir, Lit. Mag, Tutors....would do the greek system. This is are first choice.<br><br>", "<b>Username: bopambo</b><br><br>MOMbaritone, I think you're son would do just fine at Whitman. The kids ARE nice and they won't stay strangers for long. The administration does a really great job of getting everybody acquainted in the freshman dorms. The dorms are divided into sections and each section has an RA and regular meetings. They think up fun stuff to do together to show their spirit and in the process become buddies.<br><br>", "<b>Username: seattle_mom</b><br><br>\"\"sunmachine wrote: Watching thread with interest, since S2 is interested in all of those schools, save UW. BTW, why is your D eliminating L&amp;C?\"\"<br>She says it doesn't have the programs she wants -- but I think there is some nebulous \"feel\" component. She liked it when we visited, but I don't think she pictures herself there.<br><br>", "<b>Username: sunmachine</b><br><br>bopampo, would you mind sharing your perceptions of the effect of the Greek system at Whitman?<br><br>What I always hear is that the Greek system at Whitman is toned down and non-divisive compared to other places. On the other hand, seems like every time I look at the Pio on-line, including today, I see an article that reflects that Whitman is polarized over the presence of the Greek system. I'm not so concerned about the content of these articles, as much as I am about the comments from students that follow them, many of which are pretty nasty (both from Greeks and Indies). I'm also less concerned about drinking and \"animal house behavior\" that might ocurr at frats (believe me, no one needs to be in a frat to misbehave), as I am with the fact that any college, especially a school as small as Whitman, would have a polarized student body. Mind you, none of this is to imply that the Greek system is good or bad; just concerned that the campus might be divided over it, and that the unity and bonding of dorm life comes to a screeching halt once some kids decide to rush. I know a Whitman grad, who was not in a sorority, and she tells me that this was not the case when she was there. But would like to get your view. Thanks.<br><br>", "<b>Username: seattle_mom</b><br><br>\"\"bopambo wrote: You don't see a lot of dreadlocks or piercings. People look healthy.\"\"<br>Hmm, this is actually a worry of mine. My daughter has plenty of piercings and a hair color not found in nature. ;) She got on well with her student interviewer, stayed with a friend and got along with the students she met, and obviously the school accepted her... but will she fit in and find \"kindred spirits\" there?<br><br>", "<b>Username: mmaah</b><br><br>She will definitely find kindred spirits and also become friends with those who look completely preppy. One of the beauties of the community is that kids become friends with such a wide array of folks and somehow come to respect and enjoy even those they wildly disagree with. And I would not take Pio debates or commentary too seriously. College papers tend to draw the opining of the extremes and never give a very comprehensive/accurate view of the school. I'm all for using it as one sample of life on any campus..while also recognizing that there is often an essentially soph-moric quality to the \"news\". After having 2 kids at Whitman I am convinced that the Greek system does not at all live up to my negative stereotypes of frats/sororities and that kids' first year friendships readily endure even when one rushes and pledges and the other doesn't.<br><br>", "<b>Username: kolijma</b><br><br>I asked my daughter about that article in the pio. Although she herself has zero interest in joining a sorority, she has many friends who are in frats and sororities. The fraternity mentioned in the recent article is a group she is particularly close to and she was not aware of any disgruntlement over rushing. She also said that she has never seen any divisiveness on campus between greeks and non greeks.<br><br>seattle_mom, from what I've seen and witnessed among my D's wide ranging group of friends, the students really embrace their differences with warmth and respect.<br><br>", "<b>Username: bopambo</b><br><br>LOL, seattle_mom! No, dreads, purple hair and piercings aren't the prevailing fashion statement at Whitman, but they probably don't alienate anybody, either. Healthy looking just means that they get outside and run around, so pallid isn't the normal complexion. How did your daughter like it? What would a kindred spirit for her be like? Is she concerned about this?<br><br>Sunmachine, I read the Pioneer article about hazing at the TKE house about a week after my son went through this very same initiation. When the article appeared in the Pioneer I called him, his view was that it was a tempest in a teapot. He actually thought that while difficult in some respects, the end result of the initiation was a positive trust building experience. He thought it was very mild compared to some Greek initiations, including his father's Phi Delt experience many moons ago.<br><br>That was his opinion and that was obviously different than the one expressed by the student who complained. I know that the administration is taking the complaint seriously and TKE will have to reevaluate it's initiation practices. It does point out that Whitman responds quickly and doesn't take the student's well-being lightly.<br><br>I have developed an opinion about college newspapers, they share some of the same attributes as media everywhere, they love the sensational story. They are written by students for students. I remember when S was looking closely at Bowdoin, I started reading their paper. The first thing that freaked me out was an article about the prevalence of the drunken hook-up culture on campus. I went on CC's Bowdoin forum to ask about it and after a lengthy discussion came to the conclusion that some people do engage in drunken hook-ups, but not everybody, not all the time. My conclusion about the TKE incident at Whitman is that there was an unhappy pledge who complained and was taken seriously, some students felt strongly on both sides of the issue and expressed their opinions. I think a lot of self examination goes on at Whitman.<br><br>As far as polarization between Greeks and non-Greeks, all I can offer is my S's experience. During spring break he took a road trip to Vancouver with his buddies, one fraternity brother and two independents. He told us that instead of living at the fraternity house next year, he's hoping to get a four person suite with three friends. Again, it's one fraternity brother and two independents. At least these guy aren't concerned about Greek affiliations, they are all first year dorm section mates.<br><br>", "<b>Username: sunmachine</b><br><br>Thanks for all the thoughtful - and informed - responses on the greek issue.<br><br>", "<b>Username: bopambo</b><br><br>seattle_mom, I've been thinking about your daughter. I was trying to paint a verbal picture of the typical Whitman student, but that isn't really useful and probably not even true. I think that mmaah and kolijma say it best.<br><br>", "<b>Username: AbideForever</b><br><br>I'm trying to decide among UW Seattle, U Wisconsin, Whitman, and possibly UM for bioengineering/biochemistry.<br><br>From what I've gathered about Whitman is it emphasizes academics. It seems like studying is about the only thing to do around Walla Walla. Sure its great that Whitman is in a small town, but you're bound to run out of things to do. That is why I am leaning toward UW's social scene. There is so much more to do in Seattle!<br><br>", "<b>Username: wrenfisher</b><br><br>If you like the outdoors, Whitman is a wonderful place to be at. They have a renown cycling team, a wonderful new climbing wall, and one of the best outdoors programs anywhere, with organized trips almost every weekend, including activities from kayaking to rock climbing, and opportunities to develop outdoors leadership skills. There's a nice little ski area not far (Blue Woods, I think). So, If you are outdoors minded, or want to become, there's LOTS to do.<br><br>", "<b>Username: rix</b><br><br>If a college has a distinct campus, like Whitman or UW (as opposed to a school like NYU), students tend to stay on and around campus most of the time. I think it's very common for high school students to be concerned about this when trying to make a decision about college. But, if you are like most students, you won't run out of things to do at Whitman and in Walla Walla. My D is from a big city. She initially thought she would NEVER be OK going to Whitman because of where it was. She absolutely loved Whitman. She loved Walla Walla. She graduated last year and is still living there doing a year in an Americorps position. In choosing between UW and Whitman, there are many more substantive differences to think about, aside from the location. There are profound differences between the undergraduate experience each offers.<br><br>Of the other LACs, Whitman is definitely the most selective. I think the expectation is that this translates into a difference in the academics and education, but that can be hard to quantify. The others all have something to offer. Go visit, walk around, go to at least one class, talk to students and professors, stay overnight if you can, and just see how it feels. You will figure out which one is the best fit for you. If you can't visit, and you don't know anyone who attends that you could talk with, ask the Admissions Office to connect you with some current students who you can talk to or exchange emails with.<br><br>", "<b>Username: Bogney</b><br><br>S has had ups and downs academically and with the Greek system, but loves the people at Whitman. He is outgoing, but knows plenty of introverts as well as extroverts and they all get along. The controversy in The Pioneer raises a legitimate issue (I oppose hazing), but according to S it seems a non-issue to most students on campus. S is not into hazing, but will be in a fraternity with a more laid back initiation than TKE's, and is good friends with members of all frats (including TKE), sororities, and independents.<br><br>The common characteristic of most Whitman students according to S is that they are generally thoughtful. Styles vary - piercings and tattoos may not be ubiquitous, but they are not rare or off-putting to the very accepting student body. S is outgoing and does not know what he will major in other than it won't be math, his roommate is a quieter math whiz - they are good friends despite little in common because they are both thoughtful accepting guys, like the majority of other students there. Many close friends in his freshman dorm - none of those frienships based on academics or sports teams - just nice folks. He likes the guys on his team and the coach too.<br><br>Just out of curiousity, does anyone know why Lewis and Clark isn't more highly regarded? They seem to attract bright students with scores not too far off Whitman's, and it's located in Portland. Their athletics didn't appeal to S, but otherwise it looked interesting. S has found plenty to do on campus at Whitman and exploring the natural beauty of the area, but Portland seems like a nice place for those needing a city fix.<br><br>", "<b>Username: kolijma</b><br><br>That's something I've pondered also Bogney. My d visited a couple of times in the college search hoping to like it. They gave her a very tempting scholarship, but she just couldn't see herself there. The class she sat in on was watching an episode of I Love Lucy and there was just lackluster class discussion afterward. The atmosphere was a little too laid back for her, and she didn't see enough sports loving kids there. If she had gone on a different day she might have had an entirely different reaction. Portland does seem like a great city.<br><br>", "<b>Username: puma12</b><br><br>I know this is a Whitman thread - but my S is trying to decide between Davidson and Whitman and to be honest - at least on paper - they seem quite similar except for location. Anyone with comparison thoughts on these two?<br><br>", "<b>Username: bopambo</b><br><br>Puma12, on another thread someone was looking for an east coast equivalent to Whitman. One poster suggested Davidson, another came on and said they are very different and they didn't think the kid that liked one would like the other. I was curious and asked why, but didn't get an answer. I can only guess that it could be social. You really can't tell without visits what your son would think.<br><br>", "<b>Username: Bogney</b><br><br>I could be way off, but I have heard that Davidson is much more conservative / religious than Whitman. It is supposed to be a fine school. I have no personal knowledge one way or the other.<br><br>", "<b>Username: MomCat2</b><br><br>Well, here's some info about Davidson:<br>\"...Davidson's bylaws, which require at least 80 percent of its board of trustees to be \"active members of a Christian church,\" and further mandating that 24 of the 44 trustees be members of the Presbyterian Church (U.S.A).\" [snip]<br>\"The board voted in 2005 to allow non-Christian trustees for the first time, although it decided non-Christians, or non-practicing Christians, could make up no more than 20 percent of the governing body.\"<br><br><br>Whitman like Davidson - A school with such by-laws in the Deep South??<br><br>I think not.<br><br>[on edit, NC is technically not in the \"Deep South\". But still...]<br><br>", "<b>Username: puma12</b><br><br>Thank you - this info, along with some other thoughts from a recent graduate, and a parent on CC of a prospective student have helped answer my question.<br><br>S attended admitted student's reception for Whitman recently and was very taken with the presentation by students and staff. The treats were good too!<br><br>", "<b>Username: MomCat2</b><br><br>Oops - just realized I didn't give a link for the quoted material I posted above.<br>I HATE unsourced quotes, so here it is:<br><a href=\"http://www.rockymounttelegram.com/node/351421\" rel=\"nofollow\">The Rocky Mount Telegram</a><br><br>", "<b>Username: bopambo</b><br><br>puma12, which way is your son leaning?<br><br>", "<b>Username: lester</b><br><br>My son is at Willamette now and LOVES it! Great academics, loves his Fraternity and the people in general. Has had great opportunities with profs to do research, dinner etc. My daughter is going to be visiting Whitman, as she has been accepted. I think she will love it.<br><br>I think there are so many similar characteristics and a few distinguishing ones when it concerns any LAC. Mostly, does it have a program you are interested in and how does it fit you socially.<br><br>They all have great profs, staff, students, drugs, piercings, preppy kids. Seriously consider where they give you the best scholarship! That makes a lot of difference to most of us!<br><br>", "<b>Username: yangkun</b><br><br>My friend's daughter, a high school student in China, has been accepted by Whitman, UW and BU(Boston University). The reason she applied Whitman was curosity. Being a 17-year-old girl, she has no idea what will happen if she decides to go to Whitman. Is the school environment friendly to an international student? Small is better like Whitman or big is better like UW, BU? Her insterest is in political science, education and social science. Definitely not math. Any input is appreciate. Thanks.<br><br>", "<b>Username: mmaah</b><br><br>Whitman will be a warm, welcoming community. But she will not find a large cohort of other Chinese international students there, as she might at UW. (There will definitely be other international students there as well as Chinese-American students--but not in droves. Whitman will feel safer, probably, and she will acquire many non-Asian friends. Her temperament may be an important factor. For a truly adventurous, urban/metro type, the bigger cities and schools might be just fine; but for others it could seem overwhelming and I'd guess the smaller community would feel more welcoming. There will be culture shock either place. If it was my kid, I'd vote for Whitman but I am not exactly objective.<br><br>", "<b>Username: puma12</b><br><br>Responding to bopambo and others - I know alot about Whitman as I have a child who is a senior there and has had an absolutely amazing time enjoying every minute.<br>Davidson, however, we don't know so much about - and this past weekend for admitted student days they had tornadoes!!<br><br>Regarding L&amp;C - the \"vibe\" is very differnt among the kids I think. L&amp;C is more existential and self-involved. More marijuana, less beer. Whitman is more relational among students I think - kids are highly engaged in campus stuff there and with each other.<br>Willamette, I think, is a bit more conservative than either of the other two. I have been impressed with the academics at willamette - but I have had superior experiences with all facets of whitman - the financial aid office, the president's office, the academic opportunities (internships, etc) and the fellowship and career center. when the review book says \"it runs like butter\" they aren't kidding and that is a wonderful thing for a parent! Secoond son still considering Davidson - so we will go down to the wire!!<br><br>", "<b>Username: collegemaw</b><br><br>Interesting that no one has said a word about UPS? AND would love to hear more input also on Willamette also..<br><br>", "<b>Username: bopambo</b><br><br>Puma12, tornadoes, yikes! I hope the skies remain clear so your son can visit. I'd love to know your thoughts on Davidson afterwards, I have no mental picture at all.<br><br>Collegemaw, the Willamette forum discusses the school at length, there are plenty of happy kids there. The UPS forum is listed under P for Puget sound, looks like they have a healthy number of posts there also, perhaps UPS and Whitman attract different types of students, as puma12 surmises with L&amp;C.<br><br>", "<b>Username: yangkun</b><br><br>mmaah, thank you very much for your response. This is really helpful.<br><br>", "<b>Username: lester</b><br><br>S is a Sophmore. He is an Econ major and is involved in many activities. Sports (D3), community service, fraternity...seems to be pushed academically and has a great advisor. We have been very impressed with the administration, they gave him a nice merit scholarship and we know that they came thru for a boy whose father lost his job.<br><br>S says drugs are present but not overwhelming. Has never been pressured, even being in the Greek life. Says there are cliques of kids but they are very fluid, loves the atmosphere on capmus, everyone says HI and is very helpful...its very easy to join and easy to Lead. More conservative that the other NW schools (L&amp;C, Whitman).<br><br>", "<b>Username: MOMBaritone</b><br><br>We left admitted student day not feeling completely in love....and we wanted to! Now what? I read above that someone posted the school runs like butter...but it did not seem like it. Maybe because it was a weekend? We ate at a small dining hall friday, only ONE open and it was a mess. Admissions office did not help us find a place for an extra student...just said full! We were looking for that helpful warm college..did we just miss it? Students seemed wonderful!<br><br>", "<b>Username: bopambo</b><br><br>When you say you were looking for a place for an extra student, what do you mean? Overnight? On a tour? An overnight stay would be hard to accommodate on the spur of the moment, but I wouldn't think it would matter for the rest of the activities, although they did say there was limited spaces at the tea ceremony.<br><br>I'm sorry that you didn't feel great about Whitman, I've only had good experiences with the admissions office. People do have bad days, though.<br><br>Prentice is the only dining hall open on Saturday, but there is also the cafe in the Reid campus center where students can use the flex dollars on their meal plans. I think that the admissions office said that they were expecting around 520 people for admitted students' day. Maybe they were just overwhelmed.<br><br>", "<b>Username: bopambo</b><br><br>Oops, I see you said Friday. I'm assuming that you meant dinner, likewise Prentiss (wrong spelling above) is the only hall open for Friday night. I'm guessing that the students do things on Friday night so fewer are on campus to eat, but the Reid campus center is also an option on Friday night. My son has never said that availability of food was a problem, were there a lot of visitors present?<br><br>", "<b>Username: MOMBaritone</b><br><br>My daughter is still thinking about Whitman. i think in the future I would not attend on an event day...but try to hit a day with classes and normal activities. My daughter is reserved and so a friendly school with a welcoming faculty is a big factor.<br><br>", "<b>Username: bopambo</b><br><br>MOMBaritone, is your daughter an admitted student or just putting her list together? Most schools don't offer regular visits on admitted students' days because their priority is those who have already applied and been accepted. I'm afraid I'm confused about what happened.<br><br>", "<b>Username: MOMBaritone</b><br><br>She is an admitted student...with 2 weeks to make the big choice. I feel admitted student day might not be the best day to visit if you only have 1 visit ( I have more college bound kids to go) A normal week day might give a better view of the school. Now the question is do we go back and try again...because she is very serious about it. What are your thoughts on a reserved student at Whitman....she gets involved, but a little shy at the start.<br><br>", "<b>Username: Speyside</b><br><br>My D did a trip earlier this year and also did the Admitted Student's Day last Saturday. A world of difference. She really got a lot out of her individual visit and felt the Admitted Student's Day was overwhelming and somewhat contrived. In fact, I don't think she enjoyed any of the accepted student days she attended at any of her acceptances and I will definitely skip those days for our next one up for college. If you can, send your D for another visit -- I suspect the experience will be much different from the scrum and if nothing else more representative.<br><br>", "<b>Username: MOMBaritone</b><br><br>Did your daughter spend the night with a student...or just day activities. Any advise at this point is welcomed! She wants to go...but just didn't get that.... this is it feeling!<br><br>", "<b>Username: Speyside</b><br><br>She just did a day visit, but got to have lunch with students, attend a class in a field she was interested in and actually had a good chat with a professor afterwards. If your D has time to do an overnight that would be ideal it seems to me.<br><br>", "<b>Username: bopambo</b><br><br>Definitely have her spend the night if that can be arranged, the overnight stays give depth and breadth to the visit, she'll be meeting more kids in their natural habitat. You've asked if a reserved kid can be happy there and my opinion is that it is really ideal for the reserved kid. My son is one who holds back for a while, surveying the territory, but when he feels comfortable fully engages. During high school he had a social life because he made friends with outgoing kids and traveled in their wake, by senior year he had taken the reins himself. The same thing is happening at Whitman only a lot faster.<br><br>One great thing he did in the beginning that made a huge impact was to go on a scramble, one of the pre-orientation outdoor trips. He had a wonderful time and arrived on campus with a dozen new friends. The first year dorms also do many things to unite and involve the new students. Besides, the kids are really nice, I don't detect snobbery or elitism or overt competition. Greeks hang out with independents, athletes with non athletes, art students with math and science majors, etc.<br><br>It's a shame that admitted students day didn't do what it was intended to do, but you're right, if it's your first and only visit then it's not the ideal way to get a true picture. If your daughter is still seriously pondering Whitman, it's worth another look.<br><br>", "<b>Username: mmaah</b><br><br>I agree with bopambo. Whitman draws kids into the community. And the scrambles are a great way to get to know a small group first. However, for a kid who didn't want to try a scramble, the dorms do a great job of getting kids integrated and connected I think.<br><br>", "<b>Username: LCF47</b><br><br>We were fortunate to spend 2 1/2 days in Walla Walla. On Thursday, we explored the area a bit and then enjoyed ourselves on Main St. - a little shopping, eating at good restaurants and walking around. On Friday, my daughter spent time with a current freshman (daughter of a family friend) who escorted her to the two class visits set up by the admissions office, went to lunch with a group of current students, and spent the rest of the day/early evening hanging out with the above-mentioned student or other current students. My daughter was passed around a bit depending on people's schedules but felt that everyone welcomed all the \"prospies\" with enthusiasm and answered their many questions. On our way back to the hotel, she let me know that she had decided to attend Whitman. :) The Admitted Students Day was on Saturday- it was informative but she did not feel that it gave her the same sense of what it would be like to be a student at Whitman, nor was she able to interact with current students the way she did on Friday. However, with over 500 guests on one day, that would be impossible,especially at such a small school.<br><br>", "<b>Username: critter</b><br><br>bopambo-<br><br>I think you may have been talking about my post about Davidson on another thread. My apologies for not responding...sometimes I end up not getting back to places that I have wandered!<br><br>Anyway, Puma12 and I have had conversations including Davidson in the past...her son was originally very interested in my D's college and she also had visited/applied to Davidson. Bogney's response was basically in line with what I was thinking on the subject. I think I did say that it is hard for me to fathom cross applications between the two schools, but then, look at puma12's son. They are both fine schools, but so far, when it comes to Whitman, I can't get any of my kids to bite. I hate to say it, but we visited Whitman recently with S, and unfortunately, it did not go well (And to be honest, that is a major understatement).<br><br>puma12-<br><br>By the way, congratulations on Whitman and the scholarship!! It sounds like you and your son will have a very happy 4 years!<br><br>", "<b>Username: puma12</b><br><br>Thank you critter! My S is still \"very interested\" in your D's school - but alas he is on the waitlist. He is loving the one that wants him, and in his case, he really is excited about Whitman on its own merits.<br><br>If you'd be willing to pm me, I'd like to learn from what went so poorly on your son's recent visit - perhaps I can help them improve with the feedback. And thank you again for your help during this search season!<br><br>", "<b>Username: sunmachine</b><br><br>Bumping this thread, since my son was admitted EA to Willamette and L&amp;C. Whether we add Whitman to the mix depends on what we hear from the friendly admissions folks in the next few weeks. :)<br><br>Was wondering what decisions were made a year ago by the folks on this thread, and what were the deciding factors?<br><br>", "<b>Username: mmaah</b><br><br>I hope you get a Yes from Whitman too. My second, a daughter, is a junior and my son graduated 2 years ago. The community and the quality of the education are simply the best. Willamette and LandC have many strengths but there is something created by the Whitman community that seems exceptional to me and worth getting up the Columbia to see and experience.<br><br>", "<b>Username: 5boys</b><br><br>AHHH!! I sure hope I am on here in the next 2 weeks asking for advice too.. My S is in at UPS with their top scholarship and seems to really like it, but if he gets into Whit it will be no contest.<br>@bopambo... thanks for all your support.. I may need more:-))) The next 2 weeks are going to be STRESSFUL!!<br><br>", "<b>Username: AbideForever</b><br><br>Last year I was in the position of deciding between University of Washington, University of Wisconsin, and Whitman. I applied not knowing what I wanted in the beginning. After visiting Whitman it felt like the right choice, however the financials didn't work out, so I ended up enrolling at UW (Seattle). Truthfully, I am very happy with my decision despite the attachment I had with Whitman.<br><br>There is great flexibility going to a larger institution... I can take every type of class I can think of! It is also great knowing your school has top-notch programs so you can't go wrong in what you major in.<br><br>Also, it is important to realize if you are a type of person that actively pursues relationships or wants them to be made for you. At UW I've had to push myself not only academically but socially as well. As a result, I feel that I've grown more than I could have at Whitman (I always enjoy meeting new people-- and this is coming for an extrovert). I think Whitman is especially geared towards people who want a smaller tight-nit group of students. Whereas, at a larger school you get to make your own group but it depends on your effort.<br><br>"]}