{"title": "stanford full pay vs full ride at wake forest", "comments": ["<b>Username: hello_you</b><br><br>Ugh. Our family thought we had it figured out. Our son was offered the Stamps scholarship at Wake Forest. Even with offers from Duke and Vandy, it looked like Wake and the scholarship would be the choice. But then came the Stanford acceptance. That has presented a huge decision. I'd love some feedback from this (presumably biased) Stanford forum.<br><br>", "<b>Username: rickle1</b><br><br>Wow - congrats on all these wonderful acceptances. What an accomplishment! I frequently tell (when asked) my friends that competitive merit aid at highly selective, need blind schools is really designed to pick off the ones that would otherwise go to Harvard or Stanford. Your son is one of \"the ones\" and that is an amazingly small crowd. It's Wake's version of the Jefferson Scholars program at UVA or Cornelius at Vandy, etc.<br><br>S attends Wake (sophomore). I can tell you it's an amazing place and provides a top notch education. It's no wonder it's been rated among the top schools for undergraduate teaching for many years (like in the top 10). Small discussion based classes taught by leading profs is the norm. Great well rounded liberal arts core and excellent majors / outcomes in business, compsci, pre med, pre law, etc. You can get anywhere from Wake Forest!<br><br>But...\"Stanford is Stanford\". For example, if your son wanted to pursue the incredibly competitive world of management consulting out of UG, MBB lives at Stanford. That's just one, but a good, example. I imagine the opportunities in Silicon Valley are incredible!!! That makes a difference. Think about your financial resources. Would it make a major difference in your life if you were to pay for Stanford? Can you pay for it out of cash flow? Do you have a ton of home equity AND you were considering downsizing anyway?<br><br>I ask these questions out of experience. Although our choices were different than yours, we were in a similar position. Essentially free state flagship at a popular prestigious school or full pay at Wake (what we narrowed our choices to). I have been saving for college for a LONG time and earn a good living. We have also been saving for retirement for a long time. My basic MO is, other than in case of emergency, our retirement savings will never be touched for anything other than our retirement. So using it for school was/is not an option. However, between earmarked college savings and cash flow, we could/can afford full pay. Do I like it? No. Would I prefer to not pay it? Yes. But...that's why we saved...for that exact purpose - to be able to provide a profound opportunity for my son (and his sister in a yr). We're not going in to debt, just using existing resources. Based on my conservative calculations, we'll have plenty for retirement, so not spending the money would mean simply having more (which might be nice - pay for additional trips / memories) but we decided it's also fun to use it for Wake and X and see those memories happen in real time. Of course, it was a personal decision. I would not have chosen it if it required substantial debt on anyone's part. S is taking the unsubsidized Stafford loans as we required him to have some skin in the game but that will easily be paid back and quickly once he starts his career.<br><br>I hope this helps provide clarity in your thinking. Best of luck, and congratulations. You must be proud!<br><br>", "<b>Username: PurpleTitan</b><br><br>From a purely ROI perspective, it's hard to justify Stanford. $300K grows to $2.1M in 40 years even at a pretty conservative 5% real return rate.<br>And Stamps would offer a lot of opportunities and open a lot of doors as well.<br><br>What opportunities would he get at Stanford that he wouldn't get with Wake with Stamps?<br><br>Even if you spend the money, it's the difference between Stanford or Wake + a free (elite, assuming he gets in) MBA or other master's + funded travels all over the world and still a little left over to start a nest egg.<br><br>Though I would make sure that he and the younger daughter get the same amount of money (taking in to account inflation) to spend on education or other enriching pursuits (hence why I would fund travel but not a car if he chooses Wake).<br><br>", "<b>Username: Creekland</b><br><br>We had a young lass from our school in the exact same situation a couple of years back, though she was also considering full rides at U Miami and Vandy (3 options or Stanford - dream school). She chose WF. When I asked her brother a couple years later he said she was loving it and glad she made the decision she did - terrific opportunities and loves the place. There was also another lass applying there - not sure if she attended - due to her experience.<br><br>YMMV I'm just relating her experience.<br><br>", "<b>Username: PurpleTitan</b><br><br>^ OK, I saw a response. Yes, being by Silicon Valley with a Stanford degree opens doors. On the other hand, a Stanford MBA also opens doors (to MC, etc.). Probably more than undergrad Stanford. And with the money saved, that could be fully funded without taking on debt. Yes, he would have to get in, but given his current trajectory, he has a good shot (at least at getting in to an M7 b-school, who are the top targets for MC).<br><br>", "<b>Username: rickle1</b><br><br>^ I agree the Stamps / Wake make it a tough decision. Interestingly, the head of Wake's Career Services came from Stanford after heading up their graduate school's career placement center (former Stanford grad and Bain alumni). Wake is a GREAT place and provides a GREAT education and opportunities.<br><br>It's an interesting quandary. I'm a financial advisor by trade. Over the years (30), I've learned that financial planning / advising is more about client issues / vision/ concerns than the actual money. The money is just a resource. I think of it like the junction between the human element and math. The math part is ridiculously easy. The human element part is very challenging (and interesting), as everyone is so unique. In this case, the ROI mentioned may have zero or 100% relevance (or any % in between). With us and for ours, it came down to \"we could so we did\". Many probably think we're crazy but we're ecstatic with the outcomes to date.<br><br>", "<b>Username: jym626</b><br><br>OOh, I feel your pain. Tough call. If you have funds/savings that spending $300k (assuming you have travel expenses to address too) doesnt dent your retirement, quality of life or plans for younger dau, AND ther is a strong reason to be in SV, visit both, then decide.<br><br>", "<b>Username: Midwestmomofboys</b><br><br>We know a Stamps scholar, and wow, are they enjoying the perks -- beyond the money, there are special invitations to meet with visiting speakers, on campus research opportunities etc. It really is a phenomenal opportunity. I think it goes a long way to closing the experience gap with Stanford.<br><br>", "<b>Username: jym626</b><br><br>Meant to add, congrAts on the acceptances and the Stamps! A friends son turned down Harvard for a Stamps several years ago.<br><br>", "<b>Username: Riversider</b><br><br>Tough choice. Good luck! In your shoes I would pick Stanford.<br><br>", "<b>Username: ewho</b><br><br>OP, if you are comfortable to pay, just do it. Many things can't be bought by money. Look ahead 20-30 years, what matters to you and your child?<br><br>", "<b>Username: PurpleTitan</b><br><br>I'm curious as to the age of the commentators.<br><br>", "<b>Username: happymomof1</b><br><br>If your son chooses Stanford, it will require all of his share of the college savings, plus a bit more. Will you be fully ready to pay Stanford-level costs for his sister starting just a year after he finishes college? Do the math. Be honest with yourself about those numbers.<br><br>You are incredibly fortunate to have resources that would allow you to give your son this option. It truly is OK for you to do so if he decides that he prefers Stanford. But first I'd make sure he visits both places and talks with current and recent Stamps students, as well as Stanford students and grads with his projected major.<br><br>", "<b>Username: CU123</b><br><br>I would go with WF, its just a fact that students who are accepted to schools like Stanford will do just as well if they actually attend or not. The monetary difference is just too much to ignore.<br><br>", "<b>Username: Hamurtle</b><br><br>I want to say that money talks and a full ride at a Top-25 is hard to pass up. But Stanford has the reputation. Not to mention that it is relatively easy to get a good GPA.<br><br>I would go by the potential major and best fit at this point.<br><br>", "<b>Username: privatebanker</b><br><br>Congratulations - you must let him know we all send a collective high five! The work and dedication to achieve such results is not to be taken lightly.<br><br>So either he has unique intellectual gifts, is incredibly hard working even among hard workers or most likely both. Those qualities dont disappear once you walk onto campus.<br><br>Therefore, I recenter the question as to who is better off?<br><br>The superstar Stanford grad with no money for med school, mba program or grad school.<br><br>Or the same superstar from wake forest with a boat load of money to spend on the same exact (and I mean exact) grad schools to choose from. The answer is not at all difficult.<br><br>If you will do no more than ug and want the better cache and connections of Stanford. Its certainly a superb option.<br><br>You know your kid. You know the answer.<br><br>", "<b>Username: rickle1</b><br><br>Another consideration is the cost (if there is a cost) of grad school. I recall OP mentioning unsure of major at this point. So who knows if grad school is even in the cards. But assuming it is, let's not discount the chance of grad school sponsoring or scholarship. Clearly he is an amazing student. Assuming his trajectory continues, he'll still be an amazing student. Many in that category have grad school paid for by employer or via scholarship. Have a brother who got a full ride PHD from a top research university and friends who had their M7 MBA paid for by their employer. Of course, no guarantees but this kid has the chops (so far).<br><br>", "<b>Username: sushiritto</b><br><br>Stanford all day long. And twice on Tuesdays.<br><br>Im not in any way affiliated with Stanford. But Im biased anyway, because Im a neighbor. You cough here and get a Stanford alum sick. <br><br>VC capital of the US.<br><br>My small gym has a new member, young high tech guy, grew up in Kalamazoo, Michigan and he just graduated from Stanford. The connections here in Silicon Valley run very deep. Theyre everywhere.<br><br>", "<b>Username: collegemom3717</b><br><br>I don't see anything here about what the son's interests <i>are</i>. Yes, MBB 'live' at Stanford, and VC firms are thick on the ground there- but we don't have any evidence that I can see that those are what interest the student.<br><br>OP, it's not 'just' prestige v money. For one thing, Stamps is getting to be like Jefferson &amp; the other big named scholarships- in the places that matter they have real prestige. For another, 'prestige' matters differently in different areas. Is your son thinking law or med school? there is no 'prestige' benefit there.<br>\"\"I feel like the opportunities presented by Stanford are unparalleled.\"\"<br><br>Without meaning to be rude: how fact based and relevant to your particular child is that? Nobody can take advantage of every opportunity - a buffet is only interesting to the extent that you like the foods on the table and that you are hungry for them. How much narrower will the opportunities be at WF?<br><br>Don't underestimate the benefits of being a star, either. WF wants its Stamps scholars to become stars as they go out into the world, and work hard to help make sure that happens.<br><br>", "<b>Username: PurpleTitan</b><br><br>\"Many things can't be bought by money.\"<br><br>Very true. But that's true regardless of what path you choose. Either way, you will experience stuff you would not experience otherwise and give up other experiences.<br><br>And actually, a _lot_ can be bought with money.<br><br>IMO, so much comes down to self-confidence. Many will want the Stanford stamp of approval (though frankly, those folks who are aware would understand that the Stamps at WF is probably as or more difficult to get). Those who are confident in their abilities know that they will be successful regardless of where they go.<br><br>I'm quite certain, for instance, that on a per capita basis, UNC Robertson Scholars have as or more success later on in life than HYPS grads.<br><br>", "<b>Username: skompella9892</b><br><br>If I was in your son's situation, I would want to attend Stanford. Stanford, despite the costs associated with attending the school, is a spectacular school that offers a crazy amount of good opportunities due to its close ties with Silicon Valley that you just won't have in many other colleges. As long as using those college savings doesn't conflict with any other thing you're saving up for, I feel like Stanford would be a really good choice for your son. There's also the bragging rights that come along with attending Stanford that would tip the scale a bit further towards attending Stanford if I was in that situation. However, the first step would probably be to visit the colleges and have your son see what seems to be a better fit for him.<br><br>", "<b>Username: PurpleTitan</b><br><br>@rickle1: \"friends who had their M7 MBA paid for by their employer.\"<br><br>How long ago was this? This is almost impossible these days (though the b-schools themselves are more generous with scholarships to offset the insane list prices).<br><br>", "<b>Username: Rivet2000</b><br><br>We planned on making sure our kids (same age range as the OP) could graduate after 5 years (assuming a masters) debt free. That was the most important thing to us, so we saved early and often. Our commitment to our kids were: work hard in HS then you get to pick where you go to college based on your acceptances. Our S is currently a junior at Stanford and his sister is a freshman in HS. From a money perspective, everything is going as planned for our S (full pay) and is on track for our daughter. To be honest, we could have pressured our S to go to one of the other, less expensive but sound academically, colleges but that was not the deal. We could have diverted that \"saved\" money into his sisters account and saved even more down the road, but that money was always earmarked for college.<br><br>Not sure what, if any, understanding you had going in to the process, but I do agree money does play its part and Wake is a great school. The debt free path is IMO the best path.<br><br>So how about all that $$ were sending to Stanford? We'd do it again in a heartbeat. Our S has flourished on that campus in Palo Alto and grown in ways we had only dreamed of.<br><br>", "<b>Username: privatebanker</b><br><br>The one thing we can all agree upon is with age comes experience and wisdom. Except when deciding on a college for our children. Much of it temporarily gets tossed to the side in the fever of the moment.<br><br>", "<b>Username: momofsenior1</b><br><br>My vote would be Wake for ug and then take all the money you saved and go to Stanford for grad school.<br><br>", "<b>Username: RW1</b><br><br>Congrats! Do you want a Ferrari or a Corvette.(Its the actual cost difference your looking at). Their both crazy cool and nice, yet some might point out many nuances that make the Ferrari better. Some might by a house, car, vacation, vacation home or a multitude of other wonderful things with the savings. Yet, even others would say \"Save the money to pay for MD program or get started in life\". You can make money later, experiences are hard to come by. Like it was stated before, if spending the money wont cause a hardship and this is important to the student, then Standford.<br><br>", "<b>Username: rickle1</b><br><br>^ for my friends it was a long time ago because I'm old, but there are employers who have specific programs for this. Consulting comes to mind but there are others. Work for them out of UG for 2-3 yrs, get the MBA form top school and they pay for 50% -100% of tuition if you return to work for a few yrs. Corporate america does this as well based on the individual. Happens more than you think.<br><br>From a grad school perspective, it's actually quite common for top students to receive scholarships for PHD programs. Don't know about law school.<br><br>", "<b>Username: privatebanker</b><br><br>If the OP says they want to work in banking or consulting at Bain or a VC or tech start up I agree with @rickle1 to a degree.<br><br>But thats not been indicated.<br><br>If not ,I dont agree. And spending other peoples money is easy breezy here on CC. The OP has another kid going to school in five years. His income precludes any financial aid. He has 250k saved for a $560k need.<br><br>FYI. those same jobs and tuition reimbursement plans are available to wf grads too.<br><br>The top ten schools feeding IB only account for 30 percent of the incoming recruiting class. And no school, not even Wharton or Harvard account for more than 5 percent. And actually a school like UT is in this group.<br><br>So 70 percent come from somewhere else like WF.<br><br>", "<b>Username: privatebanker</b><br><br>OP. Direct real time example. One the associates on my team. BC Carrolll school. Worked for four years with us. That money and parents savings are paying for Duke MBA now.<br><br>He has a summer internship lined up to work for one of the major consulting firms in San Fran.<br><br>He is just one kid but sounds like your son in terms of options. He was a Gabelli scholar at BC. And had HYPS full or near full pay options.<br><br>He would beg to disagree with much of the advice here. Dm me and I can try and connect your son to him.<br><br>", "<b>Username: gallentjill</b><br><br>There are so many aspects to this decision.<br><br>How does your son feel? Does he have his heart set on Stanford for any reason other than the prestige of the name? Are there real opportunities that he can't get at Wake Forest?<br><br>What about your second child? If he goes to Stanford full pay, will you be able to give the same opportunity to her? If not, what will that do to family relationships? Those kinds of decisions can sometimes tear a family apart and pit siblings against each other.<br><br>What about grad school? Will he have to take loans for grad school if he chooses Stanford? Does he understand the impact that could have on his future?<br><br>In our family, D1 chose a lower cost option over a more prestigious option. It met all her needs and she understood the money saved could eventually help her with grad school if she chose AND she knew it could help her sisters. She felt very proud to be able to help the family that way.<br><br>D2 chose a higher cost option (not full pay, but higher than her other choices) because it offered a program she could not get anywhere else.<br><br>Congrats on having a great choice to make! Please let us know how you decide.<br><br>", "<b>Username: oldfort</b><br><br>I think MBA is passe now. A great (ranking) UG school is just as good as a graduate MBA.<br>I would go with Stanford because :1) your family can afford it (I wouldn't do it if your family would need to go into great debt for it), 2) Wake Forest is \"buying\" your kid's academic achievement, 3) even assuming he could get similar education at Stanford &amp; WF (which I don't really think so), the Stanford name recognition is greater world wide.<br>D1 had a similar decision to make between a top 20 school and a next tier down LAC. It was a hard decision, but I ultimately decided on the top 20 school because I've paid for 13+ years of private school for her and college wasn't the time I was going to skim on her. (I was thinking I could get a new BMW every year if D1 had taken the scholarship). I am not going to leave much for my kids as inheritance, but they've got their education.<br>Another way to look at is so many people have paid millions to get their kids into top tier schools (latest admission scandal), and your kid got himself in fair and square, so why not take advantage of it.<br><br>", "<b>Username: roycroftmom</b><br><br>To correct a misperception, Stanford is not an automatic ticket to Mckinsey. Yes, they interview on campus there. In a recent year, they interviewed 400 Stanford undergrads and made full time offers to 6 students. So I would not count on that. At Stanford, your student is just another undergrad; at Wake, he is a star, albeit at a slightly less prestigious school. Which does he prefer?<br><br>", "<b>Username: tpike12</b><br><br>My vote would be to take the free undergrad, then go for a prestigious grad school.<br><br>", "<b>Username: havenoidea</b><br><br>Ive known 2 kids offered the prestigious full ride scholarships at great institutions and both took them over their tippy top acceptances. As others said, these scholarships alone set the kids up for success. One student is now a PhD candidate at MIT (with some other elite scholarship), the other is still in undergrad, and doing great things. Very small pool, but who I know personally. The kids didnt find the decisions hard, interestingly.<br><br>", "<b>Username: itsgettingreal17</b><br><br>There is much to be said for being a big fish. I just dont see Stanford being worth $300k (and its actually more when you factor in the extras the Stamps provides) more than Wake. The only arguments Im hearing in favor of Stanford is mere speculation from posters starstruck by the Stanford brand. The education is better at Stanford? Really? How so? I would find that highly unlikely.<br><br>", "<b>Username: roycroftmom</b><br><br>Also, consider where you son is most likely to flourish. One of my kids attends a school well down the prestige chain from Wake. And she has received summer internship offers from many of the most prominent investment banks, money center banks, and consulting firms (none of which do on campus recruiting at her school). Truly, it is very possible to do very well from any college if you take advantage of the opportunities presented.<br><br>", "<b>Username: PurpleTitan</b><br><br>@rickle1: MBB consulting is one of the few industries left that fund 100% of an M7 MBA (lots fund a portion). Let me know if there are others.<br>Yes, pretty much all STEM PhD programs worth attending are funded.<br>Nearly all law schools give merit/discounts these days.<br><br>", "<b>Username: PurpleTitan</b><br><br>To answer a poster above: He also earned the Stamp scholarship at WF so why not take advantage of that?<br><br>", "<b>Username: privatebanker</b><br><br>@PurpleTitan is right.<br><br>there are some level of merit to t20 law. You definitely dont have to go to Stanford for those in any way. Lol<br><br><br>OP. I do believe you are receiving good advice for asking the CC prestige fever group to say no to Stanford. Theres more than one set of lips quivering and eyes twitching.<br><br>Its akin to asking a Patriots or Jets question on a NY Post fan blog.<br><br>", "<b>Username: Rivet2000</b><br><br>I don't see this as a Stanford vs Wake question. That would be easy :smile: . This is a money/debt question and it's easy to see that the debt free path is the best.<br><br>Now if money is not an issue, we can engage on the Stanford vs Wake discussion. Happy to play there.<br><br>", "<b>Username: Creekland</b><br><br>If money isn't a big concern, let your son choose. It's his life. Visit both places and let him decide.<br><br>", "<b>Username: aquapt</b><br><br>Stanford is Stanford, but Stamps is Stamps. The prestige of being a Stamps Scholar, the networking and mentoring and additional opportunities that Stamps provides... I would not turn that down for Stanford. Stanford has this \"golden ticket\" reputation that nothing but a windfall of happiness and opportunity awaits, but in real life I have known plenty of students who have felt stressed and lost in the crowd of super-ambitious super-achievers there. I wouldn't turn down the Stamps experience at Wake for the undergrad experience at Stanford - they'll not only pay his way but cultivate him in myriad ways, large and small, over the four years. Why pay six figures *and* compete with a concentrated pool of overachievers for a level of opportunity that's being offered on a platter through Stamps? Stanford will be there for grad school.<br><br>IMHO I would choose Stanford in this situation only if the particular student wanted a very, *very* specific program or path there that WF couldn't begin to approach. For example, if my kid wanted the Stanford engineering design program, and had been familiarizing himself with specific faculty and projects that he was dying to get involved with there... then yeah, maybe. Because Wake has nothing like that - they've only just started to offer engineering at all - and Stanford is the best-of-the-best in this realm. But if my child's areas of interest were strong at WF and not one of the uber-preeminent undergrad programs at Stanford, then Stamps all the way.<br><br>", "<b>Username: Publisher</b><br><br>OP has not really shared enough information about his son &amp; his son's interests to enable one to offer advice based on anything other than prestige versus money. But, a recipient of a Stamps Scholarship at a top 30 national university satisfies both the desire for prestige while making a very wise financial decision. Still, the ultimate decision is most likely to be Stanford University based on OP's original post in this thread which views Stanford as offering unparalleled opportunities.<br><br>If you make &amp; save enough money, then you have the right &amp; luxury of deciding how to spend or invest it.<br><br>FWIW: My opinion would be to attend WFU on the Stamps Scholarship &amp; enjoy the freedom of financial independence along with the freedom to attend graduate school without worrying about finances / COA.<br><br>An important factor should be to investigate opportunities for OP's son at WFU as a Stamps Scholar in his planned career.<br><br>Just for fun, I wonder how OP would feel if the full pay option were Harvard or Princeton rather than Stanford.<br><br>", "<b>Username: aquapt</b><br><br>A thread like this is inevitably going to be a study in confirmation bias. This is good news, in a way. It demonstrates that whatever you decide, a few years from now, you will in all probability be convinced that you made the right choice, and you will be well equipped to make the case as to why the next person should make the same decision.<br><br>People here who decided to turn down big scholarships and full-pay for T10 schools can tell you how irreplaceable their experiences have been, and how they would have tragically missed out on all that if they'd taken a full scholarship to a T30 school instead. People here who turned down full-pay at T10 schools to take prestigious, named scholarships can also tell you how irreplaceable their experiences have been, and how they would have tragically missed out on both those experiences, and a six-figure nest egg, if they'd gone the other way. And the hell of it is, none of them are wrong about having made the right choice for them, although they are likely wrong about how tragic the \"road not taken\" would have been.<br><br>I will note, though, that the more people have either paid or suffered for their choices, the more invested they feel in those choices having been right. That's just science. It's why hazing works, and why putting a high price tag on a name-brand product enhances its perceived desirability. That *still* doesn't make those people wrong, but it's a factor in why they're so deeply convinced. As I said, the good news is that no matter what you decide, you will likely be glad you chose as you did. So filter all the advice through your particular priorities and your son's, and just make the best call you can. Congrats on having such a tough but wonderful choice to make. :smiley:<br><br>", "<b>Username: oldfort</b><br><br>Unless we have unlimited amount of money, we all have our own value on how we allocate our money. It is really a personal choice. I shared my family experience/value, and OP is going to have to make his own family choice.<br><br>", "<b>Username: privatebanker</b><br><br>@aquapt thats a remarkably accurate post.<br><br>Just for purposes of determining where one falls in this OP. I have made neither choice.<br><br>", "<b>Username: rickle1</b><br><br>@privatebanker Really nothing to agree or disagree with me on as I'm not saying OP's son should do X or Y. Just pointing out there are advantages to Stanford in certain circumstances and that many grad school options for top kids will be covered (at least partially). I predicate everything on IF the cost is manageable to OP, THEN...If it's not, then it's really a non issue.<br><br>We don't know all the financial details (spending habits, future plans, etc.) My first post on this thread was simply taking a deeper dive on the \"we have it so we can spend it\" theme. So regardless of what else OP can do with the $, maybe he wants to pay for Stanford. Maybe the difference in cost would ultimately float to his son in inheritance and he'd rather him use it now. Maybe maybe maybe.... I guess my point is $ is a resource. If you already have the resource, nothing wrong with using it if you want to.<br><br>Either way, this kid will do great. Both are outstanding schools (full disclosure- I have a child at Wake)<br><br>", "<b>Username: WISdad23</b><br><br>On the other end of college, what if the offer was a low-paying job in San Francisco or a high paying job in North Carolina? It's a no-brainer.<br><br>Stanford is a relatively large school. Half of the students are in the bottom half of the class. Good for them on the acceptance, but four years later being #600 in your class loses a little luster.<br><br>Money always matters. Imagine what the $200K in a 529 plan would do for your grandkids in a quarter century!<br><br>", "<b>Username: privatebanker</b><br><br>@rickle1 You are right. I meant to note another poster and made a mistake. I tried to fix later but it was too late. Lol.<br><br>", "<b>Username: Twoin18</b><br><br>This is a much easier decision than the other thread with UTD (with NMF full ride) vs Berkeley Regents in-state. Take the $300K any day.<br><br>", "<b>Username: Publisher</b><br><br>Something that has not been mentioned in this thread is that, if I recall correctly, Stamps Scholars enjoy national get togethers &amp; enjoy special counseling from both school &amp; non-school related advisors.<br><br>", "<b>Username: socaldad2002</b><br><br>@Hamurtle Wake Forest is ranked about 45th when you factor in all colleges. 28% acceptance rate and 28-32 ACT range. I would guess OPs son will be in the top 1% stats at WF. Will he be surrounded, pushed, and challenged by his academic peers?<br><br>Stanford acceptance rate is around 4% and 32-35 ACT and is ranked as a top 5 college in the world with some of the best majors and programs around. In addition the job opportunities, the location and weather make Stanford extremely attractive especially if this student wants to stay in CA.<br><br>OPs family is in the top 3% of all wage earners, have saved 200k for this kid's college and has another 4 years to save the balance or take out some loans.<br><br>I cant think of a better way to spend my money than on an education to one to the best colleges in the world. Would I borrow 300k, no, but if my income was top 3% of income I would definitely borrow 100k to to make up the cost difference.<br><br>This kid is going to be fine no matter what college he chooses but why not give him the best education and 4 year college experience you can afford?<br><br>", "<b>Username: CU123</b><br><br>A similar situation a few years ago for Serene Singh, she chose to take the Boettcher scholarship (full ride designed to keep the top students in Colorado, similar to Stamps but not exclusive to one school). She was just announced as a Rhodes Scholar. Kids that get these type of scholarships and admittances are rarely held back by the institution they attend.<br><br>", "<b>Username: hello_you</b><br><br>OP here. Thank everyone for the awesome discussion. @aquapt - that was an awesome post about confirmation of choice. My son is really torn, and these points are helping our discussions. Thanks again for the great points.<br><br>", "<b>Username: roycroftmom</b><br><br>The best education and experience may very well be at WF. There are plenty of unhappy kids at Stanford, and no doubt some at WF too. Rankings do not nessarily correlate with either success or happiness, particularly when they are so close. WF is closer to number 25 in surveys I read, not 45.<br><br>", "<b>Username: EganAg</b><br><br>We are sort of in a similar situation with twins getting into prestigious LACs with full pay and lower ranked LACs with serious merit. Granted they are not Stanford vs Stamps, We have let them make their own decisions. We gave them pros and cons of $$ saved vs prestige. Ill be curious to see what OPs son and my kids will decide.<br><br>", "<b>Username: Puzzeled101</b><br><br>Stanford, for sure if it is affordable. The opportunities are undefeatable. Yea. 300k is a lot of $$$, and although saving for grad is a smart option, 20 years from now, those 4 years @ Stanford will pay off big time.<br><br>", "<b>Username: NCKris</b><br><br>There are variations of these threads every year, full pay at a Top school vs. full ride at a lower ranked school. It really boils down to, what his goals are, where he would be be comfortable and thrive. Stanford and WF are very different environments, and it comes down to fit. Do visit both and make a decision.<br>Disclosure: DS chose an Ivy full pay vs. Merit at Top20.<br><br>", "<b>Username: CU123</b><br><br>My disclosure, paying for DD to attend UChicago but my cost is only $135K vs a free ride at state flagship. Another thing though is like previous posters say DS will be just another student at Stanford. DD was an All American, 4.0 GPA 4.7 W, 10 APs, all 5's blah, blah, blah. By her own words, she figures she is an average UChicago student.<br><br>", "<b>Username: milee30</b><br><br>\"\"Stanford, for sure if it is affordable. The opportunities are undefeatable. Yea. 300k is a lot of $$$, and although saving for grad is a smart option, 20 years from now, those 4 years @ Stanford will pay off big time.\"\"<br><br>Maybe, maybe not. In my close family there is one Stanford grad and one Wake grad. The Stanford grad has a masters in a STEM field and the Wake grad has a bachelors in a STEM field. Both graduated more than 20 years ago. Both are in the top 1% of income but the Wake grad earns more.<br><br>Both are excellent schools and a student like OP's son can do well at either one.<br><br>", "<b>Username: NCKris</b><br><br>Some students get energized surrounded by high achievers and others can get demoralized. Its the classic Big fish vs small fish syndrome.<br>IMHO, finances should not be the main criterion as he OP has indicated they can comfortably afford S. Does it hurt that we could have bought multiple Teslas or paid off our mortgage with the money spent on tuition? Yes, but we dont mind driving older cars and working longer.<br><br>", "<b>Username: rickle1</b><br><br>Great overall thread. A salient point was made about supporting ones decision. That seems unavoidable as OPs S will do great at either and hell never know the other experience.<br><br>Something to consider re the fit issue is the type of experience S is seeking ( beyond the brand) Stanford is incredible but much of the wow factor exists at the graduate level. UG is wonderful too. Wake, like truly fine LACs - really what it is from a practical standpoint ( with the exception of having a top notch UG biz school) - is all about the UG experience . Their UG academics are on par with the best schools in the country. Thats their focus, an in person, intimate, outstanding UG education to prepare students for top careers or top grad schools. Much smaller than Stanford. My guess is a more collaborative environment, etc.<br><br>Fit is a big thing.<br><br>", "<b>Username: jzducol</b><br><br>I may have missed something, but OP has not said anything about the son's intended field of study or his career ambitions. Prestige may or may not matter that much depending on these factors.<br><br>We were in a similar situation last year---full ride with scholarship (at a T15-25 school) vs HYPS full pay. I totally agree that there is no an easy answer as someone pointed out when stakes are high opinions are full of confirmation bias. Our thought process was a bit simplistic--when money is lost you will always have a chance to make it back; when prestige and opportunity are lost they are gone forever. We preferred a situation that was a little more repairable if we were wrong.<br><br>I am not familiar with the prestige and opportunities Stamp will bring. They seem to be on par with those of Stanford to many people on CC here. But outside of certain circles I imagine Stamp is not nearly as well known as Stanford.<br><br>", "<b>Username: CU123</b><br><br>So I'm seeing a trend here, the logical part of us says save the money and go to WF, but the parent in us who sees a child work so hard to get where they are will simply foot the bill for Stanford. My bet is he ends up at Stanford, let us know.<br><br>", "<b>Username: PurpleTitan</b><br><br>@NCKris: \"IMHO, finances should not be the main criterion as he OP has indicated they can comfortably afford S\"<br><br>I wouldn't say that when the OP has stated that they have $250K saved up for the college education of 2 kids and 4 years of Stanford costs $300K.<br><br>Would you like to tell the younger sibling, if she also got in to Stanford: \"sorry, we know you got in to Stanford but we simply can't afford it and you'll have to go to a state school instead because we blew all our college funds on your brother even though he actually got a terrific free Stamps Scholar opportunity at WFU so he gets to go to Stanford but you don't\"?<br><br>", "<b>Username: oldfort</b><br><br>I don't think this is necessary a reward for a kid who has worked so hard. Internationally, Stanford is still a more recognizable name - if it is important to OP's kid some day. For some career it matters more than others.<br><br>", "<b>Username: PurpleTitan</b><br><br>\"when money is lost you will always have a chance to make it back; when prestige and opportunity are lost they are gone forever.\"<br><br>I disagree with this line of thinking. Hopefully, one doesn't die straight after attending undergrad, in which case, there are plenty of opportunities to gain prestige through grad school, companies/positions on your resume, etc. And smart driven kids can create their own opportunities.<br>Money, on the other hand, compounds. You can keep gaining money and spend it, or you can gain money, invest it, and see it compound.<br>Now granted, there are situations where spending the money on education/prestige makes a lot more sense and investing. In a corrupt country where you are an oppressed minority who could gain a huge increase in income by migrating out, for instance. I would say that, as of yet, that doesn't describe the US.<br><br>", "<b>Username: milee30</b><br><br>Some of this decision comes down to whether or not you're a parent who puts the kid's college bumper sticker on your car.<br><br>My friends and I have determined this is a pretty good, if crude and simplistic, metric for how prestige driven a person is.<br><br>", "<b>Username: NCKris</b><br><br>@PurpleTitan<br>My comment was based on how I read OP. , have quite a bit of college savings already and a high income. They didnt mention it anything about being impossible to send the 2nd kid to college.<br>Hope OP comes back with an update!!<br><br>", "<b>Username: aquapt</b><br><br>I'm more of a license plate frame person myself - swag is fine if it also has a function. I hope my demographic is represented in your analysis, @milee30 :smiley:<br><br>", "<b>Username: milee30</b><br><br>\"\"I'm more of a license plate frame person myself - swag is fine if it also has a function. I hope my demographic is represented in your analysis\"\"<br><br>It was a fairly lengthy, wine-fueled discussion that included people of the bumper sticker persuasion and those that prefer to go without, so you can imagine there was a variety of opinion.<br><br>Some of the categories we discussed included:<br><br>- Parents who have a bumper sticker from a prestigious college<br>- Parents who have kids at a prestigious college but who do not have a bumper sticker<br>- Parents who have kids at a nonprestigious college and who have that bumper sticker<br>- Parents who have kids at a nonprestigious college and do not have a bumper sticker<br>- Parents who only put the prestigious bumper stickers on yet somehow leave off the nonprestigious colleges their other kids attend<br><br>I don't remember licence plates entering in the discussion. Guessing there is some critical information we'd need to understand, such as just how flashy and bedazzled the plate is or whether it's just a subtle surround in the college colors. :-P<br><br>", "<b>Username: oldfort</b><br><br>\"\"Some of this decision comes down to whether or not you're a parent who puts the kid's college bumper sticker on your car.\"\"<br>This is rather silly. I could buy a lot of Birkin bags with 300K and I could get a lot more ooh and ahhs than a bumper sticker.<br><br>", "<b>Username: Twoin18</b><br><br>@milee30 How about parents who have the non prestigious bumper sticker but not the prestigious one?<br><br>", "<b>Username: milee30</b><br><br>\"\"This is rather silly. I could buy a lot of Birkin bags with 300K and I could get a lot more ooh and ahhs than a bumper sticker.\"\"<br><br>Nope. You \"show\" the bumper sticker to far more people as you drive around and given how many knockoff Birkins are out there, not to mention how many people have no idea how much one costs or what one is.... the Birkin is only an \"in the know\" showoffy thing.<br><br>", "<b>Username: gallentjill</b><br><br>\"\"- Parents who only put the prestigious bumper stickers on yet somehow leave off the nonprestigious colleges their other kids attend\"\"<br><br>I am not a bumper sticker person, but if I were, I would certainly never do this! Its just awful. By the way, we have strayed far away from OPs original question. Sorry OP!<br><br>", "<b>Username: oldfort</b><br><br>\"\"the Birkin is only an \"how many people have no idea how much one costs or what one is.... in the know\" showoffy thing\"\"<br>No different than colleges. Most Americans wouldn't be able to name all the Ivies. It is silly to think people would send their kids to a particular college just so they could tell people about it. On the other hand, if it matters for future career then it is a complete different discussion.<br><br>", "<b>Username: milee30</b><br><br>\"\"How about parents who have the non prestigious bumper sticker but not the prestigious one?\"\"<br><br>Didn't come up in conversation since none of us knew of any of those.<br><br>", "<b>Username: milee30</b><br><br>\"\"It is silly to think people would send their kids to a particular college just so they could tell people about it.\"\"<br><br>Not silly at all and we see it multiple times a day here on cc. A good example is a kid who applies to all the Ivies.<br><br>", "<b>Username: privatebanker</b><br><br>We are talking about the same Wake Forest, the really prestigious one in North Carolina?<br><br>The one that costs $70,000 per year and has some top students at the valedictorian level considering a gap year because they didnt get in?<br><br>The one known as Work Forest because of the academic rigor and intensity?<br><br>The one with the spectacular and beautiful campus? And all the school spirit?<br><br>And the Stamps Scholar is the one with the national network and way above honors college prestige, access to research and selectivity?<br><br>Im just asking because there are a lot of schools with similar sounding names. Like Lake Forest or Sherwood Forest etc.<br><br>This is the school offering the OP $300,000 and Stamps. Just checking.<br><br>", "<b>Username: oldfort</b><br><br>People have walked away from Duke's Robertson scholarship for schools like HYPS.<br>I think contrary to popular believe, most average people do not talk about where their kids go to school to their friends or colleagues at work. I think other than CC, and with parents with similar age kids, topic of college rarely comes up with people I know.<br><br>", "<b>Username: privatebanker</b><br><br>@oldfort. Of course. You are right about that and it does occur. And no one at work talks about it except when going through the process or we ask how kids are doing at x school to be friendly. No one cares.<br><br>And in some cases it might make sense to not choose the prestigious scholarship for the perceived extra boost an hypsm does for you.<br><br>Every situation is different. In this one with no specific research angle or preference its tough to say. Im working off a 600k need and 200k saved. And child 5 years from starting. Nearly an overlap.<br><br>And skipping Robertson and Duke for Harvard at full pay unless completely cost agnostic or hated duke culturally makes zero sense to me.<br><br>", "<b>Username: PurpleTitan</b><br><br>\"People have walked away from Duke's Robertson scholarship for schools like HYPS\"<br><br>Indeed. That is even harder to understand (unless you have 8 figures in liquid net worth or want to continue a legacy at one of HYPS or something).<br><br>", "<b>Username: ewho</b><br><br>Can't find the original link but this:<br><br><url>http://mathacle.blogspot.com/2013/05/dukes-scholarship-yields-reflect.html?m=1</url><br><br>No offense to Duke.<br><br>", "<b>Username: CardinalBobcat</b><br><br>I'm admittedly biased, but the Stanford experience is just plain fabulous. It's a genuinely \"happy\" place in a way that's hard to describe. The alumni network is very strong. Any graduate can make the wonderful and unparalleled Stanford Sierra Camp a regular part of his or her family's life (and undergraduates can work there.) Alumni events happen locally and throughout the nation and world, and alums can attend various Stanford-affiliated retreats in the Sierras. The campus is beautiful, the Bay Area's intellectual atmosphere is amazing, its cultural diversity (hearing multiple languages literally everyday on the street; regularly befriending people from around the world) is fantastic. The surfing beaches and world-class ski resorts are both within driving distance, and the San Francisco Symphony and Ballet and more are even closer. The personal and institutional connections are lifelong. I would (and did) take on debt to attend. I never regretted it. And with a ~4% undergraduate admission rate these days, I wouldn't ever recommend someone turn it down unless his or her dream was elsewhere. That said, no one can make this decision for you or for your child, and one person's opinion (including mine) is just that. Good luck! I look forward to hearing the final choice!<br><br>", "<b>Username: privatebanker</b><br><br>@CardinalBobcat Just to be clear. No one Ive seen on this thread or at least myself, ever thought Stanford isnt off the charts.<br><br>Its the clearly one of the finest schools on the West Coast and nationally in many respects. Along with Caltech and some others. And maybe the best in the whole country.<br><br>And all you say is 100 percent valid.<br><br>If this were just about anywhere vs Stanford for the same price and access. Stanford wins. If its 50 percent more. Its a closer call. But Stanford wins.<br><br>When its 100 percent more and is missing the National access and on campus resources/treatment a Stamps scholar gets - now we are talking about something different.<br><br>If the parent has money to burn and no other child to educate. Stanford in a toss up.<br><br>In this scenario, its Wake for me.<br><br>And as a future something important, I hope you can use your intellect to step back and look at the totality of things. The long range view and be objective. If you do this with intellectual honesty and still come back with a Stanford, its a no brainer. We will agree to disagree but I will respect that. If its because you love it and its great for you. Thats not conclusive.<br><br>", "<b>Username: oldfort</b><br><br>The selection committee would do better with donut hole families - not eligible for FA, but can't afford full fare. HYPS offer very good FA relative to other schools.<br><br>", "<b>Username: PurpleTitan</b><br><br>Going back to the Duke Robertson vs. HYPS, frankly, even if money wasn't an issue, I'd take the Duke Robertson (so only continuing a legacy would induce me to pass up the Duke Robertson).<br><br>Let's look at a program similar to the WFU Stamps (but with more history): The UNC Morehead-Cain.<br><br>Since 2000, the UNC Morehead cohorts have averaged roughly 1 Rhodes Scholar a year with entering classes 1/25th the size of Stanford's. Stanford would have to produce 25 Rhodes Scholars a year to match on a per capita basis. Stanford does not produce 25 Rhodes Scholars a year. None of HYPSM do.<br><br>BTW, if we're going around comparing acceptance rates, evidently the Morehead-Cain has a 3.4% acceptance rate.<br><br>It's probably even smaller for the WFU Stamps as I believe each school only has a handful of Stamps Scholars.<br><br>", "<b>Username: Happytimes2001</b><br><br>Didn't read the whole thread. My two cents is the people who don't believe in full pay for a top school, never went to one and saw the doors it opens. Over time, the increase in income from the better school ( not only first job but subsequent jobs pays for the better college education<br>). In many cases, it can pay for the better school in ten years. Again, not looking to get into a long discussion about single individuals. For the most part, a better school just greases the wheels.<br><br>Yes, a strong student can do well anywhere. But say you went to Stanford and you can get jobs others cannot, which are often in lucrative fields. Second thing to consider, grad school matters but again Wake forest is not going to be as impressive as Stanford to AO. Still, you have $$ saved and good options. Just talk to someone who actually went to Stanford and graduated years ago and ask if they think they could have taken the same route by going to a school like Wake Forest. In some cases, the answer will be yes and in many it will be a resounding no.<br><br>", "<b>Username: CardinalBobcat</b><br><br>@privatebanker I hear you. Again, as someone who personally took on significant debt to attend Stanford two decades ago, with absolutely no regrets, I don't need to \"step back\" very far to evaluate the totality of the situation. Mine is just one perspective, and the OP is asking for multiple perspectives -- fortunately without the need for us all to form a consensus. I am glad others have shared their knowledge about the Stamps program and offered wisdom of all kinds regarding finances. I can only offer my own $0.02 to the OP, which hopefully is helpful in the overall mix of excellent information provided here.<br><br>", "<b>Username: Happytimes2001</b><br><br>@PurpleTitan Yes, I'm sure those stats are all valid re: other scholarships. But how many people know those stats outside of CC? How many hiring managers care a hoot that you had a Stamps scholarship or any other at UNC? Outside of a Rhodes scholarship, none of these merits are well known in the sense that they are going to open doors. Great you get to be the best of the best at a school that isn't the best. I'm not sure that gives you as much as a university with a world wide reputation. I personally wouldn't send my kids off to the best scholarship at a lesser school unless the school had a better program in the chosen major.<br><br>", "<b>Username: privatebanker</b><br><br>@Happytimes2001<br><br>I went to a state school and Ivy for grad. Wife and fil are Harvard grads. Im only one poster but sorry your point isnt accurate.<br><br>And i work on a day to day basis with some of the most academically accomplished and financially otherworldly people on the planet. What you say is partially true. But your premise is wrong.<br><br>I would say to be completely honest. That Private equity and consulting it matters where you went UG But it isnt just hpysm. The elite group is bit longer of a list than this in real life. It is also impressive upfront to go an Ivy or hpysm. And a real head turner when the new guy or gal shows up. Not saying it isnt impressive.<br><br>But after two minutes you are on your own.<br><br>And all other industries it has no long term bearing whatsoever.<br><br>However hpysm for Professional schools do come up a lot including stern and duke level for b schools. But most executives have already been spotted as a talent and apply some years into their career.<br><br>Med school and law school no one really cares where you went undergrad. And you can get into any great med or law school from pretty much anywhere in the top 100 or 200.<br><br>I dont want list presidential colleges again. But other than the bush cohort its a big zero for hpysm undergrad back to LBJ. I can also list current presidential hopefuls. Even the one who cant be named started at Fordham before Wharton.<br><br>As far as Fortune 500 CEOs. Undergrad Ivy is a resl outlier. You as easily find way more Tim Cook from Auburn stories than a Jeff Bezos from Princeton.<br><br>Someone must have opened a door for them too? Or they helped open it themselves. Probably a little of both.<br><br>And in this example we are taking about an elite and highly selective school. With a vibrant alumni network etc. Im awake Forest.<br><br>", "<b>Username: privatebanker</b><br><br>@CardinalBobcat Cool. But selection bias and personalization are a thing too. I am only obeserving from afar with a few more years under my belt than you but respect your opinion. I attended neither and dont know the OP. Either way is great call. Just not as easy to say when your writing a check for multiple kids and retirement facing you down.<br><br>Youll hopefully see one day. But I do appreciate the insight from your perspective too.<br><br>", "<b>Username: roycroftmom</b><br><br>@happy times, not only did I go to a top school, but 11 members of my family also attended that same HYPSM (yes, we have paid way too much tuition in the last 50 years). And I would still say the differences between the schools in question are negligible, and not worth the cost difference. And yes, I also knew friends who accepted UNC Morehouse and turned down HYP, and were very happy. There are just a handful of PE and hedge funds, and perhaps MBB in consulting, which would care at all, and the Stamps scholarship would override any concerns those firms would have. Both are fine schools with great outcomes possible from either-and those same family members who now work at MBB and in PE from HYPSM agree with me.<br><br>", "<b>Username: roycroftmom</b><br><br>@cardinalbobcat, I am glad you enjoyed Stanford. It is a great school. But like all schools, it has changed greatly in the last few years, particularly with the techie vs fuzzy tensions on campus. The undergrad women I know there currently are generally fairly satisfied with their choice, but it is no nirvana for them. I expect the same is true at WF. Our golden memories of undergrad in a different century don't have much value to those assessing their options today.<br><br>", "<b>Username: Twoin18</b><br><br>\"My two cents is the people who don't believe in full pay for a top school, never went to one and saw the doors it opens.\"<br><br>I went to one, I know it opens doors, I still see it in my work all the time. But I also see from my D's program how much a cohort based full ride at a lower ranking school offers in that regard too. And it comes with money in the bank afterwards (enough for a large down payment on a house or to pay for a Stanford MBA if that's your thing). Has anyone asked the student if they actually want to be forced to work in \"lucrative fields\" to accumulate that money?<br><br>", "<b>Username: CardinalBobcat</b><br><br>@roycroftmom, thanks for offering this perspective about current techy vs fuzzy tensions. Personally, although I am indeed decades past my own university days, I'm still involved on campus and know many current undergraduates. I'm glad we can all offer diverse perspectives to the OP, which is what is being asked of us. Most of my comments were focused on the regional benefits and the alumni opportunities, and I also stand by my remarks about the positive campus culture. But not everyone needs to say the same thing or feel the same way, and that's the real benefit of a discussion thread asking for people's thoughts and advice. Hopefully, when everyone's input is offered, the OP will feel that the various bits and pieces we've all provided will help make a difficult decision a bit clearer.<br><br>", "<b>Username: hello_you</b><br><br>OP here. I've been tempted to jump in a few times, but I don't want to mess up the exchange of ideas. I sincerely appreciate both sides of the argument presented and great anecdotes that have been shared.<br><br>A few people have mentioned my younger child. She is a great kid that is her own person. Her grades are good, but much more in line with a \"typical smart kid\". Our son has been extremely impressive since he could talk. They're just different. So I would be surprised if she seeks out a national university.<br><br>Thanks again for the awesome dialog. I will certainly provide updates as they become available.<br><br>", "<b>Username: LoveTheBard</b><br><br>My $.02:<br><br>First of all what a wonderful problem to have -- congrats to your son!<br><br>As to the question at hand, my answer is: It depends on your unique situation and your son's future plans.<br><br>If your son is planning to go to law school or med school, it probably doesn't matter as much where he gets his undergraduate degree. He may well want to save the money for his future studies. If the money is not going to make a huge difference in your lifestyle, affect your retirement, or limit your other children's educational options, Stanford is an amazing place and I'd choose it in a heartbeat over the Stamps at Wake.<br><br>My daughter had a similarly difficult choice -- while perhaps not a full ride, she was offered full tuition scholarships from such schools as Wash U. in St Louis, Vanderbilt, USC (California), Grinnell, etc. and turned them all down to attend Stanford at nearly full pay. She is over the moon there and we are blown away by the opportunities she has had; she doesn't regret her decision for a second and neither do we.<br><br>That said, D is an only child so there are no other children to send to college. Retirement will be covered through savings and a generous pension plan (a rarity these days!). We are comfortably upper middle class (what might be described as \"donut hole\" family on CC.) Income-wise, we are certainly not in the top 1 or 2 percent, but probably in the top 10%. Stanford is a sacrifice, but one we would gladly do again if given the option.<br><br>I disagree with @privatebanker's assertion that one will have \"the same exact (and I mean exact) grad schools to choose from\" and that the choice only matters if the goal is just undergraduate school. My D, for example. plans to pursue a PhD in the humanities. In academia -- unlike law and med school or MBA programs -- where you get your degree from matters a LOT if you want to get into a prestigious doctoral program (pretty much a necessity if you want to succeed in her chosen field of study) or get important research grants and fellowships.<br><br>My D absolutely did NOT want to be a big fish in a small pond -- she wanted to be in a place with a LOT of really smart students and professors...Her HS experience didn't provide the level of intellectual engagement or social environment that she craved at that she found when she was at TASP. She has found it in spades at Stanford! Do I think that my daughter have been equally happy at USC or Vanderbilt than she is at Stanford?<br><br>To be honest, there are few things in life that live up to their hype. Stanford is truly one of them.<br><br>Can a person succeed in life equally well with either choice? Absolutely! There are no bad choices here.<br><br>", "<b>Username: LoveTheBard</b><br><br>@roycroftmom and @CardinalBobcat - Yes, there is a big fuzzy/techie divide, but what my D has found is that lots of techie types are also quite artsy and do not denigrate the humanities. She is finding *tremendous* support among the faculty and with her fellow students. Stanford has some of the top humanities programs in the country -- certainly on a par with HYP. And the fact that so few students go to Stanford specifically to study the humanities and want no part of a STEM program, the faculty is incredibly supportive and accessible (the head of the department offered for my daughter to do a 2-quarter independent study with him her freshman year!)<br><br>Stanford has been making a concerted effort to beef up its arts programming. Having already achieved a reputation of being a leader in STEM fields, it wants to build on its arts programming and is putting some real $$ into them through its well though out \"Arts Initiative.\"<br><br>", "<b>Username: warblersrule</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/hello_you\">hello_you</a> wrote:\"\"<br>To be fair, bias is to be expected. Few posters have set foot on Wake's campus, while many more have visited Stanford. If your son has visited both schools, he is in a better position to choose between them than most.<br><br><br>Wake is a great school with a good quality of life. He could hardly go wrong with choosing the scholarship there unless he's deeply interested in a field that Wake does not offer or one in which it has limited offerings. Most notably, engineering is still in its infancy at Wake.<br><br>I do not entirely agree with LoveTheBard's take on PhD program admissions, but that is something so variable by field that generalizations are useless.<br><br>", "<b>Username: Clone1461</b><br><br>Go to Columbia.<br>Grad school can be funded eith fellowship/TA/RA.<br>You still have time to earn enough foe your D's education. Who knows? She may get a full ride somewhere too!<br><br>", "<b>Username: JBSeattle</b><br><br>Stanford is one of the few schools that are worth the full price tag in my opinion. I went to HS across the street and Stanford provides an unparalled alumni network.<br><br>However, a free college education at Wake Forest is pretty incredible. Maybe you could split the difference and gift a good chunk of change upon graduation.<br><br>Fortunately either choice is great. It is not an obvious decision and some unstated variables should influence the final decision.<br><br>Best of luck OP!<br><br>", "<b>Username: ProfessorPlum168</b><br><br>A $300K difference is too much, especially when WF is a very good school. Unless youre going into CS. Anything but CS - where you can go undergrad to WF and then to a Stanford for grad school, thats what I would do. Also dont discount the fact that the NC high tech scene is very up and coming and the growth potential is much higher.<br><br>", "<b>Username: itsgettingreal17</b><br><br>@Happytimes2001 Its funny you should say that as I think its quite the opposite. I went to two top 5 schools, and I often think those who fetishize a few select schools on CC didnt attend one, as I just dont see the same reverence for these schools from my classmates or alumni of elite schools generally. If you compare the outcomes of Stamps Scholars and other graduates of elite scholarships with HYPS grads you will find no difference on average. Im amused by those who think attending an elite school is a $300k golden ticket.<br><br>", "<b>Username: gallentjill</b><br><br>\"\"Didn't read the whole thread. My two cents is the people who don't believe in full pay for a top school, never went to one and saw the doors it opens\"\"<br><br>Not true. DH and I both attended top schools and both ended up in a top grad school along side students from other top privates as well as state schools and schools I had never heard of. Grad school opened many doors for both of us. UG has not.<br>\"\"I disagree with @privatebanker's assertion that one will have \"the same exact (and I mean exact) grad schools to choose from\" and that the choice only matters if the goal is just undergraduate school. My D, for example. plans to pursue a PhD in the humanities. In academia -- unlike law and med school or MBA programs -- where you get your degree from matters a LOT if you want to get into a prestigious doctoral program (pretty much a necessity if you want to succeed in her chosen field of study) or get important research grants and fellowships.\"\"<br><br>I think this is the crux of the issue. The intent matters. Banking and Wall street are often brought up in these kinds of discussions, but there are other areas as well, where the UG matters. There are times where a school offers something unique that make it worth the price. For example, I can see a film student's family stretching to send her to USC. In our case, D19 will be accepting her most expensive option (although not nearly fully pay) because it offers a program she absolutely can't get at other schools.<br><br>Luckily for you, there are no wrong answers here. You have two amazing choices.<br><br>", "<b>Username: privatebanker</b><br><br>@LoveTheBard Thanks for the shout out!<br><br>Sorry if it wasnt clear. I was discussing professional schools law med and b school only. So it appears like we actually agree on that narrower group. Thats what I had intended to say in any case.<br><br>Provably a function of the mcat lsat and gmat allowing for a broader group to acces these opportunities.<br><br>I am sure your daughters experience is representative.in the humanities. I have no idea and trust you on this.<br><br>", "<b>Username: Happytimes2001</b><br><br>OP, I do think @Twoin18 raises a great point, which is, what are your son/daughter's future plans? If they plan to go into some careers, it will matter. If they plan to study something that isn't germane to making money or earning a high income due to a knowledge career, then that's another path.<br><br>Some kids want to study a subject in which the job opportunities are not altogether that lucrative. Others want to go into a career where you are evaluated based on your knowledge ( part of which is your education). Try selling WF to a client in some fields. Then try selling Stanford. Yep, there's a difference.<br><br>Some people will pay for the difference, some will not. Personal choice. $300 K over the course of a career ( if you do the math and think it's worth 7ishK per annum). My experience has demonstrated that those with a top education often earn far more than those with a standard/good education. ( In all the fields I have worked in that translated into far more than 7K per annum). Again depends on the fields OP pursues. Also, this doesn't appear to be the case where a kid takes on so much debt that they are burdened for two decades. The parents have resources.<br><br>In terms of post graduate, it really depends on the program. The student might pursue a Phd and cost will be negligible, or they might pursue an MBA which might be very costly. Again, begin with a plan and you will have different results.<br><br>", "<b>Username: roycroftmom</b><br><br>I appreciate your insight, happytimes2001, but you base it up on the assumption that of course there will be career differences based on college choice. For a very few, that may be true. But 394 Stanford students were rejected from Mckinsey offers that year, and they probably did accept someone somewhere who went to WF. It is just not the case that 400, or even 40 Stanford kids will end up at McKinsey-4 kids accepted their offers that year. So for a few, it may matter, but they likely will end up in the same place regardless, usually sorrounded by people who attended \"lesser\" schools. I know of no workplace or grad school composed exclusively of HYPSM grads, and all schools have different strengths and weaknesses. A different relative attends a small school far down the prestige chain from these schools, but that college runs circles around HYPSM in career prep and services for their students. Being the best, overall, does not mean the best in everything nor the best for your student.<br><br>", "<b>Username: Happytimes2001</b><br><br>@roycroftmom Good points. I think it does depend on career choices. But it extends beyond Mckinsey and the consulting world. ( Though that world is replete with people from the same schools). I actually did work in a company that only hired HYPSM grads and it wasn't pretty. (MIT on the tech side and another school on the business side-turned into a study in dysfunction).<br>Every kid and parent wants different things. Ideally, I think fit is very important. For the intellectual kid, the resources at a place like Stanford are going to be pervasive rather than a group of select scholars. That means something. Not to mention the alumni network ( being able to call on thousands rather than hundreds).<br><br>", "<b>Username: gallentjill</b><br><br>deleted<br><br>", "<b>Username: Hoggirl</b><br><br>OP - we were in a similar position during dss cycle, though the full ride(s) were at MUCH lower-ranked schools. Ds received a full-ride at one school that had a Stamps, but he did not receive the Stamps there. He also received merit at a T20 - not full tuition but sizeable/significant. When he narrowed his choices, his top three were one of the full rides, the T20 offering merit, and Stanford at full-pay. Without knowing how much your + is over your income of $300K, we were similiarly situated to you financially, though we had about $230K saved and ds is our only. The full ride at the lower-ranked school had a program in a field that ds was strongly interested in at the time. Stanford had been and was the *dream* school, but my ds is pretty pragmatic. He somehow developed a spreadsheet with weighted factors for pros and cons for each of his top three choices and each school was scored. We used what I call the pile approach. The monies we had saved were dss pile. He could use that $230K as he saw fit to fund his education. If he chose full-pay at Stanford, that was going to suck up the entire pile (we were fine with covering the other $30-$35K needed over the four years he would attend). If there was money left in the pile at the end of his undergrad (because he chose one of the lower-priced options), the remaining balance was for him to use for grad school or travel or any other reasonable expenditures (save, car, toward a house purchase, etc). He knew going in that if he chose Stanford he would be on his own for graduate school should he pursue that. Med school was never on his radar.<br><br>Ds chose Stanford. There have been many allusions on here to certain career paths, post-graduate plans. Since you have not stated what those might be for your ds, I do think it makes it more difficult for folks to weigh in. Ds is now in MBB consulting, and I agree with others that for certain (narrow) fields where one attends undergrad matters. I also agree with the poster that attending one of those undergrad schools certainly does NOT guarantee a pathway into one of those fields. The competition is strong, and the number of actual hires is few, at least for MBB consulting (not sure about banking). The opportunity is there for his firm to cover tuition plus some living expenses for an MBA under certain circumstances. They wont cover it just anywhere. I am not sure of all the ins and outs of how it works, but that is now his circus, not mine.<br><br>I never understand the he can go there for grad school statements. That is not guaranteed. Of course, without knowing your dss plans, whether or not grad school needs to be factored in is an unknown.<br><br>Your ds is clearly an intelligent young man. I understand wanting to guide him and get all the perspectives that you can. But, IMO, it is ultimately *his* decision. Tell him his pile amount and stop talking about it to him. Give him some space to ponder. He still has a month to decide. He needs to own whatever he decides. Revisit (or visit) both schools if possible. It took my ds about a week to reach his conclusion, and it was really hard for me not to talk about it/ask what he was thinking over and over again. If your ds wants your views, hell ask. If the pile for Stanford doesnt work because of little sister, then take it off the table.<br><br>As someone who is an only child and who has an only child I am probably not the best to weigh in on equity among siblings. Providing BOTH of your children with a debt-free undergraduate degree seems fair, to me. You have indicated that little sister is likely not going to be attending the same caliber of university as her brother. Level of elitism and level of price are not, however, correlated. Only you can know how much you can save for little sister over the next four years. Only you can know the family dynamics of fairness and equity and what that means in your household. To me, making sure the dollar amount is even is irrelevant, but obviously others differ and believe each pile should be exactly the same.<br><br>All the best to your ds as he decides. Please let us know the outcome.<br><br>", "<b>Username: AlmostThere2018</b><br><br>Great advice here and congrats to your S!!<br><br>What does strike me is that it does seem odd to offer full-pay to your oldest child IF that means you might not be able to do so for your younger child. If the plan is to build up your savings so you can have the same resources for her in 5 years, that's fine.<br><br>But even if she's not likely to go to such an elite college, telling your younger child she has to go to public U does seem 'unfair.' What if her best fit is a small, private that is not super selective but doesn't offer her merit? If that's where she might grow and bloom the most, but all the $$ went to Stanford, that doesn't sit well.<br><br>This is coming from the perspective of being the youngest of three kids in my own family and a parent who has told 2 kids their max budget -- and it's the same for both.<br><br>", "<b>Username: Publisher</b><br><br>FWIW The Stamps Scholarship award varies among its 30 something partner schools. At some schools, Stamps covers only two years. Not sure, but I believe that the Stamps award at Wake Forest University is the most generous in that it is a full ride for four years plus stipend.<br><br>", "<b>Username: milee30</b><br><br>\"\"A few people have mentioned my younger child. She is a great kid that is her own person. Her grades are good, but much more in line with a \"typical smart kid\". Our son has been extremely impressive since he could talk. They're just different. So I would be surprised if she seeks out a national university.\"\"<br><br>OK, but even if she doesn't seek out a national university unless she's going to community college or your state's public colleges are a great fit and heavily taxpayer subsidized, all that means is she's unlikely to get a full tuition scholarship so you'll be looking at full cost for whereever she goes. And if you haven't already made this disheartening discovery, there's not a huge amount of difference in the cost between Unknown Podunk U type colleges and a Stanford type college. So if she wants to go to any private college or your state schools aren't heavily subsidized, you'll be looking at paying approximately as much for her to go to college as your son if he goes to Stanford at full pay. Do you have the ability to pay for that for her or will you tell her she can't choose a college that costs the same amount as you paid for your son to go to college?<br><br>", "<b>Username: Riversider</b><br><br>In the end its a very personal decision. Everybodys needs, resources and mindset is different. Do whats right for you. Both opportunities are great.<br><br>", "<b>Username: Twoin18</b><br><br>I do think there's a tendency to forget quite how much money is involved, it can seem like it's just \"a lot\" whether it's $100K or $300K, though in reality that makes quite a difference for things like buying a house etc.<br><br>But you can always try putting out ten $20 bills on the table, thinking about how you'd feel about ripping them up, and telling yourself that's what you'd be doing every day for the next four years.<br><br>", "<b>Username: cptofthehouse</b><br><br>We had similar choices, and we went different ways with different kids. We laid it all out and offered the cost differential as graduation presents to the kids. The one who chose the state school was able to fund his lean years as a poor starving artist with the differential. He enjoyed his college years immensely. My kids, like yours, had the privilege of a choice.<br><br>", "<b>Username: Setter4life</b><br><br>Based purely on rankings, Stanford is ranked 7 and Wake Forest is ranked 27. Stanford will NEVER be worth $300K more than the Stamp Scholarship at Wake Forest. Never! Both Schools will open doors, but Wake Forest awards 10 of these scholarships a year. That amounts to 100 Elite students every 10 years which is a small network by itself. The opportunities are endless. I get the prestige that comes with graduating from Stanford, but $300K more than Wake Forest? Nah<br><br>", "<b>Username: hello_you</b><br><br>\"\"Do you have the ability to pay for that for her or will you tell her she can't choose a college that costs the same amount as you paid for your son to go to college?\"\"<br><br>@milee30 Yes - We definitely plan on paying for my daughter's undergrad.<br><br>All - I've seen the question about my son's plan of study repeatedly. I wish I knew.<br><br>", "<b>Username: socaldad2002</b><br><br>The bottom line is if you take away the money factor, which college is the better fit for your son long term?<br><br>Maybe I am in the minority here but the 4 years of college at an elite school like Stanford stays with you the rest of life and is not just about prestige; the quality of peers, faculty best in class, top 10 programs, and alumni connections is incredible. These colleges were meant to have students like OPs son attend and there is a reason a 2nd tier college like Wake is throwing a bunch of money at this same kid.<br><br>", "<b>Username: privatebanker</b><br><br>@socaldad2002 Totally agree. But the missing point is perhaps someone from Cali might not understand that Wake is also an elite school. With nearly the same exact type of student quality and atmospherics.<br><br>", "<b>Username: socaldad2002</b><br><br>@privatebanker thats my point, if the scholarship is taken away which college would the student choose and why? If Wake is just as good (or better) than Stanford than its an easy decision.<br><br>The other great question is if Stanford gave the student a full ride and he was full pay at Wake, would he choose to still attend Wake? Why not if they are equally elite colleges?<br><br>", "<b>Username: itsgettingreal17</b><br><br>@socaldad2002 Calling Wake a second tier school killed any little credibility you had left on this site. Smh<br><br>", "<b>Username: got2laugh</b><br><br>@socaldad2002 LOL! Wake Forest is NOT a second tier college and Stanford for sure is not $300K better than the opportunity at WF. This is one brilliant kid who will do well no matter where they go. By the end of the day, only the OP knows their financial situation and perhaps the $300K difference is meaningless. If that is the case, they know the answer to the question.<br><br>", "<b>Username: NCKris</b><br><br>Wake Forest is not in the same tier as Stanford, and that is precisely why they try to attract high caliber students with merit aid. WF is #27 and Stanford is #1 or 2.<br>It comes down to fit and other intangible factors and intended major. If you want CS or engineering, go to Stanford. For Business or Communication or undecided, and if you can see yourself happy at WF, go there and save the money.<br>Please do come back and give us an update.<br><br>", "<b>Username: jym626</b><br><br>Wake is certainly a good school (some call it Work Forest, lol), but I am not sure Id use the word elite to describe it. It is a very pretty campus, but a completely different feel than Stanford. Where are you from, OP? Is religion an issue? For instance, a Jewish student might not feel as comfortable at Wake. My. DS #2 felt this way and didn't consider it. Just a FYI.<br><br>", "<b>Username: anon145</b><br><br>the logic that causes Duke to be eliminated for full ride at wake but not Stanford, makes no logical sense. The same logic should apply. investment banking/Venture capital might be the one area to still use logic for, but outside of that, similar logic of Duke vs. Wake should apply<br><br>", "<b>Username: Rivet2000</b><br><br>April events for admitted students might help shape your decision. You should also take deeper dives into a few selected majors at both schools. Look for differences/similarities in several of the areas commonly raised on CC: depth and breadth of classes, class availability, faculty strength, ease of changing majors, and ability to engage with meaningful research.<br><br>", "<b>Username: Publisher</b><br><br>As illustrated in an earlier post in this thread, even the A.B. Duke scholarship at Duke University only had 8 takers out of 22 offers in 2012. The A.B. Duke scholarship is designed to get exceptional students to attend Duke rather than Harvard, Stanford, Princeton or, possibly, Yale &amp; MIT.<br><br>Wake Forest University is an excellent school. The issue is whether or not the Stamps Scholarship will open up as many or, at least, enough doors as Stanford University for one for whom money is not a significant concern.<br><br>", "<b>Username: socaldad2002</b><br><br>First off I think it's appropriate to not call Wake \"elite\" and is certainly a 2nd tier college if we are looking at the very top colleges in the U.S. (i.e. they are not Top 10 or even Top 25). Let's take emotion out of it and look at the following:<br><br>Stanford:<br><br>Ranked Top 5 in the U.S. by pretty much everyone's standards.<br>World Ranking: #3 (Times Higher Education)<br><br>#1 in Psychology, Environmental Science (Niche)<br>#2 Biology, Computer Science, Economics, International Relations<br>#4 Math, Communications<br>#5 English<br>#7 Political Science<br>#10 Best Professors<br><br>#2 Hardest Colleges to Get Into<br>#2 Best Colleges in America<br>#2 Best Value Colleges<br><br>4% acceptance rate (one of the lowest in the nation)<br>ACT Score 32-35<br><br>Wake Forest<br><br>Ranked #45 in the U.S. (Niche) and #62 (Times Higher Education)<br>World Ranking #251-300 (Times Higher Education<br><br>#3 Best colleges for Kinesiology &amp; Physical Therapy. (Niche)<br>No other Top 10 rankings<br><br>28% acceptance rate<br>ACT Score 28-32<br><br><br>Again, if the cost to both colleges was the same, would this even be a discussion?<br><br>", "<b>Username: cinnamon1212</b><br><br>All I can add to this discussion is to say that 30 years after I graduated people are still impressed that I went to Stanford. People make snap judgements-- they shouldn't but they do -- and it's nice to be pigeonholed as smart/impressive/whatever they think. Similarly, no one is impressed with my undergraduate institution, even though I'm obviously the same person who went to both.<br><br>As everyone has said, there really isn't a wrong answer here.<br><br>", "<b>Username: roycroftmom</b><br><br>Anyone who uses college niche for rankings unrelated to alcohol consumption is not to be trusted.<br><br>", "<b>Username: rickle1</b><br><br>Someone upstream mentioned religion regarding fit, a Jewish kid not being comfortable etc. I think those stereotypes are vastly overstated. Full disclosure - we are Jewish and S attends Wake. He is very happy and very comfortable. There is actually a decent size Jewish population on campus. Although S doesn't attend many faith based events, Hillel is quite active. I did see a picture of S posted by Hillel last Passover as he attended their Sedar. I was actually in shock he attended until I saw the young lady he was sitting next to... and then he told me \"she made me go...\" I get it sonny boy!<br><br>Anyway, very inclusive community. No worries there.<br><br>", "<b>Username: privatebanker</b><br><br>There are 48000 seats available in the USA for the entirety of all schools with less than a 30 percent acceptance rate. There are 3.3mm grads and 2.4mm college aspirants.<br><br>Obviously both Stanford and Wake are in this small pool of highly selective schools.<br><br>Aka elite.<br><br>If the top 2% of all students in the USA arent elite then we have big problems. And nice way to view the other 98 percent of students. They must be Neanderthals.<br><br>Stanford grads above all should understand statistics.<br><br>So are Stanford students a half percent more elite than wake. If such a thing exists. Perhaps. But we are comparing to a population here when saying a school is elite or not.<br><br>Yes navy seals maybe on average more elite than special forces. But both are elite compared to the armed services population.<br><br>And a Stamps scholar at Wake Forest is not only special forces but more akin to a delta unit. Just as elite as any navy seal.<br><br>And the duke scholars comparison makes no sense. We dont know where they went and hpysm maybe with great financial aid. Or parents where the cost is a rounding error.<br><br>In this case, with this family its a great option to look at Wake.<br><br>Second tier. How elitist and misguided in terms of the long arc of life. And the inumerable accomplishments of the students and professors.<br><br>And the selection bias is palpable.<br><br>No one is diminishing the achievement or status of another by offering good practical advice.<br><br>", "<b>Username: roycroftmom</b><br><br>Just for fun, if OP thinks Wall Street/IB/consulting may be in the student's future plans, s/he should post this question on the forums section of Wall Street Oasis. I think the results would be eye-opening to many people.<br><br>", "<b>Username: rickle1</b><br><br>^ Actually, I know what they'll say because I've posted that in different forms at different times on WSO (S is looking at Corp Banking or Consulting, not IB - has IB workshops on campus all the time). Using the context of target, semi-target and non target I asked the question: What is good placement? WSO IBers go on and on about placement, target schools, etc.. Per Wake's First Destination Report, year over year, out of roughly 200 finance and econ majors, banking takes about 50 - 60 kids. Most of these are front office BB IB jobs (More NYC than Charlotte). Some regionals but several BBs. The WSO audience told me that was great placement and that Wake does well on the street, just doesn't get the at bats of, say, UVA. The further north you go, the better. I can tell from S's experience, the alumni reach is there, and yese, he'll need to network more than the kid from NYU or Wharton or Harvard but it's still doable measured by 50 -60 do it each year. Consulting is tougher primarily because it's a smaller universe (fewer shops).<br><br>", "<b>Username: warblersrule</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/socaldad2002\">socaldad2002</a> wrote:\"\"<br>In case you're not familiar with Wake Forest, its PhD programs consist of a half dozen tiny programs in the sciences. Last year Wake produced 30 PhD students, whereas Stanford graduated 530 PhDs in STEM fields alone. One may as well compare Berkeley to Dartmouth or Wesleyan and bash the latter for their comparative lack of top 10 graduate programs.<br><br>Wake is really more of an overgrown liberal arts college with some attached professional schools than a major research university. As I've pointed out before, a mere 1% of classes at Wake have more than 50 students -- a smaller percentage than at many of the top LACs such as Middlebury (1.3%), Williams (2%), Bowdoin (2.2%), Swarthmore (2.7%), Amherst (2.8%), Wesleyan (3%), and Harvey Mudd (4%).<br><br>", "<b>Username: privatebanker</b><br><br>@socaldad2002 If they were all free as you mention, I think for most, but not all people would choose Stanford, over pretty much every school except for HYPM and Caltech. But not all. The vast majority would choose Stanford any other school by comparison. But some would choose others for various reasons.<br><br>But this scenario is not cost agnostic. And very few scenarios are with todays educational price tags. And even less people are as fortunate as this family with significant savings and high income. Imagine the vast majority in the donut hole.<br><br>Would you go into debt or as in this situation - prevent you from purchasing the second important item down the road - for the free but nearly as good item.<br><br>Mercedes Benz SL 550. 110k. Ranked number one in all its categories. Status symbol. Beautiful and known outcome of a tremendous vehicle.<br><br>Mercedes Benz E550. 70k. Same reliability regarding its ability to get you to the intended destination. Not quite as good. Not quite the same status level.<br><br>Both elite cars. Compared to ones 200k miles used whatever car.<br><br>Of course the s class is more desirable.<br><br>But what if the brand new e550 was completely free. And they would throw in some people to help you drive?<br><br>Kind of silly to buy car one in my honest opinion.<br><br>Especially since its about the driver ultimately and not the car to get you where you want to go in life. And sure maybe a few connections and s class enthusiasts will open a toll road for you once in a while. But not worth it when you have the abiiity to open the gate yourself.<br><br>", "<b>Username: Happytimes2001</b><br><br>Sounds like some think Wake Forest is a great place. And some think the $'s worth the Stanford diploma. What I always think about when paying tuition is, what kind of a thinker is my kid becoming? Is my kid getting an education that suits him/her. Are they being stretched. What kind of kids are in the classroom with mine? How did they get there? Let's face it, not all kids go to school for intellectual rigor. Many go, else, they wouldn't get a well paying job. Some go for other reasons.<br>It's not elitist to get the best education for your child. Is the OP willing/able to pay for it? The numbers are huge. Sometimes I am willing to pay for expensive things and sometimes, I am not. OP will have to make the final calculation.<br><br>", "<b>Username: Rivet2000</b><br><br>Will be interesting to hear feedback from the student after visiting. Does anyone have firsthand experience with the two campus cultures?<br><br>Numbers from 2017-2018 CDS. Wake number first, then Stanford:<br><br>C1. First time, First Year Admissions<br>applications 13,071 40,073<br>admitted 3,604 2,085<br>enrolled 1,349 1,703<br><br>C9. SAT scores 75th Percentile Scores<br>Reading/Writing 710\t760<br>Math 730\t780<br><br>Percent in 700-800 score range<br>Reading/Writing\t33.46% 72.9%<br>Math 46.38% 75.5%<br><br>C10. High School class rank<br>Percent in top tenth of HS grad class 77% 94%<br><br>", "<b>Username: roycroftmom</b><br><br>I guess it comes down to how one defines \"elite\". I'm certain OP can receive an elite education at either school. On a somewhat related note, my good friend drives a ferrarri. I'm welcome to borrow it whenever. I guess some people find the car \"elite\"; I find it hard to get in and out of, too noisy, messes up my hair with the roof down and there is barely room for a decent-sized handbag. Beauty and value are in the eyes of the beholder. To each his own.<br><br>", "<b>Username: ewho</b><br><br>If you think that you can understand math, not just think in math, read this:<br><br><url>http://mathacle.blogspot.com/2012/01/stanford-or-harvardyaleprincetonmit-or.html?m=1</url><br><br>", "<b>Username: privatebanker</b><br><br>@ewho I love that data. Thanks for sharing. Although 2012 and 2013 are already the Stone Age as this process has evolved in the last few years.<br><br>It is exactly as one would expect. Stanford loses no more than 2% or 13 students per school outside of hypm. Including Cal etc. that makes sense to me. 40 students may choose another school.<br><br>Many others who attend elsewhere, who are Stanford qualified but choose to not apply for fit, financial or some other reason.<br><br>So it makes sense that someone who takes the time to apply to a school as good as this would attend if admitted and no other data.<br><br>This appears to say approximately 40 students would choose somewhere other than Stanford after being admitted other than hyp.<br><br>My suggestion is only that one of these should be a Wake Stamps scholar, a few to Duke and a Jefferson or two. And the others probably at Cal or Amherst/Williams or Pomona etc.<br><br>And none will be any worse for it over time.<br><br>", "<b>Username: privatebanker</b><br><br>Thread note.<br><br>I used a car example that was directional only. I dont know cars at all. I made up an example. Lol.<br><br>Please feel free to use whatever car comparison and figures that work !<br><br>The larger point can be seen - I hope, regardless of one being a convertible and the other bring a sedan etc. lol.<br><br>The point being, Mercedes Benz is an elite category but there are gradations in that tier. However, would one prefer the free e class over the full cost s class?<br><br>It depends, is what this thread leads me to believe.<br><br>", "<b>Username: hariputralake</b><br><br>What about 20 K @ Harvard and 21 K @ Standford each year versus full merit scholarship plus stipend on two top 20 school?<br><br>", "<b>Username: privatebanker</b><br><br>It would help to know<br>- What are the other two schools?( for fit)<br>-Plan of study?<br>-Your personal preference?<br><br>", "<b>Username: scout59</b><br><br>Obviously, neither school is perfect. As a Wake alumna, all I can speak to is this: while youre considering your choice, make sure that Wake Forest would be a good fit socially for your child.<br><br>Its a small school with a definite culture. When I attended, it was preppy, conservative, and heavily Greek. I know its different now with a somewhat different vibe, and I know that most kids can find their kind anywhere. Just remember that at a school of 5000 people, it may be more difficult to find your tribe if your tribe is in the minority.<br><br>\"\"There are plenty of unhappy kids at Stanford, and no doubt some at WF too.\"\"<br><br>Well I was miserable at Wake Forest. Intellectually and educationally, I was fine - great professors, rigorous classes, etc. Socially, I was very unhappy. I never did find that critical mass of like-minded kids.<br><br>Thats just me, though. Plenty of people love Wake! Please just do your homework about all aspects of the schools before deciding.<br><br>", "<b>Username: ewho</b><br><br>During that 2012-2013 time, Stanford's yield was about 71%, last year's was 81%. This means they lost fewer overall lately. Maybe 1/2 to WF. :)<br><br>", "<b>Username: privatebanker</b><br><br>@ewho. Maybe only one and I bet in this exact scenario. Ive read earlier that they only offer 10 full ride stamps scholarships.<br><br>", "<b>Username: privatebanker</b><br><br>@scout59 Thanks for your input. I hope your life has turned out well for you!<br><br>", "<b>Username: scout59</b><br><br>Why thank you @privatebanker!! Yes, things did turn out fine for me - I finally found my people in grad school. Looking back, though, I just wish I had chosen a different undergrad.<br><br>", "<b>Username: oldfort</b><br><br>I also went to a small LAC. I was happy there for the first 2 years and I out grew it very quickly. Both of my kids wanted a large uni experience instead of LAC. They excluded schools like William, Dartmouth, and I did not encourage them to go to my very good LAC.<br><br>", "<b>Username: privatebanker</b><br><br>Its refreshing to hear this feedback actually. So many on CC seem to indicate the lac experience and smaller classes, more student focused profs etc are clearly superior to the big school in many ways.<br><br>I think both paths can be sensational for the right student. But depending on which one you personally chose yourself or your child selected - seem to color our views and the advice rendered on these pages.<br><br>Your input is so important, its has a leveling effect on the dialogue. And it does go counter to the usual selection bias we all tend to exhibit. Myself included.<br><br>Thanks @oldfort and @scout59 for the important reminder.<br><br>Every person is different. Our fond memories of youth, a missed or longed for opportunitity of the past or a current childs college choice - is but one personal perspective. Its a good idea to step back and let the emotions cool.<br><br>", "<b>Username: oldfort</b><br><br>Both of my kids with to the same large uni, one STEM and another humanities major. After the first year, most of their classes were small, very similar to LAC classes. They connected with their professors, and they got great LORs from the professors who knew them well. D2 still has a professor who looks her up whenever he is in NYC.<br>D2 had a falling out with a group of friends while in college and she was able to pivot and find another tribe quickly. I found that would have been a bit difficult at my LAC - we knew everyone, and knew all the dramas.<br>It is easy to make a big school smaller by joining clubs and socialize with students in one's major, but it is hard to make a small school bigger.<br>My .02 on LAC vs an uni.<br><br>", "<b>Username: Data10</b><br><br>I haven't read through most posts of this 11 page thread, so I'm sure I'm missing things. I didn't see the OP mention much about what his son is looking for in a college. For example, what types of majors is he thinking about? What would he like to do after college and as a career? What criteria is important to him in choosing a college? How does he feel about the 2 colleges and relative preferences? This type of thing is critical when comparing acceptance decisions.<br><br>In the end it's likely to depend on individual values and priorities without a simple right and wrong answer. The vast majority of full pay kids admitted to Stanford or comparable could likely could have gotten a near full ride at another quality college, yet they choose to attend the highly selective college instead. And there are also plenty of kids who choose the near free college with a merit scholarship over HYPSM... (usually by not applying to a highly selective college) and think it would be ridiculous to spend $70k+/year when they can get something similar near free. Neither one is automatically correct or incorrect.<br><br>I attended Stanford and think it was a great school. Had I attended Wake Forest instead, I believe my life outcome would have been completely different... not so much because of the prestige of the degree name, but more intangibles. For example, I entered a double co-terminal master's program offered by Stanford that involves combining 3 degrees at the same time --- a bachelors, a master's in a techy field, and a master's in a more business related field. The idea of the program was to foster tech entrepreneurship by combining studying tech with studying business. I doubt that WF offers anything similar. While in this program, I heard about a lot of success stories, was able to meet one of the founders of Yahoo, and had other unique opportunities. This likely contributed to me choosing to start my own small Internet company, which quickly became a larger source of income than my engineering day job. I doubt this would have happened had I attended WF.<br><br>I grew up in NYS and enjoyed the CA climate and lifestyle so much that I favored living in CA, which fit well with the vast majority of recruiters attending career fairs being from CA. This relates to me living in CA today. Had I attended WF, I probably would have been living in a different area of the country, likely NC. I have family in NC and also enjoy that area, particularly closer to OBX and the Smoky Mountains. It's also possible that my life would be better and I'd be more content had I attended WF. The only thing I can say for sure, is my life would be quite different.<br><br>", "<b>Username: NCKris</b><br><br>@hariputralake<br>From your other thread, your son has amazing choices. If you can comfortably afford 20k per year with federal student loans (27k total), then send him where he wants to go. It will be worth it in the long run.<br><br>", "<b>Username: NCKris</b><br><br>This is not just about college ranking or eliteness, or tier 1 vs tier 2.<br>It is about which environment is best suited for 4 important years of his life.<br>If finances or job security was of the slightest concern, then definitely go for merit.<br>Is it possible that OPs son would be average at S and not go into an elite field ? Yes!! Ultimately it depends on the student to take advantage of the opportunities. That can happen only where they are excited and motivated. Fit matters, especially when comparing very diff schools, like S and WF.<br><br>", "<b>Username: privatebanker</b><br><br>@Data10 The op indicated his son is currently undecided on a course of study.<br><br>", "<b>Username: Happytimes2001</b><br><br>Sharing the stats was great. It's funny what some people consider to be elite. IMHO, based on stats alone a school with an acceptance that high is not elite, not even close. I think people often try to compare a very high quality item with an item that is similar but not of the same quality. A house for example is not based on size alone, but on location, details and the community.<br><br>Colleges also differ. The top of any single thing is always very hard to create, obtain and grasp. An A+ student is vastly different from one who gets B+ or even A-. The last % matters a lot. That's where the excellence lies and that is where the vast majority of people who change the world and create mega companies thrive. No one is saying Wake Forest isn't a strong school. What they are saying is, there are likely many Stanford kids who are going to make huge things happen. What is the likelihood of those kids going to Wake Forest? Small. Even the cohort of Stamps scholars isn't going to make WF a school with amazing innovations and research opportunities that are world class.<br><br>Try this, ask someone in Paris about Wake Forest. Then ask someone in Paris if they have ever heard of Stanford. These days the world is global and so are opportunities. Having a great school behind you follows you for life. IF you are going to live close to WF your whole life, then there's probably no issue.<br><br>", "<b>Username: privatebanker</b><br><br>@Happytimes2001 acceptance rates versus applicant pool are different things. If 10 Rhode Scholars apply for 5 spots, is it less selective than 3 spots for 10 applicants of lower credentials?<br><br>Look at who attends, not how many apply.<br><br>And the a+ student versus B+ student comparison isnt true at all. Unless you agree the A+ student in the same major at directional state u is clearly superior to the Stanford student with the B+. Context matters and again, I believe you know this as well.<br><br>And yes, Auburn is not as elite as Stanford by any measure. And I am sure Tim Cook, Auburn grad, is very happy to hire a few Stanford grads to work for him. Fortunately he overcame his adversity and the obvious roadblocks from missing the Stanford boat in life. So instead of Paris, ask your question at Apple and change the school to Auburn.<br><br>As quoted from a highly respected fellow poster - this toxic elitism is why people hate CC. Hear hear.<br><br>", "<b>Username: roycroftmom</b><br><br>Not just toxic elitism, but ignorant as well. The good news is, this provincial hyper focus on a few schools allows more to benefit at the many extraordinary opportunities elsewhere. And I never worried what some random street worker in Paris thought about college choices-after all, most Americans probably have heard of the Sorbonne, but not the much better schools in Paris. Street knowledge is overrated.<br><br>", "<b>Username: roycroftmom</b><br><br>Jeff Williams, Apple's COO, seems to be \"making huge things happen,\" @happytimes2001, despite having attended NC State. And although he no doubt had many choices, he sent his own son to Elon, in NC. He seems to think it was an excellent education and hires plenty from there.<br><br>", "<b>Username: bopper</b><br><br>What major is your son?<br>Would he get the value out of Stanford? Would he want to start a business or whatever?<br><br>Or would he get value out of WF? Being closer to professors and having all the perks of a Stamp Scholar?<br><br>I have a friend whose son went to Stanford. After sophomore year, he took at year off and tried to develop a software app (that his parents funded). I am not sure it went anywhere, but he took that opportunity. He then went back to school at Stanford. But I know my kids would never do such at thing.<br><br>", "<b>Username: privatebanker</b><br><br>@bopper and for others to avoid having to re-read so many posts. OPs son is undecided and he wishes he could tell us his plans or goals himself.<br><br>", "<b>Username: friday28</b><br><br>@scout59 Stanford has 7,000 undergrad to Wakes 5,000. Not a huge difference population-wise in my opinion. OP please let us know what your child decides. It's such an interesting dilemma.<br><br>", "<b>Username: Publisher</b><br><br>As far as the ultimate outcome, it is highly likely that OP\"s son will enroll at Stanford. The prestige &amp; opportunities &amp; contacts are too hard to pass up for a family for which COA is not an issue.<br><br>Probably would be the same result if the super elite school was Harvard or Princeton rather than Stanford.<br><br>", "<b>Username: privatebanker</b><br><br>@Publisher Youre probably right. Tough to say no.<br><br>Although the op is not completely financially agnostic.<br><br>He has another student on the way to school soon enough. And no way to FA or merit based on his income and input regarding ds goals. And possibly half of the need already saved for both.<br><br>Unless all retirement savings and extra stuff goes away for four years.and maybe not even then. 200k is 50k a year for the next four years. I dont see it. But not my check to write. I do know that 300k is more like 150k after taxes medical insurance, property taxes, ss tax. Then the mortgage. Perhaps a car or two or three. Gas insurance and dance lessons etc. clothing and food. Theres not nearly enough time to get to the level needed. It will be loans for son one in year four or daughter two.<br><br>Even if she chooses and In state public.<br><br>Like most decisions made in the heat of the moment. Like comparing a handsome and famous suitor over the practical and pretty good looking husband . The financial outcome is generally revealed much later. And the suitor turns out to be just another guy. lol.<br><br>", "<b>Username: roycroftmom</b><br><br>I like to think that my elite education has provided me, at least, with more perspective and understanding of the many choices and benefits available everywhere-that an elite education is most certainly not limited to a handful of schools, and much more a function of the student and what s/he puts into the educational experience. But I did live in some cities where people judged one another primarily by educational pedigree, so I understand your perspective. In other cities residents may use wealth, or beauty, or whatever, as a means to classify people. Fortunately, in my experience, that is becoming less common.<br>In any event, OP has some great options, and all the best to him. Signing off...<br><br>", "<b>Username: oldfort</b><br><br>In Asia there are an Ivy Balls (just google) hosted by Ivies. They do invite some schools, but they are limited to few seats. I know it may be silly to some, but a lot of business connections are made there.<br>My brother recently was interviewing for a club (one of the oldest, less than 500, yada yada) and they asked him where he went to school and where he lived. They didn't ask him where he worked. Not everyone's cup of tea... :)<br><br>", "<b>Username: HoustonKen</b><br><br>We are facing a similar dilemma. D got offered a Stamps Scholarship to Ole Miss. Has been recruited at a level by people at Ole Miss that I cannot even fathom. She got into Stanford on Friday night and threw our lives into chaos. For the rest of the readers of this forum, I thinks its helpful to set up exactly what the Stamps offer consists of. Its full costs of attendance plus. It includes 1) 4 years tuition; 2) Room/Board/Food 3) $600./semester for books. 4) $2500 a year to travel home. 5) $3000 budget for computer &amp; printer. 6) Increased tuition etc. for study abroad year is covered. 7) $12,000 for enrichment/travel. 8) Bi-annual meetings where you network with other Stamps Scholars. I had no idea this type of scholarship even existed before she was asked to interview.<br><br>Ole Miss programs lineup almost perfectly with my daughters interests. She wants to triple major is business, international relations and Mandarin. She has been admitted to the Croft Institute of International Studies (limited to 60 kids/year), Barksdale Honors College &amp; Flagship Mandarin program. Yes I realize that Stanford is Stanford and arguably the best school in the country. Yes I know Ole Miss is in yucky Mississippi and is ranked around 150th in national rankings.<br><br>We are awaiting aid letter from Stanford but assume we will get a big fat $0. We could swing Stanford but it would hurt ... alot. Basically, if my daughter goes to Ole Miss I can payoff my mortgage at age 51. if she goes to Stanford, I might have to borrow against my home equity for the junior and senior year. I am also scared to screw my son over who is 2 years younger than my daughter.<br><br>We are committed to letting this play out through April. 1) I've asked my daughter to come up with a game plan at Stanford as to what she wants to study. Her initial response of \"International Relations\" was a little to vague for me. 2) We are going to the local admitted students reception this weekend and I'm sending her to the Stanford weekend April 25-27. 3) A few months ago, we had a nice discussion about the real world implications of her decision. If she goes to Ole Miss, I'm gonna replace her car. If she needs $ for sorority dues, Spring Break etc ... I'm happy to pay. If she goes to Stanford, there is no new car or $ for travel abroad. 4) I'm doing my own legwork talking to a few friends who have kids there now. I am very worried that my daughter will feel like she is the dumbest kid at Stanford. 5) My initial thoughts are than my daughter will be incredibly marketable with a degree from both schools. I concede that there is a small group of elite/desirable jobs that she \"might\" be able to get from Stanford that she would not have access to at Ole Miss. I am trying to quantify if that increase in opportunity is worth $320,000 or a $500,000 swing to my net worth. I'm also trying to figure out if my daughter has any interest in management consulting or venture capital etc.<br><br>Please feel free to message me if you want to commiserate offline.<br><br>", "<b>Username: bopper</b><br><br>5) @houstonken She might get that \"access' But will she have the Stamps scholar opportunities at Stanford?<br>Will she be one of many or one of the special?<br><br>", "<b>Username: Publisher</b><br><br>@HoustonKen: Unless Stanford offers a major not offered at Ole Miss, then I see your situation as very different from that of the OP since finances are a major concern for you &amp; your family.<br><br>Thanks for sharing the details of the Ole Miss Stamps Scholarship as Stamps varies greatly by school.<br><br>", "<b>Username: got2laugh</b><br><br>@HOutonken Congratulations to your daughter but be careful when using the word \"yucky\"<br><br>", "<b>Username: HoustonKen</b><br><br>@bopper She clearly will have amazing opportunities at Stanford. The Stamps Scholar opportunities through Ole Miss will also be amazing. If Ole Miss had just offered her the $ without the Stamps Foundation opportunities ... The lever would definitely swing harder to Stanford. The Stamps Foundation is clearly trying to created a generation of leaders and wants their kids to apply/receive prestigious fellowships. My daughter \"could\" do something like that at Ole Miss. I doubt she would do something like that at Stanford. I definitely would prefer that she be a Big Fish in the smaller pond, but I owe it to my daughter to let her take her victory lap and work through her own thoughts.<br><br>", "<b>Username: HoustonKen</b><br><br>@got2laugh I had no intention of criticizing Mississippi. I love Ole Miss &amp; what it has offered my daughter. Someone referred to Mississippi by the adjective to me and I just repeated it with out thinking. I just didn't want someone to say \"Go to Stanford because the weather is better.\"<br><br>", "<b>Username: HoustonKen</b><br><br>@Publisher Our family's income and college savings totals are not that far off from OP. My financial concerns might have been more forcefully illustrated but in my mind the angst and difficulty in the decision is pretty dang similar. Stanford vs Free Ride+ at less prestigious university<br><br>", "<b>Username: ewho</b><br><br>To attend Stanford, the student has to get accepted at 4% admit rate, the parents have to be able/willing/ready to pay. The whole process is a reflection of whom the students and parents are.<br><br>", "<b>Username: Publisher</b><br><br>If finances are not a concern, then Stanford offers tremendous opportunities found at only a handful of universities in the US.<br><br>Really comes down to the big fish in a small pond versus....<br><br>", "<b>Username: youcee</b><br><br>These Stamps vs Stanford decisions are fascinating. I wish you all the best on a difficult decision to make, albeit a good one to have. It seems like the support of the Stamps could seriously elevate the opportunity at a school to make it much more in line with something like Stanford. A couple of years ago we thought we were going to have to make a $20K/year choice between 2 similar schools and I thought that was hard. I hope you and your child all find comfort in whatever decision you make.<br><br>", "<b>Username: roycroftmom</b><br><br>Many IR majors continue on to get a law degree or MPA. Those degrees are expensive, if that is a consideration<br><br>", "<b>Username: HoustonKen</b><br><br>I want/expect her to go to graduate school. I would prefer an MBA or med school over a law degree bc I am a lawyer. The real consideration is that we have told my daughter that if she goes to Ole Miss, she will have a significant amount of $ for graduate school. My sister who is a 46 year old urologist who is still paying off her med school loans is all in for Ole Miss. The informal poll of my friends is quite interesting. The people who have had to pay back significant student loans ... favor Ole Miss around 8-1. The non-student loan people are Stanford by the same margin.<br><br>", "<b>Username: cptofthehouse</b><br><br>These are great choices to have the luxury to make, but painful nonetheless. I have nothing to add in terms of considerations to make, as this is purely a family decision. Good luck!<br><br>", "<b>Username: privatebanker</b><br><br>Wow. Big high five to you and your D. Amazing results! Just to be clear, I think everyone understands the allure and low odds of a name like Stanford saying yes to us. Its very flattering. Especially in the hyper competitive collegiate arms race. Its a big point of pride for you. And its an amazing school.<br><br><br>But just to be sure. I want to break out what I think you told us.<br><br>-Free ride for at ole miss, ACC conference and state flagship<br>-Including room and board. 200k for all.<br>-Books. 12k<br>-Computers. 3k<br>-A Travel budget, 28k<br>-You have special honors on campus and on degree 80k (Private school delta)<br>- National scholar conferences 20k<br>- A monthly fun money stipend. 5k<br><br>And forever a Stamps Scholar at Ole Miss. pretty darn nice and fun school too<br><br>The only close thing to this is see is the benefits offered to a recruit of a service academy. And it is still not this generous. And there you have to commit to years of military service. And go through plebe year. Lol. Thankfully some some kids choose this route.<br><br>Versus full pay at Stanford. Which is the best to have on your resume. And all the pristige, connections and great classmates.<br><br>So lets look at it with a different sort of lens for a moment.<br><br>Ok so lets say Amazon and Google are the best companies for tech. Or Bain or Mckinsey for consulting. Or GS or Merrill Lynch for IB as examples. The best names long term for your resume and bragging rights. And the connections and people you would be around are the brightest minds out there.<br><br>Would you accept an offer to work there for the next four years but the catch is you have to pay them for that privilege. And not a little. They are asking for $300,000 and you have to pay for everything else including travel , your own computer and the employee manuals are 3000 a year too.<br><br>And your next job aka law school is another 300k. And no pay.<br><br>Or you can work at an excellent alternative. The same exact job title and job experience. Say Oracle for tech, Kaiser for consulting, Raymond James or Silicon Valley Bank for IB. None of these nearly as elite. But pretty darn good. And theyll call you a Stamps fellow forever too<br><br>Oh and they will pay you 360k roughly for the four years. And your next job aka law school is essentially free too since the money is already there by then.<br><br>So would you pay to work at Google vs Oracle. Bain vs Kaiser. For the more elite resume name and connections.<br><br>Thats a personal decision. But I dont get it.<br><br>Heres a sample of the leading names today current shaping public policy and IR.<br><br>-Hillary Clinton Wellesley College (when acceptance rate was over 50 percent).<br><br>-Ambassador/Gov. Nicky Haley - Clemson<br><br>-Sen. Kamela Harris - Howard<br><br>- Rep. Nancy Pelosi - Trinity Washington U<br><br>-AOC - Boston University<br><br><br>Its a tough choice for you. I wish you the best. And wanted to give you a viewpoint that might be helpful if you choose Ole Miss.<br><br>If you choose Stanford. It would of course work out great too.<br><br>I just dont know about automatically better the way some like to portray.<br><br>", "<b>Username: roycroftmom</b><br><br>Well, that makes sense, Houston Ken. If the costs were equal, that might lead to one decision. A 500k difference might lead to another. As one commentator noted when considering a somewhat similar situation on Wall St. Oasis, if you can't figure out the value of 500k, maybe you don't belong on Wall St.<br><br>", "<b>Username: Rivet2000</b><br><br>Heck, I'd go to Ole Miss for that.........................................<br>..........but, I asked my S and said he would not...................go figure<br><br>", "<b>Username: privatebanker</b><br><br>@Rivet2000 lol.<br><br>teenagers have no concept how much effort it takes and the privilege one needs to have employment leading to making a million dollars - about what it takes to have 500k for college and grad school after taxes and fica ssi and Health insurance etc.<br><br>And this is before youve clothed fed or housed a person. And maybe a few cars. Vacations. Travel teams.<br><br>You need twice this amount. And god forbid you save anything.<br><br>Thats 100k a year for a 20 years of blood sweat and tears. And not one penny left over when its all said and done.<br><br>I love my daughter but her feelings on costs and monetary issues have no bearing in our house. Lol. They think a money fairy shows up and leaves checks for college. And while they are sleeping in on a summer mornings Im grinding it out on the highway to work.<br><br>I would ask Nebraska grad Warren buffet what he would do. Honestly. I dont know but I can guess.<br><br>", "<b>Username: Rivet2000</b><br><br>Ya, I feel ya. My only point is that where you stand depends on where you sit. Our S had different circumstances so his decision making process was different than the posters. His opinion re Ole Miss, however, is based on his academic experiences and opportunities. Confirmation bias on his part I'm sure, but everyone is entitled to an opinion.<br><br>", "<b>Username: Publisher</b><br><br>OP's dilemma concerns a choice between Stanford &amp; Wake Forest University. While researching another school, I came across several articles written within the past few years dealing with stress at \"colleges\" (all were &amp; are universities). Somewhat surprised to see both Stanford &amp; Wake Forest (Work Forest) listed among the top 5 most stressed out colleges. (Stanford was #2 &amp; WFU at #5.)<br><br>", "<b>Username: milee30</b><br><br>\"\"I am very worried that my daughter will feel like she is the dumbest kid at Stanford.\"\"<br><br>You don't need to worry about that. If Stanford's admissions practices are remotely similar to the data coming out of the Harvard lawsuit, she'll have classes with athletes and development admits, both of which will be significantly dumber than the standard students. We should probably add that to the list of really great reasons these elite colleges give such strong preferences to athletes - it ensures the rest of the students don't ever have to feel like the dumbest kid there.<br><br>", "<b>Username: privatebanker</b><br><br>@Rivet2000 Of course. But with medicial issues I stick with the opinions of drs. Law the lawyers. Bridge strength to engineers. Money. For college. The person paying lol. Yes everyone is entitled to an opinion. Some are just more informed.<br><br>", "<b>Username: Rivet2000</b><br><br>And for individual decisions you go with the individual. If money is not an issue for a given family, then others should not insist that it should be. Different colleges come with different opportunities. Yes, I am one those CC're who claim that not all colleges deliver the same opportunities. I am, however, also in camp that says if you can't afford it - don't do it.<br><br>", "<b>Username: SouthernHope</b><br><br>OP: \"I am very worried that my daughter will feel like she is the dumbest kid at Stanford.\"<br><br>it reminds me of that old joke...What do you call the person who graduated in last place at Harvard Medical School? Doctor.<br><br>She'll do great.<br><br>", "<b>Username: cptofthehouse</b><br><br>For those who can afford it, I've seen most of my kids' peers go with the elite school over the full ride. I remember only one student who picked the full ride Temple award over having to pay full price to a private top 20. So there are many folks who go with the prestige, the name.<br><br>In addition to the full freebies at Old Miss, the parents can also throw in the cost difference between the two schools at graduation. That kind of money would give most graduates a huge head start in life along with the no loan status. I'd throw that into the equation if possible.<br><br>", "<b>Username: roycroftmom</b><br><br>People make very different decisions when they are bearing the cost, in colleges, and in life. Personally, I think decision making improves when people are personally invested in the outcome.<br><br>", "<b>Username: RayManta</b><br><br>This is a great discussion. My daughter may face a similar question next year with different schools. For me the \"X\" factor is how good of a fit the student thinks the full-ride school (Wake/Old Miss etc) is for him/her. Someone raised the point that Wake may not offer a good experience for Jewish students, and maybe Old Miss for Houstonken might be a hard place for kids from New England to find their community. It's probably too late to schedule a weekend with a student at Wake, but if I were in your position, I'd plan a two-day visit, sit in on some classes and hang out at the student center, and let your daughter see how good a fit there is. If she's gonna be unhappy, no amount of scholarship money is worth it, IMO. It's four years of her life, after all.<br><br>", "<b>Username: privatebanker</b><br><br>OP. Beware of posters who joined CC in the past 24 hours and suggest you spend $500,000. Thats unless they are writing the check or willing to endanger their own retirement for years to come as well.<br><br>", "<b>Username: hello_you</b><br><br>OP here. @privatebanker Thanks for the advice and keeping this fascinating topic alive.<br><br>@HoustonKen Congrats to your daughter. I feel like I've had almost identical thoughts as you. I've even mentioned the money for a new vehicle and traveling. It's a great problem to have, but still a problem. I have \"Wake\" days and I have \"Stanford\" days. It's amazing how undecided we all are.<br><br>Good luck to you guys - keep us posted.<br><br>", "<b>Username: Thetwins</b><br><br>I'm late to the thread, but I'll throw in a vote for Stanford. Yes, we are paying the equivalent of a (cheaper) Tesla, yearly, but I'll just keep driving my 2001 Toyota until it breaks. If you had to go into true debt, then that's a whole other story, but if we are talking about vacations and nicer cars (and homes), then Stanford. I may not see the inside of a Ritz-Carlton or Four Seasons for another 20 years, but hopefully she'll take us there some day!<br><br>", "<b>Username: Publisher</b><br><br>How did the $300,000 cost for Stanford become $500,000 ? Time value of money ?<br><br>My understanding is that Stanford University COA is about $70,000 per year. With an assumed 4% increase each year, the figure grows to $72,800, then to $75,712, then to $78,740. Four years of tuition, fees room &amp; board at Stanford would be about $297,252. Add in travel &amp; books to round it out to $300,000.<br><br>Measure lost interest at 4% per year as well = roughly $30,000.<br><br>It is fair to view total COA for a Stanford degree at about $330,000, not $500,000. What am I missing ? The WFU Stamps Scholarship stipend ? The stipend is $750 per month for, presumably, 9 months per year = $6,750 for 4 years = $27,000 plus $15,000 research grant =$42,000.<br><br>Total is now $372,000.<br><br>But Stanford awards research grants as well. Plus, internship opportunities may be better for Stanford students.<br><br>A very significant amount regardless.<br><br>", "<b>Username: NCKris</b><br><br>^^^<br>Also, note that the student may get lucrative summer internships that can help pay for other expenses. The COA given on the college website is usually the max. amount.<br><br>", "<b>Username: sushiritto</b><br><br>The student can mitigate some of the cost (roughly Publisher's \"lost interest\" portion for maybe 4 years) by working summers as well. I know my kid has already found a job and is helping defray college costs this summer.<br><br>", "<b>Username: Publisher</b><br><br>Ultra wealthy schools like Stanford &amp; Princeton tend to offer generous funding for student research. In my estimation, it is more reasonable to view this as a $300,000 decision or investment, rather than as a question involving $500,000.<br><br>How long does the benefit of having a Stanford degree last with respect to real world job placement ?<br><br>Stanford degree value in career versus value of WFU Stamps Scholar ?<br><br>", "<b>Username: privatebanker</b><br><br>@sushiritto @Thetwins and others.<br><br>Internships.<br><br>Just an obvious point here. Theres no Wake Forest Stamps Scholar universe that exists where lucrative internships and summer jobs arent a thing as well. None.<br><br>Financial<br><br>Stanford 330k plus op sons med or law school is another 250k and daughters public university in state would be 160k. Best scenario. 740k and current 200k saved. And four years to save 540k on an after tax income of 150k. And a life to live. How does that math work? Its just nuts what we are suggesting. This is a Stamps Scholar at Wake. Good lord.<br><br>Tesla analogy and the decision to sacrifice to get the student to a better brand. I get it. But the decision set isnt home made moccasins vs a pair of air Jordans. Its addidas cross trainer vs the best Nike runner available.<br><br>And then new Tesla is not a good analogy. Its the opposite. .<br><br>You are saying no to a brand new Toyota Avalon Or Mercedes E 350 each and every year for the pleasure of paying 70m for the the new Tesla each year.<br><br>Thats the choice.<br><br>Its not eating vs Stanford. Or no new car vs Stanford. Or no family vacation vs Stanford No retirement for us vs Stanford.<br><br>This is a third choice. New car each year and almost Stanford. Vacations and almost Stanford. Retirement and almost Stanford. Its both not one or the other.<br><br>Good luck op. This is silly really and circular. You either think a top top school for free with a recognized Stamps network/opportunity is better than a notch up the better school ladder and costing you financial independence and choice. Or not. Its that simple.<br><br>", "<b>Username: saillakeerie</b><br><br>I read the $500k versus $300k to result from the reality that tuition is paid with after tax dollars. To have $300k in after tax dollars, you need a higher number of pre-tax dollars. So if someone is looking at what they will need to earn to spend $x for college, you need to earn more than that on a pre-tax basis to get there. Required pre-tax earnings will depend on nature of that income, tax rates and rates of return. That is at least how I read it.<br><br>", "<b>Username: Publisher</b><br><br>OP has the money. Apparently the cost of Stanford will not affect current lifestyle.<br><br>I believe that folks have the right to spend their money as they want. It is okay to spend money on a super elite education if that fits with the family values &amp; priorities.<br><br>P.S. @saillakeerie : Thank you for your response to my question.<br><br>", "<b>Username: privatebanker</b><br><br>@Publisher<br><br>The op does not have all of the money. He has a lot of it. And a solid high income. 300k. But as poster above reminds its after tax dollars that buy things.<br><br>California resident with a blended tax rate of fed and state will probably be 42 percent.<br><br>That before health care fica ss tax etc. 50 percent leaves 150k for the mortgage the 401k insurance gas food car payments. Kids dance lessons and donating to charity.<br><br>Wheres the extra for the 540k need coming from. Its lunacy to me .<br><br>Maybe not with this family.<br><br>But other familys with a lot less will read this and think the big plus and private loans make a lot sense.<br>The heloc sure.<br>The 401k loan. Why not look at lifetime earnings charts.<br><br>Look at the research opportunities and brilliant cohort of student. Heck its Silicon Valley everyones to be there right? Of course all of this is true. However. Wake and the Stamps gives you at least what 90 percent of this. 80 percent? I think its much closer thank that.<br><br>Op has another child on the way to school Theyve saved 200 to 250k for a 320k need. No extra for med school and no money for child two.<br><br>", "<b>Username: sushiritto</b><br><br>I live essentially at \"Ground Zero\" of the Stanford. UMich talks about the \"Michigan Difference\" ad naseum. I see first hand the \"Stanford Difference.\"<br><br>My neighbor and family friend is a regular on CNBC's Squawk Talk, my employer is a Stanford alum and the neighbor across the street is a doctor at Stanford with 2 of their 3 children going or attending Stanford. The other is in middle school. Stanford is building campuses, facilities and a collections of buildings everywhere around here. They've closed one side of the street entirely and made parking at my gym \"mission impossible.\" (hyperbole)<br><br>It's all around me and I can't get away from it. Please help me! :smiley:<br><br>", "<b>Username: ewho</b><br><br>So 58%X300,000=$170,000 is for OP's take-home income. Stanford is about $70,000, and the OP should have $100,000 to spend annually on something that the OP thinks worth to do.<br><br>A lot of posts here are insult to Stanford full-pay parents. Have been there and done that. My case was really to choose Yale or Stanford, not full ride to schools like Michigan. My son spent 4 hours to apply Stanford and got in. He was recruited by Google upon graduation (he was not CS major). He randomly applied to Stanford MBA and got in (w/ MS-CS joint program.) He made me a Stanford parent 4 times ( two BSs, an MBA and MS-CS). He is a PM (product Manager ) at Google now and also teaches a class at UC - Berkeley (extension). All is from my original investment of $200,000 at Stanford and his effort.<br><br>OP -- I think my son's case is an outlier that could be influential. My suggestion is still my original one - if you can comfortably afford it, do it, otherwise, go to WF and never look back.<br><br>", "<b>Username: Scipio</b><br><br>We had a similar situation for both of our daughters. Both got accepted (full pay) at their Ivies - Harvard and Dartmouth, respectively. And both were offered generous merit money at cheaper, lesser but still solid schools. We are not rich but paying the full pay was doable by employing some economy and sacrifice but without taking a huge hit to our lifestyle.<br><br>We weren't big spenders to begin with, so refraining from buying say expensive toys or costly vacations wasn't some big sacrifice for us. In practical terms what it has meant to us is that we had to forego some of the more expensive maintenance work on our house along the way, so we now need to get caught up on that. Get the house in shape for our golden years. And I will probably need to retire 2 or 3 years later than I would have otherwise in order to boost the retirement portfolio up to our target numbers.<br><br>But overall it has been worth it. I warned each girl at the outset of their college years that if things went south for us financially (say lay-off or market crash, etc) they were going to have transfer to lower cost options. And they agreed. I also offered to set them up with a nice car at a lower cost college. But both still opted for their dream schools without a car. Both had worked for very heard for many years to achieve their high-end acceptance letters, so I had to agree that they had earned it.<br><br>And I have to say it has worked out fine. Both girls earned STEM degrees and have gotten internship, job, and grad school opportunities that in some cases I'm not so sure they would have had if they had taken the same courses and earned the same degrees at some of the low cost schools.<br><br>You certainly should NOT go into big debt or otherwise wreck your finances for the sake of Stanford, but if you can make it work financially then maybe you should consider going for it. In the end I thought it was worth spending the big money on the education of my kids. It's not like I had something better to spend it on.<br><br>", "<b>Username: Publisher</b><br><br>OP's income is above $300,000 according to the original post in this thread. Also, OP has saved almost $200,000 for son's education.<br><br>Summer internships could make Stanford more attractive. WFU Stamps offers $15,000 research &amp; travel award spread over 3 summers. But if OP's son works instead, then he can make substantial money if interested in interning at an IB or MC firm. Pay is about $3,500 to $4,000 per week for interns at the top firms.<br><br>", "<b>Username: micgeaux</b><br><br>The input regarding actual $ regarding internships is the most useful. If you can make $4,000 * 10 = $40,000 less 25% taxes = net $30,000 for a summer internship, then some of that can pay for Stanford. The evaluation really needs to be if a student could get this same job at Wake Forest. Maybe they would get a different internship that pays slightly less but still a solid internship.<br><br>In following many of these discussions on CC, this has always been my question - Are there jobs/internships available to these students that aren't available to others? And, if so, would my student even want that job? If you read other forums, like Reddit and Quora, the hours for Investment Banking and Management Consulting are horrendous, even for internships. Sure, you gain valuable experience and make lots of money, but does your child really want that? I'm sure some would thrive on it; others, not so much.<br><br>", "<b>Username: Publisher</b><br><br>Many find the work environments to be very stimulating due to the projects, co-workers &amp; guidance received. But, yes, if one does not want long hours, then best to look elsewhere for work.<br><br>Yes, there are jobs available for students at elite universities which are rarely if ever offered at non-elite schools. Some are great such as two year rotational programs with major Fortune 100 companies, and some are just 2 year paralegal stints at the most prestigious law firms in Wash DC &amp; in New York City.<br><br>", "<b>Username: HoustonKen</b><br><br>@Publisher I think the $500,000 came from my post. Stanford's cost of attendance on its website is $74,700 PLUS travel home. Throwing in 2-3 plane tickets and other incidental raised the real cost to $80,000. I have a friend with freshman twins at Stanford and he says $80K is a \"little low\". I used the $500,000 number as an illustration of the financial swing I am facing. I am looking at paying $320,000 to Stanford or receiving $160-$180,000 from Ole Miss.<br><br>", "<b>Username: roycroftmom</b><br><br>No, interns in IB and consulting are not getting 4k/week. Not even half that. At least not in NYC. So if you know of any firms paying that rate to undergraduates, do share the names of those companies. Nor is silicon valley high tech or private equity.<br><br>", "<b>Username: itsgettingreal17</b><br><br>@publisher Please give examples of these $3,500 - $4,000/wk internships. MBB definitely doesnt pay that much. I cant speak to any other internships, though I know theyd be extremely rare. And for you and others who seem to be peddling the golden ticket argument, please produce the stats. The facts are as follows: these top internships and full time jobs are extremely hard to get from even the elite schools. Extremely hard. Very few applying for MBB and IB from the top schools get offers. MBB competition is fierce. MBB hires from all over. Top IB firms hire from non-target schools, though in fewer numbers. And competition is fierce for everyone. And lest I become a broken record, most/ the overwhelming majority of students do not want these jobs! So please do tell what these other exclusive opportunities are such that it should be a primary consideration.<br><br>", "<b>Username: roycroftmom</b><br><br>By the way, the Stamps foundation website says the most frequent career path for their alumni is indeed finance.<br><br>", "<b>Username: momofsenior1</b><br><br>Did you mean per month @publisher?<br><br>", "<b>Username: itsgettingreal17</b><br><br>For those who are obsessed with MBB and Google, the top 5 employers of Stamps Scholars are Deloitte, McKinsey, Bain, Google, and Boeing. Out of 700 alumni, over 50 have won prestigious fellowships, which is quite good. Top cities include Silicon Valley and NYC. I could go on and on. But no one wants to talk about facts. Some would rather focus on the Stanford mystique.<br><br>", "<b>Username: sushiritto</b><br><br>Top Feeder Schools to Silicon Valley (Stanford is #2):<br>@TiggerDad . Top Feeder Schools to Graduate school (Stanford #4):<br><url>http://collegematchus.com/ranking-the-colleges-top-colleges-that-feed-alumni-into-grad-school-programs/</url><br><br>WF is not on either list. Again, I'm not alum, nor do I have a child that attends, but I definitely buy into the \"Stanford Mystique.\"<br><br>", "<b>Username: jzducol</b><br><br>@momofsenior1 &amp; @itsgettingreal17 Actually, it is indeed $3500-$4000 per week (total compensation including housing and other benefits). I know it sounds crazy but I saw it in my kid's offer letter from last Oct.<br><br>", "<b>Username: itsgettingreal17</b><br><br>@jzducol MBB does not pay $4,000/wk. Im not sure what youre including in that package.<br><url>https://managementconsulted.com/consulting-salaries/consulting-salaries-for-2019-management-consulted/</url><br><br>", "<b>Username: jzducol</b><br><br>No, not at MBB, but others.<br><br>", "<b>Username: privatebanker</b><br><br>@michgeaux 40k for a summer internship as the normal? Sign me up. Not realistic.<br><br>@Scipio and @ewho.<br><br>No one is knocking full pay families. I am one myself. 72k per year.<br><br>But its this particular case we are discussing and perhaps the belief that a school in the top ten is that much better than a top 30.<br><br>And even if the top 30 Is offering additional benefits and prestige not available at the top ten.<br><br>And they are offering this for free versus paying a fortune for the top ten.<br><br>Its not Stanford vs the universe. Its wake and Stamps. Free. Vs Stanford full pay and other needs to fulfill for any family. But especially one with another child to educate.<br><br>Thats the whole discussion in a nutshell.<br><br>Also to financial math. Which is my full time day job. Lets take a look at the math at whats left over to spend on what you want in real life.<br><br><br>At 300k income level<br><br>126000 fed and state income tax<br>8300 in social security tax as well<br>6384 in Medicare tax at income level<br>10000 in medical insurance. Low estimate.<br>42000 mortgage 3500 per month+insurance<br>15000 property tax<br>6000 car payments.<br>6000. Gas low estimate for said car<br>1500 phone plan<br>4200 electricity<br>1500 cable and internet<br>20000 food for family<br>10000 household items Rx, CVS, laundry<br>20000 retirement savings<br>3000. Life insurance<br>4000. Sons books Uber and sundries<br>5000. Housing maintenance and repairs<br>0. Emergency fund<br>0. Travel<br>0. Entertainment<br>0. Restaurants<br>0. Daughters activities, allowance<br>0. Charity<br>0. Family<br>0. Christmas or Chanukah gifts.<br>0. Wedding presents birthday presents.<br>0. Nights out or going out with buddies<br>0. Funds for med or law school for s.<br><br>57500. **. See below.<br><br>Total $326584*<br><br>$105536 four year shortfall. After tax. $145000. Pre tax need<br><br>And spartan lifestyle. If possible.<br><br>Option two. Wake forest. 300k costs plus 105k shortfall. 405k available to family or son after four years after tax. Theres the 500k. And this includes all costs for d education as well. This is med school already covered with 250k left over.<br><br>*very low estimates. Depending on state mortgage may be much higher. The zero columns are not realistic. These will be significant even if sacrifice is involved. Does not include emergencies. Major repairs. Car issues. Loss of job.<br><br>*This is the 160k for d school and 70k Stanford shortfall for s -/- 4 years. Needed to accumulate.<br><br>", "<b>Username: Rivet2000</b><br><br>The numbers posted by @publisher for gross weekly pay are not uncommon, but don't forget some of those internships are in very high cost areas (NYC and Bay area come to mind). However, those opportunities are open to all students, and while some say that certain companies/industries hire interns exclusively from a handful of schools, I'm not sure. For some students, in some majors, having access to SV startups for internships is an advantage. For instance, our S landed an internship with an interesting startup that resulted in a part time gig throughout the year. Additionally, the founders have encouraged to try out other opportunities during subsequent summers that have seen him work at a mid size company and this summer at a large-sized company.<br><br>", "<b>Username: roycroftmom</b><br><br>Well, I know interns at all MBB, all BB IB, and the FAANG companies last summer, and no one topped 1600 per week for undergrads. The various salary sites, including glass door and,WSO, back that up, so fantastical stories with mythological compensation do not impress me<br><br>", "<b>Username: micgeaux</b><br><br>What is total comp without housing? Unless you have a free place to live and can bank the $, housing is not \"real\" pay.<br><br>", "<b>Username: micgeaux</b><br><br>Also, @itsgettingreal17 makes a strong point that might be missed. Out of the 700 Stamps scholars, over 50 have received prestigious fellowships - think Goldwaters, etc. - that's almost 10%. At the risk of starting an additional debate, each year, this group of scholars is smaller than the freshman class at any highly ranked college.<br><br>", "<b>Username: micgeaux</b><br><br>What I meant by housing is not real pay is that some internships provide housing - the student doesn't even know how much it costs. Then, they pay the student an hourly or weekly salary.<br><br>", "<b>Username: momofsenior1</b><br><br>If we are talking about students' contribution to their education, the housing cost the company's are paying is not relevant....just the student's salary/take home.<br><br>", "<b>Username: sushiritto</b><br><br>Where does the OP live? Some of those costs aren't realistic. I live in CA and they're not realistic. $15,000 for property taxes, we don't even know how much the OP paid for their house or if they even own one do we?<br><br>The OP's employers could be paying for phone plans, medical and such. Isn't MC 1.45% and FICA 6.2%?<br><br>Life insurance $3,000? Maybe if you're getting a policy in your 60's with not great pre-existing conditions, but who needs one then? :smiley:<br><br>Sorry, for veering off track (again, but at least it's not sports), but the OP knows their financial siutation better than us. Let's stick to the specifics we know.<br><br>", "<b>Username: socaldad2002</b><br><br>One of the problems with this thread is that a certain group of posters will never think its wise to spend 300k on an undergrad education, period, no matter what college it is. I disagree with that concept.but you are never going to convince them otherwise.<br><br>The bottom line for the OP is that no matter what the final decision is, it will be a great choice and your child will be getting one heck of a college education. Keep us updated.<br><br>", "<b>Username: Publisher</b><br><br>Yes $3,500 to $4,000 per week for interns. For MBA candidates will also pick up second year of MBA tuition for MBA interns who return for full employment. I am not revealing the employers, but this info. is available on the internet.<br><br>@jzducol : You know. Thanks !<br><br>", "<b>Username: sushiritto</b><br><br>@socaldad2002 File me under those who would \"beg, borrow and steal\" to send my kid to Stanford.<br><br>", "<b>Username: Publisher</b><br><br>@roycroftmom: I can assure you that those pay sites are not entirely accurate. I know plenty of cases where new hires receive about 30% more than reported on those sites.<br><br>I will try to find my notes, but the $3,500 to $4,000 is gross pay for MBA candidate interns. The best also pay second year of MBA tuition for interns who accept job offer &amp; a couple offer substantial signing &amp; relocation bonuses as well.<br><br>P. S.Found my notes for undergraduate interns in MC. Pay is about $1,500 to $1,600 per week. Internships run from 9 to 12 weeks. I believe that housing is provided for all interns as well as travel. Some pay hourly at about $40 per hour plus overtime (all those that pay hourly are, of course, accounting firms).<br><br>These salaries &amp; hourly pay figures are a year or two old now.<br><br>I cannot locate my IB notes at this time.<br><br>", "<b>Username: itsgettingreal17</b><br><br>@Publisher We are discussing undergrad here.<br><br>", "<b>Username: Publisher</b><br><br>I do not have undergraduate tech internship pay, but should be able to find my IB undergrad notes. (MBA is important for MC, but not necessary for IB.)<br><br>", "<b>Username: privatebanker</b><br><br>The costs I presented are for a parent. Not the student. Lol. The prices are guesses. Much lower than realistic. If op makes 300k the housing costs are low most likely. And insurance is for dad. Etc. lol<br><br>", "<b>Username: scholarme</b><br><br>Imo getting the Stamps scholarship is a bigger deal than Stanford.<br><br>", "<b>Username: roycroftmom</b><br><br>Publisher, we are talking about a college kid, not a 30 year old MBA candidate at a T7. So we agree the numbers are closer to $1600 per week, for those lucky undergrads who get summer internships in lucrative industries. Those generally occur after junior year, or if you are very very lucky maybe after sophomore year as well. So 2 summers worth of work before graduation, and certainly not guaranteed at all.<br><br>", "<b>Username: micgeaux</b><br><br>@Publisher thanks so much for the information. It is good to know these things before heading down the path of spending money and wondering what the return will be. (almost like going to the doctor and not knowing what the bill will be until you get your explanation of benefits. lol)<br><br>Good luck OP on your decision. My advice is whatever you decide, embrace it and make the most of it. Wish everyone and their children much good fortune.<br><br>", "<b>Username: Publisher</b><br><br>I cannot find my IB (investment banking) summer intern pay notes.<br><br>Because I do not want to open up any other boxes of notes, I searched WSO &amp; Poets &amp; Quants (which uses WSO as a source).<br><br>Several charts indicate a bidding war that resulted in an enormous pay bump for 2018 interns. The pay quoted for interns exceeded that of first year associates so I will not repeat it here. A chart of averages showed IB summer interns were paid at the rate of $105,000 per year. The highest chart showed pay at more than double that rate for summer IB interns (listing pay at the equivalent of $249,000 per year.) Again, not my notes &amp; not my figures. These are from WSO and Poets &amp; Quants citing WSO as its source.<br><br>", "<b>Username: SincererLove</b><br><br>Tech internship can pay from $6k to 7.5k a month for top companies, like FB, Microsoft of the worlds.<br><br>D17 went with Vandy tuition scholarship, instead of MIT full pay. She was the one who decided, as DH wanted her to go to MIT as he passed it up for full ride at UIUC back then for his PHD. Her thinking is that can I be where I need to be if I go to Vandy? Her answer was yes. She did have to hassle harder for opportunities, but she enjoyed work life balance which was another factor in picking Vandy. In addition, she gets more leadership positions and can stand out more at Vandy too!<br><br>Best of luck deciding! But I will let you know that two years in, I am glad she picked Vandy as well. With her summer internship, she is already at payback stage!!<br><br>", "<b>Username: Mastadon</b><br><br>\"\"File me under those who would \"beg, borrow and steal\" to send my kid to Stanford\"\"<br><br>@sushirrito-<br><br>1. Why would someone want to attend a school full of people who stole to get in?<br><br>2. Who would want to recruit there (other than Wall Street) ? :smile:<br><br>", "<b>Username: roycroftmom</b><br><br>@socaldad2002 , you misunderstand . it is not that some posters do not think a top-tier education is worth 300k. Obviously I do, and after 11 full pay tuitions, it appears my family agrees and willingly spent the money. But we weren't given the option of an almost tippy top school for free with internships, travel, and networking benefits galore, as in this case.<br><br>", "<b>Username: Rivet2000</b><br><br>From my experience it's not uncommon to have undergrad tech internships beginning in the freshman summer. Returning interns always make more $$ and most of the big name employers give the choice of providing shared apartments or paying an additional $10k for housing. The highest paid undergrad internship I am aware of was a friends kid, math - CS dual major, to a quant firm in NYC last summer. His gross was slightly over $4k (uncommon). Facebook, Microsoft, Google types typically range $1,600 - $2,000 a week base pay for a 10 week internship (not including housing, or the many perks). Very competitive environment.<br><br>How much $$ a student makes is not a big factor (my S has said many times that he would have worked at his last startup for free). The connections, opportunities, and exposure to VCs peculiar to SV are real and compelling especially in the tech space.<br><br>", "<b>Username: Publisher</b><br><br>I had conversations last year with Penn-Wharton students who claimed that several of their classmates were making salary &amp; bonus beyond what I am willing to write here. These are NOT MBA students or candidates. They were Penn-Wharton with just BS degrees in their first &amp; second years in IB.<br><br>As astonishing as the Penn-Wharton IB salaries are / were, 5th year computer engineers were making base salaries of $160,000s to $170,000s and their annual bonuses far, far exceeded their base salaries. This I can swear to. Major employers that are household names.<br><br>My point is that Stanford grads are targeted by IB banks &amp; MC firms as well as for the best technical positions. The pay is hard to believe, but it is real.<br><br>Would be interesting to speak with seniors at Stanford &amp; Penn-Wharton to discuss earnings of their classmates who graduated a year or two ahead of them.<br><br>Again, I have read &amp; heard about a major pay bump &amp; bidding war for summer IB interns last summer.<br><br>P.S. Articles should be available with a Google search about last summer's IB intern bidding war.<br><br>", "<b>Username: Scipio</b><br><br>@privatebanker \"Its not Stanford vs the universe. Its wake and Stamps. Free. Vs Stanford full pay and other needs to fulfill for any family. But especially one with another child to educate.<br>Thats the whole discussion in a nutshell.\"<br><br>I'm not disputing your facts and figures or the logic of your arguments, but the counter-point is what if the family has the money and the kid wants to go to Stanford and the family wants Stanford too, then who are we to tell them how to spend their money?<br><br>I also had another kid to educate. My daughters were 5 years apart just like the OP's kids. And back when they were in school I had people both here on CC and in real life telling me how crazy I was to pay for two Ivy League educations. But the bottom line was the girls were getting what they wanted, I was getting what I wanted for them, I wasn't going into debt, the moderate sacrifices I made to fund this were worth it to me, and it was my money. At that point the arguments should have been over. But some people just couldn't stop trying to decide for me.<br><br>", "<b>Username: roycroftmom</b><br><br>So that explains why start ups and high tech are the third and fourth most frequent fields of employment for Stamps scholars, after finance and healthcare. Got it.<br><br>", "<b>Username: itsgettingreal17</b><br><br>If you look at Stanfords most recent career outcome report, I dont see a single top employer that is exclusive to Stanford. The mean salary doesnt mean much since the top destinations are high cost of living areas. What am I really missing? Nothing. I just dont see $300k-$500k difference between Stanford and Stamps at Wake.<br><br>", "<b>Username: Rivet2000</b><br><br>Actually startups can be in finance and healthcare; finance can include tech (quants) as can healthcare (ML radiology). You can probably map the Stamps fields to the field of the colleges they attended.<br><br>", "<b>Username: roycroftmom</b><br><br>It is the OP's money, and of course he can do as he wishes with it. People make unusual financial decisions all the time based on what they value. Leaving the ethics and legality aside, one recent defendant is accused of paying a 200k bribe, plus full tuition, for kid's admission to Chapman. I guess he thought Chapman was worth the money.<br><br>", "<b>Username: Mastadon</b><br><br>\"\"I had conversations last year with Penn-Wharton students who claimed that several of their classmates were making salary &amp; bonus beyond what I am willing to write here.\"\"<br><br>@publisher - There is an existence proof that Penn-Wharton students have a strong tendency to exaggerate when discussing their personal finances.<br><br>", "<b>Username: Rivet2000</b><br><br>There may be a few things we can all agree on. The OP will at some point make a decision based on their particular circumstances. Then, in a few years, the OP will be able to access the soundness of that decision.<br><br>", "<b>Username: ewho</b><br><br>^ The conclusion could be there is nothing good/bad but different from going to the other school.<br><br>", "<b>Username: Twoin18</b><br><br>\"...in a few years, the OP will be able to access the soundness of that decision.\"<br><br>This seems rather unlikely. Confirmation bias suggests that the OP is likely to view whichever decision is made as \"sound\" unless the kid is either desperately unhappy or the family ends up in financial difficulties from being full pay. After all, the outcomes from the alternative choice will remain unknowable.<br><br>", "<b>Username: Scipio</b><br><br>My son-in-law faced a similar choice for law school. He got accepted to Harvard, Yale, Stanford, and Univ. of Chicago law schools, among others. HYS offers were full pay but Chicago offered him a full tuition scholarship. And he would have to borrow big bucks to pay for any of the full pay schools.<br><br>Now Chicago is a top 5 law school on pretty much everybody's list. It gets its graduates into firms and opportunities every bit as grand as do the HYS law schools. So which law school did he choose? Stanford of course.<br><br>Why Stanford? I'm not sure. And I'm not so sure I would have made that same choice myself since it required going into significant debt, which for me is a red flag. So what did he find at Stanford that, in retrospect at least, made his choice the right one and his debt worthwhile? He found his wife there - my daughter. She was working at Stanford at the time and that's where they met.<br><br>Sometimes you just have to go with what your heart is tell telling you about these choices and not what the spreadsheet adds up to.<br><br>", "<b>Username: GoQuakers18</b><br><br>@Publisher - You are correct. Top IB pays first year analysts $200k+. Tech pays similar. Hedge funds pay more. Even for internships, a number of undergrads take home $40k gross. There are a myriad of posts on WSO on this topic.<br><br>", "<b>Username: Rivet2000</b><br><br>^ That is true but if you can look back and be happy with the education and opportunities that were experienced without regrets, that is success. If you are honest with yourself, confirmation bias is not involved. Could have, would have, should have are all irrelevant.<br><br>", "<b>Username: saillakeerie</b><br><br>\"\"One of the problems with this thread is that a certain group of posters will never think its wise to spend 300k on an undergrad education, period, no matter what college it is. I disagree with that concept.but you are never going to convince them otherwise.\"\"<br><br>And another problem with this thread is that a certain group of posters will always think its wise to spend $300k on an undergrad education as long as you have the financial means (subjectively determined). So it ends up being two groups of people talking past each other.<br><br>Though the biggest problem with this thread (and the numerous similar ones that pop up here from time to time) is the decisions are very unique to each family. Different kids have different goals, interests, personalities, etc. Different families have different financial circumstances. Although I have been gone from this site for about a year, I can see some of the same people making the same arguments I saw a year plus ago (and some new people making the same arguments other people made back in the day). So nothing has changed. The term \"financially able\" and \"sacrifice\" will vary by family. If someone says it was worth it to them, how does that help you make the determination for your kid/your family?<br><br>I always thought that this type of thread was pretty much useless for the OP asking the question for those reasons. People on an anonymous site (who may be telling the truth but you really have no way of knowing) who don't know anywhere near as much as you do about your own kid and your own financial circumstances will influence one of the biggest decisions you will make? Always seemed odd to me. Ultimately, I think the real \"benefit\" is for the same group of people making the same arguments over and over.<br><br>Though this did help remind me why I avoided these threads in the past. A year off made me forget. So that's a good thing.<br><br>Remember, there are no test cases with kids. No matter what decision you make and how well it turns out, one of the other options may well have turned out better. And no matter how badly a decision works out, all other options on the table at the time may well have turned out worse. Make your own decision based on the best info you have (and hope you have a lot better info/basis for this decision than what comes from an anonymous online site) and move forward.<br><br>", "<b>Username: roycroftmom</b><br><br>I leave you with one final observation, OP, and wish you luck in your decision. In my experience based upon friends and family I know well, those who thrived in college developed confidence and had opportunities, not necessarily commensurate with the rank of their school. It is far better, for employment purposes, to be number 1 at UVA than number 325 at Harvard. There are considerations besides employment, of course, but go where you will thrive. Good luck.<br><br>", "<b>Username: socaldad2002</b><br><br>\"It is far better, for employment purposes, to be number 1 at UVA than number 325 at Harvard\"<br><br>Or maybe you go to Harvard and you really shine there and become #1 because you are surrounded by the best and the brightest who challenge you and bring out the best in yourself...<br><br>", "<b>Username: privatebanker</b><br><br>@socaldad2002 The assumption you make is flawed. By both data and ultimate outcomes and alumni success. The assertion that Harvard students are better and brighter than UVA students, is inaccurate.<br><br>If one looks at the Harvard lawsuit there are wide spectrum of students admitted to Harvard.<br><br>And not all because they are better or brighter. Some are richer, can jump higher, gained media fame or have really smart or connected parents.<br><br>Or your dad was President of the USA or a Supreme Court justice.<br><br>I think both Harvard students and uva students are equally examples of tremendously talented kids.<br><br>", "<b>Username: sushiritto</b><br><br>\"\"If one looks at the Harvard lawsuit there are wide spectrum of students admitted to Harvard. And not all because of being better or brighter. Some are richer, can jump higher or have really smart parents.\"\"<br><br>Then it should make the path to #1 much be easier.<br><br>", "<b>Username: socaldad2002</b><br><br>@privatebanker when I say \"best and brightest\" I'm not only talking about the students but the faculty, program, the guest speakers from all over the world, etc. There is a false assumption that one will only be \"average\" at Harvard (Stanford) but #1 at UVA (WF). I'm not even sure I know exactly what \"#1\" means (by a previous poster) but maybe the elite college pushes and challenges the student beyond what the latter colleges could do in 4 years?<br><br>I look at it like the gifted athlete. Will you get better being on a weaker team but are the best player or do you want to be surrounded by other exceptional athletes who challenge you beyond your imagination?<br><br>", "<b>Username: privatebanker</b><br><br>@sushritto. You must be able to see the larger point of the post - regarding the relative quality of students at the nations best schools. UVA and Harvard students are nearly interchangeable. There is simply not that much separation and dont know why its is so important, to so many. Its quite odd actually.<br><br>As a person with a wife and father in law as Harvard grads and four generations at Deerfield. The potential for intellectual snobbery could run deep in my extended family. But it doesnt. Strange, but we are as happy and excited for the future for our Pitt nephews as the Vassar BC and ND and Brown clan. And we are certain that all of these kids , even the brilliant duo who chose Pitt for reasons of their own over so called big name schools, will find success equal to their talent and tenacity. They are all way more qualified than we were back in the day.<br><br>We love Harvard in my house. Its the finest school by many measures. But its not so much better to be blinded by it to other equally wonderful opportunities. And I love my wife so I better say its a great school.<br><br>And I know nothing about wake forest other than the data and real life students from our kids school. But we can also be open to reason and logic.<br><br>And the info being shared with youngsters and uninformed parents with a lot to lose - should be based on fact and honesty. Not selection bias or some outdated and elitist view of educational opportunities. And ignoring real life economic realities and crushing student and parental debt.<br><br>", "<b>Username: privatebanker</b><br><br>@socaldad2002 Well I think the UVA b school students wouldnt find their time at a school with no ug b school that interesting. And the kids who live on the lawn senior year are pretty interesting too.<br><br>And the professors. Speakers. And activities on campus are equally great at UVA and wake etc. I can post the number of professors in the harvard English dept or Yale neuroscience Depts that actually attend H or S, I checked yesterday.<br><br>They come from a majority of schools many would likely consider to be inferior. And they are teaching the classes.<br><br>Are these the better profs you mention? Because I couldnt find a Stanford grad in the mix but lots of state schools, European and Canadian equivalents.<br><br>I think when we say things about the higher level of profs and speakers. People assume itnto be true. Do you know who spoke at uva this semester. Or who are these profs that are so special. Wouldnt they all be from hpysm if thats where all the real talent resides and cross pollinates?<br><br>No one. Esepiclly me wouldnt say hpysm arent the most selective and prestigious schools in the world. I just dont think and have examples galore to show its not as determinative of success as it seems some others do. And we over index them in relation to other options.<br><br>", "<b>Username: sushiritto</b><br><br>I didnt go to a fancy school, I decided to pursue a athletic scholarship at a non-fancy school.<br><br>Anyway, I dont buy that the Stanford (Harvard) and WF (UVA) students are interchangeable. This WF thread popped up today and I read it. Does WF have a 44% ED acceptance rate? I know most of the 8-9 +/- students from our local HSs Class of 2022 that went to Stanford. All were the elite of their class. Simply brilliant kids.<br><br><url>https://talk.collegeconfidential.com/wake-forest-university/2135513-wake-forest-university-stats.html#latest</url><br><br><url>https://www.iecaonline.com/wp-content/uploads/2018/05/Early-Decision-and-Regular-Decision-Acceptance-Rates-April-2018.pdf?fbclid=IwAR3oXgn9bEVEhtxyp8BHS36zyX4r3jUAqFx7pLNbiIPXEL9nYnWMqZl_hsg</url><br><br>", "<b>Username: privatebanker</b><br><br>@sushiritto No. WF isnt 44%. From the WF website for last year. 74 percent of student attending were in the top ten percent of their class. The majority within the Harvard 25 to 75 percent profile range I would venture.. UVA oos applicants are towards the top of the range. UVA has 25000 applicants for early action this year. Up 17 percent. The total admit rate was low 20s. Much more selective than some of the cal powerhouses.<br><br>Do you think Berkeley students are way outside the hpysm threshold? I dont.<br><br>Back to WF. More than 1,400 first-year students will move into Wake Forest residence halls on Wednesday, Aug. 22. This class was admitted from an applicant pool of nearly 13,000. Seventy-four percent of the class of 2022 were in the top 10 percent of their high school classes.<br><br>But I am not saying hpysm arent better schools or the students Arent better. At the margins. I just dont think that margin is the English Channel. Maybe more like a river or creek that can be jumped over by many.<br><br>", "<b>Username: sushiritto</b><br><br>\"\"Do you think Berkeley students are way outside the hpysm threshold? I dont.\"\"<br><br>Stanfordrejects.com<br><br>WAY! Theres a old joke around here. If you ask a Cal grad why did they chose Cal (Berkeley), theyll answer because I was rejected by Stanford. I know a lot of Cal and Stanford grads, friends, neighbors and family, yes, English Channel in my opinion. I buy the Stanford Mystique.<br><br>Regarding the 44%, is the info from the 2nd link wrong? Because it states 44%.<br><br>", "<b>Username: privatebanker</b><br><br>@sushiritto They havent released it. Your figures are from last year and 44 percent is the early decision round. Regular is 25 percent where there is a much larger pool. I would think in the high 20s. But the quality of the pool is great. They dont get the waves of non competitive applications some schools get that pad that stat. There is definately overlap in the stats when you lay 25 to 75 ranges over each other.<br><br>And yes Im sure many cal admits also tried to get into Stanford.<br><br>But to suggest that means thr Stanford admits are therefore better assumes a few things I dont.<br><br>-that they are perfect in their decision making<br>-,there are no other non academic influences in the process<br>-a school that says it can admit three co -equal classes from its pool is lying<br>-the late bloomer isnt a thing<br><br>", "<b>Username: iska123</b><br><br>Full pay Stanford family here ( D is a junior ) and for those who are curious, we have paid about $202,500 for all three years so far. No regrets-- she has two jobs on campus ( both related to major ), four internships ( including one this upcoming summer which is in finance/IB ( will be paid 18k for 11 weeks plus housing stipend). In her circle of mostly full pay friends/classmates, this scenario is not unique. Just sharing her experience.<br><br>", "<b>Username: privatebanker</b><br><br>Thats awesome @iska123. Its a great school!<br><br>", "<b>Username: Data10</b><br><br>\"\"Does WF have a 44% ED acceptance rate? I\"\"<br>\"\"@sushiritto No. WF isnt 44%\"\"<br>The 44% figure is from section C21 of Wake Forest's CDS at <url>https://prod.wp.cdn.aws.wfu.edu/sites/202/2018/02/CDS_2017-2018.pdf</url> -- 815 / 1842 = 44.2% .Assuming nearly all of the \"early decision\" matriculated, then ~60% of the matriculating class would have been admitted ED. However, the early decision admit rate doesn't seem particularly relevant to this thread, as the OP wasn't an early decision applicant. If you mean that having a relatively high early decision acceptance rate means much of the class isn't academically qualified, I don't think you can make that assumption.<br>\"\"From the WF website for last year. 74 percent of student attending were in the top ten percent of their class. The majority within the Harvard 25 to 75 percent profile range I would venture.\"\"<br>Only 29% of matriculating students submitted rank, and WF is test optional. Neither is a good representation of all students. That said, among the students who did submit scores, scores ranges are high, but notably lower than Stanford and Harvard. Specific numbers are below from the latest CDS:<br><br>Wake Forest 25-75 ACT Range = 28-32<br>Stanford 25-75 ACT Range = 32-35<br>Harvard 25-75 ACT Range = 32-35<br><br>", "<b>Username: privatebanker</b><br><br>@Data10 as I said there is overlap at the tails of the bands.<br><br>The school itself posted the stat about the top 10 percent. Its a direct cut and paste from their website. Are you suggesting a lack of academic honesty for the school? They must have a source not available to you. It would be a bit of a scandal among the faculty to outright lie.<br><br>Do you have 25 to 75 sat range. Uw gpa type numbers? Any idea if the ecs and leadership of the classes. Thats an important component to success in life.<br><br>Any idea about the ranges and profile of the wf Stamps Scholars?<br><br>What about cals numbers.<br><br>", "<b>Username: Data10</b><br><br>\"\"The school itself posted the stat about the top 10 percent. Its a direct cut and paste form their website. Are you suggesting a lack of academic honesty for the school? They must have a source not available to you. It would be a bit of a scandal among the faculty to outright lie.\"\"<br>The majority of students rank is listed as \"not available\" on Wake Forest's website at <url>https://prod.wp.cdn.aws.wfu.edu/sites/202/2018/05/2017_2018_p12.pdf</url> . For 2017, Wake Forest's website says class rank is \"not available\" for 956/1349 = 71% of students, meaning only 29% of submitted rank.<br>\"\"So yo have sat range. Uw gpa type numbers?\"\"<br>SAT ranges are in the link above (note test optional students who did not submit scores are excluded), as well as the previously linked CDS.<br><br>", "<b>Username: itsgettingreal17</b><br><br>@iska123 Thanks for sharing! Im glad your daughter and her friends are having a wonderful experience. I wish more would share their experience. It might demystify Stanford, Harvard, etc. Because nothing in your post seems exclusive to me.<br><br>My D is a Stamps (not at WF). She and her friends who want those types of internships get them (she has one this summer). Shell be interning right alongside students from Harvard, Stanford, Wharton, etc. My D and her friends work or intern on campus (if they want to, though they dont need to). They do research on campus and internationally. They travel the world. (My D has already done 4 study abroad programs and traveled to 9 countries, including an amazing African safari for spring break exclusively designed for them). They are, like your daughter and her friends, having similarly wonderful undergrad experiences. And the bonus is they arent paying for it; its free.<br><br>I dont care what other people do with their money. The elevation of a few schools beyond all reason is just irrational to me. Someone upthread said theyd beg, steal, or borrow to send their kid to Stanford. While that poster may have been kidding (I sure hope so), some really do think that way. Its not healthy and not rational. I dont deal in mystique.<br><br>Tell me Stanford is a better fit than WF for OPs specific kid. Maybe it has a particular program not offered at Wake that he wants to pursue. That I get. But dont tell me the Stanford experience and opportunities are unparalleled and $300k-$500k better than the Stamps experience at Wake Forest or similar, because the objective facts and stats just dont bear that out. Both are elite options that very few students ever get to consider. Thats all Im saying. I know which option Id choose. And my D didnt hesitate when faced with a similar choice to make.<br><br>Interestingly, last year my D went to a workshop where she ran into a student she had met at the scholarship interview weekend for where she attends now. The other student turned down the scholarship for Harvard. They compared experiences. Nothing the other student said caused my D to regret her choice. Both will be working in the same industry this summer. One of them will be working at a higher ranked company. You guess which one. ;-)<br><br>", "<b>Username: roycroftmom</b><br><br>I too am glad for you, @iska123. But your daughter likely would have the same outcome had she attended another school as well. My eldest also has a well paying summer internship in consulting this summer, and banking next summer. Looking at the linked in profiles of her fellow interns, the students are from all over-mostly<br><br>", "<b>Username: roycroftmom</b><br><br>Sorry, posted too quickly. Anyway, the interns are mostly top 20 college kids, but a few from other schools,as well. So the Stanford kids are working right next to the Wake kids, at the same salary, and there is a state flagship kid there too. It is more about the kid and less about the school, at least at the top tier places my kid is interning.<br><br>", "<b>Username: Publisher</b><br><br>An important factor is what do employers think about Stanford versus WFU ?<br><br>Do employers target WFU ? Or even WFU Stamps Scholars ?<br><br>Easy for employers to target (recruit at) large state university honors colleges--such as the University of Georgia--and super select groups within that honors college--such as Foundation Fellows--benefit.<br><br>Most major companies have leadership development programs which target certain universities. Investment banks &amp; management consulting firms also have target schools at which they recruit every year. Stanford is a target school. WFU is not. I may be wrong, but I have not even read or heard of WFU being a semi-target. Tech companies also target Stanford.<br><br>Stanford is a hot school for employment &amp; other opportunities. Stanford offers a different environment than almost all other colleges &amp; universities.<br><br>An extreme example: If you are in search of a high paying job &amp; career, should you move to Detroit / Flint, Michigan or to Silicon Valley, Seattle, Boston, or New York City ?<br><br>Stanford is almost like Harvard &amp; MIT combined into one university.<br><br>There is a reason why NFL scouts focus their attention on certain schools year after year.<br><br>Students make lifelong connections at Stanford with other exceptional students.<br><br>Nevertheless, in the two cases being discussed in this thread, Stanford is not free.<br><br>", "<b>Username: momofsenior1</b><br><br>\"\"If you are in search of a high paying job &amp; career, should you move to Detroit / Flint, Michigan or to Silicon Valley, Seattle, Boston, or New York City ?[/<br><blockquote class=\"Quote UserQuote\"><br><div class=\"QuoteText\"><br>\"High paying\" in a high cost of living area doesn't translated to increased quality of life.<br><br>\"\"<br></div><br></blockquote><br><br>", "<b>Username: roycroftmom</b><br><br>@Publisher, there are 247 employees at Goldman Sachs with Wake Forest degrees. No doubt it is comparble at Black Rock, CS, etc. But I have begun to think the facts simply do not matter to some posters, which is fine. Let deserving kids who appreciate the value of the Stamps scholarship (or the Robinson, Commodore, etc) take them and enjoy all the benefits thereof.<br><br>", "<b>Username: Hoggirl</b><br><br>For future readers who may face similar dilemmas: How should one value the Stamps across the different institutions that offer it? The OP @hello_you has a child considering Stamps at Wake Forest v Stanford at full pay. Another poster on this thread @HoustonKen has a child considering Stamps at Ole Miss v Stanford at full pay. Somewhere in this thread, I read that the Stamps awards vary among institutions where offered. I dont know if they are the same at Wake and Ole Miss, but for the sake of argument, lets say they are. My question is how much should the underlying institution be factored in when considering Stamps v full-pay Elite University?<br><br>Righty or wrongly, I think most posters on this board would consider Wake to be better than Ole Miss. So do we value Stamps for the sake of Stamps alone, or does one also look at the underlying institution where it has been awarded?<br><br>", "<b>Username: sushiritto</b><br><br>\"\"Someone upthread said theyd beg, steal, or borrow to send their kid to Stanford. While that poster may have been kidding (I sure hope so), some really do think that way. Its not healthy and not rational. I dont deal in mystique.\"\"<br><br>@itsgettingreal17 That was me. Thats my opinion. Im very healthy and rational too. But ToS states that CC members are to be kind, respectful and nice to one another. :wink:<br><br>", "<b>Username: itsgettingreal17</b><br><br>@Hoggirl It goes back to fit. First of all, no one should be applying for Stamps all over. They should apply because the school is a good fit and the Stamps scholarship sweetens the deal. My D also considered the Stamps at Ole Miss. While it was one of the lowest ranked schools among her choices, it ended up being her second choice at the end of the day. Why? Because Ole Miss has amazing critical language programs, a fantastic honors college, and is strong in her second major. Had she accepted it, my D would have graduated with scholarship money in her bank account, attained all of her academic goals, and had a great 4 years. The Stamps students there are very impressive - Ivy/Stanford level stats and accomplishments. The language students she met there run rings around students at schools people think are top notch in languages, eg, Middlebury (yes she can compare based on experience). We just are not obsessed with rank for undergrad.<br><br>", "<b>Username: dumbo11</b><br><br>If you can afford it, it really depends on your child. My oldest daughter had quite a few amazing scholarships, but she fell in love with Dartmouth, and we told her if she got in, we would pay for it. It was the perfect school for her, and Im thrilled we could provide that opportunity. Our younger daughter never fell in love with that one school. She also got in to many prestigious schools, but she decided to take the full ride Stamps scholarship at U of Miami. Both my kids graduated several years ago. Fast forward to today, and both work for Google. The Stamps Scholars program is an amazing program, with many benefits to its scholars. My younger d is happy with her decision. My older d wouldnt have given up her dartmouth experience for anything. Id let your child decide. There is no wrong answer.<br><br>", "<b>Username: bopper</b><br><br>I think she should think: why did I apply to wake forest? Why did I apply to the Stamps Scholarship?<br>Do i want to be a big fish in a small pond or a small fish in a big pond?<br><br>", "<b>Username: sushiritto</b><br><br>@Data10 wrote:<br>\"\"If you mean that having a relatively high early decision acceptance rate means much of the class isn't academically qualified, I don't think you can make that assumption.\"\"<br><br>That was not the assumption I was making. @privatebanker and I were having a discussion about peers at each school, Stanford and WF. With a 44% ED acceptance rate at WF, IMO, the overall class profile at Stanford would be much better than WF.<br><br>", "<b>Username: Publisher</b><br><br>Not sure whether or not one \"applies\" for the Stamps Scholarship at most of the schools.<br><br>The Stamps Scholarship Foundation has about 31 partner schools. Annual benefits range from approximately $72,000 to just $5,000.<br><br>Stamps Scholarship is a two year benefit at Dartmouth, Chicago, USMA at West Point, The USAFA at Colorado Springs &amp; at the Naval Academy.<br><br>Partner schools include:<br><br>The University of Georgia Foundation Fellows, the University of South Carolina \"Carolina Scholars\", Wake Forest, Virginia, Virginia Tech, College of William &amp; Mary, Pitt, Oregon, Texas, Purdue, Barry University, Elizabethtown College, Georgia Tech, LSU, Oberlin, Ohio State, Tulane, UConn, Florida, Illinois, Univ. of Miami as well as its music school, Michigan, Mississippi, Notre Dame, and Oregon.<br><br>", "<b>Username: Publisher</b><br><br>@roycroftmom : Never wrote or suggested that WFU students do not work at or get jobs at investment banks. Just wrote that I questioned whether or not WFU is a target school for recruiting by the top investment banks.<br><br>", "<b>Username: Scipio</b><br><br>\"Stamps Scholarship is a two year benefit at Dartmouth, Chicago, USMA at West Point, The USAFA at Colorado Springs &amp; at the Naval Academy.\"<br><br>Since the military already provides a full ride plus a small salary to all cadets and midshipmen at the service academies, what is the purpose of the Stamps scholarships at those schools? Genuinely curious.<br><br>", "<b>Username: BuckeyeMWDSG</b><br><br>Networking through organized events like their national convention. <url>https://ssnc.stampsfoundation.org/</url><br><br>", "<b>Username: Publisher</b><br><br>@Scipio: Service academies' Stamps Scholarships are used for attending conferences, international travel &amp; research expenses. At the USAFA, Stamps Scholars are selected from among the top 5% of the class.<br><br>The Stamps Foundation is based in Atlanta, Georgia.<br><br>", "<b>Username: CU123</b><br><br>The Stamps scholarship is more like a grant at the academies and is used for projects/studies during the summer.<br><br>Example:<br><br>United States Air Force Academy (USAFA) junior James Brahm from Huntsville, AL, is majoring in computer science with minors in nuclear weapons and Chinese. Brahm competes as part of the USAFA Cyber Team and is interesting in hacking, artificial intelligence, and deterrence theory. He has also completed survival training and earned jump (skydiving) wings and is learning to fly T-53s. The Stamps Foundation provided him the resources to study the role of technology in Chinese society, participate in an Aspen Institute Symposium on the future of western democracy, and purchase computing equipment to conduct machine learning research. This summer, he will conduct quantum computing research in Palo Alto.<br><br>", "<b>Username: RayManta</b><br><br>What's interesting is that, to the OP (per the original post), WF w/Stamps > Duke and WF w/Stamps > Vandy. Perhaps the OP should try to articulate why Stanford is so much better than Duke and Vandy to create this dilemma. I'm not saying it isn't, but implicitly that's the calculus here.<br><br>I don't know what the right answer is, and I am trying to wrap my head around what we'd do in the same situation when my junior D applies next year. When I told her your dilemma and asked her what she'd chose, she first wanted to know if she would get to keep all the money we would save. If you offered, say, to split the savings with your son--that half of the cost of Stanford he'd get as a graduation gift if he went to Wake--would that make the difference to him?<br><br>Obviously, there's no \"right\" or \"wrong\" answer here, and you'll never know if you made the right choice. Would be be truly happy at Wake? I don't think you said where you are from--would he feel out of place in a southern school? I also think that Stanford has more of an urban feel, and is a larger campus (in part due to the grad programs), but could be wrong. My wife went to law school there, and I think it would have been difficult without a car because of the sprawling nature of the campus, but again, maybe that's just for the graduate programs, and regards the students who don't live on campus--others can chime in there better than I. Anyway, I'd probably chose wherever he'd be objectively happier.<br><br>", "<b>Username: iska123</b><br><br>one additional point I wanted to add that I have never seen mentioned before on CC, but when my D (current junior at Stanford) did her last year's summer internship at a Startup ( tech , not finance) , she found out from conversations with her two other co-interns ( there were three of them in the same exact department and positions, and these other two are from in state Universities in California) that she was paid much more than them . FYI my D was a sophomore then and the other two were both seniors. This may just be one isolated situation, but wanted to share that as well.<br><br>", "<b>Username: sushiritto</b><br><br>\"\"My wife went to law school there, and I think it would have been difficult without a car because of the sprawling nature of the campus, but again, maybe that's just for the graduate programs, and regards the students who don't live on campus--others can chime in there better than I.\"\"<br><br>Not that the being one of the largest campuses in the US by physical size matters in this discussion, but a simple bike will suffice to navigate Stanford's campus. As I said earlier, Stanford pervades much of everyday life in one way or another. Another example is that I often play pickup basketball on Sundays with a Stanford professor in the School of Medicine and he just bikes everywhere.<br><br>", "<b>Username: Hoggirl</b><br><br>@itsgettingreal17 - Im quite familiar with Ole Miss. It made dss short list as well, though he went elsewhere. He was not offered a Stamps, but all costs would have been covered there because of National Merit, the Croft Institute Scholarship and other scholarships he qualified for there. The stacking they provide is amazing! The Croft Institute and the Chinese Flagship programs are wonderful - thats why Ole Miss made his overall list and short list. In the end, he did not stay with IR anyway. I am always a bit reluctant to choose a school for a specific program/major, but thats just one persons view.<br><br>I was just asking about the underlying institution because others had been comparing middle 50% score ranges between Wake, Stanford, and Harvard. If one values those statistics, that speaks to the perceived *overall* quality of the underlying institution and its student body. My assumption is that the middle 50% for Ole Miss is significantly lower for Ole Miss than it is for Wake.<br><br>I do hear you on fit. But, for some a significant component of fit is the academic stats of peers.<br><br>", "<b>Username: observer12</b><br><br>Am I the only middle aged person here who knows grads from Stanford, Harvard, Yale etc. doing pretty much the same types of work that grads from Wake Forest and so-called \"lesser\" universities do? They are doctors, lawyers, teachers, professors, filmmakers, producers, scientists, businessmen, journalists, etc. They aren't masters of the universe nor are they Nobel prize-winners. They have happy, successful lives and their self-worth is not defined by their degree. If they did attend a prestigious university like Harvard or Stanford, it is likely their children do not. And they are perfectly fine with that, and if one of their kids does go to Harvard or Stanford, they are happy with that, too. It doesn't make them love that child more and often they recognize that their child that got into prestigious university x is no smarter than their child that did not get in. And they also see that the students going to those universities are not necessarily the smartest but sometimes the most connected.<br><br>If your goal is investment banking and Goldman Sachs seems like nirvana, then yes, going to Harvard or Princeton is it. If you believe your degree from Stanford guarantees you a fantastic position at some silicon valley firm, then yes, go to Stanford. (Although I find that ironic given that it seems likely that if you are actually brilliant enough, you don't even need college at all for tech jobs).<br><br>If you are a few years out of college and you still have to count on your \"prestigious\" college degree to make people accept you or respect you, then you are hanging out with the wrong people. Or you are on a career path that the majority of graduates from those schools do not want and do not value. If your goal is to be on that career path - like investment banking - then choose prestige. But if your goal is to have a happy life, then it is highly unlikely that the people you choose to surround yourself will care about whether your college degree is from Wake Forest or Stanford. They will like and respect you for who you are, for what kind of person you are, not your degree. And students choosing a school for prestige may find themselves disappointed that most people will judge them by their character and what they do in their workplace and their life, not the name of the college they attended.<br><br>", "<b>Username: Publisher</b><br><br>Google search revealed that Stanford has the first or second most alumni of any school at Google, Facebook &amp; Apple.(San Jose State was ahead of Google at one of the three companies.)<br><br>Could not find any support for a poster's earlier statement that 247 WFU grads worked at Goldman Sachs. But GS has almost 37,000 employees worldwide and several divisions. Most GS placement discussion revolves around IB (investment bank division).<br><br>What is interesting is that there is a list, now 3 years old, of the top ten feeder schools to Goldman Sachs IB and school #10 had 248 alumni at Goldman Sachs--so it is possible that #11 could be a school with 247 alumni.<br><br>P.S. JP Morgan has the most interesting list of employees by school affiliation. While Ohio State was at number one with 1,811 JP Morgan employees, number two was the University of Phoenix with 1,081 employees at JP Morgan.<br><br>Of course, number of employees is not meaningful unless their positions &amp; pay are known. That is why most discussion focuses on the high paying IB positions when referring to \"feeder schools\".<br><br>", "<b>Username: socaldad2002</b><br><br>\"If you are a few years out of college and you still have to count on your \"prestigious\" college degree to make people accept you or respect you, then you are hanging out with the wrong people.\"<br><br>I look at this a little differently, I don't think most students only choose to go to Stanford, Harvard, or MIT because it's \"prestigious\" but because it's a world class institution that will shape them for four (4) very important years of their life and is an education that will stay with them long after they receive their college diploma. Is it a fluke that Stanford is one of the best educational institutions in the world, or, as I think, maybe they do things a little better than their peers.<br><br>", "<b>Username: sushiritto</b><br><br>\"\"Am I the only middle aged person here who knows grads from Stanford, Harvard, Yale etc. doing pretty much the same types of work that grads from Wake Forest and so-called \"lesser\" universities do?.....They are doctors, lawyers, teachers, professors, filmmakers, producers, scientists, businessmen, journalists, etc. They aren't masters of the universe nor are they Nobel prize-winners. They have happy, successful lives and their self-worth is not defined by their degree. If they did attend a prestigious university like Harvard or Stanford, it is likely their children do not.\"\"<br><br>Well, I can tell that I've never met anyone from WF here in the SF Bay Area or anywhere yet. I know many/most of folks in my peer network that did attend prestigious universities, but I didn't.<br><br>Regarding the children and where they attended, as I said up-thread, the Stanford doctor across the street will likely have all 3 of their children attend Stanford. One is in middle school, but the other two are there. The Stanford professor in the School of Medicine. His two children graduated Stanford. They do get reduced tuition though, so that helps.<br><br>Someone I work with went Yale. His oldest child went to Yale. Another person at work went to Stanford. His child went to Stanford.<br><br>The 8-9 +/- brilliant students that graduated our local HS and now attend Stanford Class of 2022, yep, most of their parents went to Stanford. I know one of those Stanford students, whose parents didn't attend Stanford. She actually chose Stanford over MIT and Harvard. Not that its relevant here. All really smart kids though.<br><br>All anecdotal.<br><br>", "<b>Username: observer12</b><br><br>@sushiritto<br><br>It sounds as if Stanford admits a lot of students whose parents have a connection to Stanford. While I am sure the 8-9+ students who graduated your local HS and now attend Stanford are brilliant, I suspect all of them are not more brilliant than 200 unconnected students (maybe more!) who applied from high schools all over the country and got rejected. Some of those will end up at schools like Wake Forest -- especially if they are students whose families don't qualify for financial aid and decide that merit money at Wake Forest is better than full pay at Dartmouth or Northwestern or even Duke.<br><br>You must live in very rarefied community. Outside of incredibly affluent communities or expensive private schools, most graduates from those schools don't send all their kids there. At least, I certainly don't see it (anecdotally, of course).<br><br>", "<b>Username: sushiritto</b><br><br>The bottom line for me is that I see incredibly successful people, many of whom attended Stanford. And some of their children do too. With or without connections. The 8-9 +/- kids from the HS Class of 2018 were from the same class as my kid and they all attended an extremely diverse local SV public school of 2,400-ish kids.<br><br>As far as I can tell, WF graduates aren't well represented in my community, which isn't \"rarefied.\" I've just not run across any WF graduates. Or Ole Miss for that matter. I do know someone very well from the State of Alabama, but he's the Dartmouth graduate I mentioned earlier. He drives me nuts though, because he's a big Bama football fan. :smile:<br><br>As I said, all just anecdotal to my life here.<br><br>", "<b>Username: Scipio</b><br><br>\"And they also see that the students going to those universities are not necessarily the smartest but sometimes the most connected.\"<br><br>As the recent scandal has shown, there may be more than one way into a high-end university. However, rightly or wrongly, it still remains that in many cases attending one of the HYPSM or peer colleges BY ITSELF is taken as a mark of achievement - apart from the courses you took or the grades you earned. When a Hollywood movie wants to signal to the audience that a given character is a very smart high-achiever, it often writes them into the script as a Harvard graduate. And everyone in the audience gets the point.<br><br>I think employers know that there are many wonderful and very smart kids coming out of schools other than the very top, but the percentage of the graduating class that is comprised of really bright kids coming out of Harvard, Stanford, etc. is going to be higher than out of lesser schools such as say, my alma mater, UC Davis.<br><br>But by focusing solely on internship, employment opportunities, and career success perhaps misses an important component of motivation of whether to choose Stanford even when it costs more money. Namely, for some individuals, part of the goal they are seeking may be Stanford itself, rather than better opportunities later that it may or may not provide. If attending Stanford is a significant part of the goal, then saving all that money by going to \"lesser\" school may not be worth it to them.<br><br>", "<b>Username: Happytimes2001</b><br><br>@socaldad2002 When you say people shouldn't need to rely on their education after a few years out of school, you are missing an entire set of people who work for themselves/consult/are knowledge workers/ or own businesses. Their education is essential to getting them work ( putting food on the table). In some industries clients care about your education because they are paying you for knowledge and that is one component. Granted for someone who works in government or some job with very little change, it doesn't matter all that much. But for a large segment of the population in particular knowledge workers of various types it can mean tens of thousands of dollars every year or more for a lifetime. That is money in the bank. BTW, I know entire classes of people who rely on their education in this manner.<br>This is likely to continue given that very few people work for the same corporation for a lifetime.<br><br>", "<b>Username: Happytimes2001</b><br><br>@socaldad2002 Sorry I just realized you were citing someone else's quote. Didn't mean to take you out of context. My point was with the first sentence ( which obviously was not yours)<br><br>", "<b>Username: roycroftmom</b><br><br>Sushiritto likely lives near Silicon Valley, so of course there is disproportionate attendance at Stanford. The same is true at Princeton for NJ, Harvard for Massachusetts, Emory for Georgia, etc. If one is just judging from one's hometown, the results are both narrow and skewed.<br><br>", "<b>Username: privatebanker</b><br><br>On another thread choosing between Princeton and Pomona, an astute poster brought up a great point.<br><br>She referenced the foremost scientist in molecular biology, Bonnie Bassler, who is a noted professor at Princeton.<br><br>And she stated its a great reason to look at studying that major there instead of Pomona. Reinforcing how important it is to have access to quality of the profs. Dont disagree.<br><br>Worth mentioning she is a graduate of UC Davis. She obviously survived without the like minded and equally brilliant students to make it bearable . And the unique access and research opportunities that seem to be the exclusive domain of five or six schools.<br><br>But funny to me that the reason to reasonably select Princeton over equally elite Pomona in 2019 may be access to a lowly UCD grad (sarcasm) . Not even a state flagship.<br><br>Side note. If saying that Stanford grads dominate in Palo Alto and greater SF tech goes without saying. Hopkins in Baltimore. CMU and Pitt in Pittsburgh. UCLAs and usc is LA. Harvard and MIT in Cambridge. NYU and Columbia in NYC. Etc etc can say the same thing.<br><br>Where i live it would be intersesting to meet a Stanford grad. I know a few and they are b school grads. But Brown and the state school dominates. And who cares?<br><br>", "<b>Username: sushiritto</b><br><br>I have family and friends from all parts of the Bay Area, including SF, Oakland, Berkeley, etc. I haven't lived in SV all my life and I also don't work in SV. :smile:<br><br>There's plenty of other universities around here too, including Cal, Santa Clara, USF, St. Mary's, GGU, CSU East Bay, UCSC, SJSU, etc. I have quite a few of my immediate relatives that went to Cal, including one who graduated in 2018-2019.<br><br>Edit: Nope, I don't live in Palo Alto or Stanford, CA. My two best buds? Penn State alum and the other is from India. But we can keep playing 20 questions or get back on topic. :smiley:<br><br>", "<b>Username: Rivet2000</b><br><br>I wonder why Bonnie Bassler chose to teach at Princeton instead of UC Davis.<br><br>", "<b>Username: privatebanker</b><br><br>@Rivet2000 Money.<br><br>", "<b>Username: Rivet2000</b><br><br>And that's one metric that differentiates colleges. Having the money to attract teaching talent, build the facilities and labs, etc.<br><br>", "<b>Username: privatebanker</b><br><br>@sushritto. Think regionally not town specific.<br>SV and the Bay Area.<br>Western PA<br>Metro nyc and surrounding area<br><br>Georgetown and UVA in the great greater DC and nova.<br><br>Etc.<br><br>", "<b>Username: privatebanker</b><br><br>@Rivet2000 And then everyone complains about rich kids getting in because of huge donations. Until it supports the argument why it makes them better.<br><br>Princeton is a better school in nearly all categories than UCD.<br><br>But for the right set of circumstances like a Stamps scholarship and a full ride its more than good enough.<br><br>If someone wants to spend their money on a school that is super elite. I have no problem with that at all. In the absence of competitive alternatives I would and currently am doing this personally. But thats not the question being asked.<br><br>And no one is saying that wf or ole miss have the same reputation or super elite composition.<br><br>Its just the no brainer commentary among some. Its funny that the least open minded responses to a dialogue around this and to differing opinion seem to be grads of these super elites or their ardent supporters. You would think open minded exploration is what these fine schools would encourage. Not close mindedness. And they would be the least insecure about how the world viewed them. Theres room at the top for a few more people and doesnt disparage or reduce your great schools in any way.<br><br>But its a free country.<br><br>", "<b>Username: sushiritto</b><br><br>@privatebanker Of course, I know that, BUT here's a 2017 article about....<br>\"\"\"Silicon Valley hires the most alumni of these 10 universities, and none of them are in the Ivy League\"\"\"<br><br><url>https://qz.com/967985/silicon-valley-companies-like-apple-aapl-hires-the-most-alumni-of-these-10-universities-and-none-of-them-are-in-the-ivy-league/</url><br><br>1 University of California, Berkeley<br>2 Stanford University<br>3 Carnegie Mellon University<br>4 University of Southern California<br>5 The University of Texas at Austin<br>6 Georgia Institute of Technology<br>7 University of Illinois at Urbana-Champaign<br>8 San Jose State University<br>9 University of California, San Diego<br>10 Arizona State University<br>11 University of Michigan<br>12 University of California, Los Angeles<br>13 North Carolina State University<br>14 California Polytechnic State University-San Luis Obispo<br>15 Cornell University<br>16 University of Waterloo (Canada)<br>17 Texas A&amp;M University<br>18 University of Washington<br>19 Purdue University<br>20 Massachusetts Institute of Technology<br>21 Santa Clara University<br>22 University of Phoenix<br>23 University of California, Santa Barbara<br>24 University of California, Davis<br>25 Penn State University<br><br>Many CA universities, but # 3 is Pittsburgh, PA, #5 is Austin, TX, #6 is Atlanta, GA, #7 is UIUC and so on. WF didn't make the Top 25.<br><br>The point is the SF Bay Area is a melting pot of people from everywhere.<br><br>", "<b>Username: Rivet2000</b><br><br>@privatebanker If you remove money from the equation (which I think OP has) what is the value of Wake (and any non-monetary Stamps benefits) over Stanford? Isn't that the question?<br><br>", "<b>Username: privatebanker</b><br><br>@sushiritto This supports exactly whats been said. Look at the list of schools. 11 of the top 15 are state schools.<br><br>And if you did these same surveys in other areas stanford or other great schools wont make the top 10 either.<br><br>But, I thought youve been saying that Stanford is so dominating where you live its hard to imagine choosing somewhere else for school? What about Cal grads. Do they fly in on Mondays ?<br><br>And I recall earlier posts where it was nearly mocked for suggesting Cal vs. Stanford. UCB is only for Stanford rejects. Seems the employers like them.<br><br>", "<b>Username: bluebayou</b><br><br>\"\"lowly UCD grad (sarcasm) . Not even a state flagship.\"\"<br><br>But, and perhaps somewhat related to this thread, she was offered a Regents Scholarship at Davis in 1980. Back then, I believe it was a full ride, tuition, stipend for housing, computer, and summer research paid. Undoubtedly, she also would have gotten into Cal and UCLA if she applied, but instead, she took the money and ran, so to speak.<br><br>", "<b>Username: marrast</b><br><br>OP must be amused.<br><br>", "<b>Username: Hoggirl</b><br><br>Ive written about this before on CC. Ds had a friend who graduated a year ahead of him who chose to attend UT-Dallas as a McDermott Scholar over being full-pay at Stanford. Cant tell you how many folks said he was crazy for turning down Stanford (yes, his family could afford it). When we were going though the process, I had a friend say to me, Anybody who spends $______ (insert full-pay price of elite college) when they can go somewhere for free is crazy.<br><br>Im telling you - youre <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"553115383b3031\">[emailprotected]</a> if you do, and <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"1e7a5e73707b7a\">[emailprotected]</a> if you dont. No one is likely going to change anyone elses mind.<br><br>", "<b>Username: Rivet2000</b><br><br>or frightened :smile:<br><br>", "<b>Username: privatebanker</b><br><br>@Rivet2000 Without stamps and the monetary difference i would choose Stanford. 100 percent.<br><br>But we dont usually live in a world of absolutes and vacuums.<br><br>The question is actually where would you go under these circumstances. And its a tough call because of the Stanford advantages. Its just Wake is close enough for me with the other benefits involved to be worthy of a long discussion. And with the long term consequences for a family and student on the line, quick judgements are irresponsible.<br><br>Its best to let the fever of the hunt subside.<br><br>Its just the Stanford and elite proponents wont have it.<br><br>Theres no conversation to be had. Its easy to spend other peoples money and endanger the future opportunities for child two, med school and retirement. And with such a nearly equally alternative it seems a bit of a folly.<br><br>In my business, it would be called negligence if I gave this advice - to a paying client or company.<br><br>", "<b>Username: sushiritto</b><br><br>@privatebanker Not really. You can say it supports your opinion, but I don't believe so.<br><br>A. The list represents ONLY SV hires and the Bay Area is much more than just SV.<br>B. My peer/friend network seems more dominated by very successful Stanford alums and a few other prestigious universities not located here (Dartmouth, Yale, Harvard, etc.). I guess I'm lucky to have them around to help me. My views here are colored by those who are around me in my daily life.<br>C. Cal is the largest university in the area, so yes, sheer volume will give them a better chance at being at the top of the list.<br>D. The old joke about \"Stanford Rejects\" (Cal vs. Stanford) didn't start with me. It's a very old joke. Funny though. I attended neither one. I'm agnostic.<br><br>", "<b>Username: youcee</b><br><br>@bluebayou Unless Davis was different than the other UCs, the Regents was probably several hundred dollars and possibly a one time payment. That's all UCSD was back then. Berkeley added guaranteed housing, but not money for it. Also, at least in 1978, you basically applied to all UCs on the same app and ranked the order of preference. So if Davis was put first, since it wasn't impacted you would not be put into Cal or UCLA if they were ranked lower.<br><br>", "<b>Username: Rivet2000</b><br><br>@privatebanker sounds right, although I have not read that the OP has expressed conflicts w child #2 or other. I may have missed that.<br><br>", "<b>Username: rickle1</b><br><br>Much has been said or assumed about job outcomes / placement for WFU. For those interested in facts, go to the Wake website. Under Career Development screen, you can look at actual data (not stats, real data) that account for EVERY student who replied to their first destination survey (has a massive 90%+ knowledge rate- at least recently). Go look at the spread sheets per major and you'll see Major, Yr, Company, Title, ROle, Location. You'll see that Wake is very well represented in IB in both NYC and Charlotte, Corp Banking, Private Banking / Wealth Mgmt (wish more cared about that because that's where you can do incredibly well without killing yourself - at least that's my experience the past 30 yrs), Consulting (Big 4, Booz Allen, Accenture, a few Bain - not many). Typically Fin majors want banking and approx 50% of them get it each yr.<br><br>Does it have the quantity of Stanford? Absolutely not. But it is heavily recruited by major banks and firms. They are on campus alot and kids who want to go down that path ( and who do well academically) have a very good shot at those jobs. This is without Stamps. Although an anecdote, I've looked through S's linkedin contacts. Over 200 so far (not bad for a sophomore). Of his peer network, virtually every junior has an impressive upcoming summer internship at GS, Blackrock, Pimco, Wells, Citi, PNC, JP Morgan, Morgan Stanley, Fifth Third, Suntrust, EY, Deloitte, KPMG, Pepsi, Newell Brands, etc.<br><br>These kids do just fine if they're motivated (which they are or they wouldn't have been admitted).<br><br>", "<b>Username: privatebanker</b><br><br>@sushritto. The point is as exactly as youve stated - ones worldview is colored by your environment. And by confirmation or selection bias.<br><br>It would seem that a young engineer in Mumbai wouldnt understand why anyone would say no to IIT.<br><br>Or the young executive in Florida where UF dominates or Georgia with UGA would naturally wonder why anyone would pay to go to school in New England.<br><br>Ive been around and lived and worked with people from all over the world. Ive had clients that are considered titans of their respective fields turn to me for advice on financial matters.<br><br>I can only share my advice and experiences. Disagree as one is free to do.<br><br>But I do believe if we all posted our LinkedIn profiles, posters could better determine who is sharing advice based on expertise and who is using emotion.<br><br>", "<b>Username: ewho</b><br><br>\"\"And I recall earlier posts where it was nearly mocked for suggesting Cal vs. Stanford. UCB is only for Stanford rejects. Seems the employers like them.\"\"<br><br>It really means that if you type<br><br>www.stanfordrejects.com<br><br>it will direct to UCB.<br><br>", "<b>Username: privatebanker</b><br><br>@ewho I know its a thing. A thing started by standford grads who are either needlessly insecure or pissed off at that their cal grad boss.<br><br>", "<b>Username: ewho</b><br><br>^ You speculate, it could be your secret and should not tell others. We don't know.<br><br>", "<b>Username: privatebanker</b><br><br>@ewho. I dont think the cal kids started it themselves. And no one else gives a .....lol<br><br>", "<b>Username: sushiritto</b><br><br>\"\"But I do believe if we all posted our LinkedIn profiles, posters could better determine who is sharing advice based on expertise and who is using emotion.\"\"<br><br>@privatebanker Really are we \"measuring\" by the size of our LinkedIn profiles? :smiley: OK, you win there! I only compete in the gym or on the course, court or field. (all said with a sense of humor, of course)<br><br>I'll stick to my original opinion, which is, if it were my child, and not the OP's, then I'd \"beg, borrow and steal\" to send my kid to Stanford (I added quotes there this time). My opinion alone and I certainly don't care if I'm the only one here and I'm swimming up stream. It wouldn't be the first time in my life. :wink:<br><br>", "<b>Username: sushiritto</b><br><br>What happened to our collective sense of humor? It's a joke. That website probably was started around the time when they just begun handing out the 1st domain names. Cal and Stanford have had a rivalry for forever.<br><br>", "<b>Username: Rivet2000</b><br><br>Actually, I think the regional hiring effects are and will continue to diminish. They will always be there to some extent but for different reasons. I think they are an artifact from a pre-globalization time that just made it easier to hire local. Most big companies look on a global level now. The Silicon Valley ecosystem is slightly different in that it is primarily a startup incubator spinning out new tech at a high rate (even though more that 90% fail) utilizing Bay Area money and the academic concentration in the valley. Other regions are working to build their own ecosystems (Pittsburgh - CMU) but always in the SV shadow (SV still dominates in WW VC money at ~$140B followed by Beijing at almost half that size). Once a startup becomes successful they tend to stay in area but hire globally (Google et al)<br><br>", "<b>Username: privatebanker</b><br><br>@sushritto not by size but content and quality of experiences. The online cv of sorts. I could care less about how many followers my doc has. But I care about relevant experience. And I think the cal reject site is very funny. Good college humor!<br><br>This thread is about outcomes and finances. I know a bit about both. But not everything. And I learn a lot here. From everyone. And lots of times you all actually help me change my mind. But for some their accumulation of experience and situational exposure is just a little wider. . In my case its certainly not because I am smarter or more educated than the vast majority of posters. Or their children. The absolute opposite. You all are an impressive group. Scary smart actually.<br><br>But Ive been blessed by access to the paths to success across a wide spectrum and locations. And Ive got a decent memory. So Im sharing observations based on real life and real people. Its still anectdotal. Take it as you will.<br><br>But between several other posters like @Nocreativity1 @roycroftmom @bluebayou @rickle1 etc you get a fairly wide net of accumulated experience that I would seriously take time to consider.<br><br>Best to all !<br><br>", "<b>Username: bluebayou</b><br><br>\"\"Unless Davis was different than the other UCs, the Regents was probably several hundred dollars and possibly a one time payment.\"\"<br><br>yes, the (ahem) lower UC's had a much more generous Regents scholarship program. (My S was offered one from Davis, and considering UCD for free or the Ancient Eight on finaid......)<br><br>", "<b>Username: socaldad2002</b><br><br>@privatebanker fwiw im not defending Stanford (or the ivies) because I went to any of those colleges. I graduated from the much maligned UC Davis in this thread. However, I did grow up and lived 25 years in the SF Bay Area and I have many start-up clients who are graduates and post-grads of these colleges and have personally witnessed the caliber of professionals coming from these institutions of higher learning. Its extremely impressive and the tippy top HS students really thrive and grow in these intellectual incubators.<br><br>You get one shot at an excellent undergrad education and some colleges are just better at it than others.<br><br>", "<b>Username: Rivet2000</b><br><br>I think we may have jumped the shark here a little bit. I value all opinions based on the content. I will question but will not claim that mine are any better than any other. We should all let our words do our talking.<br><br>", "<b>Username: youcee</b><br><br>@bluebayou That's interesting about Davis's Regents. I think UCSD's was a one-time $500 if I remember correctly. At the time, Davis was probably considered higher up the food chain than UCSD which was still fairly new. Makes sense I guess because our son was offered Regents by Davis a few years ago and with all the extra amounts they tacked on to the base $7500 it would have come close to full tuition, far better than the other UCs.<br><br>", "<b>Username: rickle1</b><br><br>I've enjoyed reading this thread and appreciate the emotion and experience involved. It's Friday night. Time to fire up my green egg and do some grilling for our soon to arrive guests. One or two of them are wine snobs which is good for me because they bring their own stash. I have the cigars... Enjoy your evening everyone.<br><br>Looking forward tot he Final Four tomorrow!<br><br>", "<b>Username: Hapworth</b><br><br>This family has some means, so if they can comfortably afford Stanford (and, in time, whatever school their daughter chooses), fine.<br><br>That said, there is a myth out there that Stanford or Harvard offers unparalleled undergraduate educations, and this simply isn't true. It's not as if a WF student would be overwhelmed at Stanford, while a Stanford student would find the academics at WF remedial. I'd recommend everyone read Frank Bruni's book \"Where You Go Is Not Who You'll Be.\" Bruni, a writer for the NY Times, turned down admission to Yale to attend UNC-Chapel Hill. One of the biggest myths out there is that there is some huge difference in quality of undergraduate education (undergrad!) between more or less similar universities.<br><br>So, yes, the issue is really whether the Stanford *name* is worth it. Again, we are talking about undergrad here. Undergrad! Stanford's main reason for existence is not to take families' 18-year-olds and provide them with four years of rigorous, mentored education and opportunities for personal growth. Stanford exists to create research and scholarship. It also exists to educate and mentor graduate students. Last of all, because there are so many bright minds around Palo Alto, yes, it is willing to \"take in\" the OP's son, knowing full well that the Stanford name will have pull. An earlier poster mentioned that WF is buying the OP's son. That's true. But it's also true that Stanford hopes to convince the OP to spend 300K instead of zilch (actually, less than zilch, since the OP's son would be receiving a handsome stipend at WF).<br><br>I am not denying that prestige has value, but as the somewhat well-known Krueger and Dale study shows, for students who are admitted to elite schools but choose to attend a school elsewhere, there is zero difference in earnings over the long run. The student who turns down Penn for Penn State will be just fine, as will the OP's child if he chooses, potentially, to attend Wake Forest over Stanford. The exception that Krueger and Dale found is for the student who has minority status. People of color, for instance, do benefit from the chance to attend an Ivy or Ivy equivalent.<br><br>Normally, the choice here would be a no-brainer: WF. Only the OP can decide if the 300K price tag is worth the name recognition. If the family can afford it (without affecting the daughter's college choice down the road), great! If not, OP, you have your answer. Oh, and it's not as if WF is some podunk school that no one has ever heard of.<br><br>", "<b>Username: Publisher</b><br><br>@hello_you: OP: We faced a similar decision about a decade ago. The deciding factor was that the student's major was known. The decision was made on that basis.<br><br>Most \"troubling\" about your situation is that your original post states: \"Unknown major yet.\"<br><br>If your son remains undecided about his major, then consider the WFU Stamps Scholarship. Invest the $200,000 so your daughter's education is fully funded and/or for graduate school for your son.<br><br>Of course, he needs to fit in with the culture at WFU. Decades ago, I studied at Wake Forest as a visiting student. And I have acquaintances who attended or their children attended WFU. When I was there we had to take our own alcohol into any bar or club in a brown bag &amp; buy mixers. Winston-Salem was among the most segregated cities in the country--which was a bit dangerous for a long distance runner like myself. I love North Carolina--especially the Outer Banks which are a bit over 6 hours drive from WFU, but well worth the drive. Access to the Smoky Mountains &amp; the Blue Ridge Parkway (Virginia) make for interesting trips. Charlotte is a nice city.<br><br>If your son was determined to study engineering or computer science, then my advice would be different based on the lifelong contacts he would make at Stanford &amp; on the basis of, as you wrote, \"unparalleled opportunities\". But without a plan in mind, the WFU Stamps Scholarship is too valuable to pass up. Use the money for graduate school--if needed--and for making elite graduate school contacts &amp; enjoying elite graduate school opportunities.<br><br>", "<b>Username: Twoin18</b><br><br>So I guess I live closer to Stanford than Sushiritto and my experience of who got admitted to Stanford in my kids' class (a somewhat average HS for Silicon Valley with a large URM population) was that they were great kids, but absolutely not the smartest in the class. All the NMFs went to UCs and the Stanford kids weren't in the top 10 in the class. Instead the kids going to Stanford all had hooks of one kind of another.<br><br>I see the influence of Stanford all around us, quite a few of our neighbors are Stanford grads. They are smart people. But the vast majority don't have outsize influence in SV, they are regular people, doing similar jobs to someone from a UC or other college.<br><br>", "<b>Username: Publisher</b><br><br>@Hapworth: You wrote: \"...there is a myth out there that Stanford or Harvard offer unparalleled undergraduate educations...\". I think that you misunderstand--especially in OP's case. It is not \"unparalleled undergraduate educations\", but, rather, \"unparalleled opportunities\" for their undergraduates.<br><br>", "<b>Username: Rivet2000</b><br><br>When it comes to undergraduate education I do think that there are distinctions between all schools. The value of the differences may be up to debate but I think that their presence just makes sense. If you look at some of the basic components that make up an undergraduate education some colleges are just better situated to deliver. Faculty, depth and breadth of curriculum, class availability, and undergraduate research opportunities are all key to a great undergrad education, and in those dimensions not all schools are equal.<br><br>", "<b>Username: Publisher</b><br><br>I have forgotten which poster is deciding between Stanford &amp; the University Of Mississippi. but PM me because I have some familiarity &amp; direct contact with the program that you mentioned. @HoustonKen<br><br>", "<b>Username: Hoggirl</b><br><br>@Publisher - its @HoustonKen<br><br>", "<b>Username: Publisher</b><br><br>@Hoggirl Thank you !<br><br>", "<b>Username: marvelousmarvel</b><br><br>Here are my two cents as a student in the Bay Area. Stanford does have many undergrad research opportunities. There's also a really strong community - people will randomly find each other 7 years after graduation and bond over being at \"The Farm\".<br><br>That being said, contrary to popular belief, hiring managers and recruiters in SV and PA don't really care where you graduate from. They care whether you did work at your school and whether you have awards/projects/research. Sure, saying you go to Stanford might push you right into the interview phase, but so will going to Wake Forest if you have a good resume and GPA. (And you can trust me on this because my father works at one of these big-time SV companies and is on the recruitment board).<br><br>If, however, your son wants to study CS or engineering, I'd go to Stanford. There are a lot more networking opportunities and a high retention rate.<br><br>One more thing, though. Bay Area living cost is much higher than you think. Earning a $100k salary here is considered far less than earning a $100k salary in somewhere like Montana. One year at Stanford will set your son back around $71k.<br><br>Hope that helps!<br><br>", "<b>Username: websensation</b><br><br>Where did OP end up going? We were in the same situation and decided to take a gap year instead. lol By the way, to me, going to let's say WF or UVA on an impressive scholarship is more impressive (to me at least) than going to HYPSM. But that's just the way I think. Also, getting merit money scholarship because you are a National Merit Finalist is not that all impressive to me, although ok impressive. I don't even know why they give out merit money for just being NMF. I am not saying this because I am bitter or jealous because my kid was a NMF and was offered merit money. I think to get a full ride scholarship, a student needs to show a definite talent in some area or an evidence of demonstrated contribution or great potential.<br><br>", "<b>Username: Ballerina016</b><br><br>I dont think anyone but your family can make this decision. Based on information you provided it seems that you can afford Stanford. When our family was facing similar decision few years back we chose full paying options vs free ride. Three years later I dont believe DD would have even a fraction of those opportunities her school presented. Also by interning every winter and summer break and sometimes during school year she earned good chunk of what we are paying for her school.<br><br>", "<b>Username: eyemgh</b><br><br>\"Three years later I dont believe DD would have even a fraction of those opportunities her school presented.\"<br><br>We presume they wouldn't have gotten better opportunities because of confirmation bias. We WANT to know that is the case. The reality is that students at lots of schools get opportunities. And students at the \"top\" schools often don't. NASA gave 32 scholarships in Oregon alone this year, half of which went to community college students. I know a student personally who attends the school that @Ballerina016 has a student at. He's taking a year leave, disillusioned, working in a private lab, trying to decide his next step in life. No school comes with guarantees.<br><br>What is true is that the money you'll spend has opportunity cost. If you were to invest the $300,000 more that it'll cost for a full pay program over a free program, at 7% over 40 years, you'll have over $4M. That's how much BETTER the full pay program will have to be to break even.<br><br>Now, that's not to say that you should always choose the cheapest option. On a pure financial basis though, no full pay school pays as an investment compared to free, not even Stanford, even if the full pay school comes with more opportunity.<br><br>", "<b>Username: Rivet2000</b><br><br>\"\"If you were to invest the $300,000 more that it'll cost for a full pay program over a free program, at 7% over 40 years, you'll have over $4M.\"\"<br>Or the market could tank and you could loose all that money..... :wink:<br><br>", "<b>Username: eyemgh</b><br><br>@Rivet2000, if the market tanked for over 40 years, we'd have more concerns than where we went to college. Remember, even if you invested the day before any previous crash, including 1929, you made money, LOTS of money, by simply holding on. We are comparing a free degree with $300,000 in the bank to a $300,000 degree with no money in the bank (or in some worse cases, debt), not degree versus no degree.<br><br>", "<b>Username: Rivet2000</b><br><br>I knew I should have labeled that *humor*<br><br>", "<b>Username: eyemgh</b><br><br>@Rivet2000, Oops. Sorry. :blush:<br><br>I have seen that exact same reply proffered with dead seriousness. :neutral:<br><br>", "<b>Username: roycroftmom</b><br><br>On campus recruiting is so much less important than it was even 3 years ago. With hundreds of companies, and pretty much all of Wall St, opting for the AI recruiting programs, it is no wonder that elite companies like JP Morgan have completely ceased all on campus recruiting. More will follow next year. The world is indeed getting flat in many ways.<br><br>", "<b>Username: Ballerina016</b><br><br>And yet companies pay significant amounts to have access to elite schools resume databases.<br><br>", "<b>Username: Rivet2000</b><br><br>While less important, many of the larger employers still host on-campus events where students can take code tests and, if successful, have first round interviews all in the same day. Easier on the students and they employers alike. However, I agree that it's easier than ever to complete the process end-to-end online. That said, there are many other ways to get keyed into employers via lab connections, profs, and during poster sessions where employers (large and startup alike) as well as investment-types attend in surprising numbers.<br><br>", "<b>Username: eyemgh</b><br><br>@roycroftmom, while I agree that students can apply for and get jobs with companies that don't visit campus, there is some real value in seeing students and the students seeing said companies in person. My son had a tech interview wit Apple the same day that he met them at the career fair. He's also able to speak with people in person regarding not only which openings he'd be best suited to from THEIR prospective, but to learn first hand what they like and don't like (if they are being honest) about where they work. Most recruiting tends to be regional even at the top schools, but my son was able to spend some real quality time with an engineer from Tait Towers. He's at a CA school and they're a smallish company (300 employees) from PA. They are world class at what they do though, as no one else really does what they do. Had he tried to vet them and their interest in him via a cold app, it would have been challenging. All that said, he's an engineer, and that might be different.<br><br>", "<b>Username: EganAg</b><br><br>@hello_you curious what your sons decision is. Mine chose the no scholarship option- Amherst over St Olaf, MAC over Conn/Earlham.<br><br>", "<b>Username: hello_you</b><br><br>All - OP here. The decision is... Wake Forest. He decided that Wake would give him similar opportunities and it'd be a huge advantage to have a large portion of grad school paid for.<br><br>I'd be lying if I say that I don't revisit the decision in my mind still, but he is at peace with it and that's all that matters.<br><br>Kudos to Wake for sincerely recruiting my son. The fact that Stanford has sent 0 emails and only one call (to ask - somewhat incredulously - why he hadn't signed up for the admit weekend) didn't go unnoticed. Meanwhile, Wake was sending emails highlighting what current scholarship students are researching and where they're traveling.<br><br>I'm just glad it's over. Good luck to all that are still deciding. And a huge thanks those like @privatebanker and others that made well thought out arguments on both sides of this debate. We read them all and many gave us serious food for thought. We really appreciate it.<br><br>", "<b>Username: CardinalBobcat</b><br><br>Thanks for the update, and all the best to your son for a great four years!<br><br>", "<b>Username: roycroftmom</b><br><br>congratulations and the very best wishes to your son.<br><br>", "<b>Username: EganAg</b><br><br>@hello_you congratulations! In addition to being a great school, Wake is in Winston- Salem, a very nice southern city.<br>Thanks for the post as it helped us think through as we made our decisions as well.<br><br>", "<b>Username: Hoggirl</b><br><br>Congrats to your son, OP! I hope @HoustonKen will also come back with a final decision once its made.<br><br>", "<b>Username: privatebanker</b><br><br>Thats such great news that you have a happy and excited undergrad on your hands!<br><br>And enjoy graduation season and some summer rest- the work and stress comes fast and furious in the fall!<br><br>", "<b>Username: sunnryz</b><br><br>Congratulations to your son on all of his accomplishments! It sounds like he made the right choice!<br><br>", "<b>Username: collegemom3717</b><br><br>Your son came out on top in the college admissions process, and now you have watched him start to chart his own course. Win-Win really :-)<br><br>Congrats to you both!<br><br>", "<b>Username: HoustonKen</b><br><br>@hello_you Congrats on your decision. We met another Stamps WFU Scholar at the Stanford reception in Houston. They were from Shreveport, LA. The dad texted me last week and said his son had picked WFU too. Congrats !!!! @HogGirl My daughter is in Palo Alto right now at the admitted students weekend. I suspect we will decide Sunday or Monday ... hopefully not at 11:59 pm.<br><br>", "<b>Username: HoustonKen</b><br><br>Quick update on our end. My daughter decided to go to Ole Miss and turn down Stanford. Not gonna lie ... i5 was wired watching her hit decline in the Stanford portal. She is happy with her decision and excited for graduation and the next phase of her life<br><br>"]}