{"title": "rice vs duke vs princeton", "comments": ["<b>Username: ejc000</b><br><br>Major: Mechanical Engineering<br><br>", "<b>Username: Publisher</b><br><br>If I understand correctly, you will be a full pay student at all three. Confused because one of your earlier threads discussed Posse Foundation.<br><br>If full pay at all three &amp; with stats strong enough for Duke &amp; Princeton &amp; Rice, then you should have received scholarship offers from some schools.<br><br>What about Texas-Austin ?<br><br>", "<b>Username: ejc000</b><br><br>Yes, I would be essentially full pay at all three (I got a little bit from Duke). I didn't advance past the semifinalist round for Posse.<br><br>I did receive 7,000 to attend UT, but I'm not a big fan of the campus. I didn't really feel at home, and I think the prominence of frats and sororities would make it tough for me to be really socially involved (I don't want to join Greek Life).<br><br>", "<b>Username: ejc000</b><br><br>@Publisher ^<br><br>", "<b>Username: Publisher</b><br><br>If you do not want Greek life, then Duke may not be the best fit for you.<br><br>Eating clubs at Princeton strike some as elitist.<br><br>Rice might be the best fit for you.<br><br>", "<b>Username: fdgjfg</b><br><br>I don't think you should worry about Princeton being elitist. They've recently been touting the fact that ~20% of their offers were to first-gen college students, and that about ~25% are from lower income backgrounds. I don't think you would have a negative experience with the student body.<br><br>source: <url>https://www.princeton.edu/news/2019/03/28/princeton-pleased-offer-admission-1895-students-class-2023</url><br><br>Both Princeton and Rice have the residential college model which is nice for creating social connections, especially if you don't see yourself in greek life. Rice has no greek life, while Princeton has eating clubs - I think those are pretty innocuous though, since you join by lottery and only a small number do the bicker (just a traditional \"rush\" process). Duke's scene would be more dominated by the frats.<br><br>You should really just visit and see which campus you vibe with. Everyone will have their preferences. That being said, I think I might personally be inclined towards Princeton. It's recruiting/connections/alum base just tend to be a tad stronger broadly across multiple disciplines than the other programs, and I think it's always good to experience a new setting (east coast vs your Texas roots). But it's perfectly understandable if you feel like the support network at Rice is too good to pass up.<br><br>", "<b>Username: TiggerDad</b><br><br>\"My Mom is particularly scared about Princeton being elitist and full of privilege that wouldnt necessarily be found at Duke or Rice.\"<br><br>That's from the Fitzgeraldian popular imagination born of Great Gatsby, not from today's reality. My son hasn't encountered anything \"elitist\" or \"privilege\" at Princeton. The only thing that he's encountered anything remotely resembling any of that is his discovery that so many kids are wearing \"Canada Goose\" jacket with the price tag of $1,000 or around there during the winter season. My son wore the same $40 jacket all winter and survived just fine, so don't let Canada Goose scare you. :-)<br><br>\"I'm also very involved in orchestra and would like to continue playing in college, if anyone can comment on the schools' strength in this.\"<br><br>I don't know anything about Duke orchestra, so I won't go into that, but both Rice and Princeton have excellent orchestras. In fact, both made the list of top-20 most impressive college orchestras in the nation:<br><br><url>https://www.onlineschoolscenter.com/20-impressive-university-orchestras-america/</url><br><br>Rice, however, has the Shepherd School of Music, so a successful auditioning into its top orchestra and chamber groups with the music performance majoring musicians might be more difficult for non-music majors. But it all depends on your level and skills, of course.<br><br>My son is currently a member of Princeton University Orchestra (PUO). Princeton doesn't have a school of music (it does have dept. of music, however), so no priority chair spots going to anyone other than strictly by your skills level displayed during its annual audition. Many of its members are highly accomplished, having honed their skills from their middle to high school years in places like pre-college Juilliard, NEC, Colburn, etc. Princeton has a second-tiered Sinfonia orchestra. The audition for PUO tends to get more competitive every other year, because PUO tours a select country in Europe every other year, all expenses paid for by the school, so a greater display of interest in the touring year. This year, my son toured three cities in Spain, for example. There are several other groups that you can also participate in. Some members of PUO, including my son, are in Opus 21, a chamber group that consists of about, well, 21. Then there are groups for pianists, jazz musicians, etc. They even have Laptop Orchestra. So, no lack of opportunities for continuing your interest in performing.<br><br>", "<b>Username: Hoggirl</b><br><br>Im not sure about accessibility to the highest groups at Rice if you are not in their school of music. There is an orchestra opportunity available for credit for non-music majors. I would call and speak to someone at Shepherd. My ds considered Rice but matriculated elsewhere. In order to take lessons from top faculty, he would have needed to have taken those as a private student rather than a university student and would get no credit.<br><br>Here is the list of courses available for non-music majors. The orchestra is listed there. As I said, I am guessing the top orchestra may not be available. If that is important to you, I would call and ask.<br><br><url>https://music.rice.edu/non-major-offerings-spring-2019</url><br><br>", "<b>Username: privatebanker</b><br><br>Parents, elite school enthusiasts and grads. Its Elite Top ten Tippy Top Uber elite HPYSM as an adjective<br><br>Student. Im concerned it might be a bit elitist at these schools<br><br>Response.  No. No. Lets show you how elite they are at being un-elite<br><br>LOL. CC cracks me up.<br><br><br>OP. I would go to Princeton. Break it up with all the Rice connections. And its a beautiful place and has a real global name recognition. Congrats and good luck!<br><br>", "<b>Username: Penn95</b><br><br>@ajc000 I d go to Princeton. The undergrad quality is unparalleled and the global recognition of the schools is well ahead of the other true. Re: the elitist concern. Yes Princeton might seem elitist but I think they also have the highest % of first gen students in the ivy league and Duke is arguably more elitist.<br><br>", "<b>Username: PtonAlumnus</b><br><br>My sister and her husband attended Rice so I am very familiar with the quality of education available at Rice. Since your parents and brother have attended Rice I will not provide info on Rice but help you understand how you could fit in at Princeton.<br><br>My Mom is particularly scared about Princeton being elitist and full of privilege that wouldnt necessarily be found at Duke or Rice.<br>This is not a problem. I attended a public HS as did most of my friends. 60% of the students receive financial aid. There are more first gen low income students than alumni children. Visit for Princeton Preview and you will discover the other admitted students are similar to you.<br><br>The residential college system at Rice and Princeton are similar; however, I believe Rice has changed since my sister attended.<br><br>Frats/sororities are not important at Princeton. For their junior and senior years students have the option to continue to eat in their residential college or join an eating club. Students that want to join an eating club may join a club simply by telling the club that they want to join or go through a rush type process to join other clubs. If you join the Princeton University Orchestra you might to decide to join the same eating club as your friends in the orchestra.<br><br>Both the Rice and Princeton orchestras are considered among the top 20 in the US. Other instrumental groups at Princeton are Princeton University Sinfonia, Princeton University Wind Ensemble, Cornel West Theory, Shape Machine, Princeton University Chamber Ensemble, Undergraduate Composers Collective, Music in Mind, Princeton Classical Music Players, Princeton Pops, and many brass and international groups. You may be interested in the Princeton Laptop Orchestra. <url>https://www.youtube.com/channel/UChiK8wRwAugDuABbtHmNK4g</url><br><br>When you attend Princeton Preview you may want to obtain information on the program with the Royal College of Music, London were exceptionally talented students may qualify for a five-year, double-degree program (Bachelor of Arts from Princeton and Master of Music from the Royal College of Music) that includes study in London for the fall term of the junior year. Visit the Lewis Center for the Arts. This complex has many practice rooms and performance space. The residential colleges sponsor trips into NYC or Philadelphia to listen to concerts, attend Broadway plays, or attend an opera.<br><br>Princeton's music department was established in 1946, and 15 years later it became one of the first in the country to offer a Ph.D. in composition. Former Professor Milton Babbitt helped to establish and co-directed the Columbia-Princeton Electronic Music Center in New York City, which housed the RCA Mark II Electronic Music Synthesizer, the first American machine designed for the production of electronic music. The Certificate Program in Musical Performance provides an opportunity for students to develop their performing skills. Students in the Program in Musical Performance are required to pursue some kind of performance study and therefore the department subsidizes the entire cost of weekly lessons taken with teachers under contract with the department. Caroline Shaw GS, who studied composition in the Universitys Department of Music, has won the 2013 Pulitzer Prize for Music for her a cappella piece Partita for 8 Voices. Shaw is the youngest winner of the Pulitzer Prize for Music since the awards inception in 1943. Julia Wolfe *12 is a 2016 MacArthur Fellow. She is a post-minimalist composer whose work combines influences from folk, classical, and rock music. Her pieces, including Cruel Sister (2004) and Anthracite Fields (2013) which was awarded the Pulitzer Prize for Music in 2015. Pascal Le Boeuf GS composition Alkaline was nominated for a Grammy in 2017.<br><br>Since you enjoy math you may be interested in the research by Professor Dmitri Tymoczko, a Rhodes Scholar is a composer and music theorist. In the first paper on music theory published by Science magazine Dmitri showed that two-note cords occupy the space of a Mobius strip, a two surface embedded in a three-dimensional space. More complex cords inhabited a multidimensional space that is twisted back on itself called orbifolds. Music cords have a geometric shape.<br><url>http://www.princeton.edu/pr/pwb/08/0428/music/</url> and <url>http://www.sciencenews.org/view/generic/id/9450/title/The_Geometry_of_Music</url> and his YouTube video: <url>http://www.youtube.com/watch?v=NnvynOyZI-Q</url><br><br>While I would expect that ME at Rice and Princeton would be similar; however USN&amp;WR does rate Princeton higher.<br><br>Enjoy Princeton Preview.<br><br>", "<b>Username: TiggerDad</b><br><br>Here's the list of music opportunities for non-music majors at Rice. It does look like they have a separate orchestra for non-music majors:<br><br>@Hoggirl has already linked it above.<br><br>", "<b>Username: MWolf</b><br><br>They're all elitist and full of privilege. How elitist? Let us see just how many rich kids go to each.<br><br>Percent of percentile by income:<br>Top 20%; Top 10%; Top 1%; Top 0.1%<br>Princeton: 72%; 58%; 17%; 3.1%<br>Duke: 69%; 56%; 19%; 3.4%<br>Rice: 64%; 50%; 9.8%; &lt; 1%<br><br>Median family income:<br>Princeton: $186,100<br>Duke: $186,700<br>Rice: $160,800<br><br>USA: $62,000<br><br>The only questions are: A. how elitist? and B, how much do you care?<br><br>Seriously, if somebody doesn't want to go to an elitist college, they should not apply to a private college with an annual cost of attendance that is equal to the entire family income of a middle class family. So either actually consider a college that is truly not elitist, or forget about that as a criterion.<br><br>@PtonGrad2000 Saying that Princeton isn't elitist because it has 25% low income kids is disingenuous at best, dishonest at worst, when you include people who are making more than 60% of the population as \"lower income\". Saying that Princeton isn't elitist because 60% receive FA is even more dishonest, since families which make $250,000 a year are still getting FA to the amount of 43% of their tuition.<br><br>You really do not get more elitist than thinking that a middle class family is \"lower income\", and that a family in the top 20% by income requires financial aid...<br><br><br>I personally do not care - Princeton is an excellent university, and an excellent choice. But would Princeton students, parents, and alumni stop pretending that it isn't elitist, just because It's Not As Elitist As Some Other Colleges (with side glances at Harvard and Yale)?<br><br>", "<b>Username: TiggerDad</b><br><br>There's a world of difference between being \"elite\" and \"elitist\" and having \"privilege\" and \"privileged.\" My son is surrounded by many who are better in SES terms, but he hasn't encountered anyone with elitist attitudes and privileged behavior at Princeton.<br><br>", "<b>Username: privatebanker</b><br><br>When one looks at or judges choice in tiers of elite-ness like we do with colleges to the nth degree, and chooses said college based on its elite-ness - that is, in and of itself, elitist. Not mean spirited or an evil doer. Not even wrong. But it is in fact elitist.<br><br>And I suggest Princeton tonthe op.<br><br>", "<b>Username: observer12</b><br><br>\"he hasn't encountered anyone with elitist attitudes and privileged behavior at Princeton.\"<br><br>I don't really understand how Princeton still has the eating club system. Is it really completely non-elitist and non-privileged? I thought many of them were open to all by lottery but a few still had some vestiges of privilege and elitist attitude. I still think Princeton is probably the best choice for OP, but isn't it better to go in understanding whatever the reality is and not thinking that there are no elitist attitudes or privileged behavior? But if those attitudes are now gone from every Eating Club, that's terrific and kudos to Princeton!<br><br>It's easy to ignore elitist attitudes and privileged behavior at any college, which is why I think Princeton is likely the best choice for OP. But if there are more of those attitudes at Princeton than Rice, it's good to know going in. If there isn't, that's great.<br><br>", "<b>Username: sushiritto</b><br><br>We toured Princeton last year and there were still eating clubs not open to all/lottery.<br><br>Princeton would be my choice here.<br><br>", "<b>Username: TiggerDad</b><br><br>The upperclassmen at Princeton has a choice to continue to dine at a residential college or join an Eating Club, not all of them through bickering. In other words, students have a choice. As far as I know, the Eating Clubs at Princeton has come a long way from its elitist founding. I think my son hasn't encountered (yet) anyone with elitist attitudes and privileged behavior is most likely due to the fact that he tends to hang with those with similar SES backgrounds. My post was in response to the OP's mother being scared by her perception that Princeton might be \"elitist and full of privilege that wouldn't necessarily be found at Duke or Rice.\" I don't think whatever the definition of elitism is extent at Princeton in relation to the other two such that it's a real problematic issue to the OP and his/her mom. In fact, I'd actually like to see my son experience elitism and privilege as played out in real life as a good learning experience.<br><br>", "<b>Username: Ghostt</b><br><br>I'd choose Princeton TBH, but this depends on your personal attachment to Rice. (If you're motivated by a fear of the unknown more than by affection for Rice, try to overcome it.)<br><br>Have you visited Princeton?<br><br>", "<b>Username: ejc000</b><br><br>@Ghostt I'm actually flying out to Princeton for Princeton Preview tomorrow afternoon! It will be nice to finally experience it in person.<br><br>", "<b>Username: TiggerDad</b><br><br>@ejc000<br><br>Enjoy the Preview Day. It was a whole lot of fun. Take a good look at Richardson Auditorium inside Alexander Hall where parents and prospective students will gather. That's where PUO's concerts take place. I was in awe of the concert venue. If you can, stay overnight if you have signed up for it. You get to see first hand one of the residential colleges. When I visited on the Preview Day with my son, I was expecting to see some of that \"Preppiness\" that has historically been associated with Princeton. I was very surprised not only by its non-existence but also by how everyone looked and dressed \"middle-class\" like us and how diverse the crowd.<br><br>", "<b>Username: Houston1021</b><br><br>You have 3 terrific choices. Go with what feels right to you as the best fit.<br><br>Can you also fit Owl Days at Rice or one of the Rice admit days into your schedule? Are you going to Blue Devil Days or something similar? Being on campus at all 3 will highlight the differences. The difference in cost is not substantial. Being from Texas, you will have higher travel costs to Princeton and Duke than to Houston. Rice is located in the midst of a major city. Princeton is a lovely town, but is a train ride away from a large city. Durham is a decent sized town with an airport. You can get some good deals on Southwest flights.<br><br>The weather will be dramatically different, Houston will be blazing hot August through October But nice for the rest of the school year while Princeton will be the coldest (down jacket needed). Duke will be somewhere in the middle with a beautiful change of seasons. All have beautiful campuses. Duke and Princeton are Gothic while Rice is Mediterranean style. At Duke the Freshmen live on a East Campus, a part of campus separated from the rest of the campus. There is bus service between the two.<br><br>Princeton has the Ivy league prestige and centuries of tradition while Rice was founded in 1912. Rice has a happy nerd vibe. Duke has an old south traditional vibe. Duke has sororities and frats and a fanatic sports culture. Few students at Rice attend the sporting events. Princeton has the Ivy league rivalries in sports.<br><br>Rice has serious music majors but also has activities for non music majors such as the Campanile Orchestra.<br><br>CAMPANILE ORCHESTRA (MUSI 334), 1 credit<br>The Campanile Orchestra is a symphony orchestra made up of talented non-music majors and members of the greater Rice community who wish to continue their orchestral activities. The group plays works from the standard literature and meets on Saturday from 10:00 am-1:00 pm. The orchestra performs three concerts per academic year. Email Ben Manis at <a href=\"/cdn-cgi/l/email-protection\" class=\"__cf_email__\" data-cfemail=\"96f4f3f8fbf7f8ffe5afa2d6f1fbf7fffab8f5f9fb\">[emailprotected]</a> for more information.<br><br>There are no exclusive groups at Rice like some of the eating clubs at Princeton or Greek life at Duke. Do you like the idea of writing a thesis your senior year as Princeton requires?<br><br>", "<b>Username: JenniferClint</b><br><br>It's nice that cost isn't a factor. Tell us how you feel after the Princeton visit. Have you been to Duke?<br><br>Duke's new housing model has colleges like Yale, Princeton, Rice etc.<br>The Greek scene is not as overwhelming as some people make it out to be.<br>I'm not sure that I would describe Duke as having an \"old south traditional vibe\".<br><br>Princeton is often stereotyped as being an \"elitist\" institution. I've interacted with many Princeton undergraduates and alums over the past few years. Almost all of them have been perfectly pleasant people.<br><br>The real issue at Princeton will be grade deflation (not a deal breaker, but something to consider).<br><br>Also, they're all great opportunities. People on this website will push you to go to Princeton, but it is perfectly reasonable to prefer Duke or Rice.<br><br>A happy, successful Duke graduate beats a miserable, underperforming Princeton one every day of the week.<br><br>A quick internet search tells me that Rice and Princeton both have very highly regarded orchestras. If you're just looking to play recreationally, I'm sure all 3 schools will fit the bill.<br><br>", "<b>Username: scholarme</b><br><br>Perhaps your mom is thinking that Princeton will have east coast elitism, a sort of looking down attitude on Southern and Mid-western folk.<br>I think that's pretty common in the region honestly, but should not be enough to deter you from a really great opportunity. Be true to yourself, don't let the uninformed opinions of cause self-doubt.<br><br>", "<b>Username: collegemom3717</b><br><br>There are still 6 (I think) \"private\" eating clubs, whose members are chosen by the old 'bicker' system. All the rest are on a lottery system. For all of the eating clubs, finaid provides up to $2K/year to cover the difference in cost between the college dining options and an eating club.<br><br>There is absolutely a group of 'elitist' types at Princeton. This is true at all most of the 'elite' type schools (at Oxford they are referred to as 'red pants'). But like the group of uber cool kids in school, they are a minority, tend to hang by themselves and mostly don't bother with anybody else (as my socially adept collegekid recognized by grade 4, 'the funny part is that they are the only ones who think they are cool'). The idea that they in some way dominate the university or the university experience for everybody else was probably never as true as movies would have made you think and certainly isn't now.<br><br>Given that the costs are the same, and that they are all strong for engineering, I would go with what turns out to be an amazingly good metric: where you feel comfortable. Go to the visit weekends. Be aware that they are mostly a sales pitch, but mostly, just let yourself be there, with your potential future classmates, and see if it feels like a place you want to stay.<br><br>", "<b>Username: Doublekk2</b><br><br>@JenniferClint<br><br>The Greek scene is not as overwhelming as some people make it out to be.<br>I'm not sure that I would describe Duke as having an \"old south traditional vibe\".<br><br>I agree. My oldest daughter is a junior at Duke. She is not involved in Greek life, and has received an incredible education as an engineering major. Since Duke is in NC, its understandable that some would think it has an old south traditional vibe, but in reality, the vibe is nothing like old south. (The student body is very liberal, for starters.) Having visited lots of colleges in various parts of the US, Durham is a perfect (foodie) college town, IMO.<br><br>Based on my daughters experience at Duke, Im sure that all three schools are filled with valedictorians and other extremely talented, hardworking students. I know that my daughter and her friends are grateful to have the opportunity to attend Duke, (as Im sure many others are as well).<br><br>To the OP, you cant go wrong with any of your choices! Congratulations! Having visited all three, Princeton would be my choice. But I feel strongly given your options, you should visit and decide which one is the best fit for you. Best of luck!<br><br>", "<b>Username: bopper</b><br><br>Where do YOU want to go?<br><br>Not where your family wants you to go or not go.<br>Not where you family did go or didn't go.<br><br>Which is appealing to YOU?<br><br>It is okay to say \"I want to go to Rice...I would prefer being at a top notch school near home. I think the college system is great and am familiar with it so that will make the transition easier.\"<br><br>It is okay to say \"I want to go to Princeton. Its a top school and I think there would be many advantages.\"<br><br>Go to the music website for each college and see what it says is offered for Non-majors.<br>Contact the music dept and ask if you cannot tell.<br><br>", "<b>Username: Riversider</b><br><br>As far as average income for Princeton vs Rice vs Duke families, salaries are lower in low cost of living areas so practically all of them have similar average income. With two Rice alum parents and as a full pay student, you are pretty elite yourself. At all schools, a large majority gets some need based aid.<br><br>As far as Princeton being more elitist academically, its a wash. All of these schools admit students who are poor, URM, First Gen, athletes, artists,donors, rural residents, poor internationals, home schooled etc so no way more than few percent will be even in your academic league if you got in all three colleges on your own.<br><br>From your post, I think you should take Duke out and focus on Princeton vs Rice. Both are great academically but I would pick Princeton as it has more name recognition and Ivy tag and we live in a shallow world. If Rice is a comfortable fit and feels like home then that adds more value there and their mechanical engineering is as good as Princeton.<br><br>Dont pay any attention to state school recommendations. You have enough resources and acceptances to even consider that route.<br><br>", "<b>Username: Rivet2000</b><br><br>If money is not an issue. Then Princeton is a great choice. You're going to find some level of poor behavior at virtually every college (elitist attitudes, privileged behaviors, misogyny, etc). Don't let that deter you from a great experience and the potential to be \"part of the solution\".<br><br>", "<b>Username: sherpa</b><br><br>One of my kids went to Princeton; the other to Duke. I dont know a lot about Rice.<br><br>Both of my kids received need based aid and both were comfortable with their peers; no elitism noted.<br><br>My son joined an eating club and viewed it as a positive thing. At Duke my daughter joined a selective living group (much more casual than a sorority, and co-ed) and she was happy with that too.<br><br>In my opinion Princeton is the best college in the US and Id recommend that you not pass up the opportunity to attend.<br><br>Congratulations and good luck!<br><br>", "<b>Username: collegemom3717</b><br><br>\"\"no way more than few percent will be even in your academic league if you got in all three colleges on your own.\"\"<br><br>Factually wrong, not to mention grossly insulting to the students who are \"poor, URM, First Gen...artists...rural residents, poor internationals, home schooled\".<br><br>", "<b>Username: JenniferClint</b><br><br>As much as I hate to say it, this does sound like a Princeton vs Rice decision. Princeton = Head. Rice = Heart.<br><br>If you go to Duke and you absolutely love the place (it has a way of winning people over), come back and let us know. If it doesn't do much for you, the decision boils down to prestige (Princeton) vs fit (Rice).<br><br>", "<b>Username: Publisher</b><br><br>Also, I suspect that Duke has a wealthier clientele than does Princeton as 60% of Princeton students qualify for need based financial aid versus about 43% at Duke and, ironically, just 38% at Rice.<br><br>", "<b>Username: 3sonsmom</b><br><br>We toured with twins two years ago and thought no one was full pay at Princeton? One son teased me when they talked about eating clubs (it sounds like fun but of course if you are in one). The tour guide also spoke about a club bad movies/good cheese which I found amusing. We only walked around Duke and they ultimately didnt get in Princeton but we were impressed, so much to offer! Also, we are NJ residents so biased. Great choices.<br><br>", "<b>Username: texaggie</b><br><br>Am I the only one here? ME Major, not sure what you will getting out of paying 70K X 4 = 280K. UT Austin for 180K less. No guarantee you will get pay increase with P/D/R education as an Engineer. Unless you have some other plans, I said your $mart brain should rule..<br><br>Good Luck,<br><br>", "<b>Username: CupCakeMuffins</b><br><br>@collegemom3717 You have a point.<br><br>", "<b>Username: CupCakeMuffins</b><br><br>@3sonsmom no one was full pay?<br><br>", "<b>Username: CupCakeMuffins</b><br><br>@texaggie I disagree. Its totally worth it for a family who has acceptances and resources. Its just not the same.<br><br>", "<b>Username: CupCakeMuffins</b><br><br>@ejc000 You have three great choices from top tier colleges. Pick one where youll be most comfortable academically, logistically, financially and socially. You are not deciding between Princeton and UTSA. Its not a clear choice.<br><br>", "<b>Username: 3sonsmom</b><br><br>@CupCakeMuffins Hence my ? Of course I may have heard wrong. Part of the reason my kids applied was the generous financial aid, the hurdle of course acceptance!<br><br>", "<b>Username: HPTD12</b><br><br>Princeton<br><br>", "<b>Username: JenniferClint</b><br><br>@Publisher<br><br>43% is an outdated US News figure. Over half of Duke's students receive some form of financial assistance.<br><br><url>https://financialaid.duke.edu</url><br><br>", "<b>Username: Publisher</b><br><br>Thank you @JenniferClint. I used US News &amp; their data is about a year old when published.<br><br>Great to see that Duke has increased financial aid budget. I suspect that many wealthy universities are doing so, at least in part, to avoid the endowment tax.<br><br>", "<b>Username: texaggie</b><br><br>@CupCakeMuffins explain, what is \"not the same?\"<br><br>ME from Princeton- 100K starting salary, ME from UT - you saved 180K, we'll start you with 80K salary?<br>Until someone brings some facts and numbers, yes, it's same! ME are same here and there.<br><br>Good Luck,<br><br>", "<b>Username: Alexandre</b><br><br>Attending UT would save the OP $150,000-$200,000. For Engineering, UT is also arguably the best of the bunch. Only 15% of UT students join Greek Life. As far as I am concerned, unless the OP's parents are wealthy, UT is the way to go. IF the parents can easily afford the difference, then Princeton is the way to go.<br><br>", "<b>Username: Houston1021</b><br><br>The Original Poster has not expressed any interest in attending UT. The poster is trying to decide between three private schools which apparently are affordable for the family. They already have one kid attending Rice. Telling the OP to go to UT is beside the point.<br><br>", "<b>Username: rjkofnovi</b><br><br>Attending UT would save the OP $150,000-$200,000. For Engineering, UT is also arguably the best of the bunch.<br><br>Sound advice.<br><br>", "<b>Username: rickle1</b><br><br>I'll join in for a reality check re the \"elitist conversation. S attends a highly selective private that is 60% full pay. He was actually concerned about that as we are public school folk.<br><br>His experience, after two years, has been:<br><br>1. There are some really wealthy kids there form 8 figure income families. True<br>2. There are lots of kids whose parents are Drs and lawyers and Bankers, etc.<br>3. The kids are kids. They're just regular kids. His range of friends is from need based full COA paid for though 9 figure net worth who could pay for everyone. The kids don't care. They get along great because they like each other, are excited about their college and what they are doing.<br><br>That's reality.<br><br>", "<b>Username: monydad</b><br><br>One thing you might explore, if you care..<br>Do you actually want to be an engineer?<br>Are there differences in the engineering programs and requirements?<br>What are the destinations of most of the mechanical engineering department grads, in each case?<br>Do most of them, or very few of them, actually become engineers?<br>Or rather do they tend to become wall street number crunchers?<br>Or do they tend to go on to \"bioengineering\" to become doctors and dentists?<br>Are they heavily recruited for mechanical engineering?<br>To what extent are their engineering departments physically separated from the rest of the university, and does this impact social life?<br><br>", "<b>Username: CupCakeMuffins</b><br><br>@texaggie There is more to college education than 2+2=4. ME degree is only a small part of this whole journey.<br><br>Regardless of this debate, OP asked about three schools, UT isnt one of those. If he was struggling to find cheapest degree possible, he is more than qualified to get many free rides just from Texas.<br><br>", "<b>Username: rjkofnovi</b><br><br>If he was struggling to find cheapest degree possible, he is more than qualified to get many free rides just from Texas.<br><br>Except that the cheapest degree at an outstanding public school sometimes represents the smarter choice. We are talking about engineering here, not investment banking. The OP certainly can decide to attend any school he chooses, but its certainly not a bad thought to remind him of the cost differences.<br><br>", "<b>Username: Riversider</b><br><br>Do factor in weather, travel, proximity to friends or family. NE can feel extremely lonely specially when you get sick or during cold and dark months. Travel adds up extra few thousands per year. Make sure you are going eyes open wide. Driving home whenever you have a long weekend isnt going to be an option for 4-5 years.<br><br>", "<b>Username: Mastadon</b><br><br>\"\"Also, I suspect that Duke has a wealthier clientele than does Princeton as 60% of Princeton students qualify for need based financial aid versus about 43% at Duke and, ironically, just 38% at Rice.\"\"<br><br>@Publisher -<br>Here is the data on family income:<br><br>........................................Prince...................Rice..............Duke<br>Average income...........$186,100............$160,800..........$186,700<br>Top 0.1%.............................3.1%.................&lt;1%...............3.8%<br>Top 1%...............................17%.................9.8%...............19%<br><br>Bottom 20%.........................2.2%................4.9%................3.9%<br><br><url>https://www.nytimes.com/interactive/projects/college-mobility/rice-university</url><br><br>", "<b>Username: scalable</b><br><br>For Mechanical Engineering, your best education and outcomes will probably be Princeton>Duke>Rice, although the three are close! In terms of elitism, you will find a bit of that at each college but it definitely won't define your experience at any of them if you don't want it to. I would say to narrow it down, you can decide by fit and vibe. Princeton and Rice are more close-knit and have a more intellectual vibe, Duke also has droves of very intelligent kids but will have a different sense of community revolving around sports and a more fun student body. In terms of weather, Rice>Duke>Princeton if you like warmth and sun. In terms of overall happiness, probably Rice>Duke>Princeton as well. If you want to try something new, I would consider Princeton or Duke because you'll be in a newer area and a chance to try new things out for 4 years. The ability to have great opportunities from these schools are also quite comparable, although I would say Princeton and Duke probably open doors to the most exclusive opportunities that you might get overlooked for from Rice.<br><br>", "<b>Username: ejc000</b><br><br>Hello, everyone! Just wanted to provide an update on my decision.<br><br>My visit to Princeton for Princeton Preview was nice. The people I met were friendly, the campus was absolutely stunning, and the performing arts groups were really fun to watch. It was definitely a positive experience.<br><br>My visit to Rice (immediately after Princeton) for Owl Days was also nice, if not even more nice. The students I met were incredibly outgoing and passionate about the school, the weather was great, and I even got to participate in some social activities with my older brother. I felt at home, and that I would fit in easily. Despite previously being very keen on Princeton, I came out of Owl Days nearly ready to commit to Rice.<br><br>The following week I flew up to NC for Blue Devil Days at Duke. Again, it was a nice visit. I hung out with some really fun students, saw a gorgeous campus, and got a glimpse of the amazing things happening at Duke. That being said, the visit didn't wow me enough to justify going there (after all, Duke was the most expensive of the three!). After this visit I declined Duke and started deciding between Rice and Princeton.<br><br>Deciding was one of the hardest things I've done in a while. Over the course of several days, I flip flopped between Rice and Princeton extremely often. Sometimes my opinion even changed multiple times during the course of a day.<br><br>Basically, my decision came down to my consideration of the opportunities and social life at the two schools. While Rice felt like a better fit when I was on campus, I eventually deduced that this was likely a result of my familiarity with the campus, and the fact that I got to go around with my brother and check out a party. After talking to friends, teachers, and Princeton students, I felt confident that I would be able to find my people at Princeton through extracurriculars and my residential college, even if the environment wouldn't be as laid back as Rice's.<br><br>As far as opportunities, I decided that Princeton was more catered to what I want out of my college experience. While Rice has a decent non-major symphony orchestra, Princeton has multiple extremely involved and skilled music ensembles. While Rice would provide excellent outcomes to me post graduation, Princeton would provide even better ones when considering the alumni network (and that I want to end up on the east coast after I graduate). Lastly, Princeton is a new environment to me. While Rice would undoubtedly feel \"new\" in the transition to college life, Princeton would really broaden my horizons and expose me to a new area and the people and culture in that new area (seasons included!).<br><br>After careful deliberation, I decided to commit to Princeton. The decision really tore me apart. It was so difficult to turn down Rice after all of the positive experiences I've had with the school. Also, I'm the first person in my family to go somewhere other than Rice. To be honest, Rice felt very safe and homey. Going to Princeton is a risk, but I think it's one that I'm going to be glad I took.<br><br>Having decided on Princeton, I'm trying not to think about Rice (it feels sorta like breaking up with a significant other!). Rather, I'm trying to enjoy the little bit of high school I have yet while also building up excitement to head to New Jersey in the fall.<br><br>Thank you all for your insight on my decision. I mean it when I say that your comments and research helped with my decision. While I usually think of college confidential as a pretty toxic place, you all have proved to me otherwise!<br><br>The only thing I have left to say is this: Go tigers!<br><br>", "<b>Username: collegemom3717</b><br><br>Congrats, @ejc000! and well done. Stop and look back a year, and compare where you are now to where you were then. Then, at Thanksgiving, stop and look back to now. The changes are massive at this juncture in life, and pretty exciting.<br><br>One of the best things about all the thinking you put into your decision process is you *own* it: you know that you have made the best decision you can for where you are right now. On tough days (b/c obviously there will be some- whether a little homesick, bad weather, friend trouble, tough exam, etc.) you know that you made this choice for the totality of it (and you know that there are tough days everywhere), and you have a well considered list of positives that you can use on those tough days to bolster you!<br><br>", "<b>Username: Sunny66</b><br><br>Congrats! Great decision. Sounds like it will be an amazing adventure.<br><br>", "<b>Username: cptofthehouse</b><br><br>I love Rice. Its the absolute friendliest and happiest school Ive seen. Education is top rate.<br><br>To try to argue Princeton over Rice seems ludicrous to me. Princeton is a Holy Grail School. Im not going to even go into those merits. Im sure you know this ad nauseam. In your case, its the fear of the unknown that is an issue. I encourage you to venture out of the comfort zone of Rice and explore Princeton territory.<br><br>The extra cost for someone whose family is willing to pay full price is likely not an issue and IMO well worth a Princeton education<br><br>", "<b>Username: collegemom3717</b><br><br>@cptofthehouse, read post #54<br><br>", "<b>Username: Houston1021</b><br><br>Congratulations! Your road map to your decision will be a guide for future students making the same choice. Princeton is a terrific school and you will be forging your own path there.<br><br>", "<b>Username: cptofthehouse</b><br><br>Congratulations! You had two great choices! Go Tigers, as much as Im partial to Owls!<br><br>", "<b>Username: TiggerDad</b><br><br>Congratulations! @ejc000<br><br>You'll have no difficulty finding your people at Princeton, especially through music extracurriculars. Musicians make quick friends and bond together very closely at Princeton. My musician son, in my opinion as a concern parent, has made too many to be potentially disruptive in his studies. They hang out in NY a lot via one-hour, $20 train ride, exploring great food and music scenes. In fact, he was at the Metropolitan Opera House last night watching Richard Wagner's Die Walkre with some of his friends and a professor.<br><br>Now that you made your decision, you might want to chill and enjoy yourself by tuning in to the live streaming of Princeton University Orchestra and Glee Club conducted by Maestro Gustavo Dudamel tonight at 7:30 p.m. EST. The live streaming can be found here:<br><br><url>http://bc.princeton.edu/live/richardson/</url><br><br>Dudamel, the music director of the Orquesta Sinfnica Simn Bolvar and the Los Angeles Philharmonic, is capping his residency at the university with this concert and another concert tomorrow in Trenton.<br><br>", "<b>Username: Publisher</b><br><br>@ejc000 : Great choice. Your entire family should benefit from a shared experience at a school new to the family in a different region of the country.<br><br>", "<b>Username: Rivet2000</b><br><br>Congrats and thanks for the recap of your thoughtful decision making process. Have a great adventure.<br><br>", "<b>Username: PtonAlumnus</b><br><br>Welcome aboard Tiger. A good Princeton friend of mine from Houston Texas returned to Rice for his PhD and became a Rice professor. The Houston Princeton alumni club has had events at Rice. Enjoy your time at Princeton while realizing that you may benefit from Rice in the future.<br><br>"]}