{"title": "cornell full ride vs johns hopkins full ride vs usc full tuition vs emory", "comments": ["<b>Username: nervousnerd</b><br><br>Hi everyone!<br><br>", "<b>Username: momofsenior1</b><br><br>JHU is in the middle of Baltimore. Much smaller and much more urban than Cornell. Glad you are making visits because they are very, very different!<br><br>Talk to all of your schools about what would be involved in switching majors.<br><br>FWIW, I would not pay more money for USC than Cornell or JHU.<br><br>You have great options on the table. Congrats!<br><br>", "<b>Username: SouthernHope</b><br><br>If you consider Cornell the \"joke of the Ivy League,\" it's likely not a good fit for you.<br><br>", "<b>Username: nervousnerd</b><br><br>Thank you for the speedy reply! I know that at both Cornell and USC, switching your major within your school is generally very common and easy to do. It only starts to get complicated/difficult if you request a change to a completely different school, but I don't plan on doing that as of now. Not too sure what it's like for Emory and JHU but I'd assume it's a similar story.<br><br>", "<b>Username: momofsenior1</b><br><br>Just wanted to be sure you weren't thinking of transferring to Dyson because I'm not sure how easy that is these days. Within CAS, you don't even officially declare your major until middle of sophomore year so you have plenty of time to decide and try out different classes.<br><br>", "<b>Username: bluebayou</b><br><br>\"\"Johns Hopkins from what I've seen doesn't have the strongest programs in the Humanities...\"\"<br><br>fwiw: Hopkins has a stronger History program than does Cornell. (sure, The Hop is known for biomed, but it is also extremely strong in lit/hume.)<br><br>USC+debt is not better than a full-ride (tuition+housing). Actually surprised that their calc of need is lower than the other two since USC finaid is not considered miserly. If 'SC is really where you want to go, you should call and ask for a review of your need: 'I'm really excited to become a Trojan, but can't put my family into debt to make it happen...'<br><br>Call Emory and ask where their FA offer is. I'm guessing they'll match Hopkins &amp; Cornell.) Oxford is a two-year program in a small town and then continue on at the main campus (Buckhead is beautiful). You'd want to visit that Oxford too, if you could.<br><br>prop: learn to write in paragraphs, and/or get off of your phone for long posts.....<br><br>", "<b>Username: monydad</b><br><br>I was proud and happy to be admitted to Cornell.<br>You aren't.<br>If you come in with all that negativity practically bursting out of you, you will no doubt find things there to confirm it.<br>Suggest go someplace else.<br><br>Not sure why you applied, tbh<br><br>", "<b>Username: nervousnerd</b><br><br>\"\"If you consider Cornell the \"joke of the Ivy League,\" it's likely not a good fit for you.\"\"<br><br>I don't consider it the joke of the Ivy League, I was just making a comment on what some other people feel since I was talking about prestige and recognition. I even made mention of how Cornell is typically more highly regarded on an international level than it is in the U.S. Prestige is not a big deal for me and will not be a major deciding factor once I ultimately decide where I want to go, but it was worth mentioning.<br>\"\"fwiw: Hopkins has a stronger History program than does Cornell. (sure, The Hop is known for biomed, but it is also extremely strong in lit/hume.)<br><br>USC+debt is not better than a full-ride (tuition+housing). Actually surprised that their calc of need is lower than the other two since USC finaid is not considered miserly. If 'SC is really where you want to go, you should call and ask for a review of your need: 'I'm really excited to become a Trojan, but can't put my family into debt to make it happen...'<br><br>Call Emory and ask where their FA offer is. I'm guessing they'll match Hopkins &amp; Cornell.) Oxford is a two-year program in a small town and then continue on at the main campus (Buckhead is beautiful). You'd want to visit that Oxford too, if you could.<br><br>prop: learn to write in paragraphs, and/or get off of your phone for long posts.....\"\"<br><br>Interesting, I'll have to do more in-depth research into Hopkins's History program. I'm not sure if that's the degree I want to graduate with, but evidently I'm a very undecided person so it's good to know I have that possibility.<br><br>We contacted SC to see if they'd match Cornell/JHU's offers but they said no. I'm not complaining at all since they did give me 67k in grant aid, but yeah, finances are a concern. If anything I would have to take out a small loan and pay off the rest through work, so I don't know how big of a deal it would be, but I want to graduate with as little debt as possible.<br><br>Not sure what you mean by that last part, I broke up the sentences at the end because I didn't want to make the post look too much like a giant wall of text (even though it still kinda is).<br><br>", "<b>Username: menloparkmom</b><br><br>@nervousnerd<br>\"If 'SC is really where you want to go, you should call and ask for a review of your need: 'I'm really excited to become a Trojan, but can't put my family into debt to make it happen...'\"<br>I agree. Let them know your offers from JHU and Cornell .<br>It can't hurt to ask.<br><br>And btw- my DS was also an introvert at USC who was awarded a full tuition scholarship, but he had NO problem finding his \"peeps\" and avoiding the whole rah- rah, rich kid party scene.<br>It's a BIG school, and there will be LOTS of kids like you there. And practically nothing beats being able to be closer to home, warm weather and wearing t shirts and flip flops all year long.<br><br>", "<b>Username: collegemom3717</b><br><br>Why did you apply to JHU if 'from what you've seen' it's not strong in the area you want to study- humanities?? As it happens you are wrong, not just about history, as @bluebayou pointed out, but for IR (aka Political Science/Government's big brother), an area in which it is one of the top programs in the US. And I don't know where you got the idea that \"Cornell is considered the \"joke\" of the Ivy League\". I've heard of it being lumped in with Dartmouth, Penn &amp; Brown as some sort of 'lower Ivy' (a ridiculous enough concept), yes, but never as a \"joke\".<br><br>Seriously, I am glad that you are going to visit these schools, b/c your post suggests you are working on nothing but superficial stereotypes<br><br>Going into any debt for a vague humanities major/might-want-to-do-law-school kind of track - when you have 2 full rides to top-tier schools- is madness.<br><br>", "<b>Username: nervousnerd</b><br><br>@momofsenior1 I don't plan on going into business, and Cornell has an Economics department in the CAS so I think it should be fine. Dyson is Applied Economics which I assume is more geared towards Business and Management Economics?<br><br>@menloparkmom Ok, that's good to know. I'm not worried about finding my \"crowd\"/group of friends since USC is so big, but as an introvert it's still something that's on my mind. USC is a really great school and I have a feeling I'd be better off staying close to home/family/friends, but it's tough to turn up offers from schools like Cornell, JHU, and Emory. Thanks for the advice.<br><br>@collegemom3717 I applied because I have family in Baltimore, and because at the time I was still undecided as to what I wanted to do. Their generous financial aid was another draw, too. If it looks like I'm going off of stereotypes, that's because I don't have much else to work with. I'm glad I'll be visiting the campuses soon. The only reason I'm considering going into debt for USC is because it's close to my home and to my friends and family.<br><br>@monydad I was very excited and proud to have been admitted to Cornell. If it looks like I'm being reserved about the school, it's because I am - I've never visited, and it's thousands of miles away from home. Out of all the schools, I'm probably leaning Cornell the most, but I don't want to get myself overly excited and then disappoint myself if I have to turn down the offer because I realize the campus's location and weather isn't for me.<br><br>Thanks for the comments everyone.<br><br>", "<b>Username: Happytimes2001</b><br><br>Actually Cornell is not well known at all in those fields. JHU has an excellent world renown IR program. It's highly regarded in the diplomatic, strategic and other fields. Did you look at SAIS? If so, then why don't you recognize its impact in those fields which you are interested in? I find this odd as it is very well known.<br>Emory isn't in the same class but might be great. I really don't know the school.<br>USC isn't strong in those fields either, at all. Might be a good choice if you end up in economics which I'd imagine would be easier to do at any of your choices. While Cornell is a very well known school for good reason, the areas you cited aren't the strongest fields. And Cornell isn't as strong outside the US as any of the other Ivies. So, if you end up in international studies of some type, you aren't going to have the same connections that someone at JHU or Georgetown would.<br>I'd suggest you look at the actual majors you are interested in and how they rank at the various schools rather than just looking at the schools. You have some good choices. Also, why would you pay for USC if Cornell is free?<br><br>", "<b>Username: nervousnerd</b><br><br>@Happytimes2001 I'm not too interested in International Relations but I'm aware of the SAIS and it really made me consider going into graduate school for IR (as did Georgetown's foreign service school). A lot of information I have about college has come from my college counselor and she never really talked to me about Johns Hopkins and its Social Sciences/Humanities. I guess it's my fault for not being more aggressive about the research process and I probably shouldn't have trusted her word as much as I did. :P Admittedly when I was a sophomore I was pretty much set on studying IR but my passion shifted more towards History/Economics since I'm interested in the possibility of either law school or academia after I graduate. This is good to know, though, thank you for the information.<br><br>Main reason I would pay more for USC than any other school is so that I could stay close to home and remain in California. A lot of people don't really take this into consideration when I give the differences in offers but USC is 45 minutes away from my house (in good traffic) and as someone who has never lived away from home for a long period of time, it's hard for both me and my family to push USC aside just because it's a bit more expensive. Maybe I'm just being irrational though, idk. Hard to tell, especially on a site like this.<br><br>Thanks again :)<br><br>", "<b>Username: SouthernHope</b><br><br>SAIS is a graduate school only....located in China/Italy along with DC so no presence in Baltimore...and wouldn't be a consideration until senior year of college (and, even then, only 10% of the students accepted come straight from undergrad).<br><br>", "<b>Username: Happytimes2001</b><br><br>@nervousnerd For some families, the cost isn't a consideration. So that's fine.<br>Just FYI, government/policy science is very closely though not the same as international relations. There are definitely those who want to work and study US policy. These days most of these fields are international in scope. History and literature are a different story, however. Likewise, economics can be studied from a number of perspectives.<br><br>As a parent, I would push you out of your comfort zone and away from home. Going to college is the best way to learn about yourself and gain confidence. Being away from home, you will have to rely on making new friends, learning from others and integrating into the community. Even in a diverse university like USC, a new area will allow you to fully embrace a new experience. I do realize that many students stay close. But I don't think many realize that this is one of the best and often only time it will be easy to leave their nest. But it's all about how you feel about your choices. Best of luck to you.<br><br>", "<b>Username: nervousnerd</b><br><br>@SouthernHope I'm aware, I think @Happytimes2001 brought it up just to comment on JHU's IR program in both the undergrad and graduate realm.<br><br>", "<b>Username: albertsax</b><br><br>Rankings for undergraduate majors usually don't matter. You'll get a great education at any of these schools no matter what you end up deciding on studying. I would chase the money in your case (assuming you feel comfortable at either Cornell or JHU).<br><br>", "<b>Username: bluebayou</b><br><br>\"\"As a parent, I would push you out of your comfort zone and away from home. Going to college is the best way to learn about yourself and gain confidence.\"\"<br><br>I would agree with that but not necessarily for the poor. Sure, a full ride eliminates most -- but not all -- financial issues, but it can still be economically isolating when your dormie/friends are off for a weekend of skiing and you need to stay back to eat the 'free' dorm food. At some private schools, the wealthy gap is noticeable and can be uncomfortable (think Columbia and NYU kids living high in Manhattan).<br><br>Of course, that's what's great about Ithaca and Baltimore, not too many places in either locale that require extra money to visit. Emory, OTOH, has a lot of full pay students who could easily spend every Friday night clubbing on Peachtree.<br><br>", "<b>Username: menloparkmom</b><br><br>@nervousnerd ,<br>My DS was also accepted at many east coast U's, including 2 Ivy's.<br>In the end, after visiting the 2 Ivys during accepted student days, he decided, as MANY kids do, that he would be happier staying closer to home. And he was! Most college students go to college within 400 miles of home. [Yes that does include students going to CC's and local public colleges.]<br>The nightmare stories of trying to fly home [ we are in N Calif] from the east coast during thanksgiving and Xmas -10 hr travel times and frequently delayed flights due to bad weather- WERE a factor in his decision.<br><br>Mu recommendation is that you should go to USC. They are a top 25 U and are plenty \"prestigious\" enough for students applying to grad school.<br><br>They do offer many UG opportunities to study abroad. And USC is VERY well know overseas in countries in the Pacific region.<br><br>", "<b>Username: monydad</b><br><br>It's often assumed JHU undergrad is \"good\" at something because of SAIS. SAIS *IS* good, very good. However SAIS is a [wholly-]separate master's program located in Washington DC, not Baltimore, with separate faculty and no undergraduate cross-registration or majors. (AFAIK, you can check)<br><br>Just checking some grad rankings -<br><br>US News History, Poli Sci, English, Econ :<br>Cornell 11,19,8, 21<br>JHU 11, 49 ,15 ,23<br>USC 38, 51, 37, 33<br><br>NRC Rankings : <url>https://www.chronicle.com/article/NRC-Rankings-Overview-History/124736</url><br><br>If I read these correctly:<br><br>NRC (S ranking range, R ranking range)<br>English: Cornell 7-28; 5-25<br>JHU 7-36; 21- 70<br>USC 48-80; 42-83<br>Poli Sci:<br>Cornell 27-50; 18-33<br>JHU 29-64; 35-68<br>USC 50-88; 57-90<br>History<br>Cornell 27-50; 18-33<br>JHU 29-64; 35-68<br>USC 50-88; 57-90<br>Philosophy<br>Cornell 16-34; 2-19<br>JHU 33-52; 28-44<br>USC 42-79; 39-65<br>Economics<br>Cornell 20-28; 20-31<br>JHU 30-63; 26-49<br>USC 30-45; 32-51<br><br>other rankings<br><br>Philosophy<br><url>http://cwsuat.philosophicalgourmet.com/overall.asp</url><br><br>Economics<br><url>https://www.chronicle.com/article/NRC-Rankings-Overview-History/124736</url><br><br>.<br><br>", "<b>Username: observer12</b><br><br>My only advice:<br><br>Make your decision without factoring perceived \"prestige\". There are good reasons to choose a great university that gives you a full ride, but not if you will be unhappy there. There are good reasons to choose the university with the best department in your major, but not if you are unhappy and the other choices have perfectly good departments and you are an undergrad.<br><br>Visit as many of the schools as you can. Cornell is an excellent school and a full ride is amazing, but please don't choose it because of perceived prestige - choose it because you want to be there and the full ride makes it hard to turn down.<br><br>", "<b>Username: bluebayou</b><br><br>\"\"There are good reasons to choose the university with the best department in your major, but not if you are unhappy and the other choices have perfectly good departments and you are an undergrad.\"\"<br><br>Bingo. The differences in academic ranking is marginal at best. Both are world-class Unis. Neither will hinder your future career in any way.<br><br>", "<b>Username: monydad</b><br><br>woops poli sci in # 19 was wrong, should be:<br>Cornell 25-37; 12-27<br>JHU 66-82; 47-78<br>USC 26-40; 12-27<br><br>Re#18, I agree, from everything you've written here I would suggest that you go to USC. IMO.<br><br>", "<b>Username: Riversider</b><br><br>@monydad<br><br>SAISs isnt what Johns Hopkins is really famous for, its better known for all things medicine among masses. Most people wouldnt even know what SAIS stands for. Im not claiming SAIS is not awed and respected among powerful elites and global players but its a very specialised small program not on any commoners radar. On other hand, everyone knows about JHUs medical research.<br><br>", "<b>Username: monydad</b><br><br>@Riversider:<br>SAIS was brought up in #11 as a factor OP should take into account, I was responding to that.<br><br>I agree that med is what JHU is by far most known for, however (far) below that JHU's other known (perhaps not to so many) areas of excellence include SAIS and its creative writing program.<br>But I only mentioned SAIS here because it came up previously.<br><br>", "<b>Username: nomorecoll96</b><br><br>can I ask you what your stats are? I am surprised USC did not offer the same scholarship.<br><br>", "<b>Username: LoveTheBard</b><br><br>Since you still don't know where Emory will come in $$-wise, I'll limit my comments to the choices at hand -- USC, Cornell, and JHU. I<br><br>You seem to know USC culture well enough to get the sense that you don't love it there. I'm not sure that being sooo close to home such a good thing; it might do you well to explore another part of the country. While I'm sure that you would ultimately find your tribe at USC (there are plenty of students that are not into the rah-rah sports / party scene), I don't see what USC brings to the table that your lower-cost and, FWIW, higher-ranked options can offer.<br><br>While JHU is well known and highly respected in the sciences, it is also very, very strong in both the humanities and in the social sciences; it offers unique and highly respected programs like SAIS as well as a number of interdisciplinary programs and great options for study abroad (e.g., SAIS-Bologna and Sciences Po). Travel to and from Baltimore is easy -- there are plenty of inexpensive non-stops from LAX to BWI (including on Southwest which allows two checked bags and offers a lot of flexibility in terms of changing dates/times without penalty.) The weather is worse than So Cal but nowhere near as bad as it is in update New York. The fact that you have family there will make you feel less isolated.<br><br>Forget \"lower-ivy\" elitist nonsense -- Cornell is a great school. It is also much bigger than Hopkins and is in a much more rural area in upstate New York; Ithaca a small airport with no direct flights from the west coast. It's a beautiful area, but it's cold and dreary and winters are loooong. Travel costs will be higher and the trips back and forth to the west coast significantly longer and much more of a hassle. I don't see the advantage to Cornell over Hopkins, but you need to see what feels right to you.<br><br>Emory could turn out to be a nice option, but I certainly wouldn't pay a premium for it.<br><br>", "<b>Username: monydad</b><br><br>Relative strengths in humanities and social sciences areas deemed relevant by OP can be assessed in part from #19 &amp; 22 above.<br>As previously discussed SAIS, which is a graduate-only program located in Washington DC, will likely play no part in OPs experience as an undergrad at JHU in Baltimore, AFAIK .<br><br>", "<b>Username: collegemom3717</b><br><br>Taking on debt for undergrad, with only a vague idea of what the plan is (except one expensive potential plan, law school) to go to a school that has not felt comfortable to the OP, in preference to at least 2 (possibly) 3 schools where no debt is required and are <i>at least</i> as sound academically is baffling logic to me- UNLESS the other 2/3 schools feel even less comfortable.<br><br>IMO, OP: go visit Cornell &amp; JHU, &amp; Emory if they come through with a no-debt offer. Until you have been there it's all theoretical -and that's not how real life works.<br><br>", "<b>Username: CupCakeMuffins</b><br><br>My vote is for Johns Hopkins, its a smaller school in a bigger city with strong academics and with another Bloomberg Billion $$$$, its only getting better.<br><br>USC is too big and not easy for everyone to to stay focused there. Cornell is big and both their winter and secluded location sucks. Its not a great place to fly in and out.<br><br>All are good schools but with a free ride to JHU, it makes most sense for OP. Unless he doesnt want to stray too far from home, which certainly has some advantages.<br><br>", "<b>Username: nervousnerd</b><br><br>@CupCakeMuffins Thanks for the reply! :)<br><br>", "<b>Username: LoveTheBard</b><br><br>@monydad - Re: SAIS: I did look it up. There is a combined BA/MA SAIS program in International studies which entails 3 years on the Baltimore (Homewood) campus and two years at SAIS in D.C. Given that it's a program that students apply to as in their sophomore year, SAIS can very much be a part of the undergraduate experience.<br><br>There is also SAIS - Bologna, which is a junior year / semester abroad program. For East Asian Studies, there is a similar SAIS study abroad program in China<br><br>From the website re: SAIS-Bologna:<br><br>\"Motivated international studies and political science majors....may apply to spend their junior year or a semester at the School of Advanced International Studies (SAIS) Bologna Center in Italy.<br><br>....students apply in the second semester of their sophomore year for the year abroad program.\"<br><br>Credits earned in the SAIS - Bologna program can get advanced credit if they end up doing the MA program.<br><br>", "<b>Username: happymomof1</b><br><br>If you have such significant need that both CU and JHU have offeredfull rides (tuition, fees, housing, meals) then my guess is that your family can't truly afford USC. Remember, you an only borrow the standard federal loans on your own. Any debt beyond that would need a cosigner.<br><br>CU has several divisions that are state affiliated, and attract a fair number of in-state students whose families are in financial situations similar to yours. So don't worry about being the only one in your dorm who is counting their pennies to make sure they can pay for their share of a pizza. You are smart to be concerned about the weather. Winters are long, dark, and snowy. They also will be cold by your standards. Summers are gorgeous, but most undergrads aren't around then. I like the wide variety of programs (and consequently students) at CU. Yes you could switch into CALS or ILR or HUMEC if you suddenly decided to. But again, the winter and travel costs need to be taken into consideration.<br><br>JHU is easier to get to as others have pointed out. Historically, it has had an excellent reputation in the humanities, and has had a good track record for getting students into graduate or professional school. You nedn't worry about that. The winter is definitely milder than at CU, but still might be cold by your standards. I'm not familiar with the JHU campus, but Happykid graduated from Towson U in the Baltimore suburbs, and really enjoyed the time she spent in the city.<br><br>Fingers crossed that when you visit you will know which can be a good home for you for the next four years!<br><br>", "<b>Username: privatebanker</b><br><br>Full ride to Cornell and JHU are like winning the educational lottery. If youre a nerd and hard working as your username states. I cant think of two better schools for your personality, major and cost in the world.<br><br>Stop worrying about what other uninformed and immature people/peers say about anything. If you think of any of these people in a few years it would be remarkable, if you actually care what they say at that time it would be unimaginable.<br><br>", "<b>Username: CupCakeMuffins</b><br><br>OP @nervousnerd look into the program @LoveTheBard mentioned in post #31. It looks like an amazing custom tailored opportunity for you.<br><br>", "<b>Username: Alexandre</b><br><br>Cornell and JHU are exceptional universities. Attending those universities at a highly discounted price is an opportunity that nobody should pass up. Where it matters most, they are as prestigious as they come. No educated adult, especially one in a position to admit you into a graduate program or hire you into a company, would associate Cornell or JHU with the word \"joke\". In fact, those two universities are pressure cookers, known for their uncompromising academic standards. I would explore there respective offerings and campus cultures and pick the one that fits you best.<br><br>", "<b>Username: monydad</b><br><br>IMO most of the \"pressure cooker\" reputation (at both schools, probably) comes from the sciences &amp; engineering. Humanities are no joke either, far from it, but the Humanities students don't do the same level of moaning and groaning. Maybe they just have better manners..<br><br>FWIW my D2 was a humanities major at Cornell, and worked very hard there. However, while she was doing that, she also had part-time jobs, extra-curricular involvements and an active social life. She did well academically too. Actually her extracurricular involvements, and some classes taken at the university's more specialized, applied colleges, helped pave the way for her subsequent work life,<br><br>", "<b>Username: mamaedefamilia</b><br><br>@nervousnerd JHU alumna here. I got my PhD in History, and I can assure you that the department was and continues to be excellent and highly ranked. Also strong are Political Science, English, Philosophy, and Creative Writing. Internationally renowned scholars circulate through on a regular basis. There are also weekly seminars where leading researchers circulated works in progress in advance for discussion and debate.<br><br>While the average person on the street will think \"Hopkins - medicine,\" law schools and grad schools know the worth of a JHU humanities/social sciences diploma.<br><br>As you are interested in community service, I also can assure you that ample opportunities await you in Baltimore.<br><br>As mentioned previously, getting in and out of Baltimore will be easier from the west coast than Ithaca, which will involve more regional airports and weather-related delays and cancelations at some point over the course of four years. Is that enough to discount Cornell? Of course not. But it's a point worth considering, given that you have some concerns about being far from home.<br><br>Basically, you have four strong options before you. I do not know USC's history program well but both Cornell and Emory also have large, diverse History programs with distinguished faculty and frequent guest lecturers. My recommendation to you is to do a deeper dive on the faculty pages and also the course catalogs to see what leaps out at you intellectually.<br><br>Congrats on your many acceptances.<br><br>", "<b>Username: theloniusmonk</b><br><br>\"I'm thinking of majoring in History as I am considering going to law school after undergrad, with a potential double major/minor in Government/Political Science, or some other subject like Literature or Philosophy. Alternatively I'm also thinking of studying Economics along with Statistics/Data Science if I decide I'd rather not go to law school.\"<br><br>Based on potential majors, especially the data science part (maybe as minor or second major), I'd strongly lean to Cornell, then USC. Good luck!<br><br>", "<b>Username: nervousnerd</b><br><br>Thank you for the advice everyone! At this point the debate seems to be between Cornell and JHU; hopefully visiting the campuses will make the decision easier for me.<br><br>", "<b>Username: BivalentChomps</b><br><br>Someone asked this previously, but I'm *very* curious as well about your grades, community work &amp; activities... three top-ranked, high-profile universities w/ 10%-15% acceptance rates don't offer free rides that often.<br><br>", "<b>Username: momofsenior1</b><br><br>Cornell only gives need based aid.<br><br>", "<b>Username: BivalentChomps</b><br><br>@momofsenior1 - understood, but there's a difference between aid &amp; \"full ride\" so @nervousnerd must be one special person!<br><br>", "<b>Username: whidbeyite2002</b><br><br>@nervousnerd, my daughter was also accepted to JHU (for Classics/International Relations). I was very surprised about how strong JHUs humanities programs are. I am a Cornell grad from an applied sciences program that at the time was considered best in the nation and one of the premed paths. I love Cornell and Ithaca, but its not to everyones taste. I did not push my D toward Cornell because its really in the middle of nowhere and dark, cold, and snowy in winter; she wanted an urban area after growing up in rural Washington. That said, Ithaca is a fun, vibrant college town, and my impression is that Cornell has an excellent history program. Your proximity to DC at JHU would be a big bonus, though. Its easier to travel from Baltimore to home, too. If I were you, I would skip USC for the cost alone and also to grow in a different part of the country.<br><br>", "<b>Username: twoinanddone</b><br><br>Hopkins is the winner. Location (with family nearby), cost, majors.<br><br>", "<b>Username: monydad</b><br><br>?? Why is it a \"winner\" for majors ??<br><br>", "<b>Username: monydad</b><br><br>Also:<br>Did OP say he /she had family in Baltimore? I guess I missed it.<br><br>It's true flying to/from Ithaca is more cumbersome, requiring a connecting flight, but OP won't be doing that trip everyday. And true it is cold and snowy there in the [long] winter.<br><br>Nevertheless, there are actually a lot of Californians attending Cornell. And if you believe that Parchment thing more cross-admits choose Cornell. FWIW.<br><br>To me largely It is a college town, vs. Baltimore thing. My D2 didn't like going to school in a city- a lot better city than Baltimore- and transferred to Cornell and loved it in Ithaca. YMMV.<br><br>And then, there are advantages to being near home, if OP can swing that financially the severity of the expressed reservations in #1 would swing things towards USC, to me.<br><br>OP suggest when you are vising don't just visit the campuses, also the surrounding areas. Find out how/where upperclassmen live and what their lives are like. Socially as well as academically.<br><br>", "<b>Username: monydad</b><br><br>Also when you are at Cornell, or just on-line, please look into what the specialized colleges there may offer you, in some cases beyond what typical liberal arts programs may offer. There are potentially relevant courses in at least three of its other colleges that effectively expand the offerings that are available to you. It is normal to take courses at several of its colleges. Also check out the extracurriculars and other programs that may be relevant (eg prison education program, if that's of itnerest..)<br><br>", "<b>Username: LoveTheBard</b><br><br>@BivalentChomps - The difference between \"aid\" and \"full ride\" at Cornell is *strictly* based on financial need. From the Cornell website:<br><br>No merit aid or athletic scholarships are awarded at Cornell; all grant aid is need-based.<br><br>Given that there is no merit component to Cornell aid, no matter how \"special\" OP may or may not be, his full ride is based on financial need. (And, while Hopkins does offer some merit scholarships, most of their merit aid takes financial need into consideration).<br><br>We have no reason to believe that OP's full ride to Hopkins has any merit component and it certainly does not at Cornell. That said, OP may indeed be a special person.<br><br>", "<b>Username: nervousnerd</b><br><br>Thanks for the advice, everyone.<br><br>", "<b>Username: whidbeyite2002</b><br><br>@nervousnerd, please report back about your decision. Good luck!<br><br>", "<b>Username: Tc11204</b><br><br>Let us know what you decide. DS is in similar boat as you. We did visit JHU at SOHOP last week and ds absolutely loved it. It was so welcoming, people were very friendly and he made friends already during the overnight stay. We visited Cornell a few days ago for an overnight visit and he did not like it as much. The campus is huge (his phone showed that he walked 9 miles in that one day), it was gray, it was cold, people didnt seem that friendly. Well see what he ultimately decides. Good luck with your decision.<br><br>", "<b>Username: Lindagaf</b><br><br>Joke of the Ivy League. Ok.<br><br>Accruing debt to pay for USC is not sensible. It is not better than the other two schools. Id choose JHU in your shoes. The campus is lovely, facilities are outstanding. Nice vibe, and even though kids are smart, they arent boring or unapproachable. Easy airport access so your parents can keep tabs on you. Cornell is going to be a schelp, no matter how you slice it. Unless you really like Emory, it seems the smart decision is to follow the money.<br><br>", "<b>Username: BivalentChomps</b><br><br>@LoveTheBard Understood and appreciated!<br><br>", "<b>Username: scalable</b><br><br>Since you don't want to do anything particularly STEM, I think Cornell loses it's advantage here since that's its strong suit. For humanities your best bet is probably Johns Hopkins, although if you change your mind and want to do anything math or statistics related, it's probably gonna be Cornell that wins out. If the finances are pretty similar, I would say USC and Emory probably don't need to be in consideration unless you really like warmer weather and climates, which is absolutely valid too.<br><br>", "<b>Username: bluebayou</b><br><br>\"\"For humanities your best bet is probably Johns Hopkins...\"\"<br><br>Huh? I chose three disciplines at random, and for Classics, English and Philosophy, Cornell was slightly higher ranked than Hopkins.<br><br>", "<b>Username: monydad</b><br><br>See posts #19 &amp; 22<br><br>"]}