{"title": "boston college vs northeastern", "comments": ["<b>Username: kdmt1998</b><br><br>What is your opinion of BC vs Northeastern? I was under the impression that they are about the same now in terms of prestige, jobs opportunities etc. NU actually seems to have a lower acceptance rate than BC but everywhere I go people seem to think BC is more prestigious? Which college will end up with better job opportunities? What about in terms of social experiences? Is BC fun? What do kids do on the weekends? Do most BC kids go to boston on weekends? Is NU hard to keep same friends with Coops and kids coming and going? I can't make up my mind. I want to meet and keep lifelong friends and I want to get a great job as well!<br><br>", "<b>Username: bluebayou</b><br><br>yes, in terms of prestige, jobs, etc, BC and NEU are similar. Is there a difference in Cost of Attendance? (On another thread, you posted about merit from NEU.) What major?<br><br>Different campus cultures, and NE is more urban, while BC is a leafy, suburban campus (even tho technically speaking, half of the main campus resides inside the Boston City limits). Jesuit education is a big differentiator and the Core curriculum vs. the coop program at NE. Fortunately, the Boston environs has a ton of businesses, so internships are plentiful for those that attend BC. Given the low unemployment rate right now, as a parent I think the coop program is over sold. (now, back in the last recession....)<br><br>", "<b>Username: privatebanker</b><br><br>In New England, BC is considered to attract the higher performing students. And those with less of a specific career goal in mind. But that doesnt mean anything in the real world. Both are great and the best students at each school have unlimited opportunities for success in life. You cant go wrong.<br><br>Yes BC is fun. But its very rigorous. NEU isnt the same type of environment. Doesnt have the big sports options on campus etc. but college kids all know how to have fun.<br><br>", "<b>Username: CCSavant</b><br><br>These schools could not be more different. First off, don't be influenced by Northeastern's lower admit rate. Northeastern has worked very hard over the years to generate the high application numbers needed to report such a rate. My son got endless expensive mailings and, ultimately, was offered an application fee waiver (not for financial reasons). At that time, there was no writing supplement. Now there is a modest one. My experience based on my son's high school is that BC was a more difficult school to gain admittance to. And application numbers at BC are limited by BC's Catholic heritage. Having said that, the stats of the enrolled students at Northeastern (to the extent that they are reliable - may exclude international students and all of those NU-in students who don't show up as Fall Freshmen) are impressive.<br><br>As to the differences, Northeastern is very urban, less sports oriented and with the college experience highly driven by coops rather than the campus. I think you lose the sense of \"class\" early on, as you and your fellow students rotate in and out of school regularly. That is not necessarily bad, as it does provide perhaps for meeting many new people along the way, but it is different. It is also five years at Northeastern - usually.<br><br>BC is strongly influenced by its Jesuit heritage, sports culture, and strong campus community. The campus is not urban, but certainly within easy striking distance of downtown Boston on any given day through public transportation. Heck, you could walk it. To me, that is the best of both worlds, though for some, being able to walk across the street to art museum or hang out at urban cafes, etc. might be very attractive. BC is certainly in a safer neighborhood.<br><br>I know great students at each school, and they like where they are at. So...........two good choices, but very different ones.<br><br>", "<b>Username: BCBoundMaybe</b><br><br>Id pick based on which campus you like and which is best fit for your major. They both are great schools, just different. I applied to both and got denied from NU and accepted to BC. My friend applied to both and he got into NU and denied from BC. So no idea which is harder or more prestigious. Id just go based on how you feel after visiting. That will tell you a lot. Good luck.<br><br>", "<b>Username: bbfan1927</b><br><br>@kdmit1998- Well, I am biased for sure, but BC over NEU all the time. BC has a BRAND and an identity- one of those intangibles that are earned over a very long period of time. IMHO, go to NEU if you truly desire a urban college experience. If you want a college campus environment that fosters relationships and a collegiate experience, enjoy a sports atmosphere, seek a active, supportive and very vocal alumni, and a solid academic reputation, than BC is the school. NEU is a fine school, but they play games with their admit ratio, so don't be lured by that. Many students at BC are here because they didn't get into the Ivies, ND or GT. the NEU. We have a solid academically inclined and determined student body, and the work assigned is vigorous- so dont kid yourself that getting an A is an easy feat- its not. You have to work hard here. Slackers will have difficulty....apologies to those for flying the flag.<br><br>", "<b>Username: TomSrOfBoston</b><br><br>@bbfan1927 Boston College has come a long way from the early 1970's when it was on the verge of bankruptcy and there were rumors that it would close and the campus would be purchased by Harvard.<br><url>http://bcheights.com/2014/11/02/focus-cost-cutting-saved-bc-bankruptcy-financial-woes-1970s/</url><br><br>", "<b>Username: CCSavant</b><br><br>I would echo @bbfan1927 completely. My sense is that students choose NEU over BC for:<br><br>1. Coop program (\"unique\" as a marketing tool but not sure it is any easier to get an internship out of NEU than BC<br>2. True \"urban\" environment<br>3. Merit scholarship $$$<br>4. Certain programs that BC does not have (like engineering....but will have)<br>5. Turned off by the optics of attending a Catholic school (I say optics because, while certainly Jesuit, students at BC are not in any way influenced by Catholicism against their wishes)<br><br>For me, BC is an easy first choice here but some students do certainly choose NEU over BC for their own reasons. I cannot emphasize strongly enough that the students, the environment and the \"vibe\" are very different between the two schools. Spend time at both to get a more visceral sense of what attending each might be like. My son applied to both and withdrew his application to NEU after getting into BC REA last year.<br><br>I provided a more balanced response above but, if you want a perspective as to which one I would choose, BC in a heartbeat.<br><br>", "<b>Username: TomSrOfBoston</b><br><br>@CCSavant<br>\"\"Coop program (\"unique\" as a marketing tool but not sure it is any easier to get an internship out of NEU than BC\"\"<br>Northeastern students do not do internships, they do coops. They are not the same thing. Many of these coops are arranged through long standing relationships with companies.<br><br>", "<b>Username: PengsPhils</b><br><br>To give a differing perspective and correct some information:<br><br>Co-op is absolutely a huge difference between internship programs. Northeastern doesn't have a top-rated career center (top 3 in Princeton Review for the past decade) without reason. Having a huge database of longstanding co-op relationships and specific co-op advisor and co-op prep classes in addition to the career center resources helps students be ready for postgrad life. The time difference also allows for more meaningful work. The environment also encourages much more experience. A student with two internships has only a third of the work experience that a student with 3 co-ops has when they graduate.<br><br>You don't need co-op by any means to be successful, but there is absolutely an advantage. No, it's not just marketing. The question for a prospective student should be how those advantages compare with other factors in their decision and how they feel about the differences in the academic model that co-op creates. If you really want that consistent campus life then going to BC and doing internships is probably the better call. It's just a matter of values.<br><br>I think it is very telling that the list provided by @CCSavant is exactly the reason I looked at both schools, never even bothered applying to BC, and chose Northeastern in the end. The co-op program, urban environment, and strength in programs over BC (CS in my case) are three great reasons to pick Northeastern for some, but for others they aren't important. What's really emphasized by that list is that fit is what should guide your choice here.<br><br>", "<b>Username: tR5674</b><br><br>I actually have twin HS Seniors that seem to be trending towards 1 going to NEU and 1 going to BC. Each accepted to both schools among others. BC grad myself.<br><br>@CCSavant The Coop program is for real. There are decades of relationships with employers who have taken kids for Coop/ 6-month paid employment stints with that number continuing to grow and more and more are not in New England/Boston. It seems that most NEU grads have at least two 6-month stints of working and getting paid. While you are working in these stints, the student can continue to live in university housing / even continue to use some form of the meal plan if they want. They don't pay tuition while working and make anywhere from $20 to $40 per hour in their work. Kids graduate with real hands-on experience that enhances a resume more than an internship IMO. At a recent Admitted Student Day, we were told that over 100 Coop jobs didn't get filled - so there are plenty of Coop jobs which allows kids to try out different roles/ professions.<br><br>Hey, I'm a big BC fan. I am also a big NEU fan. The Coop program is definitely pre-professional as opposed to liberal arts focused; as are the BC Schools of Management, Nursing, and Education. Coop program isn't for everyone but it is pretty darn impressive.<br><br>", "<b>Username: TomSrOfBoston</b><br><br>I will cite one example of the difference between a coop and an internship. I read this on another blog that CC does not allow to be linked. A Northeastern student was an accounting major. He did his first coop at a Big 4 accounting firm in the January to June cycle, as most accounting coops are. The wage was good and he worked 70-80 hour weeks from January through April. He made a lot of money with overtime. It slowed in May and June was very relaxed. In June the summer interns arrived. The firm sponsored company trips to baseball games and amusement parks during the work week. The interns thought \"Wow!\" this is a fun and easy job. They had no idea about the grind of tax season and stories about it didn't phase them. They never worked through it.<br><br>That student changed his major to finance upon returning to campus in July. He learned that big accounting was not for him.<br><br>", "<b>Username: bluebayou</b><br><br>\"\"That student changed his major to finance upon returning to campus in July.\"\"<br><br>Did said student still graduate in four years? I see NEU still does not report its four-year graduation rate....<br><br>Back when NEU did publish its stats, the 4-year grad rate was &lt;20%. (Staggering number, IMO.) Assuming the number has improved to say, 50%, that's still a big factor for parents to consider: 1) additional costs; 2) co-op experience is now offset by a job working in the real world if graduating 'on time'.<br><br><url>https://thechoice.blogs.nytimes.com/2009/12/09/at-northeastern-a-degree-in-4-years-instead-of-5/</url><br><br>For perspective, at BC, 4-year grad rate is ~90%.<br><br>", "<b>Username: TomSrOfBoston</b><br><br>@bluebayou<br>\"\"Did said student still graduate in four years?\"\"<br>He is still a student. He should be able to graduate in 4 years, If he chooses to do so.<br><br>All but a handful (pharmacy, architecture) of programs at Northeastern can now be completed in four year, if the student so chooses. I would imagine that the four year graduation rate is still under 25%. There are no additional costs of attendance because tuition is not charged while on coop and virtually all coop jobs are paid.<br><br>Why do you consider the 4 year graduation rate to be \"staggering\" since in the past Northeastern had always been a 5 year program and made that quite clear in its promotions?<br><br>", "<b>Username: elderwood</b><br><br>@bluebayou quoting statistics that are a misrepresentation of the program is not helpful to a student trying to decide. Even if you go to NEU for 5 years you do not pay more. You go to school for 8 semesters and pay for 8 semesters like every other college. There might be exceptions to paying more if students want to go on multiple international dialogues, do additional summer sessions, combine with masters program, etc. You work in the real world, earning real wages for 2 or 3 coop semesters and dont pay tuition. No one is stopping kids from graduating in 4 years , 2 coops. Many kids want that third coop and do not see a downside to 5 years. In fact many excellent job offers come out of the last coop. Still, they only pay for 4 years of school...not sure how often this fact needs to be repeated.<br><br>On another note @kdmt1998 dont rely on biased opinions to make such an important decision. These 2 schools are as different as can be. You have to feel completely comfortable with the culture (and perceived prestige differences, if that is as important to you as it seems). One of my children chose NEU over BC and schools more prestigious than BC. It was more difficult for us parents to get over that fact, but it is NOT our college experience. He wanted to be in an environment that didnt feel like an extension of HS and being able to explore the world through NEU programs was way more important than a traditional college experience.<br><br>", "<b>Username: privatebanker</b><br><br>Its like a beanpot thread. lol.<br><br>", "<b>Username: ProfessorPlum168</b><br><br>FWIW, my D will graduate at NEU in 3.5 years, this December. She did one coop. And she loves it there at NEU.<br><br>", "<b>Username: tR5674</b><br><br>@bluebayou If you show up with a bunch of APs, you can graduate in 4 years from NEU even with two 6 month work stints. Many kids stay the extra half year or full year to get a 3rd 6 month job or to study abroad. It is an entirely different model than BC. Again, I'm a BC grad and fan but the 4 year graduation rate isn't a good way to measure the effectiveness of the very different models. The Coop program is actually intended to be in general a greater than 4 year program. Student only pays for 3 or 4 years because of Coops. An traditional internship (7-8 weeks in summer?) is nice but limited. Compared to multiple 6 months Coops? Unquestionably NEU kids come out with real work experience and real resumes. Coop experience > Internship experience. And 'yes' it might take 4-5 years but so what.<br><br>", "<b>Username: merc81</b><br><br>If graduation rates were to be considered, it might be informative, or at least interesting, to compare BC's 4-year rate (88%) with Northeastern's 6-year rate (85%), which would partially adjust for the different structures of these schools' programs.<br><br><url>https://www.usnews.com/best-colleges/rankings/highest-grad-rate</url><br><br><url>https://www.usnews.com/best-colleges/northeastern-university-2199/rankings</url><br><br>", "<b>Username: BCBoundMaybe</b><br><br>@privatebanker haha. @CCSavant I think u nailed the list. Ok. Not sure why I checked this site on break, but have a good one everybody<br><br>", "<b>Username: bbfan1927</b><br><br>Harvard is Harvard, MIT too. I even get Tufts but who and what is NEU?<br><br>I have said it before and I will say it again- BC is a BRAND. BC has more panache. BC has more of an an identity. BC has an xfactor that NEU simply does not. The BC alum network is huge, loyal, committed, loud and proud - there is TREMENDOUS school spirit....Overall, BC hits all the buckets of a varied and full college experience -very solid academics, a beautiful social campus, school spirit, access to a major metro area, and sports I mean....How can any student go to 4 years of college and not go to a home football game? EVER.... YIKES!!!!<br><br>The College Game day hosting on campus was off the charts!!! The BC campus was totally and completely unified and electric when BC hosted Clemson on national television last year- Let me repeat- National television PRIME TIME! The Eagle Walk before game time- a memory that will last a lifetime! Sorry NUE fans, you can keep your over hyped coop program, sketchy acceptance rate- ill take the BC Brand................now, how do we just get rid of Adazzio?<br><br>", "<b>Username: katliamom</b><br><br>\"How can any student go to 4 years of college and not go to a home football game? EVER.... YIKES!!!!\"<br><br>The tens of thousands who go to schools without football programs?<br><br>", "<b>Username: ProfessorPlum168</b><br><br>If the OP was concerned with football he or she would be considering Notre Dame and not Backup College....signed, all ND fans<br><br>", "<b>Username: moooop</b><br><br>BC is durable &amp; stubborn. It has carved out a distinctive niche in the most competitive college town in the world. People who are intimidated by it, who wish they had gone there, who wish those glorious towers they see poking up above the horizon from the Greenline T were theirs, feel compelled to attack it because they can't BC.<br><br><url>https://www.google.com/search?q=boston+college+from+the+reservoir&amp;tbm=isch&amp;ved=2ahUKEwiXoaGfzeDhAhULa60KHaP5DaAQ2-cCegQIABAC&amp;oq=boston+college+from+the+reservoir&amp;gs_l=mobile-gws-wiz-img.3...116772.126206..128737...0.0..0.349.5357.2-12j7......0....1.........0i67j0j0i8i30j0i24j33i299j30i10j33i10._jMT_9QR1Iw&amp;ei=uBO8XJflF4vWtQWj87eACg&amp;bih=560&amp;biw=360&amp;client=ms-android-sprint-us-revc&amp;prmd=nmiv#imgrc=jNnm3aSsM7v8EM</url><br><br>", "<b>Username: vpa2019</b><br><br>Why are the BC posters on here so defensive? College choice is personal. Both of these schools have pros and cons. Students seems very happy at both schools so why trash one over the other? For example, not everyone cares about national prime time college football occurring in your backyard. Likewise, not all students want to break up their college years with coops but both are available depending on whats important to you.<br><br>", "<b>Username: collegemom9</b><br><br>@CCSavant NEU got rid of their writing supplement. Nothing was required this year not even an optional one. It was dropped before the app deadline.<br><br>", "<b>Username: collegemom9</b><br><br>The lack of diversity at BC can be a huge turnoff to some. It definitely was to me. When I asked the student panel how it is to be a student on campus who is not Catholic the response was Oh you dont need to be religious at all here. They werent talking about being a different religion as it just didnt even occur to them that you wouldnt be Catholic, just that maybe you didnt go to church regularly. As much as I wanted to love BC, as a Jew, I just couldnt get on board with it. I also found the cafeteria super depressing lol.<br><br>", "<b>Username: moooop</b><br><br>Two of BC's more famous former students are Jews--Bruce Pearl &amp; Leonard Nimoy.<br><br>", "<b>Username: privatebanker</b><br><br>@ProfessorPlum168 as an adult why would you post that. And its off topic and let the students play that game.<br>.<br><br>", "<b>Username: privatebanker</b><br><br>@collegemomof3. You can definitely question on religious diversity. But the student  these days are so accepting in general. Its nice to see.<br><br>As an aside to anyone reading this someone I know personally was accepted and attends now- wrote his essay about leaving the church, not being confirmed on purpose and why. It was no problem to them or since for him.<br><br>But ethnic diversity is a a different story. I disagree with @collegemomof3. Its a big focus now. Over 30 percent of the class this year was African/American Hispanic Native American and Asian (AHANA). And that does not include a pretty large international contingent as well. Ive been really happily surprised how much so. Picking up my d this week it was like the United Nations of kids coming out of the dorm to go home. I asked her about it and she said the most active and largest student activity group on campus is the AHANA diversity group.<br><br>The Cafeteria on upper isnt great. The big new one on lower with the fire places and pannnis is awesome.<br><br>I do believe we make snap judgements on places after one or two superficial visits that arent reality. And those views are also shaped by long held stereotypes. I always considered t BC was super preppy. Its remarkably not in 2019. Those days are gone but those embedded belief systems still shape our views.<br><br><br>OP. They are both wonderful options and both will be academically challenging and rewarding. BC is bit more intense it would appear from feedback from family attending and a parental view. But both will be rewarding.<br><br>But they are different experiences. Choose the one that fits your budget, goals and dreams.<br><br>", "<b>Username: bbfan1927</b><br><br>@collegemom9 As a current BC student, BC is no more or no less diverse than any other top tier college in New England. So, given that, please define for me and everyone who reads this thread, how you came to that very uniformed opinion and conclusion about BC's alleged lack of diversity? Surely, it wasn't based upon any religious symbolism because none exists on campus except for the church on the outskirts of lower campus. Frankly, I have to remind myself this is a religious institution. No religious symbols or crucifies anywhere to be found. And to somehow hold a bunch of well meaning and enthusiastic 19-21 year old students as insensitive because they in-artfully answered your question, is sad and very revealing about your tolerance issue(s).The Cafeteria super depressing? .... I guess if my parents were planning a vacation for me that would matter, but happily they took other issues into account.. Sorry you \"couldn't get on board?\"<br><br>", "<b>Username: PengsPhils</b><br><br>@collegemom9 Northeastern has not required a writing supplement for some time. An optional additional info field was added to the common app to give space for applicants if they wanted, but people took it as a required essay so they cut the section.<br><br>", "<b>Username: privatebanker</b><br><br>@collegemomof3. Sorry I meant to respond to another college mom. Lol.<br><br>", "<b>Username: PengsPhils</b><br><br>\"\"BC is a BRAND. BC has more panache. BC has more of an identity. BC has an xfactor that NEU simply does not. The BC alum network is huge, loyal, committed, loud and proud - there is TREMENDOUS school spirit....\"\"<br><br>Maybe it's just me but that exact attitude is what stopped me from applying to BC. Reminds me of Vonnegut and Hoosiers. I want to be judged on my own merits, not the name of a place I went to for 4 years. Northeastern and co-op foster independence and work ethic and gives tons of amazing and varied opportunities to choose from to make yourself into whatever you want to be. It's okay if Northeastern doesn't fit you, but it fits many obviously as people choose it over BC and Tufts quite regularly for various reasons (and the reverse).<br><br>OP has plenty of info here - I don't think these silly debates are adding any information at this point. We don't need to be turning our personal preferences into objective laws.<br><br>", "<b>Username: aquapt</b><br><br>I have to say that the current BC student's response to @collegemom9 only validates the discomfort she describes.<br><br>", "<b>Username: privatebanker</b><br><br>@aquapt come on. One student makes a culture?<br><br>", "<b>Username: aquapt</b><br><br>@privatebanker Not my point at all. And you are not seeing the most offensive aspects that I was responding to, because the mods already edited them out.<br><br>", "<b>Username: privatebanker</b><br><br>@aquapt. My apologies. Didnt see it. Thanks.<br><br>", "<b>Username: skieurope</b><br><br><b>MODERATOR'S NOTE:</b><br>OK, let's move past the OT comments and focus on the OP's question, please.<br><br>", "<b>Username: bluebayou</b><br><br>\"\"The lack of diversity at BC can be a huge turnoff to some. It definitely was to me. When I asked the student panel how it is to be a student on campus who is not Catholic the response was Oh you dont need to be religious at all here. They werent talking about being a different religion as it just didnt even occur to them that you wouldnt be Catholic, just that maybe you didnt go to church regularly. As much as I wanted to love BC, as a Jew, I just couldnt get on board with it. I also found the cafeteria super depressing lol\"\"<br><br>There is no doubt that over half of the students are Catholic. BC makes no claim otherwise. That being said, in my D's year, one of the student panelist was Atheist and he gave a wonderful answer to a similar question: BC is extremely welcoming to folks of faith or no faith. What attracted him to BC was the focus on a liberal arts education and community service, something he had been involved in since middle school.<br><br>Of course, that's the issue with Student Panels and tour guides. You never know what you'll get, so you need to take them with a grain of salt so to speak. (How many STEM prospies get turned off of a college by the tour guide who is artsy and can't stop speaking about what they know -- the arts program. Of course, the opposite is also true....)<br><br>My D was a BC volunteer tour guide, and she said they didn't have much training per se, and were told to just answer questions as honestly as the could from their own perspective. My point is that is that they weren't given any canned or recommended answers. I'm sure that's true of many other colleges too, but there are better ways to answer the question that you asked, college mom.<br><br>", "<b>Username: collegemom9</b><br><br>@bbfan1927 Nowhere did I say I thought the student who answered my question was insensitive. I didn't think that in the least. I thought they were being honest. They clearly have mostly Catholic friends and so to them that answer made sense. Nothing wrong with that. As far as the religious part goes, I don't see BC as super religious either but to have someone of that denomination tell me that BC is a school that all kids of different religions will feel comfortable in isn't super helpful even if well intended. I wasn't worried in the least that anyone would try to force Catholicism down my son't throat or try to convert him lol. What I did worry about was feeling left out maybe on a Sunday evening when lots of kids go to the big Mass that I heard about from several kids. Or when a bunch of his friends went on a retreat. That kind of stuff gave me pause. The cafeteria part was a joke which is why I included the LOL. I did find it depressing but that certainly wouldn't be a huge influence in my decision. As far as the rest of your post goes, unfortunately, it was edited before I read it. I will say if I had heard anything like the stuff you posted here I most likely would have left the tour.<br>FWIW my son liked BC and that's good enough for me. I didn't object to him applying there, that's not how I operate. He had his application ready to go for RD if he had not gotten accepted ED elsewhere to a school I think will be a much better fit than BC would have been.<br>@privatebanker This was not our first trip to BC. My husband grew up blocks from BC. We've been to football and basketball games and my son has a brunch for an organization he attends each year there. I had hopes that I would feel more comfortable with my son applying there then I did and it just didn't go that way.<br>@bluebayou Thank you for your thoughtful reply. We had an excellent guide who was able to answer my question in a more satisfactory way. I don't fault any of these kids and didn't find anything inappropriate in the response from the panel.<br>OP when considering these 2 schools I do think it's worth thinking about the diversity on campus. I certainly think it's something to consider. They are both fantastic schools and have much to offer.<br><br>", "<b>Username: collegemom9</b><br><br>@PengsPhils NEU actually started this application year with a required supplement in the common app. You couldn't submit your app without it. They changed it close to the deadline. My son and most of his friends had it written and ready to go. My son's college counselor told him he could still upload it if he wanted but he chose not to.<br><br>", "<b>Username: elderwood</b><br><br>Just to add fuel to the fire...<br><url>https://www.thrillist.com/lifestyle/boston/boston-colleges-ranked-by-obnoxiousness</url><br><br>", "<b>Username: TomSrOfBoston</b><br><br>@elderwood That ranking is validated by a few posters on this thread.<br><br>", "<b>Username: collegemom9</b><br><br>I would also say that our visit to BC did include lunch at Eagles so all was not lost ;)<br><br>", "<b>Username: PengsPhils</b><br><br>@collegemom9 Again that was an unintended result, not a supplement. It was intended to be optional but it seems someone in admissions checked the wrong box or something, so it was removed.<br><br>", "<b>Username: collegemom9</b><br><br>@PengsPhils ok. The point we are both making remains the same. NEU does not have a supplement anymore.<br><br>", "<b>Username: wisteria100</b><br><br>@bbfan1927 Yes, BC is making big strides in trying to diversify the student body, and their admitted student pool this year is testament to that. (Though well have to see how that translates to enrolled students)<br>But when you say that BC is about the same in terms of diversity as any other top NE school, well that is really not true at all.<br>Harvard, MIT, Brown, Amherst, Williams, Tufts... are all much more diverse than BC.<br><br>", "<b>Username: tR5674</b><br><br>@TomSrOfBoston As an experienced poster, you probably realize that CC brings out a few extreme defenders of any school. FWIW, I've seen the same on the NEU board and to a lesser degree the McGill board. I have kids currently deciding amongst all three.<br><br>", "<b>Username: RightCoaster</b><br><br>Both of my kids looked at NEU,BC, BU, and Tufts. They felt that BC was the most traditional of the 3 and offered a classic college experience. . They felt that NEU and Tufts were both schools looking to change with the times and were just more hip places. Instead of liking classic schools with storied histories, my kids both liked schools with a vision for the future.<br><br>", "<b>Username: swimchris</b><br><br>I am glad I did not see whatever the mods felt like the needed to edit it out from some posts.<br><br>BC does seem to be making strides around diversity (through admissions), but they are still having issues on campus of non-white students feeling unsupported and unsafe. I am white and cis-gendered, but potential students and parents taking a longer and more nuanced view on BC given past rankings of large race-class divides, racial epithets and what has been viewed as an supportive administration makes them smart. I am not saying that this is who BC is (it isnt), or even a large number of students (they aren't), but it it something that BC seems to be working through. Below are articles of incidents, but also students trying to work through it:<br><br>@bbfan1927 I understand that you are impassioned about BC. It is a great school with a lot going for it. You should be enjoying this start to your college career. Enjoy the things that BC has to offer rather than here on College Confidential. And when you do feel like you can help a student out, please tell them about your experience or how you chose colleges. But also keep in mind that you don't attend these other schools, you aren't an expert to say BC beats X school in every situation. Enjoy life, go experience things!<br><br>For the original poster - BC and NU and both great schools and I do not think you can make a wrong decision. I attended NU a decade ago now, so consider me as a source somewhat biased (I also attended Harvard for grad school). The campuses are different aesthetics (although that wouldn't be the top reasons I would choose a school). Northeastern is ranked #44 in US News and BC is ranked #38, which isnt a significant different (NU has higher SAT/ACT scores). Northeastern is BC's 2nd most common cross-admit so there are a lot of students choosing between these two schools. I can't speak to the social scene at BC, but I can tell you that although you might not see certain friends for 6 months while on co-op, or a dialogue, or study abroad - the sheer number of friends and connections youll make by exploring means that youll have friends around the country (and world). In my experience, I did not feel like I lost anything from choosing NU over a more traditional college experience. @kdmt1998<br><br>", "<b>Username: kdmt1998</b><br><br>Hi Everyone, I am the original OP, poster. I thought I should come back and report on the decision. My daughter chose Northeastern. It was a tough choice! My brother went to BC, my dad went to BU. She chose Northeastern for a few reasons. She is a STEM major and felt the STEM program at NU was stronger. She is very interested in global and felt the global program at NU was stronger and finally she was sold on the COOP. She is not 100% positive what she wants to do and felt the COOP could help her decide rather than spend four years not really sure. Finally, She got almost $100K in merit aid from NU and nothing from BC. We could not justify the cost difference as we have two younger ones. And finally, she came from a small high school that was very clicky and was worried it would be a repeat at BC. Of course, we have no idea but that was what she went with. In the end, she can always transfer if she hates it! Nothing is cemented... My two cents. Thank you everyone for responding. Very open, helpful and honest.<br><br>", "<b>Username: collegemom9</b><br><br>@kdmt1998 I think she made a great choice! Congratulations!<br><br>", "<b>Username: privatebanker</b><br><br>Awesome. My d is at BC (who loves it) and I think you made a 100% smart and great decision.<br><br>Congrats. See you in the 2020 Beanpot!<br><br>", "<b>Username: bluebayou</b><br><br>A great college at a big discount is never a bad choice. 'Grats.<br><br>", "<b>Username: brown2024</b><br><br>@kdmt1998<br>Would you mind sharing her stats? You can pm me if preferred. We are applying this coming fall to both BC and NEU and my DS is STEM focused a well.<br><br>", "<b>Username: kdmt1998</b><br><br>No problem! My DS stats. 4.4 weighted GPA. I know that can vary among schools. To help clarify, she has never had anything below an A. She has been in all honors classes, with 3 AP classes last year and 4 this year. She got a 1540 on her SAT (790 math 750 ER) and a 34 on her ACT. We did not submit her ACT though. She tennis captain, varsity soccer, plays cello, treasurer of environmental club, librarian of orchestra, on grant committees. She also worked two jobs from 9th grade on, one in the after school program for elementary school. I think her common app essay was sincere and she had good teacher recs I think. We tried for merit at BU, BC and NEU, but only got merit aid from NEU. She is also 3rd in her class ranking out of 160 kids. Public school as well. I hope this helps.<br><br>", "<b>Username: brown2024</b><br><br>@kdmt1998<br>Thank you so much - that helps a lot. We are applying to the same 3 as well:)<br><br>", "<b>Username: AlwaysLearn</b><br><br>@kdmt1998 Congrats to your daughter. Both are great schools, and either one would have been an excellent choice. $100k is $100k though! :)<br><br>", "<b>Username: privatebanker</b><br><br>Boston College is a meets full need school. It offers only 15 Gabelli scholarships per year. These are unbelievably competitive and require interviews etc. They are invitation only.<br><br>There are no merit scholarships available at all.<br><br>But they are very good at meeting need as they define it using a css profile. The big difference is they do count home equity. I believe to avoid having people take money available for college and hide it there. Not everyone agrees. I personally do agree. I could have paid down mortgage more aggressively and not bothered with the 529 plan. Seems reasonable.<br><br>If you run the NPC and are very accurate with your inputs you will get a very realistic idea of costs before spending anytime on an application.<br><br>", "<b>Username: bluebayou</b><br><br>\"\"The big difference is they do count home equity.\"\"<br><br>Just to be clear, <i>most</i> colleges that use CSS Profile count home equity as an asset in the calculation of need. However, many of the wealthy colleges ranked above BC do not count home equity or they cap it. (Ivies, Stanford, and their ilk).<br><br>BC is caught in no-mans land for middle class folks. Higher ranked schools limit/cap home equity, while most lower ranked schools offer merit money, but may not meet full need.<br><br>", "<b>Username: privatebanker</b><br><br>Yes. In essence that what I was trying to convey. However I dont believe it is a ranking issue as much as free cash flow from the endowment. BC has a large and growing endowment but 3b isnt 30b.<br><br>Also BC seems to spending a lot on professors and new buildings and programs too. I think its a a great mix as they continue to grow and thrive.<br><br>", "<b>Username: violettrose</b><br><br>BC is liberal arts, NEU is more career focused. Depends on the person<br><br>", "<b>Username: moooop</b><br><br>\"BC is liberal arts\"....and a lot of students majoring in nursing, business, education; &amp; engineering is on the way in a couple years.<br><br>", "<b>Username: suzyQ7</b><br><br>^right - would never classify BC as liberal arts.<br><br>", "<b>Username: vpa2019</b><br><br>The real differentiator is the NEU co-op. Working in a job for 6-8 months is significantly different than a 10 week internship (assuming you can find one). I agree with @Violetterose it depends on what the student is looking for.<br><br>", "<b>Username: privatebanker</b><br><br>They are so totally different. The OP is getting significant financial support at NEU.<br>He is fit agnostic. Its a great choice.<br><br>Internships arent a problem for specific majors at BC. But the co op is for all at NEU and that is a big difference.<br><br>Post grad is a different story. If you want to stay in New England. Theres no more entrenched alumni network than BC. Its a thing in finance, banking business, law and politics.<br><br>Not even the Harvard grads are as earnest in their networks. The Harvard grads dont need the edge quite frankly, except at the very highest part of the networking food chains. They are a bit out of the day to day fray, for the most part. And they travel well outside of Boston. NEU and BC outside of the region, I would surmise would be equally strong.<br><br>", "<b>Username: bluebayou</b><br><br>\"\"^right - would never classify BC as liberal arts.\"\"<br><br>BC has a mix. Obviously, nursing and eduction are pre-professional in nature, but the Uni has a strict liberal arts Core Curriculum (which only a few Unis still maintain), and all undergrads must complete it. Thus, plenty of required readin' and writin' in addition to the STEM courses.<br><br>", "<b>Username: moooop</b><br><br>Really? Few unis still have a core? Are you making a distinction between a \"core\" and courses in a variety of fields?<br><br>", "<b>Username: bluebayou</b><br><br>\"\"Really? Few unis still have a core?\"\"<br><br>Yes, few colleges have a required Core. Most have GE's or distribution requirements, i..e., ~6 classes outside your field or major + Frosh English/Writing.<br><br>BC's core totals 15 required courses, including, the Arts, Philosophy, and Theology, as well readin', writin', and 'rithmatic. B-school students also have to complete the Core.<br><br><url>https://www.bc.edu/content/bc-web/schools/mcas/undergraduate/core-curriculum/core-requirements.html</url><br><br>Columbia College and UChicago also have a Core.<br><br><url>https://www.college.columbia.edu/core/core</url><br><br><url>https://college.uchicago.edu/academics/core-curriculum</url><br><br>", "<b>Username: privatebanker</b><br><br>I love the universities and lacs that still want students to be a bit more broadly educated human beings outside of a specific discipline. The world is very interesting. To me it makes life a little bit more meaningful connecting with at least some of the areas of study requiring critical thinking. The ability to write and research are skills that apply to all fields of endeavor. Big fan. Whats the rush. Being a grown up is overrated. Lol.<br><br>", "<b>Username: bluebayou</b><br><br>Me too. Love the Core. College should be about breadth as well as depth. The science geeks need to learn how to write and write well. On the other hand, English/comm majors need to be exposed to science &amp; math courses so they have some idea of what they are writing about. Philosophy is a great way to improve critical thinking skills. (Without the core requirement, few would dare take PL As a result, PL is a popular double major/minor.)<br><br>Personally disappointed that BC dropped the foreign language requirement from the Core. (IMO, that's going the wrong way in our multi-cultural world.)<br><br>", "<b>Username: evergreen5</b><br><br>\"\"@bluebayou Personally disappointed that BC dropped the foreign language requirement from the Core. (IMO, that's going the wrong way in our multi-cultural world.)\"\"<br>I was confused for a few minutes but then found clarification from the Core FAQ:<br>\"\"No, there is no foreign language requirement as part of the Core Curriculum. However, students in the Morrissey College of Arts and Sciences and the Carroll School of Management are required to demonstrate intermediate-level proficiency in a foreign or classical language in order to graduate from Boston College. More information can be found in the Policies and Procedures section of the Undergraduate Catalog. Students in the Lynch School of Education and the Connell School of Nursing do not have a language requirement.\"\"<br><br>", "<b>Username: rickle1</b><br><br>Although some students complain about having to complete the Core , there are definite benefits for many. S attends a different school but similar in many ways to BC. The Core at his school, Wake Forest, takes two full yrs to complete (with some of the classes serving as prereqs for specific majors. )The purpose is to create well rounded, interesting and interested students. Very typical for students to discover new interests. For my son, that was politics and international affairs. Thanks to the core, he decided to minor in that which will make for an interesting combination with his Finance major. Even doing a study abroad in the fall that will include international relations.<br><br>I frequently read that major firms are quite interested in kids with a global view, critical thinking (and technical) skills. The core does a nice job of making sure they get a bunch of that.<br><br>", "<b>Username: privatebanker</b><br><br>@rickle1 On point once again!<br><br>", "<b>Username: bluebayou</b><br><br>\"\"I was confused for a few minutes but then found clarification from the Core FAQ:\"\"<br><br>Sure, and what that means is that the FL requirement can be fulfilled by taking a language in HS, or speaking it at home. To me, that is anything but a College Core -- we're all in this together. And, of course, CSOM is dropping the FL completely -- makes absolutely no sense for business, either.<br><br>btw: Not to mention that Nursing and Education are two disciplines that should embrace additional FL as a necessary component of preprofessional studies.<br><br>Like I said, personally disappointed. Altho, truth be told, all three of my D's roommates complained about the required course (if one didn't take enough in HS) to complete the FL requirement. All four girls in the suite had mentioned that they had considered a FL minor going into College, but said no way after taking just one class to fulfill the requirement. (if they took ~3 years of HS language, and did not ace the placement test, students needed to take a special Language/Culture class to fulfill.)<br><br>My take is that that course had a LOT of HS-style project work -- make up a French poster! -- as part of the cultural element, and that was what the girls were reacting negatively to, not the language/lit part itself.<br><br><br>Edited to add: All the STEM majors in A&amp;S think it's a joke that CSOM students get to take an intro class to Excel for which they receive course credit. All the STEM majors have to learn it on thier own. (So, CSOM has room to keep a FL if they choose to do so.)<br><br>", "<b>Username: moooop</b><br><br>@bluebayou, I think you are exaggerating the difference between BC's \"core\" &amp; the required distribution classes at a lot of colleges. It's not like BC offers one or 2 classes in the various core areas. You can fulfill the social science rqmt with classes in econ, poli sci, sociology, or psych. You can fulfill the physical science rqmt with classes in bio, geology, physics, chemistry, or environmental science. Even in philosophy &amp; theology there are wide varieties of classes that fulfill the requirement. This is not significantly different from a lot of colleges' \"distribution\" requirements.<br><br>", "<b>Username: tR5674</b><br><br>@bluebayou Re: \"Edited to add: All the STEM majors in A&amp;S think it's a joke that CSOM students get to take an intro class to Excel for which they receive course credit. All the STEM majors have to learn it on thier own.\"<br><br>Are you are referring to the business core required course, Modeling for Data Analytics? If so and FYI, this is considered a second math course (beyond Calculus) that is required. Doesn't sound like it is an 'Intro to Excel' class to me.<br><br>Maybe you are referring to something else but either way, the business core is not at all thought to have easy courses.<br><br>", "<b>Username: bluebayou</b><br><br>\"\"Doesn't sound like it is an 'Intro to Excel' class to me.\"\"<br><br>Actually, it is an Intro to Excel class as well as Intermediate Excel (run macros, pivot tables etc). But again, the kids in A&amp;S have to learn this stuff on the fly since some labs require Excel and understanding/running macros.<br><br>The fact that CSOM counts it as a math class -- hahahahaha<br><br>btw: the grading on this course can be tough, since the material is not very rigorous.<br>\"\"This is not significantly different from a lot of colleges' \"distribution\" requirements.\"\"<br><br>That's a fair point but still, 15 BC courses is 2x than 6 (or 8 counting English/Writing/HIstory), which is what our public flagships require. And its the required breadth -- Arts/Theatre &amp; Philosophy. And, as I mentioned previously, BC used to have a requirement for intermediate language.<br><br>", "<b>Username: privatebanker</b><br><br>Csom may be slightly more competitive than Mcas to get in for sure. Its much harder to stay on track to be a biochem or math major once enrolled. Its not really close. Its probably the same everywhere with top 10 ug b schools and high achieving premeds and engineers on campus.<br><br>", "<b>Username: collegemom9</b><br><br>@bluebayou Im confused. What public flagships only require 6 gen eds? UMass requires far more than that and pretty much all schools weve looked at require more than 6 (except for the rare schools that have no gen ed requirements). Maybe Im misunderstanding what youre saying.<br><br>", "<b>Username: bluebayou</b><br><br>\"\"UMass requires far more than that and pretty much all schools weve looked at require more than 6...\"\"<br><br>For example, I looked up a Chem major requirements for UMass. The College requires 10 GE's of which 3 can be satisfied by major requirements (double-counted?). That leaves 7, 2 of which are Writing courses. 1 is a basic math course, which any Chem major would pass with Calc 1. Then of course, there is 2 bio/physicial science courses which again, a Chem major will cruise thru with a Chem/science elective<br><br>What's left is really 4 lit/hume/social classes + 2 writing classes, i.e., a total of 6 outside the field or major. My point is that a physical science major can get by with as few as 6 non-STEM courses.<br><br><url>http://www.umass.edu/gened/students/fulfilling-requirements</url><br><br>", "<b>Username: moooop</b><br><br>Here are U of Alabama's required courses:<br><br><url>https://catalog.ua.edu/undergraduate/about/academic-regulations/curriculum/core-curriculum-general-education-requirements/</url><br><br>Here are U of Nebraska's:<br><br><url>https://catalog.unl.edu/undergraduate/academic-policies-other-units/general-education-requirements/</url><br><br>Here are U of Iowa's:<br><br><url>https://clas.uiowa.edu/clas-core/requirements</url><br><br>All a lot more than 6 classes, &amp; not much different from BC.<br><br>", "<b>Username: collegemom9</b><br><br>Yeah Im not seeing BC doing anything ground breaking in regards to their core curriculum.<br><br>", "<b>Username: privatebanker</b><br><br>@collegemom9. Nothing nice to say....<br><br>This was about it being overly burdensome not novel.<br><br>", "<b>Username: collegemom9</b><br><br>@privatebanker I think youre misunderstanding what I said. Im responding to the comment about few universities having a common core. Simply untrue. BC requiring strong liberal arts is not unique. Ita not an insult, its a fact.<br><br>", "<b>Username: privatebanker</b><br><br>Ok. Sounds good.<br><br>The point that seems to be traveling through the thread was it was a possible burden.<br><br>Maybe not worth the time and effort.<br><br>People posted its not an unusual requirement. Personally, I suggest it is actually a real benefit to have distributions or core requirements. Its a great way to be broadly educated.<br><br>It seems that no one never suggested it was ground breaking. The concept goes back to ancient Greece. Lol.<br><br>", "<b>Username: collegemom9</b><br><br>@privatebanker my son is going to Emory. The dont even allow you to start your major until your junior year. Its the ultimate liberal arts education so I certainly have no problem with the common core and its importance. Ground breaking was the wrong word to use, its not unusual. That seems to be what most were responding to, including myself.<br><br>", "<b>Username: privatebanker</b><br><br>@collegemom9 wow! Emory is an awesome school. Congrats. Its just the kind of place I had hoped for my d last year.<br><br>So hard to get into these schools isnt it? Not for the feint of heart when looking at these Uber elite USA universities.<br><br>", "<b>Username: collegemom9</b><br><br>@privatebanker Indeed.<br>My son applied ED so we were lucky enough to get off the crazy train in December.<br>And thank you :)<br><br>", "<b>Username: tR5674</b><br><br>@bluebayou Good luck to you. Glad you are having fun here.<br><br>"]}