{"title": "columbia vs princeton", "comments": ["<b>Username: monokill</b><br><br>Hi What are the main differences between undergrad Princeton and Columbia? Since these two have very similiar admission statistics, I am not sure for which I should apply for early admissions. I know Columbia is located in New York City and has a core curriculum, but any other differences that are striking between the two?<br><br>", "<b>Username: metsfan</b><br><br>From what I've heard, Princeton is more well-known for math, while Columbia is more well-known for economics/humanities stuff. I think.<br><br>", "<b>Username: columbia2007</b><br><br>Some might say that a primary difference is that Columbia is a research university that focuses a good deal of attention on its graduate schools, while Princeton caters almost exclusively to undergrads. The consequence is that, at the level of the major, at least, it's probably true that Princeton devotes more resources to undergrads. It lacks, however, the sort of broad, cohesive core curriculum that Columbia College offers as the centerpiece of its undergraduate academic experience. Take this for what you will; I find both schools offer excellent undergraduate educations, but that Princeton is superior for anyone who wants to pursue to its utmost a specific specialty program, whereas a \"best fit\" Columbia student would aspire to a more well-rounded renaissance man education.<br><br>Another major difference is environment. Obviously, Manhattan, even Columbia's relatively quiet enclave of Morningside Heights, is radically distinct from arboreal, exurban Princeton. Princeton has a larger, more spread out campus, which can entail longer walks to class but also more congenial living arrangements if one prefers more rolling lawns and grassy courtyards. What Princeton cannot offer (or can, but for a longer, more expensive trip) is the city as an educational resource. The Core classes at Columbia do not exist entirely in an ivory tower vacuum, but use the city as an educational resource; you will attend concerts for your Music Hum classes, visit musea for Art and Lit Hum, walk through cathedrals to learn about gothic architecture, and dine in ethnic neighborhoods where you will have the opportunity to practice the language(s) you are learning.<br><br>Social life is the other element of distinction. A lot of one's life at Princeton seems to revolve around the eating clubs, to which one applies and joins, and finds oneself around on weekend nights for parties and such. Columbia has no such institutions and social life is much more variegated; individuals may choose to stay on campus for parties, theatrical productions, films, or whatnot, or go out into the neighborhood and broader city. Consequently, there's less of a \"typical Columbia experience\" in that fewer students are doing the exact same thing at any one time, but far more options in terms of what one chooses to do with one's time.<br><br>", "<b>Username: Denzera</b><br><br>Qualitatively, I second 2007's notes.<br><br>If you attend Columbia and have friends who go to Princeton, they will end up crashing at your place on the weekends, since everyone there is desperate to enjoy new york.<br><br>If you want to do investment banking or consulting, Columbia's career office is highly prepared to help you find a job there. Beyond that, it's hit-or-miss. Princeton has a very well-funded program to help place its students in nonprofit organizations at a reasonable salary, so if you're more the political / NGO / nonprofit type, they can do more for you.<br><br>", "<b>Username: slipper1234</b><br><br>Princeton (and all the Ivies) are equally strong at placement into banking and consulting.<br><br>", "<b>Username: columbia2007</b><br><br>\"\"Princeton has a very well-funded program to help place its students in nonprofit organizations at a reasonable salary, so if you're more the political / NGO / nonprofit type, they can do more for you.\"\"<br><br>I agree that they may be able to do more for you directly in that endeavor...as they would be able to more ably fund thesis research and the like. Still, being in New York one has the opportunity to weave internships at said NGOs and other organizations into one's class schedule if one so chooses. This would be very difficult to achieve commuting from Princeton.<br><br>", "<b>Username: Denzera</b><br><br>I was speaking for post-graduation jobs. Having gone through the whole process with CCE's assistance for job hunting, I can say with a high degree of confidence that the only industries they do very well in are Banking, Consulting, and (to a lesser degree) IT / Software. You'd think they'd have plenty of ins for the publishing or media world, but they don't. You gotta fight for it on your own if that's your pref. I'm not sure about Princeton in that regard, but I do know they do very well by their students when it comes to nonprofits.<br><br>", "<b>Username: columbia2007</b><br><br>I agree completely with regard to CCE and the worst part is they have no shame; they seem to care less they only cater to banking/finance types). I get more interesting job tips from other sources within the university, though. The various departments and preprofessional advising offices have been helpful in this regard. And, of course, local internships are often as good a prelude to postgraduation careers as an on-campus interview.<br><br>", "<b>Username: sac</b><br><br>These schools have such a different feel to them, I really think you need to visit both if you can.<br><br>After visiting Princeton, my son did not apply. I will relay what he told me: It was too far from the city, didn't feel as if it had enough going on, had a social life centered on the eating clubs, and seemed preppier to him than other places. None of that has to do with its educational opportunities, which are wonderful. There are many who judge Princeton the best place in the country to get an undergraduate education because undergraduate eduction is its focus.<br><br>I would say that until recently, Princeton was weaker in some of the arts than other colleges of its caliber. But they have set out to remedy that. They are also expanding, and I understand they are trying to loosen the grip of the eating club scene some by adding a residential college. I don't know where all this will be by next year.<br><br>What appealed to him about Columbia: the core curriculum, NYC, the music scene in New York city, something about the intellectual intensity that struck him when he visited Columbia students.<br><br>So, it's really about you as an individual.<br><br>", "<b>Username: slipper1234</b><br><br>Danzera,<br><br>Unfortunately that is the way career services operate at most Ivies, its not just Columbia. I networked myself into a unique job situation, but only after significant effort on my part.<br><br>", "<b>Username: JohnnyK</b><br><br>I second slipper. Career services isbest for the biz types. For less conventional folk, you're best using the career services for resume proofreading, interview tips etc, but for the actual connections, you'll be more dependent on your wits (hey, you are in an ivy league school, right? you can handle it ;-))<br><br>I think it has recently dawned on schools that their CS systems are totally lopsided and they are finally moving to rectify this...my school just started up an elaboate CS system for people looking to go in DC.<br><br>", "<b>Username: eugenie98</b><br><br>I'm a Princeton student whose spent two summers at Columbia (Princeton does not offer summer classes), and went to a competitive high school in Manhattan and so had 30 classmates in my graduating class matriculate at Columbia. Based on that I wil say:<br><br>Columbia is one of the WORST experiences in terms of administrative red tape and nickel/diming you to death. I don't know what the deal is with the administrators but they seem inept, shameless, and lazy. For example, my summer classmates apartment had a fire in it (she is a full time Columbia student), and it took the administration two months to resettle them. They were people basically living in the library because of the administrations ineptness.<br><br>The day I was to come in for registration, they decided to close the registration office early, but neglected to tell me this when I called them two hours prior to taking an hour train and half ride to campus.<br><br>They also seem to get extreme pleasure out of nickeling and diming you to death at Columbia, for example, charging you 10 cents a page for printing on the laserjets.<br><br>Columbia currently has a better arts program and chemistry program.<br><br>Princeton has a better social sciences (esp. economics) program, much much better engineering school, better life sciences program, better english and comparative literature program, and better hard science program (other than chem).<br><br>Princeton has realized this and is building a new chemistry building/program and arts center/program to remedy the situation.<br><br>Some other aspects:<br>Columbia is very liberal, less so than Brown, but still very liberal.<br>Princeton has the full spectrum of politics, I would say conservatives represent 35% of campus, liberals 35%, and 30% are libertarian types.<br><br>Columbia's sports teams are a joke whereas Princeton's sports teams are not.<br><br>Columbia is in NYC, and a 10 minute train ride to midtown, 15 minute train ride to downtown. whereas Princeton is an hour and 15 minutes from NYC and Philly.<br><br>Columbia is surrounded by a ghetto to the north and the east (don't go running in Morningside park or north of 125th street unless you wish to be mugged or approached by crack dealers).<br>Princeton is surrounded by investment bankers and pharma professionals (watch out, you might be approached by someone trying to sell you some stock).<br><br>When I stayed over for prefrosh weekend I also thought that Princeton students were very preppy and stuck up. I actually matriculated elsewhere but changed my decision. Best decision I ever made. Princeton students are actually quite friendly and most are not at all conceited or stuck up. There are many very wealthy students (I would say that out of the 25 hallmates in my entryway, 10 of them had parents with net worths over $15 million), but they are all friendly and sociable, even to a middle class kid like me.<br><br>I think the preppiness stuck up factor that your son might have perceived stems from the fact that princetonians have a strange affinity for polos or blazers pretty much wear them all the time.<br><br>Columbia's dorms have roaches. Princeton's do not.<br><br>Undergraduates run Princeton's campus, not sure about the situation at Columbia but I see their GSB students all over the place.<br><br>", "<b>Username: Elleneast</b><br><br>I find it very interesting that students who do not go to Columbia or did not stay through their undergraduate years find it necessary to come to this section of the board and rip into the school. Real information is useful but exaggeration and BS is not.<br><br>", "<b>Username: sac</b><br><br>\"\"There are many very wealthy students (I would say that out of the 25 hallmates in my entryway, 10 of them had parents with net worths over $15 million), but they are all friendly and sociable, even to a middle class kid like me.\"\"<br>How do students know each other's net worth? I obviously don't know most of my son's friends at Columbia, but I have met his two best friends there and his girlfriend, and been struck by the fact that all three have parents who are professors. Maybe this is meaningful, probably random. But I think your post reflects some of the differences between the atmospheres of the two schools.<br><br>As for the Columbia administration, everyone complains about it and so I accept your take, though my son hasn't had any unfortunate dealings with them. Princeton is primarily an undergrad institution, and that has its real advantages as I mentioned earlier, but I don't think that means that GSB students run the Columbia campus. There are advantages also to being at a research institution like Columbia, including lots of projects to work on. And to being in the city, including many opportunities for internships during the year as well as in the summer. As for economics, Princeton is excellent of course, but Columbia is regaining some of its earlier top status as well with more than a dozen fine hires in the last two years. This will take a few years to show up in the rankings, since these repuations tend to lag.<br><br>", "<b>Username: eugenie98</b><br><br>Over the course of the year you get to know your hallmates pretty well. My dorm had every two entryways connected and enclosed from the rest of the building which means there were about 50 students over two entryways in essentially one building.<br><br>Eventually you learn what your hallmates' parents do. I had two entrywaymates who had a father as a partner at a law firm (one in NY and one in DC), two who had a CEO or CFO parent of a publicly traded company or subsidiary with market caps over $1 billion, one whose mother was a radiologist and was the former president of the american college of radiology, a student whose father was one of the largest real estate developers in TN, Al Franken's son (I think it should be safe for me to assume his dad made at least $15 million from all those books and shows?), a student whose dad was an exec of Osh Kosh Bigosh, and two banking MDs. I'm pretty sure they all would be classified as having net worths over $15 million, wouldn't you?<br><br>There were two others who were the children of doctors, but these days it's hard to figure out how much that means.<br><br>Then there were the other 15 or so including myself who had parents doing various things, teaching in middle school/hs, college professors, insurance adjusters, and other typically middle class occupations.<br><br>Unless the roaches occupy the Columbia dorms only part time (during the summer) I would think they are there during the school year as well.<br><br>Also, unless they have some sort of temporary administration over the summer, I would think they are there during the school year as well.<br><br>I am not ripping on Columbia. I pointed out it has a better chemistry and arts program than Princeton, and better proximity to NYC.<br><br>Yes, Columbia's sports teams are largely a joke. No need to attend Columbia to know that, just keep up with Ivy football/basketball/crew/tennis/squash/golf. They do have a decent fencing team.<br><br>I am just recounting my experience in interacting with Columbia as an institution. It's an opinion.<br><br>", "<b>Username: Denzera</b><br><br>Half of Eugenie's criticism is apt, and half of it is pure homerism for Princeton on her part. In her order:<br><br>- Columbia does indeed have a reputation for a stodgy bureaucracy. That is quite true in some areas and very untrue in others. Even in the places where they can be pains in the ass, it's like with any other bureaucracy - if you learn the rules and play by them, you can get what you want out of it. I have, in turn, milked the registrar/student services, housing &amp; dining, and student government infrastructures to get what I wanted, and in many cases have been pleasantly surprised to find intelligent people behind it all.<br><br>- If they didn't charge you 10 cents on copies, students would make 2000 copies of flyers for their event or group's auditions or what-have-you, and would bankrupt the printer budgets for the rest of the students. They have a weekly quota for each student for printing in the labs, which gets the job done admirably.<br><br>- I would argue Columbia's programs in economics (Stiglitz / Sachs and all sorts of luminaries dropping by), creative writing, and life sciences are all first-rate, especially with the resources of the med school. Many budding engineers and med students take internships at the med school during the summer and during the year.<br><br>- Columbia's campus has a range of politics, and your quote is its reputation, not its reality. I would say ~10% are raving, half-anarchistic liberals, 2% are activist conservatives, and the vast majority are apathetic but leaning left in their beliefs. By and large, students find the continuous protests by the socialists or wackos involved in the middle eastern conflict to be annoying obstacles to their daily routines. 1968 is a long time ago.<br><br>- All Ivy League major sports are a joke. Columbia's may be more of a joke than Princeton's, but that doesn't mean you've got anything to brag about unless it's squash. Columbia's fencing (as noted), tennis, sailing, and crew teams are top rate, and until this past year their ultimate frisbee team kicked some butt too. But let's not kid ourselves... try winning an NCAA tournament game before you get all uppity.<br><br>Furthermore, one of the things I like best about columbia is how there is zero jock culture. I very much like the fact that sports are a joke here, because it means the university doesn't overvalue sports as a revenue source and compromise its academics. Nobody is a second-class citizen.<br><br><b>- Columbia is in a very safe neighborhood with that safety extending for some ways away.</b> Again, you are speaking from either an overly-sheltered-upbringing paranoia, or 1970s stereotypes that no longer apply. A private security force called Morningside Alliance patrols the streets in addition to the NYPD, and areas within walking distance of columbia are gentrifying quickly. It's the second-safest neighborhood in the city after the upper east side. Your stereotypes about crack dealers, muggers and harlem seems to belie, perhaps, some latent racism about our neighborhood.<br><br>The only area near columbia that's dangerous at all is morningside park after dark. everywhere else, i'd go running in late at night (and have).<br><br>- Roaches are less of a problem at columbia than in most of NYC. Most of the time, the appearance of roaches is precipitated by students bringing about absolutely gross conditions in their kitchens, leaving food around or being really messy, or the same thing in the bathrooms. In my 4 years at columbia I saw exactly one live roach. The newer buildings are better than the older ones, too.<br><br>- One of the best advantages about columbia as compared with yale, harvard, penn, cornell, etc is that while it is a major research university with numerous graduate schools (18 of them), the university is very focused on its undergraduates. The core curriculum - and how proud they are of it - is evidence of this. The centralized undergraduate campus and resources clearly place the two major undergraduate schools at the top of the university's priorities. It may not be as exclusively undergraduate as Dartmouth or Princeton but it strikes an excellent balance.<br><br>-Steve<br><br>", "<b>Username: eugenie98</b><br><br>Hah, don't preach to me about my having a sheltered upbringing, I lived in the Brooklyn ghetto of East Flatbush until Junior High School (which happened to be on the border of Flatbush and Midwood). Flatbush is home of Abner Louima and all sorts of ghetto fun. Where did you grow up, Steve?<br><br>It's true, Morningside heights is very safe because it's basically filled with Columbia students and faculty. The crack types rarely venture below 125th or west of morningside park b/c of the gentrification of that area, but they are most definitely present in ample quantity above 125th and west of morningside park.<br><br><url>http://www.morningside-heights.net/crime.htm</url><br><br>Notice the curve to the right of campus. That's morningside park. Notice the dark red coloring of the area to the right of the park, that's from the crack dealers committing crime.<br><br>Don't even talk to me about Washington Heights which is where the medical center is, I volunteered at Columbia Presbyterian two years ago and the surrounding neighborhood is almost as dangerous as the area east of Morningside park. If you look at the above crime map, the medical center itself is the light colored area in that sea of red north of Columbia's undergrad campus/Barnard/GSB, near where the land juts out to the west.<br><br>I'm sure that the crime situation will improve for the area above 125th as Columbia assimilates more and more of that land/buildings into its manhattanville project (manhattanville is the only light red area on columbia's borders), but it's still not safe to go above 125th and east of morningside park by yourself.<br><br>If you can't walk in the street at night as an able-bodied male near morningside park, what makes you think the area is safe for females? Also, since when is an area where you can't walk at night safe?<br><br>Perhaps you're right about only 10% of the population being liberal anarchists, but when I get to walk by the Spartacist League (Give IRAN NUKES TO PREVENT IMPERIALIST AMERICA FROM INVADING) every day, handed flyers by La Roche fanatics every other day, and implored to donate to all the PIRG's projects (Sierra Club, Greenpeace, etc...) for 12 weeks it gives me the impression that they wouldn't be at Columbia if there wasn't a large target group for them....<br><br>", "<b>Username: sac</b><br><br>If you don't distinguish between the Sierra Club and the Spartacist League, I guess you don't take many flyers.<br><br>As for La Roche, I believe he is a right wing nut, not a left wing one. I don't think there is a large target group, or possibly any target group, for either La Roche or the Spartacist League at Columbia, whatever their aspirations.<br><br>It's good to see you agree that Morningside Heights is a safe area, filled with Columbia students and faculty.<br><br>", "<b>Username: Denzera</b><br><br>\"\"Perhaps you're right about only 10% of the population being liberal anarchists, but when I get to walk by the Spartacist League (Give IRAN NUKES TO PREVENT IMPERIALIST AMERICA FROM INVADING) every day, handed flyers by La Roche fanatics every other day, and implored to donate to all the PIRG's projects (Sierra Club, Greenpeace, etc...) for 12 weeks it gives me the impression that they wouldn't be at Columbia if there wasn't a large target group for them....\"\"<br>they need something to rant about, and somehow every year they recruit a dozen or two impressionable freshmen... but really, most of us just find them annoying. The campus Democrats mailing list has maybe 15% of the campus on it.<br><br>The Spartacists aren't even the most annoying, the International Socialist Organization are the fools who interrupt perfectly interesting lectures by everyone from William Bennett to Sen. John Edwards to Salman freaking Rushdie with their antics. Their lack of respect is apparent to everyone but themselves, trust me.<br><br>", "<b>Username: columbia2007</b><br><br>Yes and note that the \"target\" of such groups, and the groups on campus are primarily the New York/Upper West Side chapters of these organizations, are the audiences of large lectures given by prominent public officials rather than the average Columbia student. I find them, more than anything, an amusing diversion if they happen to be around on campus- I think the ISO sets its little card table up once a week or so, rarely more.<br><br>Far more aggravating are the religious zealots attempting to invite me to Bible or Torah study or whatever...masquerading as lost tourists with their \"excuse me, do you go here?\"<br><br>I actually second Eugenie's comments on the administration. It's vile. Occasionally I sympathize with the 1968 protesters for doing everything they could to subvert it. There's a reason the New Left and all its rhetoric about \"the System\" found such fertile ground at Columbia. Denzera is, however, right that there is the occasional person of higher cognitive function that will warm the heart of the jaded Columbian with unexpected kindness, understanding, and sensibility.<br><br>Having worked in the far more distressing bureaucracy of the US Government, I can honestly say that the madness of Columbia both paled by comparison and proved excellent preparation (vs. the coddling care I received at my small religious high school) for the institutions one has to deal with in later life. Columbia students do not enter the \"real world\" expecting everything to be facilitated smoothly. We receive an excellent education in dealing with the sort of extreme incompetence that's prevalent in every corporation, institution, or government.<br><br>", "<b>Username: Denzera</b><br><br>talk about looking hard to find a silver lining, huh?<br><br>I really don't think it's as bad as its reputation, but that is certainly its reputation.<br><br>", "<b>Username: columbia2007</b><br><br>The unfortunate reality is that the administration hires a lot of low level administrators to appease local politicians by claiming they're creating lots of jobs. In many cases, though, these people either don't have much of a reason to care about Columbia students or are even hostile to those they perceive as spoiled rich kids. Other schools seem more willing to induct alumni or other people closely affiliated with their institutions into these positions, or in the case of the more low level service jobs, let workstudy students take them.<br><br>Another perennial issue with the administration is its constantly revolving door. Many people in these posts seem to be promiscuous careerists who relish the opportunity to slap Columbia's name on their resume but are up and out before they can make meaningful connections to students or staff. Again, not people who have any real connection to the university or desire to see its students proper/thrive/accomodated beyond the minimum requirements.<br><br>Columbia's complicated administrative system is a further obstacle; maybe if Columbia College students only had to deal with Columbia College administrators, it would feel like the personable LAC it's advertised as...but the university is a vast institution as a whole, and competing for administrative time and resources with tens of thousands of grad students is a severe chore.<br><br>", "<b>Username: Skymall935</b><br><br>even after reading all this \"bS\" or the truth... i still am stuck between the two... I honestly only care about these things:<br><br>-good weather<br>-lots of parties, things to do, nightlife,girls<br>-obviously good food, dorms, good college life with good people<br>-whichever school is easier to succeed and have a better educational experience... maybe which school CAN HELP ME get into a decent law school preferabbly top 10 : )<br><br><br>I guess i'm mainly stuck because I sucked horribly freshman year gpa wise...<br><br>and I heard princeton looks at 10-12 grades and Columbia looks at 9-12... so I might have a better chance at princeton i'm guessing...<br><br>Also, I guess i'll apply for sports to either one and which ever one recruits me I guess i'll go there... : )<br><br>So I still need help deciding and I ddin't even start the thread. trust me these 2 schools are the best in the nation IMO... so help me out!<br><br>", "<b>Username: eugenie98</b><br><br>\"Columbia's campus has a range of politics, and your quote is its reputation, not its reality. I would say ~10% are raving, half-anarchistic liberals, 2% are activist conservatives, and the vast majority are apathetic but leaning left in their beliefs. By and large, students find the continuous protests by the socialists or wackos involved in the middle eastern conflict to be annoying obstacles to their daily routines. 1968 is a long time ago.\"<br><br>How apt, looks like 1968 has come back...<br>I just have to applaud Columbia students for doing a great job this week at portraying the university as a hotbed of liberal anarchy.<br><br>Anyhow, Skymall you should visit us and then Columbia to see which has better parties, girls, food.<br><br>", "<b>Username: columbia2007</b><br><br>1968 was still long ago. You can't compare ca. 15 radical socialists occupying a stage to the weekslong occupation of half of campus by hundreds of students.<br><br>Either there is an unselfconscious lack of logical thought that goes into these \"Columbia is full of fanatics\" posts or a conscious desire to tar Columbia. In other words, one must deplore either your lack of reason or your motives.<br><br>", "<b>Username: Denzera</b><br><br>Yeah. Do you see me going on the Princeton board ranting about whatever minutiae I can take out of context and use to criticize your school? No, you don't.<br><br>And I'm sure readers here are smart enough to realize that your rants here mean you're more concerned with \"competition\" from Columbia than we are in the other direction. I'm happy with my school, and I think every other CU student here is as well. You seem to have some latent jealousy towards us or something. Get over it. As has been discussed ad nauseum in other threads, a dozen crazy people most of whom probably don't go to the university are hardly emblematic of the typical atmosphere here.<br><br>", "<b>Username: eugenie98</b><br><br>OK, I see you do not understand my meaning when I say Columbia is very liberal.<br><br>I'll revise my statement to be more exact:<br>Columbia has a minority of radical liberals, ~10% according to Denzera. The majority of students are apathetic but left leaning. The radical liberals permeate the political atmosphere with their crap. It is impossible to go through the week without being bombarded at least once with some ridiculous radical liberal literature.<br><br>10% of the student body = 400 students+.<br>400+ radical socialists running around a campus can cause plenty of trouble.<br><br>I wonder if Columbia's disciplinary board is doing anything significant in response to what happened. If this happened at Princeton the students involved would have received a Dean's warning at a minimum, if not a year's suspension. It has nothing to do with partisanship, I am certain that if the College Republicans @ Princeton stormed the stage with a Pro-Choice speaker on the podium they would be in deep crap. That's Columbia's problem, the administration doesn't do jack ABOUT ANYTHING, including students getting out of hand, and it results in this political environment that is infested with radicals.<br><br>You (Denzera) admit that organizations like the ISO interrupt other speakers, including liberal ones. The issue I have is not that the radicals are liberal, but that YOUR SCHOOL DOES NOT DO ANYTHING ABOUT THEIR DISGUSTING BEHAVIOR. The fact that they're liberals is a minor detail. If they were radical conservatives and your school did nothing about unacceptable behavior I would have the same scathing opinion.<br><br>", "<b>Username: Old Campus</b><br><br>\"The radical liberals permeate the political atmosphere with their crap. It is impossible to go through the week without being bombarded at least once with some ridiculous radical liberal literature.<br><br>10% of the student body = 400 students+.<br>400+ radical socialists running around a campus can cause plenty of trouble.\"<br><br>Ha, Eugenie, you want to be taken seriously?<br>I think I know a lot about Columbia because I teach there.<br>I think I know a lot about Princeton because I used to teach there.<br>The crude descriptions and bitter, facile comparisons you make (plus your obviously erroneous numerical approximations and the overall exalted tone of your comments) do not do justice to either school.<br><br>", "<b>Username: Byerly</b><br><br>Kind of hostile &amp; defensive, aren't we, Yale grad and Columbia prof?<br><br>I'd say you reveal a touch of \"exalted tone\", crudity and bitterness yourself!<br><br>Not becoming for a faculty member representing his school.<br><br>", "<b>Username: eugenie98</b><br><br>Do you deny that there are at least 4,000 undergraduate students at Columbia?<br>Do you deny that Denzera said \"~10% are raving, half-anarchistic liberals\"?<br><br>So.. tell me where I miscalculated?<br><br>", "<b>Username: Denzera</b><br><br>You miscalculated at the point where you took a wild estimate for the purposes of illustration and comparison to be fact, and hyperbolic phrasing to be appropriate description.<br><br>I'd say there's about 50 people who actually go out and physically protest, hand out flyers, yell at people on college walk, etc. There's probably another 100 who will join in things periodically as part of a large group or will get outraged over some issues but not an every-day thing like pushing Socialism. And then there's the several thousand who fall somewhere on the center-to-left spectrum.<br><br>In either case, I believe the school's decision that nothing major needs to be done is pretty much correct. This has been discussed to death in other threads, so I would refer you to those to keep this on-topic. Princeton has protesters too, it's just that their campus is located farther from the TV cameras and talk show studios.<br><br>", "<b>Username: Old Campus</b><br><br>Ha, Byerly.<br>I would not expect you to undrestand when someone is fair or \"defends\" a school he or she did not attend. That, perhaps, is beyond your possibilities.<br><br>", "<b>Username: love me97</b><br><br>what is the salary if you are a teacher at that school because i am doing a project at school and i have to really find that out so please say it<br><br>", "<b>Username: Fastfood15</b><br><br>^^^ weird, eh?<br><br>try googling, \"average university professor's salary\".<br><br>I would guess at Ivies it's ~150k avg?<br><br>", "<b>Username: PrincetonGuy2010</b><br><br>Go to Columbia. I chose Princeton over Columbia and it was the worst mistake of my life. People at Princeton are spoiled brats with rich daddies and Jersey is lame. I did well (going to Yale Law), but I really wished that I would've attended Columbia. Princeton seems more prestigious because Harvard and Yale are holding it up, but if you really think about it: Columbia's graduate programs are far better while Princeton has very little (Princeton College, anyone?), Columbia's undergrad core curriculum is amazing and, although Princeton's undergrad is amazing, too, guidance would've been preferred. They have the same admission stats, but Columbia has NYC. Go to Columbia; it's better than Princeton (sorry guys, but it's the sad truth).<br><br>Welcome the new Big Three: Harvard, Yale, and Columbia. Check your stats; it makes perfect sense.<br><br>", "<b>Username: PrincetonGuy2010</b><br><br>I love Princeton, guys, but I was really confused as to why it's considered top three. I know a girl who went to Long Island University and my best friend is attending Fordham Law School. It's not the prestigious school that people make it out to be. Honestly...<br><br>", "<b>Username: jgraider</b><br><br>OP will be graduating from college soon...<br><br>", "<b>Username: collegeftw</b><br><br>^ LOL yeah wonder where he ended up choosing.....lol<br><br>", "<b>Username: jamescchen</b><br><br>Duke is the new Princeton, and Stanford is the new Yale.<br><br>", "<b>Username: admitone</b><br><br>I dunno Princeton is pretty awesome. Princetoneguy2010 smells like a ****. 2 posts?<br><br>", "<b>Username: Light Airen</b><br><br>@jamescchen<br><br>Duke? Yeah, no.<br><br>", "<b>Username: collegeftw</b><br><br>^hahaha. Duke is great, but its undergrad is really not that comparable to Princeton's.<br><br>Although I really haven't heard of any Princeton's in anything outside of the undergraduate realm...if I'm correct they don't even have a med school right? And I'm not familiar with any of their research or publications in science journals and such. Are they primarily a liberal arts/undergrad institution o.0 ?<br><br>", "<b>Username: bioblade</b><br><br>Yes, they're primarily an undergrad institution.<br>I don't think they have any professional schools.<br><br>", "<b>Username: admissionsgeek</b><br><br>princeton has one prof school, woody woo.<br><br>as i've said before - princeton is in many was as close to the antichrist, evil empire as it gets from columbia's force of goodness and truth. i sometimes don't get students who apply to both. folks think brown is the bigger antithesis, but i don't agree, i think brown and columbia have more crossover in terms of personality than princeton and cu.<br><br>as a columbian, my dislike for princeton is grounded and irrational, kind of like the way i feel about new jersey. *snap*<br><br>", "<b>Username: almamater</b><br><br>Princeton has lots going for it including a stronger social life, a real college community, and well known loyalty from their alums. I would day Princeton and Dartmouth are probably the most similar Ivies, vs Columbia at the other end.<br><br>I also love their undergrad focus and the academics that come with that. I'm sure it has a lot less bureaucracy than Columbia. Trust me, going to a 5 law school you meet lots of alums from other schools. The Princeton students love the place, and its hard not to see why.<br><br>Columbia is a great school but it has so much more left to go. Our endowment is something like 1/4 of Princeton's per student.<br><br>With all of this said, I think that if you're applying to grad school or going to consulting or banking all of the Ivies are feeders to some degree. Its more what are you looking for in a college experience. All I'm saying is what Princeton's selling looks pretty good to me, and it has a lot of things going for it that I wish Columbia had.<br><br>", "<b>Username: confidentialcoll</b><br><br>\"\"All I'm saying is what Princeton's selling looks pretty good to me, and it has a lot of things going for it that I wish Columbia had.\"\"<br><br>fair enough, after having visited many times and having friends go to princeton, I can comfortably say that Columbia has a lot of things that princeton doesn't. they are very different schools offering very different scenes. I agree that in many ways Columbia and princeton's student bodies are at opposite ends of the spectrum in the ivy league. I frankly found princeton less diverse, insular and polarized with fratty eating club boys and girls on one end and nerdy science and math students on the other. Princeton students came off as intelligent without a doubt, but not at all people I would've wanted to spend 4 years with. I'm sure many princeton students would find Columbia as disagreeable, they are very different experiences and student bodies.<br><br>", "<b>Username: lesdiablesbleus</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/collegeftw\">collegeftw</a> wrote:\"\"<br>Neither is Columbia's while we're on the topic.<br><br>", "<b>Username: yoda16</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/lesdiablesbleus\">lesdiablesbleus</a> wrote:\"\"<br>.<br><br>Not sure what Lesdiablesbleus has against Columbia, but I've read several of his/her posts before and they were full of platitudes and either false or poorly researched statements. He/she doesn't really appear to know much about the school but often speaks up against it.<br><br>Columbia and Princeton are peer institutions in terms of academic quality, yet they are different in terms of undergraduate experience.<br><br>", "<b>Username: lesdiablesbleus</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/yoda16\">yoda16</a> wrote:\"\"<br>I have nothing against Columbia at all. I was just making a point that is widely accepted. Calling Columbia a peer of Princeton at the undergraduate level is a stretch. Princeton is the best undergraduate college in the world and has stronger students, more resources, smaller classes, better grants/service learning opportunities, greater faculty focus on undergrads, a much much more well-defined campus social experience and higher prestige. Columbia is definitely a top 15 school and probably a top 10 one. It just isn't one of the 5 best.<br><br>", "<b>Username: yoyoma999</b><br><br>I'm pretty sure Dartmouth has both of them beat when it comes to undergraduate education.<br><br><a href=\"http://colleges.usnews.rankingsandreviews.com/best-colleges/national-ut-rank\" rel=\"nofollow\">Best Colleges - Education - US News</a><br><br>", "<b>Username: Light Airen</b><br><br>Since when did undergraduate teaching equal undergraduate education? According to your logic neither Columbia nor Harvard is even in the top 25 colleges.<br><br>And psh, hell yeah. I would pick Miami over Columbia <i>any</i> day.<br><br>", "<b>Username: pbr</b><br><br>Princeton has more than four peers, and two of them are Dartmouth and Columbia.<br><br>", "<b>Username: hume15</b><br><br>\"\"Calling Columbia a peer of Princeton at the undergraduate level is a stretch. Princeton is the best undergraduate college in the world\"\"<br>Since the second sentence here is entirely subjective, what makes the first part objective?<br><br>", "<b>Username: lesdiablesbleus</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/pbr\">pbr</a> wrote:\"\"<br>Interesting you bring up Dartmouth.<br><br><a href=\"http://www.payscale.com/best-colleges/top-us-colleges-graduate-salary-statistics.asp\" rel=\"nofollow\">Top US Colleges ? Graduate Salary Statistics</a><br>MID CAREER SALARIES<br>Princeton: $123,000<br>Dartmouth: $123,000<br>Duke: $117,000<br>...<br>Columbia: $99,700<br><br>Why are Columbia grads so dirt poor compared to their so-called \"peers\"? Maybe many of them can't land the plush front office finance positions on Wall Street and end up being struggling writers and artists instead haha. I wonder how they manage paying the city rent...<br><br>", "<b>Username: lesdiablesbleus</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/bill10004\">bill10004</a> wrote:\"\"<br><a href=\"http://www.rhodesscholar.org/stats/institution/1911\" rel=\"nofollow\">The Rhodes Scholarships - Winner Statistics by Endorsing Institutions</a><br>Columbia: 27 Rhodes Scholars<br><br><a href=\"http://www.rhodesscholar.org/stats/institution/1858\" rel=\"nofollow\">The Rhodes Scholarships - Winner Statistics by Endorsing Institutions</a><br>Princeton: 195 Rhodes Scholars<br><br>Even Duke and Dartmouth have a much higher number of Rhodes Scholars than Columbia. What's going on over there at Morningside Heights? Not too much undergraduate advising it seems...<br><br>", "<b>Username: pbr</b><br><br>lesdiablesbleus, citing random statistics does little to inform whether Columbia and Princeton are peers. You cite a questionable salary survey and the number of Rhodes scholar. A Columbia advocate could argue the number of Nobel Prize winners and the fact that Columbia College's admission rate is less than Princeton's. All of which does nothing to address the issue of whether Columbia and Princeton are peers, which is a more subjective amalgam of all factors. Do you really think Columbia and Princeton are not academic peers? Have you really bought into the SHYMP acronym?<br><br>", "<b>Username: bioblade</b><br><br>The salary survey excludes the 90% of Columbia students who go on to grad school.<br><br>", "<b>Username: jameschase</b><br><br>Nobel laureates from Columbia :: 97<br><br><br><br>Nobel from Princeton :: 31<br><br>", "<b>Username: lesdiablesbleus</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/pbr\">pbr</a> wrote:\"\"<br>Nope, not even close.<br>\"\"<a rel=\"nofollow\" href=\"/profile/pbr\">pbr</a> wrote:\"\"<br>Columbia College's admission rate is less than Princeton's because it is a renowned college located in a major American city (New York). UCLA gets the most applications in the country but that doesn't mean that its as sought after as Princeton.<br><br>What matters is the number of \"competitive applications\" that Columbia receives. I have good reason to believe that a fair amount of unqualified high school seniors apply to Columbia just because it is located in New York like they do to NYU or USC while nearly all of Princeton's applicants are academic superstars.<br><br>Also, the number of Nobel Laureates affiliated with a university has nothing to do with institutional quality. Who cares if some random Nobel Laureate worked in some obscure department of the university as a researcher for 3 years. How does that improve the undergraduate experience I have at Columbia?<br><br>Producing Rhodes Scholars consistently, on the other hand, shows that a university is committed to helping its best and brightest achieve the highest honor in academic scholarship. That should matter to you and I because it means the university more likely than not has incredible fellowship and career advising.<br>\"\"<a rel=\"nofollow\" href=\"/profile/bioblade\">bioblade</a> wrote:\"\"<br>A large majority of most students at elite school go on to attend grad school so I don't see how this is a Columbia-specific issue.<br><br><url>http://wsjclassroom.com/pdfs/wsj_college_092503.pdf</url><br>Regarding Columbia: \"Youd think undergradshere would have an edge getting into its elilte law and medical schools. But several other Ivies sent more students.\"<br><br>", "<b>Username: jameschase</b><br><br>Number of Billionaires from Columbia : 16 (ranked #4)<br><br><br><br>Number of Billionaire from Princeton : 5-6 ? (ranked 15th ??)<br><br>", "<b>Username: jameschase</b><br><br>\"\"A large majority of most students at elite school go on to attend grad school so I don't see how this is a Columbia-specific issue.<br><br><url>http://wsjclassroom.com/pdfs/wsj_college_092503.pdf</url>\"\"<br><br>Wall Street journal used incorrect data. Columbia College class size is about 1000 (not 1652)<br><br>", "<b>Username: lesdiablesbleus</b><br><br>^That's totally false just off the top of my head. Princeton billionaires I can think of immediately are Meg Whitman, Jeff Bezos, Carl Icahn and Eric Schmidt. That's 4 right there. I can't think of a single famous businessman hailing from Columbia UNDERGRAD.<br><br>", "<b>Username: jameschase</b><br><br>\"\"Also, the number of Nobel Laureates affiliated with a university has nothing to do with institutional quality.\"\"<br>LOL.<br>\"\"Who cares if some random Nobel Laureate worked in some obscure department of the university as a researcher for 3 years. How does that improve the undergraduate experience I have at Columbia?\"\"<br>Nobel Laureates at 'Economics' department (Stiglitz Mundell) teach 'economics' courses at Columbia. Prof. Merton is a Columbia graduate (Nobel Economics) who basically created 'Financial Engineering' (options, derivatives, hedge funds, etc.)<br>Do you think 'economics', 'hedge funds' are obscure departments ?<br><br>", "<b>Username: jameschase</b><br><br>\"\"^That's totally false just off the top of my head. Princeton billionaires I can think of immediately are Meg Whitman, Jeff Bezos, Carl Icahn and Eric Schmidt. That's 4 right there.\"\"<br><br>Here is the ranking of billionaire univeristies. Princeton is not even top 14.<br><a href=\"http://www.forbes.com/2009/08/02/billionaire-study-harvard-stanford-business-billionaires-colleges-09-wealth_slide_2.html?thisspeed=25000\" rel=\"nofollow\">In Pictures: Billionaire University - Forbes.com</a><br><br>", "<b>Username: jameschase</b><br><br>\"\"That's totally false just off the top of my head. Princeton billionaires I can think of immediately are Meg Whitman, Jeff Bezos, Carl Icahn and Eric Schmidt. That's 4 right there.\"\"<br><br>Meg Whitman LOST Governor election. LOL<br><br>Barak Obama won 'PRESIDENTIAL ELECTION' and is now the PRESIDENT OF U. S. A.<br><br>", "<b>Username: Nonsensical</b><br><br>Okay; this thread is getting kind of silly. Both schools are the best of the best. They're both so good that rankings are basically arbitrary, and if you can get into both, you really should just choose which one is a better fit for you. Do a campus visit, look at what the department(s) looks like for your prospective major(s), and go from there. It's really a matter of personal preference.<br><br>", "<b>Username: admissionsgeek</b><br><br>columbia undergraduate billionaires off the top of my head:<br><br>kluge<br>lerner<br>kraft<br>campbell<br><br>", "<b>Username: quantman</b><br><br>If Princeton was all that great, it would rely less on legacies. According to the Princetonian, one cannot walk on the campus without bumping into these privileged scions. Roughly one in every eight undergrads at Princeton are legacies. Plus the athletes and the URMs and one finds that hardly twentyfive percent of the undergrads have been selected on their merit. While all those nice buildings certainly look great on a sunny day, it takes really good students to make an institution. On that score, Princeton is beginning to look weaker and weaker. Maybe that is why they had to hand out all those As. Probably explains the Rhodes scholars.<br><br>", "<b>Username: hume15</b><br><br>^I've felt that way about Princeton for a while--good to know it's not just me.<br><br>", "<b>Username: confidentialcoll</b><br><br>lesdia here are a few metrics on which columbia beats princeton:<br><br>freshman retention<br>% of classes under 20 students<br>% of minorities<br>% of pell grant receipients<br><br>there might be others, but these are from the top of my head.<br><br>In terms of selectivity Columbia and Princeton are practically identical - acceptance rates are nearly the same, princeton has slightly higher SAT scores and Columbia has slightly higher % of students in the top 10% of their high school class (97% vs. 95%) - US News rates them equally on selectivity.<br><br>You mentioned that # of nobel laureates if an irrelevant metric, but you sighted # of rhodes scholars which is an equally irrelevant metric. Few students ever want to become rhodes scholars in the first place and each year 1-3 students from either institution makes it anyway.<br><br>I definitely consider Princeton and Columbia peer schools, in that there are good and perfectly normal reasons to choose either one if given the choice. For the sake of consistency, I also think that Duke and Princeton are peer institutions, if someone chose Duke over Princeton I wouldn't really be very curious as to why (because there are many good reasons - specific programs, school spirit, sports, weather, campus feel etc). If someone chose boston college or USC over princeton I would be very curious as to why they did so.<br><br>", "<b>Username: collegeftw</b><br><br>lesdiable needs to **** this thread and go read a book or something<br><br>say, man, what school did you even go to?<br><br>I'm not going to bash on Princeton because it was a close second choice for me. I think that the reason it relies so much on legacies is because its primarily an undergrad institution and piling up legacies helps it to ultimately build loyalty to the institution.<br><br>I think that the education at both institutions are roughly similar (as had been reiterated like a billion times in this thread); Princeton might be *slightly* more \"prestigious\" or whatever, but for stimulations outside of the classroom, such as internships, volunteerism, and job shadowing Columbia clearly wins - whether its in research, business, medicine, etc.<br><br>idk if that helped or not....probably not....lol<br><br>", "<b>Username: admissionsgeek</b><br><br>i just like to look back at the time when columbia was nearly as selective as princeton, and the rush of the most insensitive comments on the daily princetonian news story. it is things like that that make me feel good where i went.<br><br>love princeton if you want. i don't. and as a reasonable choice, i think columbia is right there.<br><br>", "<b>Username: monstor344</b><br><br>This thread makes me glad I chose Princeton over Columbia!<br><br>Not really. But I feel like I have to make a post like this in order to keep par with some of the moronic content here.<br><br>", "<b>Username: admissionsgeek</b><br><br>explain how you're princeton '15?<br><br>", "<b>Username: collegeftw</b><br><br>^ probably a wannabe<br><br>", "<b>Username: vstheworld</b><br><br>Just out of curiosity... is this Columbia vs. Princeton thing a common rivalry? My cousin at Columbia seemed pretty offended when I told him Princeton was my second choice. I know I should probably know more about these things, but I ... honestly don't care very much.<br><br>", "<b>Username: monstor344</b><br><br>\"\"^ probably a wannabe\"\"<br>Yep. That's all I am. In fact, technically speaking, everyone with a Princeton likely letter claiming to be a member of the class of 2015 is a wannabe, since official decisions don't come out for another few months. At least I can admit my shortcomings though! :)<br>\"\"Just out of curiosity... is this Columbia vs. Princeton thing a common rivalry? My cousin at Columbia seemed pretty offended when I told him Princeton was my second choice.\"\"<br>There's no rivalry between the two really; I guess though that they do have quite different environments, which leads to some pretty strong opinions on each side. I would have to say though, admittedly without knowing all the context, that your cousin is a weeniehead.<br><br>", "<b>Username: vstheworld</b><br><br>Hahaha I think it was just because at the time of that conversation, I was wavering on my \"rah rah Columbia!\" stance since it was just after I toured Princeton and just before I toured Columbia and he was showing his school spirit. But it was pretty weenieheaded of him, I will agree.<br><br>", "<b>Username: collegeftw</b><br><br>monstor, my bad bro. You a recruited athlete?<br><br>", "<b>Username: confidentialcoll</b><br><br>Columbians try to stir up a rivalry with Princeton, they are definitely the most hated school on campus, I don't think princetonians know or care that much though. I think Princeton would be my least favorite ivy followed closely by Cornell. Penn think they have a rivalry with Princeton, but again, not sure Princeton knows or cares.<br><br>It's also sad that a Princeton'15 kid spells monster wrong :p<br><br>", "<b>Username: admissionsgeek</b><br><br>i think there is a degree of pride in beating princeton, though princeton may not care the same, i do recall princetonians getting all bent out of shape when we almost beat their admissions rate, it was the first time i recall direct hate mail to columbia, but princeton often tries to belittle (remember the article when columbia beat princeton 38-0?) - which is funny because that is kind of playing into their elitist stereotype.<br><br>i think going to columbia makes you dislike princeton more because of the obvious pomp that you will find especially because you'll find princeton grads in the city talking about how they went to school (near) nyc. going to princeton makes you think you're in a cloud and therefore you don't think of others. innocence is bliss.<br><br>", "<b>Username: confidentialcoll</b><br><br>^after waitlist activity we <u>did</u> beat their acceptance rate that year (two years ago) this year we should comfortably beat their acceptance rate.<br><br>", "<b>Username: slicedbread21</b><br><br>hey adgeek!<br>could you post the link to any of the articles at the daily princetonian that you were speaking about? either the one after we nearly beat their admission rate and/or the one about beating them 38-0? or any other article pertaining to the columbia -princeton rivalry as such?<br><br>it would be pretty interesting to read what could possibly be their end of the 'rivalry?' :)<br><br>", "<b>Username: admissionsgeek</b><br><br>when admissions was 9.79% or 9.8% and columbia's was too. they wanted to burn down poor old Shirley Tighman. the amount of vitriol is impressive.<br><a href=\"http://www.dailyprincetonian.com/2009/04/01/23213/comments/\" rel=\"nofollow\">Comments on \"Admission rate rises to 9.79 percent for Class of 2013\" - The Daily Princetonian</a><br><br>i mean this is pretty great too, and more recent: \"perhaps the Princeton is receiving more \"mature\" and \"sincere\" applicants than other competitive schools. At the risk of sounding elitist, I know of kids with utterly unremarkable credentials applying to Harvard, Yale, Columbia, and Stanford just because they're infatuated with the names.\"<br><a href=\"http://www.dailyprincetonian.com/2011/01/19/27394/comments/\" rel=\"nofollow\">Comments on \"Web Update: Applications rise 3.3 percent for Class of 2015\" - The Daily Princetonian</a><br><br>\"Perennial pushover tops Tigers\" is their response to 38-0 shallacking<br><a href=\"http://www.dailyprincetonian.com/2009/10/05/24010/\" rel=\"nofollow\">Football: Perennial pushover tops Tigers - The Daily Princetonian</a><br><br>", "<b>Username: pwoods</b><br><br>Of course, there's a rivalry. Princeton is the anti-Columbia: <a href=\"http://www.wikicu.com/Princeton\" rel=\"nofollow\">Princeton University - WikiCU, the Columbia University wiki encyclopedia</a> Puck Frinceton!<br><br>", "<b>Username: lullinatalk</b><br><br>^ Is WikiCU pretty representative of the way Columbians view things? My friends and I got good laughs out of a lot of articles there.<br><br>", "<b>Username: admissionsgeek</b><br><br>i think a lot of columbians have a biting sense of humor, very dry and sarcastic, and that especially comes out at orgo night and the varsity show.<br><br>----<br><br>and to actual princetonians and those interested in princeton. this is just fun. in the end princeton is a great place for some, a horrible place for others, and each of us needs to figure that out on our own. but if any of us are lucky enough to get into princeton i think that is an achievement to be proud of. in reality this kind of barb is so disconnected from the realities that most students face, but it is done mostly to keep sanity and levity in our daily lives. i can't say i hate princeton because i respect so many people that go there and have went there.<br><br>the danger of arrogance is when it isn't at least in part sarcastic. and if folks don't realize that on wikicu or even my posts here there is a sarcasm (and a self-conceit of its own ridiculousness) in its arrogance and columbia chest-thumping, then you are missing the joke. my problem with princeton at times and i can be very honest about this, is the fact that this kind of world-realization that princeton (or harvard or yale) is not the center of the world does not compute. indeed i have been told with extraordinary seriousness about how great (pick one) institution is. and i find that troubling, as i would find someone who wouldn't label their love of columbia anything but irrational.<br><br>", "<b>Username: Jersey13</b><br><br>\"\"Number of Billionaires from Columbia : 16 (ranked #4)<br><br><br><br>Number of Billionaire from Princeton : 5-6 ? (ranked 15th ??)\"\"<br>Off topic I know, but I'm curious. How many of the Columbia billionaires are undergrad alums?<br><br>", "<b>Username: pbr</b><br><br>^I don't know the answer to your question, but I certainly hope no one gauges educational quality based on the number of billionaire alums...<br><br>", "<b>Username: Jersey13</b><br><br>^ Exactly why I prefaced my question with the first four words in my last post.<br><br>", "<b>Username: admissionsgeek</b><br><br>i know at least 5 were ugrad alums.<br><br>to fold two posts into one, i think that c was more prestigious in terms of the 'public' in the early 20th century than y and p, if even it wasn't within WASPy circles. in part because the cultural consciousness of the world really centered on the kind of nyc world - and columbia played a demonstrative roll as the academic acropolis, as commentators often called columbia.<br><br>but there is something that concoll has said, and that prezbo has often said. if there is a school that could break the hyp grip it would be columbia - in many ways it represents the vision of the future: an urban university in an increasingly urbanized world. as the school in new york city it further reinforces a lot about our own national expectations, and how so often we focus those expectations on nyc. lastly because of its stronger emphasis on diversity and the way it mirrors nyc, it strongly mirrors the world that the US will become over the next 30-40 years.<br><br>none of this is 'absolute' but it is in many ways the hope and aspiration of the institution, and one of the few institutions with the lineage, history, academic breadth and sheer drawing power to accomplish such an ambitious move that 30-40 years ago would've seen impossible.<br><br>", "<b>Username: slicedbread21</b><br><br>although this thread may be dead..<br><a href=\"http://spectrum.columbiaspectator.com/opinion/consensus-princeton-sucks\" rel=\"nofollow\">Consensus: Princeton sucks | Spectrum</a><br><br>", "<b>Username: joso2015</b><br><br>not that there's really any point in fighting over who's \"better,\" but i would argue that columbia has produced much more impressive alumni and has overall done a lot more for the world than has princeton. obviously princeton is an amazing school nonetheless, whether better or worse as an undergraduate college who's to say. but it just seems to me that columbia has been a more important factor in the world and created some real world-changing individuals. can't say i've really seen or heard the same about princeton or its alums<br><br>", "<b>Username: waitlistman</b><br><br>Quantman wrote:<br><br>\"If Princeton was all that great, it would rely less on legacies. According to the Princetonian, one cannot walk on the campus without bumping into these privileged scions. Roughly one in every eight undergrads at Princeton are legacies. Plus the athletes and the URMs and one finds that hardly twentyfive percent of the undergrads have been selected on their merit. \"<br><br>You claim to dislike Princeton for the very reasons that make Columbia more diverse and a better representation of what America looks like as your comment on legacies and athletes might pass muster your implications that URMS are not qualified applicants---is really over the top and racist. Latinos URM from South America scores are maybe 40 points lower on SATs than their caucasian counter parts, Mexicans slightly lower, and PR slightly lower but to say that Columbia does not factor in the inherent differences in opportunity that these URMS have in the equation thus making a Latino raised in a largely white affluent area or say of mixed heritage is totally disrespectful of your peers at Columbia and your peers at Columbia have a far greater percentage of URMs than the other ivies. Are you then saying that your fellow URMs did not deserve to be admitted on thier own mertis--because I would argue that they deserve far more than any other category to get in as they more than likely are a lot smarter than a kid who went to a great suburban school and had life very easy, did not have to work etc. Not saying its always fair 100 percent but affirmative action is IMHO fair and Columbia, being one of the most liberal colleges I would suspect would highly disagree with your lumping in of URMs into that fairly immature statement about Princeton in general. I understand your point on legacies, as the only reason they get a boost is mom and dad gave money to the endowment, but that is a valid reason and Columbia also uses it, so while there may be more legacies at Princeton there is not a lot of difference on the whole admissions method, Its the kids that are attracted to Princeton and given the choice choose a more diverse and city environment college that probably make Columbia and Princeton polar opposites in many ways while clearly equal in academics in most areas...just as a parent of a Latino child who has 2250 on her SATs I don't feel like my kid is unqualified to match up to any other applicants period.<br><br>", "<b>Username: slicedbread21</b><br><br>now it gets real interesting...<br><a href=\"http://spectrum.columbiaspectator.com/spectrum/consensus-princeton-sucks-part-ii\" rel=\"nofollow\">Consensus: Princeton sucks Part II | Spectrum</a><br><br>", "<b>Username: pwoods</b><br><br>If you're discussing influence and power, most Supreme Court justices and a good deal of politicians have done Princeton undergrad (and then Yale/Harvard law). Of course, some have done Harvard undergrad, and a lot of politicians have gone through Harvard's Kennedy School of Government.<br><br>Internationally, though, Columbia dominates and has dominated for a while: <a href=\"http://bwog.com/2011/01/28/from-the-magazine-new-world-order/\" rel=\"nofollow\">Bwog From the Magazine: New World Order</a><br>This isn't terribly surprising, given SIPA, the proximity to the UN, and the fact that New York is a truly global city.<br><br>", "<b>Username: Dad2</b><br><br>And... the greatest per capita production of nobel laureates comes from neither of these schools. But to the OP's question: Columbia and Princeton are qualitatively on a par, and one's choice could be made on the physical setting (urban or not), strength of specific undergraduate programs and the vibe (more preppy at Princeton and more intellectual/liberal at Columbia).<br><br>", "<b>Username: beard tax</b><br><br>All my friends would chose Princeton over Columbia. They're definitely different environments, but Princeton has more resources for their undergraduates. As educational institutions, I'd say that Columbia has had more impact on society. It does have a law school, business school, medical school, and various Ph. D and master's programs.<br><br>However, for an undergraduate, I think Princeton is hands down better. There are more resources at Princeton for undergraduates to take advantage of. Columbia is a sprawling bureaucracy where each school (CC, SEAS, Barnard, various graduate schools) controls their own funds and opportunities - there isn't much sharing.<br><br>It depends on what you like. If you like going it alone, not really being administered/mentored, and enjoy the city more than the campus, then Columbia is fine. I don't know about Princeton but I've heard of many engineers who've hated it. However, I get the general impression that for those who get into Princeton, they have a pretty good time. For all I know, it could be because Princeton accepts many wealthy kids who enjoy networking and the \"elitist\" culture. Regardless, Princeton is perceived to be more prestigious and for many HS students facing this dilemma, I would be hard pressed to find many that wouldn't take Princeton over Columbia (always exceptions but I'd say majority).<br><br>", "<b>Username: admissionsgeek</b><br><br>a pretty fair assessment from beard. not surprising in his/her conclusions, but also evenhanded. though beard, your conception of 'resources' for undergraduates is fair (no university spends as much endowment dollars per student as pton), but there is also the reality of having more 'opportunities' living in nyc and going to a bigger and broader university. for some that outweighs or counterweighs the money that could come to them.<br><br>that and princeton is the evil empire.<br><br>", "<b>Username: confidentialcoll</b><br><br>\"\"All my friends would chose Princeton over Columbia.\"\"<br><br>well then you're friends with prestige obsessed whores. I actually have two close friends who each turned down princeton to attend Columbia and thanked the stars they did after visiting during college. Princeton has more resources within the university, but is a suffocating environment, with preppy kids and exclusive clubs. I have been impressed by how smart princeton kids are and amazed at how imbalanced and often socially retarded they have been as well. After visiting several times and have good friend who go there, I can say with confidence, that princeton would have not suited me at all, I would have hated it and I wouldn't have done as well.<br><br>perhaps your friends (you as well?) should stop chasing prestige and think more along the line of fit, when debating two top 10 schools. Columbia got me a great job out of college (and it was Columbia, I'm not special), and now my alumni network is phenomenal - I can interview at pretty much any industry I want because of it.<br><br>Beard - your posts are always putting down your school and questioning what the school can do for you. but do something for you and for the school and you'll see everything fall into place.<br><br>", "<b>Username: pbr</b><br><br>It's difficult to imagine how someone who chose Columbia would regret not going to Princeton (and vice versa). On a day-to-day basis, they are polar opposite experiences. My Columbia son, from an affluent suburb, had no interest in Princeton, Stanford, Cornell, Dartmouth, etc. because each felt a bit too much like home. He has many, many friends who were very interested in those schools, for the very reason that they felt a bit like home.<br><br>One can analyze stereotypes of the two schools until the cows come home (Princeton's snobbiness, undergraduate emphasis, etc. vs. Columbia's disinterested administration, lack of campus life, etc.), but one spends every three of every four days of his or her life from age 18-22 at his or her college. Surely one can picture whether the suburban life of Princeton or the urban life of Columbia is the \"right choice.\"<br><br>", "<b>Username: beard tax</b><br><br>confidentialcoll - thank you for your attacks on my friends and myself. I'm glad that you enjoyed Columbia and have a job coming out. Just as you are allowed the right to freely praise Columbia, I should enjoy the right to freely criticize it. Your last comment also doesn't make much sense.<br><br>Many of my friends are pre-professional engineers who are put at a disadvantage when applying to medical or law school. Due to grade inflation in the college as well as the finite number of graduate schools spots offered to Columbia students, many of my friends are quite honestly screwed. Middle 50th in SEAS and middle 50th in CC are more than 1/3 of a letter grade off. A 3.4 in SEAS (about top 45%) is an automatic reject for medical schools. No consideration whatsoever. Talk about decisions you make when you're 17 that screw you for the rest of your life. Sad but true.<br><br>I would also add that I would choose Princeton because of academic freedom. Don't like engineering? Go study a liberal art. There is a deep dissatisfaction and feeling of being trapped in the engineering school among students. It's extremely competitive and difficult to transfer among the college and SEAS.<br><br>I'm glad that you enjoyed your experience but keep your personal attacks to yourself. Contribute something meaningful instead of \"you're friends with prestige obsessed whores.\"<br><br>", "<b>Username: beard tax</b><br><br>Also, I don't really understand why you say that you can interview with pretty much any industry you want. When you say any industry, do you mean investment banking and second-tier consulting firms? I don't see much recruiting on our campus besides these two.<br><br>I'm glad that your alumni network is phenomenal. I'm sure that you and admissionsgeek were quite exceptional in maximizing your opportunity at Columbia. Sadly, you are more the exception than the norm. 20% of alumni attend reunions? Sounds like a terrible allegiance and alumni network. Princeton has students from 40-50 years ago attending reunions. That's a vibrant and active alumni network.<br><br>Frankly, most students couldn't care less about Columbia. I'm surprised to meet fairly socially outgoing and successful people who dislike/tolerate the school. Both of us had a WTH moment when we learned Kravis donated several hundred million to the business school.<br><br>", "<b>Username: admitone</b><br><br>Confidentialcoll- \"amazed at how imbalanced and often socially retarded\"<br><br>No offense there confidentialcoll but your comment is a bit ironic. You would think that someone more socially aware would seem to understand that calling people retarded is a little passe.<br><br>", "<b>Username: lesdiablesbleus</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/joso2015\">joso2015</a> wrote:\"\"<br>This is an absolutely ridiculous statement. Princeton has produced 10x as many Rhodes Scholars and dozens of more influential politicians and ambassadors than Columbia undergrad has. This is not to mention tech tycoons like Meg Whitman (Ebay) and Jeff Bezos (Amazon) as well as investors like Carl Icahn.<br>\"\"<a rel=\"nofollow\" href=\"/profile/Dad2\">Dad2</a> wrote:\"\"<br>Columbia and Princeton are not on par. Columbia is an incredible school but Princeton is the best undergraduate college on the planet. Columbia's peers are the non-HYP Ivies, UChicago and Duke.<br>\"\"<a rel=\"nofollow\" href=\"/profile/admissionsgeek\">admissionsgeek</a> wrote:\"\"<br>That's a nice little speech but there's a school that's already broken the HYP grip and its called Stanford. If I were a betting man, I would put my money on Duke or Penn over Columbia.<br><br>Listen to beard tax, the most rational Columbian on this site, and stop trying to compare Columbia to Princeton. There are a lot of things that Columbia needs to improve on like resources/advising/funding before it can even approach Princeton's level.<br><br>", "<b>Username: almamater</b><br><br>As a Columbia alum I have to agree. Columbia is full of bureaucracy, grad students teach way too many classes/ sections, some particularly science classes are HUGE, our physical infrastructure is in need of repair/ replacement (Hello Carman and McBain), our advising is non-existent, and we don't have much alumni loyalty. We don't have much in major grants or special undergrad programs except pre-entry programs like University scholars (shouldn't every undergrad get this level of access and attention?).<br><br>I think Princeton has about 5 times the resources per student. I just don't get glossy-eyed Columbians like admissionsgeek. I mean did you not see any of this??????? We need much more in terms of resources to get up to the HYP level. This alone is why a school like Princeton can provide so much to their undergrads, they have the resources to do so. I loved the Core, and feel that it alone is a trump card for Columbia, but I can't help but hear/ feel that students at top LACs or places like Dartmouth and Princeton get that level of attention in all their classes.<br><br>I've always felt that certain students, particularly those with a very specific program in mind such as music, benefit from Columbia because of New York (i.e. Lincoln Center access). I have friends who liked having a good film school around (again a very specific niche major). But for the vast majority of us majoring in studies like Philosophy or Econ, Columbia's NYC location basically does nothing except detract from a feeling of community feeling or a real social life.<br><br>For Columbia to get up to HYP level we're going to have to multiply our endowment, build many more undergraduate specific programs (like Dartmouth's study abroad which my friends who went there rave about), and rebuild a lot of the physical plant (I am glad this is happening in some way now).<br><br>", "<b>Username: collegeftw</b><br><br>@lesdia....<br><br>um I can see why you don't think Columbia matches Princeton, and kinda see into your pessimism about Columbia breaking HYP grip, but you really think schools like Duke and Penn (GREAT SCHOOLS, dont get me wrong, duke was like my 3rd choice) have better chance of jumping into that HYP powerlock? Just curious<br><br>", "<b>Username: admissionsgeek</b><br><br>a) i was a scholar, which may or may not have colored my views re: resources; b) i was a heavily involved undergraduate that had very close relationships with administrators, students, student groups and all that had to offer; c) i did sponsored research (in a non physical science department) and had a very close relationship with multiple professors and many graduate students.<br><br>in the end my rosy-colored picture exists because my experience was pretty great, and better than expected. in part because i bought into what columbia has to offer and i see its strengths, in large part because i loved new york and the life of the city, but mostly because i never wanted columbia to be anything more than what it was- i didn't want it to be pton or dmouth or a LAC (if i did i would've chosen the half dozen LACs i got into, only to find their teaching and strength of faculty to be worse than columbia's). i liked being challenged by my peers, by the craziness of campus life, by the malaise that inevitably sets in when you live in ny too long. it was enthralling.<br><br>cce was tiny when i first went to columbia, but its budget has nearly tripled under dean sharma (the spec article on this is pretty good - <a href=\"http://www.columbiaspectator.com/2011/02/06/give-cce-due-credit\" rel=\"nofollow\">Give CCE due credit</a>). the amount of expenditures per student at the ugrad level has steadily increased, as has alumni giving which has for 8 years in a row exceeded the annual giving targed and vaulted columbia from low 20s in alumni giving to nearly equaling that of most schools (especially direct peers in terms of size being stanford/harvard/penn) if even not quite at dmouth and pton levels.<br><br>but i am also very realistic about columbia and what it can and should do. unlike you i don't think the answer is in study abroad opportunities or the dartmouth plan (we aren't dartmouth, our university isn't in the middle of nowhere). you can't have the core (which is one of the most expensive enterprises out there, and considered one of the best teacher training programs in the country making columbia grad students better teachers than almost any other institution) and spend tons of money on study abroad. i think international education is important, but i tend to side with the SEAS dean here and see if you can't make it so every student goes abroad for a summer and concentrate resources there than push for every student to go during the school year.<br><br>", "<b>Username: admissionsgeek</b><br><br>but as i said i am also probably more excited about columbia because of what is happening. if you follow the numbers and reorganization the way i have, there is a lot to be excited about. the amount of new money coming into the university, the way it has repositioned cc/seas at the center of the university. small things like the quigley endowment that often go unnoticed which are quickly giving undergrads today far more than we ever had. is it enough? not yet. but that is what continues to be exciting. imagine the university in 5 years when the b-school, sipa and soa are up in manhattanville and you have all that space to play with down at the mo-heights campus. there is a lot of untapped potential the uni and the ugrad schools are just tapping into.<br><br>at a certain point rationality goes out the window and you just have to choose to believe in something, an image or a fiction. we take all this data we see, facts and information, and in reality it is impossible for us to compare columbia and princeton. they are different institutions, with different strengths and goals. i would never want princeton to be columbia and vice versa. therefore the idea that somehow princeton is better than columbia, especially when so much raw data as well as anecdotal evidence could contradict that assertion, we ultimately have to choose to believe what reality we want. at times that involves projecting a past image onto the present - heritage, prestige and tradition. at times that involves projecting a future image - opportunity, possibility. regardless of what trope we use ultimately we choose how to handle this data - uneven measures that never line up correctly (you can't compare the wonders of nyc to the wonders of more money per pupil, the two are different scales), and we decide where our emotions lie.<br><br>you needn't be as rosy as i am, but you shouldn't take your own agency out of the picture. ultimately you are allowed to be as irrational and future focused as i am about columbia. or you can try to jam a tiger vision into a lion world.<br><br>", "<b>Username: jameschase</b><br><br>\"\"Princeton has produced 10x as many Rhodes Scholars and dozens of more influential politicians and ambassadors\"\"<br>Columbia procuded 10x more Nobel laureates than Princeton. Columbia also produced 4-5 US presidents and princeton produced only one.<br>\"\"This is not to mention tech tycoons like Meg Whitman (Ebay) and Jeff Bezos (Amazon) as well as investors like Carl Icahn.\"\"<br><br><br>According to Billiionaire University rankinby by Forbes, Columbia is #3 and Princeton is probably not even top 10. Wall Street is dominated by Columbia graduates as well.<br><br>Citi Bank CEO, Mongan Stanley CEO, one of the largest shareholder of Goldman Sach are Columbia Graduate ( warren buffet ) Princeton graduates not well respresentes at top management level at Wall Street.<br>\"\"Columbia is an incredible school but Princeton is the best undergraduate college on the planet.\"\"<br>The quality of Princeton undergrad students is below HY Columbia Stanford MIT Caltech.<br>Look at Princeton's Alumni, who are not simply as impressive as HY Columbia Stanford MIT Caltech.<br><br>", "<b>Username: jameschase</b><br><br>\"\"think Princeton has more resources\"\"<br><br>More resources are availabe for Columbai undergrads when applying for grad schools.<br>There are about 5x more Columbia undergrads at Columbia Law Med Business PhD programs because very strong preferences are given to Columbia undergrads.<br><br>Since Columbia Alumnus are more impressive and successful than Princeton grads, greate resources and opportunities are available for Columbia grad when applying for jobs<br><br>Columbia degree offers more opportunity than Princeton degree.<br><br>", "<b>Username: beard tax</b><br><br>Many of the billionaires on Forbes list as well as Wall Street professionals graduated from Columbia Business School, not from the undergraduate schools. The notable exception is Vikram Pandit, who graduated from SEAS with an EE degree as well as a Ph. D in finance.<br><br>In terms of the law school and business school, I think that the graduate schools actually don't give preference to undergraduates. The most well represented schools at CBS are unsurprisingly UPenn and Harvard by a wide margin. This is what I've heard as anecdotal evidence though CBS is trying to recruit more students from its own undergraduate schools.<br><br>Once again, Nobel Laureates don't have much to do with the quality of the undergraduate experience. Neither Stiglitz, Mundell, Phelps, etc. teach economics. The only superstar economist who teaches is Xavier Sala-i-Martin, who has a 300 person lecture.<br><br>This point is highly debatable, but I feel that the majority of Columbia alumni don't care about the school or undergraduates once they leave. Columbia students tend to be more independent and attached to NYC rather than the school or campus. The administration and bureaucracy engender quite a bit of dislike and annoyance. Columbia students don't feel as if the CCE, SDA, OMA, etc. (you get the point, lots of separate administrations) are here to help, but rather here to do the bare minimum so they don't get fired.<br><br>Once again, I think Columbia has had a wider impact on the world because it's a bigger school than Princeton and has law, business, social work, education, IR, etc. programs. If these resources came together and supported undergraduates, then Columbia would be a better environment. As it currently is, Princeton is hands down a better undergraduate experience. I don't know about Princeton, but the secretaries and administrators in the Registrar and the Center for Student Advising are outright mean. They've made fun of me for mishearing a question and will treat you incredibly rudely. The advisors and administrators are generally nice, but the system at Columbia just doesn't work well when it comes to supporting student groups and campus life events.<br><br>", "<b>Username: slipper1234</b><br><br>James Chase,<br><br>Its seems to me that perhaps you are an International student given your English. I believe that International students sometimes have a very different understanding of undergraduate quality, only because in the rest of the world graduate and undergrad quality is usually interchangeable. This isn't the case in the US, here they often are very different animals. Many of the numbers you cite reflect graduate student quality, not undergraduate quality (example Warren Buffet and James Gorman of Morgan Stanley went to Columbia Business School not Columbia Undergrad!)<br><br>For example, take placement into graduate and professional programs. Clearly this study isn't perfect, but it does reveal something: Half of the top 10 are very heavily undergraduate focused schools.<br><url>http://www.wsjclassroomedition.com/pdfs/wsj_college_092503.pdf</url><br><br>Not that this means that research Universities can't do well, but they often don't do as well as someone not as used to the US system might think. Grad schools can be an asset, but they also can be a distraction absorbing resources away from undergrads.<br><br>As for Columbia's legacy on Wall Street, it isn't better than Princeton (not that its that much worse, we're talking about two of the best schools in the US - both are feeders). If anything the top 3 schools are Harvard, Princeton, Wharton with Dartmouth, MIT, Stanford then Columbia and Yale right after this group. This I know from Direct experience and pretty much every experienced person in finance on these boards agrees with this.<br><br>As someone who has attended Columbia on two occasions, I do agree with almamater's assessment that Columbia lacks in some undergraduate focused qualities that certain students might very much appreciate. That said once again any Ivy puts you in the running to do almost anything so whether its undergrad focused Princeton/Dartmouth or research oriented Columbia/Harvard we're talking about the best schools in the world. Doors will be open for you.<br><br>", "<b>Username: admissionsgeek</b><br><br>i don't think xavier is quite a superstar either. until he publishes something new he is living in robert barro's shadow.<br><br>your anecdotal evidence about cbs seems off just from my own encounters with cbs, including talking with admissions people. i haven't heard it is wharton or harvard biased, and like columbia law and columbia med the largest cohort each year is usually made up of columbia students.<br><br>as for billionaire alums - most are cbs folks this is true, but what about the likes of kraft, kluge and speyer, all self-made billionaires, all graduates of columbia college. and perhaps even add randy lerner, whose dad (another cc alum) created the empire that he inherited and has since gone on to diversify.<br><br>chalfie has students work for him in his lab. stiglitz takes on students in his research group. mundell or phelps alternate leading a senior year course (phelps is teaching it this year). stormer teaches undergraduates, and for a few years led physics 1400 (and has students in his lab). kandel has undergrads working for him in his lab. pamuk co-taught a seminar for senior comp lit majors last fall.<br><br>but they are they are but a drop in the bucket of amazing profs that columbia has that are in fact hands on and accessible. my music hum teacher was president of the american ethnomusicology association; my lithum teacher is one of the leading philosophers of aesthetics in the world. perhaps not in the money disciplines - they are nevertheless creme de la creme of their own.<br><br>", "<b>Username: broski25</b><br><br>Well. Columbia is in the best city in the world and Princeton is in.....new jersey. Princeton is my dream school but as far as location goes, Columbia wins by far.<br><br>", "<b>Username: almamater</b><br><br>NYC is a great city, but is it the right place for college? The total lack of community compared to a place like Princeton wasn't worth the trade-off personally. And Princeton is one of the most beautiful towns in the US. Adding to this Princeton is maintained to one of the best standards of any school anywhere with gardens, fountains, beautiful facilities, and classrooms. Columbia is in dire need of a re-modeling. I swear my room in Ruggles should have been condemned.<br><br>", "<b>Username: almamater</b><br><br>Adding to this. I think it comes down to what is good for you personally. On one side you'll find its defenders such as Admissionsgeek and confidentialcoll and others. On the other side you will find those who were put off by its faults including myself, beard tax, truazn and others. I believe that to say Columbia is a polarizing experience is fair. I think one has to see whether its the right place for them.<br><br>", "<b>Username: admissionsgeek</b><br><br>alma - any experience could be polarizing! including princeton. i know many people who hated it. they considered it incredibly isolating, couldn't make friends in that culture. question: is the united states objectively a great country? ask that the world over and tell me you'll find a single answer.<br><br>part of being 'fair,' and i welcome the fact that you found faults with columbia, is a realization that your experience is a 'possible outcome' and not representative. it also means not edifying any other experience. that is and has always been my point on here.<br><br>because using words like 'total lack of community' is false, i mean intuitively and evidentially false. i could throw back into your face that columbia's urban campus is often lauded as the best maintained urban landscape among other accolades it has garnered. microarguments that are meant not to undermine your worldview, but to hopefully help people recognize that the visceral attack you make on columbia is one-sided...and then let the student decide who to believe.<br><br>what your argument ultimately comes down to is what does a student want his/her college experience to be like, and what is the most conducive experience for personal and professional growth. at times both of these answers might be obvious to a student, but usually it is not (we pretend we know what we want, but often it is the reflection of things that other people have told us). when you are deciding in april which school to attend there is no perfect science that will tell you where to go and what is the 'right' place. ultimately it is based on feel, a calculated guess.<br><br>but when you do end up at columbia and not princeton, the point is not to somehow dream and wish that you could've attended another school, but to find within your own experience everything you could've ever wanted. small things at times shape our memories of experiences - a break-up is enough to make us hate something in an irrational manner; a bad experience with a teacher; being recognized is enough to make us love an experience despite its faults. it is in part chance, and in part the domain of personal imagination/opinion.<br><br>it's what lets me be so positive about columbia...and yet not be wrong.<br><br>", "<b>Username: hsgirl93</b><br><br>hey...I don't really want to read through 8 pages of replies, but I just thought that you should know that you can't apply to Princeton early...they got rid of their early admissions option a while back. That said, you can apply to Columbia early as it's ED.<br><br>", "<b>Username: hsgirl93</b><br><br>nevermind...I just noticed you wrote this in 2006, so clearly that information isn't useful to you.<br><br>", "<b>Username: beard tax</b><br><br>I don't think Columbia has a sense of community. It comes down to a lack of space. Students can't book Lerner for fun events, the fraternities are closed off to non-members or other frats, and suites are only available to upperclassman. There are no sports teams to really rally behind.<br><br>My experience is a possible outcome but the faults that many of us have pointed out are incredibly common within the university.<br><br>admissionsgeek - I don't understand how you know that Columbia is changing. I've been here for 2 and a half years and have barely seen any changes. I'm also involved in student council and other clubs so I work with the administration and the ABC. I can't point to a single meaningful thing that Columbia has changed in the last several years to make the undergraduate experience better. Sure, they've added wireless to dorms and reworked the meal plan, but the fundamental need for advising and more space haven't been addressed.<br><br>", "<b>Username: joso2015</b><br><br>well, the manhattanville project appears to solve the space problem you addressed. by moving several graduate programs to the new campus, they'll have more undergrad space. now, that won't be up and running for quite some time, but eventually the problem may be solved.<br><br>", "<b>Username: slicedbread21</b><br><br>dude..im a freshman at columbia right now and I dont know where your from/went to school but your most definitely trollin/need to get out of your dorm and look around.<br><br>1) students do book lerner for 'fun events'. The freshman class council has already booked the lerner party space thrice for freshman class parties. Ive also been to Lerner for Diwali celebrations (indian festival of lights) and several dance performances (im in a dance team). In fact, we had Glasshouse Rocks last Thursday which had the whole of Lerner Hall packed with people, activities, live bands, free beer, dance performances and a party in the party space. So i really dont know what the f your on about!<br><br>2) No suites until your an upperclassman? are you serious? Carman? Hartley? Wallach? (thats 3 out of the 5 dorms open to freshman for housing) and i dont know about furnald but in all likelihood thats got suite style living too.<br><br>3) About advising: they recently opened a brand new office for the advising dept on lerner 4th floor. Sure, its still not the best advising dept in the world...but its a hella lot better than before.<br><br>4) Sports teams: the basketball and football games (last semester) have all had record turnouts at the home games. The football team did okay but beat Cornell for the Empire State bowl and hammered Princeton (the school most Columbia like to hate on). so yeah! We may not be the best..but were certainly not terrible enough not to cheer on. You were also obviously not one of the roughly 3000 people who packed Levien this weeknd for the basketball games against Princeton and Penn (lost to Princeton but beat Penn). Oh yeah..weve also beaten cornell and dartmouth.<br><br>most of your criticisms are redundant and false so i would suggest you quit the pretenses of being a columbia student/alum. the stereotypical criticisms of columbia about athletics/advising/community etc etc only make you sound terribly ignorant<br><br>", "<b>Username: beard tax</b><br><br>1) True, when I meant fun events, I thought about events with alcohol. There are several cultural events and dances for the classes, but the dances are held 1-2 times a year per class. In the grand scheme of things, I don't know if cultural and dance events are held that often compared to how much of Lerner is used for outside companies and student group meetings. I wish I could show the board what the Lerner space reservation system looks like and you could see how little of Lerner is used for entertainment. Hartley lounge is a poor substitute for a real student center.<br><br>2) Carman isn't suite style living. Hartley and Wallach are suites but barely have any privacy. Also, they happen to be dry dorms with extremely stringent noise policies. Try hosting more than 10 people there without an RA complaining.<br><br>3) A new office doesn't mean better advising. I think advising is the same as before, just more convenient to get to.<br><br>4) Nope. I didn't attend the games and didn't know many people who did. Maybe people are just closeted fans but students don't talk about the sports teams or really cheer them on.<br><br>I think most of your views come from being a freshman. This may be a high school forum, but 1 semester (let alone first semester) is not representative of an experience.<br><br>", "<b>Username: almamater</b><br><br>Ha yeah Carman \"suites.\" I don't think 2person doubles with cinder block walls from a temporary project from the 60's make the cut. And while I'll concede some of the cultural events at Columbia are super fun, I totally agree with beardtax that the fun happens a lot less than at peer institutions.<br><br>", "<b>Username: slicedbread21</b><br><br>well yeah..maybe carman suites dont really match up to your expectations of a 'good suite' but they are still suites.! 2 spacious doubles with a shared bathroom is really not so bad for freshman housing.<br><br>as for 'fun events': glasshouse rocks did have free beer (alcohol) but for most people its not an issue to pregame in a friend's dorm before heading out for a party. having alcohol available in columbia buildings simply does not make sense with a thousand students under-21 around. im sure harvard, princeton and yale dont have university sponsored on campus bars for all students or free wine at all cultural events held on campus.<br><br>once again, you really have to make the most of your experience here. but everything is offered to you to the same degree at any other peer college.<br><br>and beardtax, im sure people get busy going forth from freshman year but most of these events that ive attended were not restricted to freshman. the activities that ive been doing are definitely things i will be pursuing throughout college. The only difference maybe that Ill be staying a couple of blocks away from campus as opposed to staying on campus but im pretty sure that my experience at columbia (which has been phenomenal so far) will not see any drastic changes over the next few years.<br><br>", "<b>Username: Light Airen</b><br><br>slicedbread21, any suggestion between carman and furnald?<br><br>", "<b>Username: almamater</b><br><br>I would argue rather that a \"suite\" denotes a common shared living space, with a sofa and coffee table. From wikipedia: \"In addition to one or more beds and bedroom fixtures, a suite will include a living or sitting room\" Carman FAIL.<br><br>As for fun, the problem is that its incredibly fragmented as others have said. A few people at Havana, some at 1020, a few at EC parties, and frat brothers that stick to themselves. Not a huge social scene at all. So yes, you can drink. But not in a community environment like you can at pretty much every other top 10 school.<br><br>Maybe Columbia is a good fit for you and you don't need that level of community. But the first time I visited Princeton I was like \"wow I can't believe the whole campus actually hangs out together.\" Then I saw the same visiting Dartmouth, then at Brown, then at Harvard, then at Yale, then at Duke, and now at my law school's undergrad. There's something awesome about having a huge space, that students run, to hang out with other students in on a regular basis.<br><br>We have no off-campus house scene, no real dorm party scene due to crackdowns, no real frat scene (not like a real one), a pretty weak bar scene, oh and a nice community center where you can go to a cultural event once a month. \"Great.\"<br><br>Columbia is different, it might not bother you that much, but its different.<br><br>", "<b>Username: waitlistman</b><br><br>The recent posts are debates about Columbia between Columbia students. Perhaps the thread should be placed under Columbia, opinions from students and alumni on University. The whole thread bashing Princeton, even if in the satire news paper seems to me to be totally unnecessary and really serves not purpose but to demean all those involved in comparing two great colleges that are different in many ways but certainly not worthy of the type of bashing. And the Cornell West picture in the Columbia paper is surprising. He is one of the finest speakers I know of and is an asset every time he appears on Bill Maher, why Columbia new paper would choose to lampoon Cornell in a cartoon without stating the reason appears at the minimum to appear to be mean spirited. But hey, good luck if you guys think this is a productive thread...later...<br>I have to say, this does nothing to enhance the appearance of Columbia alumni or students to anyone on CC, excluding the more mature recent posters. No offense intended but it just seems like one of the more absurd threads I have come across..<br><br>", "<b>Username: admissionsgeek</b><br><br>so long, alma, as stating columbia is 'different' does not mean columbia is worse, then i am okay with your assesment.<br><br>i think it is a 'to each his/her own' kind of situation. and columbia offers a markedly different experience than its peer schools, such that when you note how you can have the same experience at yale, harvard, princeton, duke, dartmouth -- my mind begins to ask? so why would you choose any of those schools? but that is just how i think.<br><br>i agree that we have no off-campus house scene (if even some of my friends used to live on the other side of morningside park and that always was a hell of a party), but i don't know if that is bad. it means more people are in proximity. i don't agree that the bar scene is weak, only because my experience was that it was pretty great and easy to get into places and find your own spot. and then you had nyc if you really wanted a good time. i think the problem remains that you wish to compare columbia to other places - instead of concentrating on the things you can't do elsewhere that you can only do at columbia. i think when you reframe the focus of analysis, you come out with a 'different' answer.<br><br>not a better or worse one. in the end your education and experience at any top 10 school can be great, there is an incredible amount of agency we all have to make the most of what is given to us. and why i care a lot about columbia and columbia people is precisely because we have a shared experience, one that i view is a lot more 'real' in the sense that you battle obstacles and are forced to negotiate hazards. you become better for it, and you get to know your fellow students better as a result. and most of the hazards i don't blame the university for - because having lived in NYC afterward and with good knowledge of other universities they are common problems that most universities face. plus there is the extra cultural problem columbia butts up against because no matter how badly the university wants to give an entire building just for students to play in a) it is not cost-effective, b) there is not enough space. but maybe i am too sympathetic.<br><br>and beard: i can tell you small changes that have occurred over the past 10 years that show an incredible amount of changes by the university, perhaps insufficient, but the right direction. abc went from a bumbling behemoth to now a slimmer behemoth, the advisor:student ratio is way down, the central location of advising is great, the purchasing and distribution of spacing will only increase with mville.<br><br>and if you want to live in a suite, live in the LLC. common shared living. perhaps that is why i am so much more at peace with my columbia experience :)<br><br>", "<b>Username: pbr</b><br><br>I have tremendous respect for others' points of view. I'm sincerely confused, however, by the vehement criticism of Columbia and its community. With a community of several thousand undergraduates, I don't understand how Columbia is unable to provide the \"community\" or any other positive attribute that one might seek. (Ditto for any other similarly sized and endowed university.) If this were a small LAC, I could perhaps understand, although my older son has found his \"crowd\" and filled his interests at an elite midwestern LAC simply by looking.<br><br>These stereotypes are simply that: extrapolation of one's personal experience to all similarly situated (i.e., attending the same university). Columbia provides a myriad of lifestyles and opportunities to its students. My younger son, a Columbia frat boy and rugby player, has countless friends and \"party\" opportunities through his primary activities. He also has countless friends and opportunities that have no relationship to either frats or rugby. Why? Because he seeks them out, even though he doesn't have enough time to do so.<br><br>I sense a bit of laziness or thin skin among those who complain about Columbia (or any other similarly situated university). Advising may need improvement, student public space might be limited, huge parties may be lacking, Carman suites may lack a seating area, etc. So what? No place is perfect.<br><br>Since this is a thread dedicated (ostensibly) to differences between Columbia and Princeton, what about Princeton's grade deflation, eating club culture, New Jersey suburban location, etc.? Those may be faults, but who cares? Princeton is still a great school.<br><br>I know it's sappy, but also true, that happiness and contentment are states that are attained only if one decides to attain them. I hope my Columbia son never develops \"grass is greener\" syndrome with respect to his college experience. He's attending his first choice university, and I believe he will always think of it that way if he continues to surround himself with folks who are similarly happy to be there.<br><br>", "<b>Username: almamater</b><br><br>PBR, I think I know your son's type pretty well. He has a great group of friends through a sport, hangs out at his frat, and probably knows a fair amount of people that hang out at the Heights (the \"nice\" bar). A nice social scene, and in many cases he would probably have created a similar niche at other schools so his life may not have been that different at Princeton or Columbia.<br><br>My issue is that you have to basically the campus as a whole does not hang out together in the way that you can at other places, with parties that are open to the whole campus. Those of us looking for a broader college experience found it a little lacking in this dept. For those who are more comfortable in smaller groups, Columbia fits the bill because those students are going to hang out no matter where they are.<br><br>But if you are looking for a larger sense of community where you have deep connections to lots of people and places, the Columbia environment isn't built for that. We don't know each other broadly as classmates, but rather niche's within the University. This is different than other schools where there are locations where the entire school congregates, therefore forcing different people to interact.<br><br>", "<b>Username: slicedbread21</b><br><br>@light airen<br>carman was my first choice housing option but i dint get it. if your looking for a very social experience freshman year then I would definitely say Carman fits the bill. However, I will warn you that some of my Carman friends do complain that sometimes the social aspect can get a bit much and a lot of my Carman friends have gotten written up! (take that as you will)<br><br>I got a walkthrough double at John Jay which ive really come to love. You can get really tight with your floor and sometimes singles really really help when you want some privacy/need to get studying done etc. I certainly feel that John Jay is social to the perfect extent.<br><br>I honestly dont know much a bout furnald but it seems similar to Hartley and Wallach which seem like entirely different experiences due to the floor layouts.<br><br>", "<b>Username: slicedbread21</b><br><br>@pbr<br>im actually on the rugby team too! private message me your son's name cuz im pretty sure i know him.<br><br>@alma mater<br>Events which bring the entire freshman class together maybe fewer but not out of the question at Columbia. The Tree-Lighting ceremony definitely had a great turnout as did Orgo-Night in Butler. Also, all the freshman class parties that have been organized by the class-council had tremendous turnouts. (Nearly 600 people showed up for one).<br>There will always be social segments of a class and those who are more inclined to stay in and enjoy their tight-knit and smaller group of friends. Columbia has both (like most other places). Perhaps the administration doesnt 'force' all students to interact by holding massive concerts on South Lawns and Low Plaza but we have our fair share of community bonding events too!<br><br>The World Leaders Forum! no other peer college has anything like that..and tickets for these forums are booked out in minutes! Hundreds (maybe thousands) of students gather to hear these people speak and definitely interact!<br>Even more importantly: The Core Curriculum!! How many other colleges have an academic system where you can literally strike a conversation with someone you meet in the elevator about how depressing Augustine's confessions is or perhaps how much of a pain in the ass UWriting is. (Both of these are negative examples ofcourse and the Core has many admirers me being one of them) but the point is..its one of the most binding and unique hallmarks of the Columbia Undergraduate experience which no other school can boast off.<br><br>Maybe the Yale Green has bands and artists come and perform there which brings all the college kids together. But we have New York city and we could probably go downtown with a group of friends and watch a better band perform for a much better audience.<br>Princeton has most of its student body split up into elitist eating clubs? (really dont know how that fosters a sense of collective community)<br>Id prefer a group of friends with whom I head into the city and chill with at the bars around campus (Mel's, Campo, Abbee, The Heights etc) to that form of social restriction any day. And If I REALLY wanted to limit myself to a certain group of friends id go Greek. (Yes, Columbia has quite a few frats and even 4 sororities).<br><br>My point is, Columbia has everything any other place could offer and more. That doesnt necessarily make it better. But it most definitely doesnt make it worse.<br>Columbia is the one place where you can feel a part of a vibrant and inspiring academic community in Morningside Heights (soon to expand to include Manhattanville as well) as well as enjoy what is unarguably the greatest city in the world.<br><br>", "<b>Username: slicedbread21</b><br><br>If you digup some of my old posts on collegeconfidential youll know that Yale was my top choice. I was a big fan of the school pride and community there and absolutely loved the place. (Visited frequently since my sister went there).<br>I spent a lot of time on cc trying to learn more about Columbia before I came in as a freshman and became highly skeptical about the 'lack of community' before i even set foot here.<br>Sure, ive been here only 1 and half semesters but theres been absolutely nothing that I can get myself to feel unhappy about.<br>Youve got a reach out just a little (and sometimes even thats not necessary) and the Columbia community will most definitely reach out to you.<br><br>I love Columbia and I love New York!<br><br>(now im going to bed cuz I have an 8:45 am class where Jeffrey Sachs is gonna speak on the impact of the revolution in Egypt on the economy of Sub-Saharan Africa. =) =) :) :)<br><br>", "<b>Username: almamater</b><br><br>Slicedbread - I think you miss the point. This is an every night weekend thing, not a dance in Alumni Hall. Go to Harvard or Dartmouth on a given weekend, people are out and everyone knows there \"the party is.\" Columbia just doesn't have that, as you stated people will often go with a few friends downtown.<br><br>Not everyone wants this larger sense of community. I don't think it would probably matter to you as much, for example. But you can't deny its missing. I just don't think Bacchanal, the one day the whole year Columbia is out together, or orgo night counts to provide for a regular social life.<br><br>", "<b>Username: admissionsgeek</b><br><br>...a regular social life that lives up to the standards that i [almamater] have created.<br><br>'social life' is such a fluid idea, so is 'college life,' and 'normal college activities.' that when you use them as if they mean something it just shows a lack of rigor.<br><br>if you want to somehow tell me there is a standard and thereby 'good' social life, prove it. stop conflating your expectations with what exists at columbia.<br><br>", "<b>Username: admissionsgeek</b><br><br>alma-<br><br>i will take issue with this statement \"This is different than other schools where there are locations where the entire school congregates, therefore forcing different people to interact.\"<br><br>a) i have attended 'other schools' for graduate study<br>b) i have as you have visited 'other schools' to see my friends<br><br>so i will say<br>1) it is pretty much an impossibility to get to know everyone in your class if it is 1400 students large, it is an impossibility to formulate good relationships with a broad swath of people when the school is that large. and my friends who attended peer schools have no more or no stronger friendships with people from 'diverse' backgrounds as i do.<br>2) there are no physical spaces that i found other schools to have that were significantly better at creating a sense of community, though they did i feel have some signature events that i wish columbia could have. spring fling at penn is still a memorable moment. but i found yale to be too spread out to really have 'broad community building' as you state, and my friends at various colleges mostly kept to themselves and folks they knew in their own college. certainly not the standard you raise here. and friends from princeton that were in eating clubs stuck there, and those outside of eating clubs pretty much stood outside of that scene.<br>3) scenes and cliques and the like develop everywhere, it is how things operate, just ask aristotle. we formulate close circles of people, and our interpenetration is only as much as we are able to do. there are certainly some abstract notions of 'pride' that you might be referring to, but on a daily basis at whatever university you will as you have stated form a group of friends and that will often make or break how much 'fun' you have.<br><hr><br><br>to your columbia does not allow for community. i guess my response is not a party or alcohol in nature, so i am sorry if it disappoints you. but i am continuously impressed by the way campus lights up in the spring time and the number of people that congregate on the steps. there are some criticisms (the whole step thing is maybe 4-5 mths out of the long school year), but it is continuously one of the more swelling feelings i get and the rush when you walk onto campus. you go see your friends, your friends friends, people playing frisbee, folks playing soccer, others playing music. in a sense it is exactly as you put it - everyone doing their own thing. but everyone doing their own thing together.<br><br>and that is kind of an interesting take on community that i think defies the drone standard of a headless horde doing something at once, but not being themselves at the same time. and it does epitomize what is special about columbia and its 'community.'<br><br>", "<b>Username: slipper1234</b><br><br>My perspective: I transferred from Columbia to Dartmouth partly because of the social scene. While I felt Columbia had some community elements (much more so than NYU or BU), it wasn't enough on a regular basis for me. For example, I feel as if at Dartmouth it was the culture to know many people and I echo the points that Columbia can be more cliquey (note: some people don't mind this!). Also at Dartmouth there was just so much more sensory energy on a given night, this probably having to do with the campus-oriented vs. urban school environment. I actually attended the 5 year reunion at both schools, you just couldn't compare them. Dartmouth was an entire weekend with about 75% of the class attending and felt like a large wedding, where many many people knew everyone. Columbia's was a night in a tent, and had to be folded into other classes because only 150 or so showed up - then it filtered into a local bar. Just epically different.<br><br>That said community isn't a priority for everyone and for many Columbia offers enough. I do think, however, that its unfair to disparage those who have written that they wish there was more. There wasn't enough for me.<br><br>", "<b>Username: admissionsgeek</b><br><br>disparage is strong slipper -<br><br>i agree with a lot of your assessment, and i would love to see reunions become bigger deals, and so that is something i'm working for on my own reunion. though in the end i'd rather folks that want to be there be there so if it means my class isn't huge that's fine with me, so long as future classes are better.<br><br>and i think you went about everything well in your college choice and often reference you for students who are unsure or think about transferring to a different experience. but there is a difference between saying - 'hey this wasn't for me' and saying 'this is lacking.' because the latter is very presumptive. further i think people see community differently so when someone says 'oh if you don't want community, columbia is for you,' is dangerous. i think we should just clarify things better.<br><br>ultimately the student who chooses columbia will have a markedly different college experience than those who go to more LAC type schools, and there are advantages to both and disadvantages too. so i think once we start getting prospective columbia students in the right frame of mind to begin to ask appropriate questions - and not begin to create rather hazardous comparisons that will (as i was treated in high school) lead them to a) not seriously consider columbia, b) not make the most of it when they arrive. ultimately prospective students should treat columbia for what it is, and us alums and current students should use our efforts to make columbia what we want it to be. there is always room for improvement.<br><br>", "<b>Username: beautifulday</b><br><br>And for something positive and more representative of the Columbia community so many of us love. Vote!<br><br><a href=\"http://planetforward.org/idea/implementing-sustainable-sanitation-and-water-management-in-ghana/#comments\" rel=\"nofollow\">Implementing Sustainable Sanitation and Water Management in Ghana - Planet Forward</a><br><br>", "<b>Username: onecircuit</b><br><br>Columbia v. Princeton?<br><br>Columbia has been improving, but<br><br>Seriously?<br><br>There is nothing to debate<br><br>Nothing!<br><br>", "<b>Username: admissionsgeek</b><br><br>onecircuit - your comprehensiveness is truly appreciated.<br><br>", "<b>Username: slicedbread21</b><br><br>interesting article for the columbia - bureaucracy haters<br><br><a href=\"http://spectrum.columbiaspectator.com/spectrum/stop-whining-you-go-here-cureaucracy-edition\" rel=\"nofollow\">Stop whining, you go here (CUreaucracy edition) | Spectrum</a><br><br>", "<b>Username: dochouse</b><br><br>I am a graduate of Columbia undergrad and Dartmouth Medical School. I spent four years on both campuses and have many friends at both institutions.<br><br>Both are great schools. They are very different. There is no question that Dartmouth provides a more traditional college experience. Likewise, there is no question that Columbia has a more diverse and sophisticated student body.<br><br>Other Ivy League schools talk a great diversity game. Don't believe them. Columbia is one of the few Ivy's that is very diverse. This diversity comes from the combined undergrad, graduate and General Studies programs.<br><br>Choose the school you want based on the experience you want and you will be very happy.<br><br>", "<b>Username: onecircuit</b><br><br>\"\"Likewise, there is no question that Columbia has a more diverse and sophisticated student body.\"\"<br><br>dochouse, I could see \"more diverse\" but please explain to us why you are saying that Columbia undergraduates are more \"sophisticated\" than Darmouth undergraduates.<br><br>thanks<br><br>", "<b>Username: slicedbread21</b><br><br><a href=\"http://www.ivygateblog.com/2011/02/is-princeton-now-a-safety-ivy/\" rel=\"nofollow\">Is Princeton now a safety Ivy? > Admissions, Brown, Columbia, Cornell, Dartmouth, Harvard, Penn, Princeton, this is why people hate the ivy league, what hath god wrought | IvyGate</a><br><br>lol. love the title. =)<br><br>", "<b>Username: onecircuit</b><br><br>slicebread, Columbia's final acceptance rate for the class of 2015 will not drop to anywhere near the 6.9% level. It will range in the 8.5-9.5% level as they will find out that, due to the use of the Common Application for the first time, many HYPSM applicants who didn't apply to Columbia previously now applied to Columbia this year - forcing Columbia's yield to drop and thereby pushing Columbia into having to admit more students than previous years.....hence the 8.5-9.5% level for the acceptance rate.<br><br>", "<b>Username: slicedbread21</b><br><br>@ one circuit<br><br>i highly doubt that.<br>several schools (columbia, hypsm and especially duke) keep several students on the waitlist in anticipation of fluctuating yields.<br>waitlist numbers are not in any way used to reflect the admission rate as such. (weird? i know..but thats the way it is)<br>admissions rate can only really increase if columbia chooses to increase its class size.<br><br>furthermore..waitlist numbers can run into several hundreds, maybe thousands (just look at duke's waitlist numbers from last year!) and can more than compensate for a slight and surely even a major drop in yield. will columbia put more people on the waitlist? probably/maybe<br><br>having said that though, i dont see columbia'a yield decreasing. sure, the commonapp was a major factor in more people easily applying to columbia. but lets not undermine the fact that columbia has also had a great year!! (manhattanville, noco building, better stats, us news rank 4 etc etc) things which do garner a lot of positive attention.<br><br>i wouldnt be surprised if a few more people chose columbia over a princeton/yale/stanford (harvard still unlikely) than before. :)<br><br>", "<b>Username: confidentialcoll</b><br><br>@onecircuit, Columbia's yield might actually go Up because of usnews. its pretty much a guarantee that Columbia's acceptance rate will end at 7.5% or under this year. in order to hit 8.5% they'd need to take over 500 people off the waitlist, so your estimation is completely off.<br><br>in terms of acceptance rate, Princeton has been relegated to 4th in the ivies this year, nothing is going to change that, it's no wonder they're scrambling to reinstate EA.<br><br>", "<b>Username: admissionsgeek</b><br><br>a) admissions folks do a lot of predictive modeling about what might occur, so they have a good idea of what to expect and average decreases in going to the common app.<br><br>b) admissions wouldn't 'pre-admit' students based on fear of how the common app would work out, but probably would be conservative and plan to take kids off the waitlist<br><br>c) admit data never includes waitlist activity, just the standard of practice<br><br>d) needing to admit 500 kids off the waitlist would be so absurd (it would mean that of the kids admitted regular only 300 students accepted offers) that it is a silly thought onecircuit.<br><br>e) a better prediction would be that columbia admits the same 2400 it has the past 2 years and will be between 50-100 students short and go to its waitlist. which means the 'official' admit number will still be 6.9%, and even if we take into consideration the worst case waitlist number it would still only be 7.2%. (columbia admitted ~100 students off the waitlist in 2008 as a result of the harvard/princeton situation in which columbia underadmitted out of concern for the fact that many h/p students would be in their app pool that would not have been before, last year columbia went minimally to the wait list, and has seen an increase in yield).<br><br>", "<b>Username: onecircuit</b><br><br>\"\"the waitlist in anticipation of fluctuating yields.<br>waitlist numbers are not in any way used to reflect the admission rate as such. (weird? i know..but thats the way it is)\"\"<br><br>slicebread, you are again wrong here....the kids that get in through the waitlist are counted as part of the accepted students, that is why a school's acceptance rate goes up from the initial count - Princeton's class of 2014 went from 8.18% to 8.7% after the waitlist kids were let in, for instance...<br><br>", "<b>Username: onecircuit</b><br><br>\"\"@onecircuit, Columbia's yield might actually go Up because of usnews. its pretty much a guarantee that Columbia's acceptance rate will end at 7.5% or under this year. in order to hit 8.5% they'd need to take over 500 people off the waitlist, so your estimation is completely off.\"\"<br><br>confidentialcoll, sorry but for the reasons that I stated earlier, Columbia's yield for the class of 2015 will DROP from that of the class of 2014.<br><br>", "<b>Username: onecircuit</b><br><br>\"\"in terms of acceptance rate, Princeton has been relegated to 4th in the ivies this year, nothing is going to change that, it's no wonder they're scrambling to reinstate EA.\"\"<br><br>confidentialcoll, huh?<br><br>the class of 2015 acceptance decisions for the Ivy league schools have not come in yet and you are already putting the Ivy League schools in order of acceptance rate?<br><br>again, please remember that Columbia's yield is going to drop considerably due to the fact that a big chunk of the increased applications are from kids that also applied to HYPSM and Columbia is going to lose the majority of these cross admits.<br><br>", "<b>Username: onecircuit</b><br><br>\"\"c) admit data never includes waitlist activity, just the standard of practice\"\"<br><br>admissionsgeek, you are wrong here. Final admittance rates for college always take into consideration the admits that come in from the waiting list.<br><br>", "<b>Username: admissionsgeek</b><br><br>really? do you know something i don't know? so you're telling me that the data that usnews uses includes waitlist? sorry i am pretty sure (99.9%) that is not true. but i welcome you to PROVE me wrong, and not just claim i am wrong. show me an admit rate that is used (especially on the level of a data collecting agency - usnews, etc) where admit inclusive of waitlist activity is used. it isn't not because that rate is more appropriate, but just SOP for colleges. it is the reason that columbia's admit rate in 2009 was inclusive of waitlist lower than princeton, but the cited number was higher because pton went heavier to the waitlist that year.<br><br>lastly, your response to concoll is ridiculous. the dailybeast, a major international news blog, wrote that. concoll was just quoting.<br><br>", "<b>Username: confidentialcoll</b><br><br>onecircuit, you're digging the hole deeper:<br>\"\"Princeton's class of 2014 went from 8.18% to 8.7% after the waitlist kids were let in, for instance...\"\"<br><br>Princeton has very little certainty after doing away with their early program, they need to rely heavily on their waitlist.<br>\"\"confidentialcoll, sorry but for the reasons that I stated earlier, Columbia's yield for the class of 2015 will DROP from that of the class of 2014.\"\"<br><br>ok Nostradamus, want to predict the direction of the price of oil in a month as well? Just because Columbia had more applicants you need to say that the yield will drop?<br><br>onecircuit argues: Columbia's yield will Drop, I'm guaranteeing it.<br><br>confidentialcoll argues: Columbia yield might drop, but it could also rise. We have a variety of conflicting factors here, pushing the yield up and down. Either way Columbia will not take nearly close to 500 kids of the waitlist such that their acceptance rate is on par with princeton's.<br>\"\"the class of 2015 acceptance decisions for the Ivy league schools have not come in yet and you are already putting the Ivy League schools in order of acceptance rate?\"\"<br><br>how much do you want to bet that Princeton is going to have a higher acceptance rate this year than Y and H and Columbia before and after waitlist activity?<br><br>Acceptance rate has always been almost entirely dependent on the number of applicants. If you look at the yield for the past 10 years for Columbia it has hardly changed and in fact increased a little over time.<br><br><br>Onecircuit's claim was: Columbia's acceptance rate will go from 6.9 --> 8.5%+ as a result of waitlist activity.<br><br>When you make an absurd claim it's better to retract it than to keep fighting for it after someone has shown why it's absurd.<br><br>", "<b>Username: onecircuit</b><br><br>confidentailcoll, first please find my post where I stated this. You can't because I never said what you claim that I said:<br>\"\"Onecircuit's claim was: Columbia's acceptance rate will go from 6.9 --> 8.5%+ as a result of waitlist activity.<br><br>When you make an absurd claim it's better to retract it than to keep fighting for it after someone has shown why it's absurd.\"\"<br><br>then after it is proven that you are again wrong, I will comment on each of your childish ridiculous statements.<br><br>", "<b>Username: onecircuit</b><br><br>\"\"really? do you know something i don't know? so you're telling me that the data that usnews uses includes waitlist? sorry i am pretty sure (99.9%) that is not true. but i welcome you to PROVE me wrong, and not just claim i am wrong. show me an admit rate that is used (especially on the level of a data collecting agency - usnews, etc) where admit inclusive of waitlist activity is used. it isn't not because that rate is more appropriate, but just SOP for colleges. it is the reason that columbia's admit rate in 2009 was inclusive of waitlist lower than princeton, but the cited number was higher because pton went heavier to the waitlist that year.<br><br>lastly, your response to concoll is ridiculous. the dailybeast, a major international news blog, wrote that. concoll was just quoting.\"\"<br><br>admissionsgeek, seriously?...are you really attempting to prove a point by quoting a second source such as USNWR?...why don't you go to the direct source - the university...<br><br>look at what each university/college initially announced in acceptance rate then look at what each university finally uses for the acceptance rate after all the waitlist kids are admitted....<br><br>then come back and apologize<br><br>", "<b>Username: onecircuit</b><br><br>\"\"Acceptance rate has always been almost entirely dependent on the number of applicants.\"\"<br><br>confidentialcoll, please please please tell me that you are kidding on this...<br><br>", "<b>Username: admissionsgeek</b><br><br>yeah - i know what unis quote, perhaps because i know more about admissions than you do. are you an admissions officer? otherwise sit down. i know what columbia/penn/brown use and what pton has used in the past. but that's just my folly for paying attention.<br><br>", "<b>Username: onecircuit</b><br><br>\"\"d) needing to admit 500 kids off the waitlist would be so absurd (it would mean that of the kids admitted regular only 300 students accepted offers) that it is a silly thought onecircuit.\"\"<br><br>admissionsgeek, I am sorry but I never said this....if you can find where I said this then please copy/paste the exact language, otherwise you have been found to have posted yet another lie....<br><br>", "<b>Username: onecircuit</b><br><br>\"\"yeah - i know what unis quote, perhaps because i know more about admissions than you do. are you an admissions officer? otherwise sit down.\"\"<br><br>admissionsgeek, why lie?<br><br>you don't know who I am so why in the world would you EVER say that you know more about admissions than me...<br><br>just the fact that you are quoting USNWR and not directly from the colleges themselves shows a bit about your knowledge of the admissions data.<br><br>lets start with one college: Princeton<br><br>find the initial acceptance rate quoted by Princeton<br><br>then<br><br>find the final acceptance rate quoted by Princeton after all kids were admitted from the waiting list<br><br>are they different?<br><br>according to you only the first acceptance rate would be used, yet if you look at all the references to Princeton's acceptance rate you would find that it refers to the acceptance rate AFTER ALL WAITLIST KIDS ARE ADMITTED - this is the acceptance rate for Princeton that will be used for the next 100 years and not the initial acceptance rate that you claim (without the waitlist kids taken into account)..<br><br>I will be waiting for your figures...<br><br>", "<b>Username: admissionsgeek</b><br><br>you quoted columbia's admit rate at 8.5-9.5%, did you not? prove that you didn't?<br><br>", "<b>Username: onecircuit</b><br><br>\"\"you quoted columbia's admit rate at 8.5-9.5%, did you not? prove that you didn't?\"\"<br><br>admissionsgeek, why lie again?<br><br>seriously guy, why lie?<br><br>the beauty of message boards is that you can copy/paste and prove your point. Please copy/paste where I said what you claim I said....you can't because I never said that...<br><br>geesh, this is getting embarrassing for you....<br><br>", "<b>Username: admissionsgeek</b><br><br>so princeton, inclusive of waitlist activity admitted 9.93% to columbia's 9.82 (as cu didn't go to the waitlist that year).<br><br>yet most places will quote 9.79%<br><br><a href=\"http://www.dailyprincetonian.com/2009/04/01/23213/\" rel=\"nofollow\">Admission rate rises to 9.79 percent for Class of 2013 - The Daily Princetonian</a> (2009 for class of 2013)<br><br><a href=\"http://www.princeton.edu/main/news/archive/S27/01/56K06/index.xml?section=topstories\" rel=\"nofollow\">Princeton University - Princeton makes offers to 8.18 percent of applicants, strengthens aid</a> (2010 showing class of 2013)<br><a href=\"http://books.google.com/books?id=TXSRvghgRdkC&amp;pg=PR39&amp;lpg=PR39&amp;dq=princeton+2013+9.79&amp;source=bl&amp;ots=5hcr9hkg5m&amp;sig=FSNVlUeotqVPx8eHQu76Shft4no&amp;hl=en&amp;ei=oddoTaK0N9K5tgfu_oTmAg&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=1&amp;ved=0CBMQ6AEwADgK#v=onepage&amp;q=princeton%202013%209.79&amp;f=false\" rel=\"nofollow\">The Half-Opened Door: Discrimination ... - Google Books</a><br><br><a href=\"http://www.hernandezcollegeconsulting.com/ivy-league-admission-statistics-2013/\" rel=\"nofollow\">Ivy League Admission Statistics for Class of 2013 Hernandez College Consulting, Inc. and Ivy League Admission Help</a> (only place to quote the official number of 9.93, but hernandez consulting is known to not follow official numbers by schools).<br><br>need more?<br><br>", "<b>Username: onecircuit</b><br><br>\"\"you quoted columbia's admit rate at 8.5-9.5%, did you not? <b>prove that you didn't?</b>\"\"<br><br>admissionsgeek, geesh please tell me that you really didn't just say this?<br><br>are you really asking me to <b>PROVE AN EVENT THAT DID NOT OCCUR</b>?<br><br>are you really asking me to do this?<br><br>", "<b>Username: admissionsgeek</b><br><br>okay:<br><br>\"slicebread, Columbia's final acceptance rate for the class of 2015 will not drop to anywhere near the 6.9% level. It will range in the 8.5-9.5% level as they will find out that, due to the use of the Common Application for the first time, many HYPSM applicants who didn't apply to Columbia previously now applied to Columbia this year - forcing Columbia's yield to drop and thereby pushing Columbia into having to admit more students than previous years.....hence the 8.5-9.5% level for the acceptance rate.\"<br><br>", "<b>Username: onecircuit</b><br><br>admissionsgeek SERIOUSLY?<br><br>YOU ARE NOW MIXING CLASS OF 2013 AND 2014 FIGURES FOR PRINCETON IN THE SAME CONTEXT TO PROVE YOUR POINT?<br><br><url>http://talk.collegeconfidential.com/12062008-post166.html</url><br><br><br>are you serious?<br><br>do you really have any idea of how silly your are looking here?<br><br>geesh!<br><br>", "<b>Username: admissionsgeek</b><br><br>i know how silly i look, you know why? because i aint looking silly at all. continue...on your fake rant.<br><br>", "<b>Username: onecircuit</b><br><br>admissionsgeek, I will make it simple for your. This is your post that includes my quote:<br>\"\"okay:<br><br>\"slicebread, Columbia's final acceptance rate for the class of 2015 will not drop to anywhere near the 6.9% level. It will range in the 8.5-9.5% level as they will find out that, due to the use of the Common Application for the first time, many HYPSM applicants who didn't apply to Columbia previously now applied to Columbia this year - forcing Columbia's yield to drop and thereby pushing Columbia into having to admit more students than previous years.....hence the 8.5-9.5% level for the acceptance rate.\"\"\"<br><br>Now please show me where I state that the Columbia acceptance rate is 8-5-9.5% in the text above. You can't because I never said it and the text above proves that I never said it.<br><br>truly truly amazing!<br><br>", "<b>Username: admissionsgeek</b><br><br>\"Columbia's final acceptance rate for the class of 2015 will not drop to anywhere near the 6.9% level. It will range in the 8.5-9.5% level as they will find out that\"<br><br>", "<b>Username: admissionsgeek</b><br><br>show me how to read your english. evidently, i should have taken more than 12 years of classes on grammar to learn how to understand that the 'it' you are referring to is not 'columbia.'<br><br>", "<b>Username: onecircuit</b><br><br>\"\"i know how silly i look, you know why? because i aint looking silly at all. continue...on your fake rant.\"\"<br><br><br><br>so admissionsgeek, when you mix class of 2013 with 2014 figures before and after waitlist, yet the correct way is to look at the <b>same year</b> for before and after waitlist, are you sure that you aren't looking silly here?<br><br>geesh, this is getting stranger and stranger<br><br>oh, wait you must be from Columbia....okay, I get in now<br><br>nevermind<br><br>", "<b>Username: onecircuit</b><br><br>\"\"\"Columbia's final acceptance rate for the class of 2015 will not drop to anywhere near the 6.9% level. It will range in the 8.5-9.5% level as they will find out that\"\"\"<br><br>admissiongeek how convenient that you drop that last part of my post....again, please tell me where I state that Columbia's acceptance rate is 8.5-9.5% here:<br>\"\"\"slicebread, Columbia's final acceptance rate for the class of 2015 will not drop to anywhere near the 6.9% level. It will range in the 8.5-9.5% level as they will find out that, due to the use of the Common Application for the first time, many HYPSM applicants who didn't apply to Columbia previously now applied to Columbia this year - forcing Columbia's yield to drop and thereby pushing Columbia into having to admit more students than previous years.....hence the 8.5-9.5% level for the acceptance rate.\"\"\"<br><br>the fact is that you can't because I am giving my opinion, that based on the information that I stated, Columbia's acceptance rate rate could fall in that range.<br><br>no where, and I mean no where did I state that Columbia's acceptance rate was 8.5-9.5%...<br><br>but wait, you are a Columbia student...never mind...<br><br>", "<b>Username: onecircuit</b><br><br>\"\"so princeton, inclusive of waitlist activity admitted 9.93% to columbia's 9.82 (as cu didn't go to the waitlist that year).\"\"<br><br>admissionsgeek, is there something wrong with you?<br><br>Princeton's acceptance rate was not 9.93% this year....maybe if you took the time to review Princeton's Common Data Set for the fall 2010 entering class (class of 2014) you would understand this:<br><br><url>http://registrar.princeton.edu/university_enrollment_sta/common_cds2010.pdf</url><br><br>next, are you sure that Columbia did not let any students in this year from the Waiting List?<br><br>hiint: does the number \"75\" sound familiar?<br><br>", "<b>Username: admissionsgeek</b><br><br>i am talking about for the class of 2013. was that clear? i used that year because it was the year that columbia was on april 1, 2009 at 9.82 to princeton's 9.79. princeton went to the waitlist and cu did not. meaning that cu had a lower admit rate (after waitlist activity), but no one mentions this in the press or anywhere.<br><br><br>---<br><br>columbia's admitted rate COULD NOT fall to the range of 8.5-9.5% it would require columbia having a yield in regular decision of 38% compared to its normal 58% yield. it would require such a world that stating it is impossible.<br><br>to cite figures.<br><br>columbia admits ~2400 students past two years, i'd say that is predictable for its class size of 1400-1450 students. ~1800 are admitted regular. ~1800 are CC admits, ~600 are SEAS admits, total.<br><br>for columbia for the class of 2015 to have an 8.5% admit rate inclusive of waitlist activity (a number that only boring hacks in institutional research offices use, and not used by folks like COFHE, journals like JBHE, CHE).<br><br>at 34,587 undergrads if columbia admits regular 2400, it will have an admit rate of 6.94%. if columbia goes to the waitlist for 100 students (the most it has ever gone to the waitlist was in 2008 (class of 2012) was for 130 students), its admit rate would be 7.23% inclusive of waitlist activity (still lower than yale). if columbia equals its worst yield (as in worst predicted yield) it would admit 130 during waitlist and thereby have an admit rate of 7.31% inclusive of waitlist activity.<br><br>if columbia has the worst year ever, and therefore has 260 spots open in the class (or twice its worst predicted yield ever), it would admit a total of 2660/34587 = 7.69%.<br><br>if columbia has its worst worst year ever, or after the 600 students that are already in the class in early (or approximately 900 spots open in regular) it would require for columbia to have an 8.5% admit rate inclusive of wait list activity that only (out of the 1800 regular admits) 300 students accept the offer. if 300 students accept the offer of admission (leaving 500 spots still left to fill in the class) columbia's yield after regular would be 900/2400 total admits, or ~38%. columbia has been around 55-60% for the better part of the last decade.<br><br>your scenario is so impossible, that it is laughable that you don't realize it so. but yes, if columbia admits a total of 2900/34587 = 8.38% or close to your 8.5% number.<br><br>", "<b>Username: pwoods</b><br><br>Onecircuit, you argued that due to Columbia's yield falling drastically, the admissions rate for the Class of 2015 will not be 6.9% as others have calculated, but 8.5-9.5%. Adgeek, Conncoll, myself, and even The Daily Beast believe that is very unlikely, but you are entitled to your opinion. But that is your opinion; you've stated it. If you would like to amend, do so, but don't claim that you didn't say it. The record shows you think Columbia's yield will decrease to the point that the admissions rate for 2015 will be above 8.5%. Maybe you'll be right!<br><br>", "<b>Username: onecircuit</b><br><br>Lets take a look at what kind of yield is needed for Columbia University to obtain the same number of students for Class of 2015 as it has for Class of 2014, namely 1,422 Freshmen, based on a total of 34,587 applications and different acceptance rates:<br><br><br><b>Applications--Acceptances--Acceptance Rate--Enrolled-Yield</b><br>34,587--2,398--6.90%--1,422--59.3%<br>34,587--2,594--7.50%--1,422--54.8%<br>34,587--2,940--8.50%--1,422--48.4%<br>34,587--3,168--9.16%--1,422--44.9%<br>34,587--3,286--9.50%--1,422--43.3%<br><br>note:<br>According to Columbia, Class of 2014 acceptance rate = 9.16% and yield = 59.3%<br><br>", "<b>Username: admissionsgeek</b><br><br>and your point onecircuit?<br><br>further - yield is calculated using the number of actual regular students admitted and those that accept, usually, but there are some folks that will calculate and use the total yield inclusive of waitlist activity. but the one flaw would be the presumption then is that yield on waitlist students would be 100%. i didn't include waitlist activity, hence how i got to my 38% number instead of the 48.4% number you list. i was asking, myself, how low would the yield have to be for you to need to admit another 500 students. when you ask a different question, you get a different number.<br><br>but i still don't get how you think your scenario - columbia admitting between 500 and 800 more students - is a reasonable estimate.<br><br>i will concede here that i should've been more forthright with clarifying that i was excluding waitlist numbers because it is just SOP to do so.<br><br>", "<b>Username: onecircuit</b><br><br><b>Columbia's REAL acceptance rate and yield for the class of 2014 after the 75 wait list kids were added</b>:<br><br>Applications - 26,179<br>Acceptances - 2,472<br>Enrolled - 1,422<br><br><b>Acceptance Rate = 9.44%<br>Yield = 57.52%</b><br><br>here is where you find that the NYTimes, after careful consultations with Columbia shows the 75 kids added from the waitlist:<br><br><url>http://www.columbia.edu/cu/opir/abstract/admissions_all.htm</url><br><br><a href=\"http://www.studentaffairs.columbia.edu/admissions/applications/stats.php\" rel=\"nofollow\">Admission Statistics | Columbia University Office of Undergraduate Admissions</a><br><br><br>even though all the first class institutions such as Harvard, Stanford, Princeton and Yale adjusted their initial admit and yield rates in order to account for their wait list kids that were added to the freshman class......<br><br>", "<b>Username: admissionsgeek</b><br><br>onecircuit -<br><br>you hate on columbia despite the fact that it clearly states \"as of May 1, 2010.\" and on the OPIR site it states \"Final enrollment figures may differ slightly from those reported here.\"<br><br>how is that false advertising?<br><br>", "<b>Username: onecircuit</b><br><br>\"\"further - yield is calculated using the number of actual regular students admitted and those that accept, usually, but there are some folks that will calculate and use the total yield inclusive of waitlist activity.\"\"<br><br>admissionsgeek, the absolute only correct way to calculated acceptance rate and yield is to include all the kids that got admitted into the class from the waitlist. To do otherwise is considered sleazy and unethical. All the first class institutions do it the proper way. If you don't believe that this is the right way, figure out how a college can game the system by waitlisting a significant amount of students that they are going to admit normally....take some time to think about it then I will show you if you can't figure it out.<br><br>", "<b>Username: admissionsgeek</b><br><br>sleazy and unethical by whom? are you an admissions professional?<br><br>not all corporations use the same accounting principles, does that make one corp better than the other.<br><br>", "<b>Username: onecircuit</b><br><br>\"\"onecircuit -<br><br>you hate on columbia despite the fact that it clearly states \"as of May 1, 2010.\"<br><br>how is that false advertising?\"\"<br><br>admissionsgeek, I am sorry but what part of<br><br><b>\"Date: November 17, 2010\" </b><br><br>do you not understand here?:<br><br><url>http://www.columbia.edu/cu/opir/abstract/admissions_all.htm</url><br><br><br>you have been so so so wrong in just about every fact that you have presented about Columbia and other schools, that it is not even funny any more. Stop embarrassing your school.<br><br>", "<b>Username: admissionsgeek</b><br><br>did you know that harvard admits a number of students each year that they offer 'deferred admission,' usually legacies or folks that would hurt their numbers.<br><br>those students a) don't count for the year they apply, b) don't count toward the year they enter.<br><br>if you talk about sleazy and off the books, that is far more problematic. but i am sure you didn't know that.<br><br>", "<b>Username: admissionsgeek</b><br><br>\"Final enrollment figures may differ slightly from those reported here.\" what about this is not clear?<br><br>you are funny, and in the laughing at you kind of way.<br><br>", "<b>Username: admissionsgeek</b><br><br>if you don't plan on reading my posts, then don't respond. it makes you look hasty and ill-prepared.<br><br>", "<b>Username: onecircuit</b><br><br>ha!...so Columbia, as of February 27, 2011, is still using old admissions stats as of 9 months ago, May 1, 2010, even though those stats are no longer valid and should be absolutely updated...<br><br><a href=\"http://www.studentaffairs.columbia.edu/admissions/applications/stats.php\" rel=\"nofollow\">Admission Statistics | Columbia University Office of Undergraduate Admissions</a><br><br>unbelievable!<br><br>", "<b>Username: admissionsgeek</b><br><br>ok, tell columbia they should update it. if your problem is the fact that an office that just got 32% bump in admissions has decided not to update its website, that is a weak argument.<br><br>", "<b>Username: onecircuit</b><br><br>so admissionsgeek, tell us again how you were falsely claiming and claiming and claiming that Columbia would have to drop its yield to 38% in order to result in an 8.5% acceptance rate for the class of 2015, even though you were completely and utterly proven 100% wrong in this analysis:<br><br><url>http://talk.collegeconfidential.com/12067126-post179.html</url><br><br>", "<b>Username: pwoods</b><br><br>Onecircuit, your analysis makes no sense. In order to get a 43% yield, you assume that Columbia will accept 3,200 students. They're going to accept 2,400 or 2,500, as they do every year. There is no reason to think they'll accept an extra 800 students. Given around 2,500 acceptances, the yield would have to be below 40% for the admissions rate to be 8.5%. Admissionsgeek is therefore correct.<br><br>", "<b>Username: celloman369</b><br><br>For all who are arguing acceptance rates, here is a link to an article that will hopefully dispel some rumors about updated admission statistics and who really does have the lowest acceptance rates: <a href=\"http://www.thedailybeast.com/galleries/2655/1/?redirectURL=http://www.thedailybeast.com/blogs-and-stories/2011-02-24/2011-college-admission-rates-rankings-for-30-schools/\" rel=\"nofollow\">Difficult Colleges - Galleries - The Daily Beast</a><br><br>", "<b>Username: admissionsgeek</b><br><br>\"further - yield is calculated using the number of actual regular students admitted and those that accept, usually, but there are some folks that will calculate and use the total yield inclusive of waitlist activity. but the one flaw would be the presumption then is that yield on waitlist students would be 100%. i didn't include waitlist activity, hence how i got to my 38% number instead of the 48.4% number you list. i was asking, myself, how low would the yield have to be for you to need to admit another 500 students. when you ask a different question, you get a different number.\"<br><br>when you are done with your reading assignment, please report back.<br><br>", "<b>Username: admissionsgeek</b><br><br>i will also make a clarification for onecircuit, using actually his own argument.<br><br>\"Applications--Acceptances--Acceptance Rate--Enrolled-Yield<br>34,587--2,398--6.90%--1,422--59.3%<br><br>Class of 2014 acceptance rate = 9.16% and yield = 59.3%\"<br><br>but as he himself notes, columbia admitted 75 kids off the waitlist, it would mean then that a) it admitted 2473 students, b) its yield would be 57.5% in that case.<br><br>ultimately the real question is what is the class size of columbia following students who ask to defer admission, which i am going to guess is 40 kids, which indeed gives us the yield rate of 59%, and yet the enrolled class of 1422.<br><br>for those of you keeping score at home, this means that on may 1, columbia would've had 1347 students confirm in an admitted class of 2398, or a yield only of 56% following the regular cycle.<br><br>", "<b>Username: onecircuit</b><br><br>\"\"For all who are arguing acceptance rates, here is a link to an article that will hopefully dispel some rumors about updated admission statistics and who really does have the lowest acceptance rates: Difficult Colleges - Galleries - The Daily Beast\"\"<br><br>celloman - huh?<br><br>what in the world are you talking about?<br><br>this doesn't dispel and acceptance rate rumors.<br><br>the fact is that acceptances at these top schools listed, including Columbia, have not been announced yet. All the link that you provide shows is the projected acceptance rate based on the current amount of applications and last years number of students that were accepted, nothing more nothing less. Not taken into account are the number of increased applications that Columbia has received due to the Common Application <b>that came from the HYPSM schools</b>, most of which will not chose Columbia, thereby significantly lowering Columbia's yield and forcing it to accept more students than last year....<br><br>", "<b>Username: slicedbread21</b><br><br>@one circuit<br><br>quit being a jackass and get a life.<br>your a new low even for the extreme columbia haters on cc.<br><br>well see what the admissions numbers are in a few months and you can whine about something new then alright? quit trying to enforce a highly unrealistic, hypothetical situation which hasnt happened yet.<br><br>how does it even bother you so much if columbia's admit rate drops below princeton's?? you spend days on end on cc trying to prove that this will not happen to assert that one school (that you dont attend) may be in some vague way better than another school (that you dont attend).??<br><br>kudos to you for being the most annoying and obnoxious poster on this thread. but stop. seriously.<br><br>", "<b>Username: onecircuit</b><br><br>It is very simple folks. As stated before, part of the increase in applications to Columbia this year is from the HYPSM schools that previously used Brown and Cornell as the fallback Ivy league applications and did not bother with Columbia. Now that Columbia is using the Common Application, students that applied to HYPSM will use Columbia as the fallback school and when accepted to both, will undoubtedly go to HYPSM, thus reducing the yield for Columbia and forcing Columbia to increase the number of students that it accepts from the 34,587 applications for the Class of 2015.<br><br>If you don't believe this, just look at the combined increase in applications for Brown and Cornell this year. It was very small, 1.1% :<br><br><u>Brown and Cornell Applications</u><br>66,474 - Class of 2014<br>67,173 - Class of 2015<br>1.1% - Percent increase from Class of 2014 to Class of 2015<br><br>Overall, Applicatons to the Ivy League plus Stanford and MIT increased an average of 10.0% from the Class of 2014 to 2015. Had Brown and Cornell had an average 10.0% increase in applications for the class of 2015, it would have had 5,916 more applications. These applicitions essentially went to Columbia and a big part of them were from HYPSM applicants that did not apply to Columbia in 2014. Most of these Columbia/HYPSM cross-admits will go to HYPSM thereby lowering Columbia's overall yield.<br><br>", "<b>Username: onecircuit</b><br><br>\"\"@one circuit<br><br>quit being a jackass and get a life.<br>your a new low even for the extreme columbia haters on cc.<br><br>well see what the admissions numbers are in a few months and you can whine about something new then alright? quit trying to enforce a highly unrealistic, hypothetical situation which hasnt happened yet.<br><br>how does it even bother you so much if columbia's admit rate drops below princeton's?? you spend days on end on cc trying to prove that this will not happen to assert that one school (that you dont attend) may be in some vague way better than another school (that you dont attend).??<br><br>kudos to you for being the most annoying and obnoxious poster on this thread. but stop. seriously.\"\"<br><br>slicebread, Columbia continues to falsely report their acceptance figures. Admissionsgeek continues to post false and misleading information on just about everyone one of his posted messages. I have pointed this out. I have also given my opinion that a decent increase of applications to Columbia was caused by HYPSM and therefore Columbia's yield will drop this year, thereby forcing Columbia to admit more students than last year. That is all, no more no less.<br><br>", "<b>Username: admissionsgeek</b><br><br>i think post 198 was really the kicker on here, it shows just how little onecircuit knows about columbia (most commonapp switches improves the bottom quintile numbers, but usually not the most admissible students, i am sure he/she doesn't know this). my reason i kept on posting was because i actually do know a bit about admissions and wanted to impart that knowledge onto our friend, which seems to be a losing battle.<br><br>anyhow with post 200, let us leave him/her to have a debate with him/herself that ever approaches the absurd.<br><br>onecircuit - usually the way you know you have won a debate is when people believe you, when folks think you're crazy, it is a kind of a good metric to know you've failed.<br><br>", "<b>Username: pbr</b><br><br>What I don't understand about onecircuit is that his/her positions reflect the type of Princeton \"homerism\" one usually finds in Princeton students or alums, but his/her argumentative style reflects more of a novice high school debater. For example, if he or she believes use of the Common Application will cause Columbia's yield to drop, why not provide evidence of yield reduction for each of Harvard, Yale or Princeton for the year of adoption of the Common Application by that institution? If he or she were to provide that information, we would have something to analyze. Mocking condescension rarely works.<br><br>As an aside, as both Columbia and Princeton used the Common Application this year, I wonder what onecircuit believes is the reason why Columbia received substantially more applicants than Princeton?<br><br>", "<b>Username: onecircuit</b><br><br>\"\"i kept on posting was because i actually do know a bit about admissions and wanted to impart that knowledge onto our friend, which seems to be a losing battle.\"\"<br><br>admissionsgeek, ha!<br><br>your posts pretty much show your knowledge of the admissions process and your false and misleading statements further underscore the lack of knowledge in this area.<br><br>Say, tell us again how you falsely claim that waitlist kids that are admitted should not be counted by a University when calculating the acceptance rate and yield. Maybe you can show further support for your arguments by mixing in class of 2013 and 2014 figures in the same post as apples and oranges in a failed attempt to prove another point:<br><br><url>http://talk.collegeconfidential.com/12062016-post169.html</url><br><br>", "<b>Username: onecircuit</b><br><br>\"\"What I don't understand about onecircuit is that his/her positions reflect the type of Princeton \"homerism\" one usually finds in Princeton students or alums, but his/her argumentative style reflects more of a novice high school debater. For example, if he or she believes use of the Common Application will cause Columbia's yield to drop, why not provide evidence of yield reduction for each of Harvard, Yale or Princeton for the year of adoption of the Common Application by that institution? If he or she were to provide that information, we would have something to analyze. Mocking condescension rarely works.\"\"<br><br>pbr, sure no problem, except Harvard, Yale and Princeton aren't used as the fallback Ivy League college as Columbia, Brown and Cornell are.<br><br>", "<b>Username: onecircuit</b><br><br>\"\"As an aside, as both Columbia and Princeton used the Common Application this year, I wonder what onecircuit believes is the reason why Columbia received substantially more applicants than Princeton?\"\"<br><br>pbr, again sure no problem, as soon as you explain the same for Columbia v. NYU and Boston University. Do you honestly think that receiveing more applications makes you a better University?<br><br><u>Class of 2015 Applications</u><br>42,242 - NYU<br>41,734 - Boston University<br>.<br>.<br>.<br>34,587 - Columbia<br><br>", "<b>Username: admissionsgeek</b><br><br><url>http://talk.collegeconfidential.com/12062008-post166.html</url><br><br>where in this post do i talk about class of 2014?<br><br>but let me teach you something here that schools with a stronger humanities component educate their students (even engineers).<br><br>a) someone cannot 'falsely claim' that something 'should not' happen. once you say should, you are not making a claim, but stating an opinion.<br><br>so which was it, was i making claims or stating an opinion.<br><br>b) my stance: universities OFTEN DO NOT include waitlist numbers in their admit rates, they don't include that number when they have to often submit it to other agencies. and there is nothing as far as i know from NACAC (the body that oversees college admissions), or more specialized groups like COFHE (that oversees admissions/financial aid for 30 schools that are truly full-need/need blind for domestic students), by accrediting agencies (regional or national). the admit rate as of may 1 is often the number cited by newspapers. that is my stance, it is standard and normal for folks to do so throughout higher education.<br><br>Rule #2 for losing an argument: when someone has to change the argument in order to try and salvage something, for instance proclaiming that i was mixing class of 2014 with 2013 when i never did anything of the sort, shows desperation.<br><br>", "<b>Username: admissionsgeek</b><br><br>onecircuit -<br><br>would receiving more applications make your institution more 'desirable'?<br><br>please elaborate the concept of the 'fallback' ivy. how long has it been around? who created the word? does it appear in any scholarship? how large of a phenomenon is it, as in how many students can be affirmed to apply to an ivy league school simply as a fallback? would you classify students that only apply to columbia in ED as using it as a fallback ivy, would you classify students that only apply to cities as using columbia as a fallback ivy? what are the limits of your use of the term?<br><br>", "<b>Username: onecircuit</b><br><br>admissionsgeek this is your post where you AGAIN refuse to admit that you mixed 2013 figures with 2014 figures:<br><br><url>http://talk.collegeconfidential.com/12070522-post205.html</url><br><br>and here is the EXACT QUOTE FROM YOU whereby you use 2014 figures in the middle of all the Class of 2013 figures - something which you are DENYING that you did:<br><br>\"\"<a href=\"http://www.princeton.edu/main/news/archive/S27/01/56K06/index.xml?section=topstories(2010\" rel=\"nofollow\">Princeton University - Princeton makes offers to 8.18 percent of applicants, strengthens aid</a> (showing class of 2013)\"\"<br><br>If you were a little smarter, you would read the link that you posted and see that the 8.18% acceptance rate was reported initially for the Class of 2014 and NOT THE CLASS OF 2013.<br><br>therefore you have been caught in yet another lie...<br><br>geesh, this is just getting too easy, much too easy<br><br>", "<b>Username: onecircuit</b><br><br>\"\"b) my stance: universities OFTEN DO NOT include waitlist numbers in their admit rates, they don't include that number when they have to often submit it to other agencies.\"\"<br><br>admissionsgeek, other than Columbia, why don't you tell us what other unversities don't adjust their accepatnce and yield rates after admitting students from the waitlist. According to your post above their must be hundreds of them. So please show us which ones. It would be interesting to see what other universities are intentially misleading the public with their acceptance and yield figures.<br><br>", "<b>Username: admissionsgeek</b><br><br>hahahaha<br><br>dude did you read the actual daily princetonian article, did it not state 9.79% for the class of 2013. i never mixed anything up. you live in another world.<br><br>i just wanted to prove that your school's newspaper was using the as you state wrong admit rate.<br><br>", "<b>Username: onecircuit</b><br><br>\"\"please elaborate the concept of the 'fallback' ivy. how long has it been around? who created the word? does it appear in any scholarship? how large of a phenomenon is it, as in how many students can be affirmed to apply to an ivy league school simply as a fallback? would you classify students that only apply to columbia in ED as using it as a fallback ivy, would you classify students that only apply to cities as using columbia as a fallback ivy? what are the limits of your use of the term?\"\"<br><br>admissionsgeek, ha!...you are kidding right?<br><br>", "<b>Username: overachiever92</b><br><br>^ You two should get a room, even though there's an age difference...<br><br>", "<b>Username: admissionsgeek</b><br><br>if you're going to uncritically use a term, you should properly contextualize it, sorry if you're not ready to party with the big boys yet.<br><br>", "<b>Username: slicedbread21</b><br><br>@onecircuit<br>\"therefore you have been caught in yet another lie...\"<br><br>...<br>...<br>...<br><br>seriously?<br><br>neways...im just gonna play along to make you happier and pull you out out of your misery.<br><br>WAY TO GO DETECTIVE!!<br>Your logic is obviously impeccable...<br><br>", "<b>Username: onecircuit</b><br><br>\"\"hahahaha<br><br>dude did you read the actual daily princetonian article, did it not state 9.79% for the class of 2013. i never mixed anything up. you live in another world.<br><br><b><u>i just wanted to prove that your school's newspaper was using the as you state wrong admit rate</u></b>.\"\"<br><br>jesus admissiongeek, what is wrong with you?<br><br>the Daily Princetonian on April 1, 2009 BEFORE THE WAITLIST KIDS WERE ADMITTED used the initial admit rate of 9.79%. This is what is responsible thing to do SINCE THE ADMIT RATE FROM WAITLIST was not known at the time.<br><br>Now if you look at later communciations from the Unversity, you will see the final acceptance rate used by Princeton for the class of 2013....<br><br>THIS IS EXACTLY the point that I am trying to make that Columbia unethically is failing to do...<br><br>geesh, this is really getting embarrassing for you and your college<br><br>", "<b>Username: admissionsgeek</b><br><br>does princeton news not state the 2009 (or for class of 2013) admit rate is 9.79% on april 1, 2010, or a year after the fact?<br><br><a href=\"http://www.princeton.edu/main/news/archive/S27/01/56K06/index.xml?section=topstories\" rel=\"nofollow\">Princeton University - Princeton makes offers to 8.18 percent of applicants, strengthens aid</a><br><br>\"In the most selective admission process in the University's history, Princeton has offered admission to 2,148, or 8.18 percent, of the record 26,247 applicants for the class of 2014. This compares to an admission rate of 9.79 percent at this time last year, and 9.25 percent the previous year.\"<br><br>", "<b>Username: iceui2</b><br><br>Can we just say that Princeton &amp; Columbia are both beast schools and move on? I think we can.<br><br>You're welcome.<br><br>", "<b>Username: columbiastu12</b><br><br>As a current student, I do not know that much about the projected acceptance and yield rates for this year and future years. Both schools are incredibly competitive to get into (have ridiculously low admissions rates) and have very high yield rates. If you are making a decision between both schools, congratulations!! It is not a bad problem to have. I think it is silly to make your decision based on admissions stats or yield rates. These rankings/rates will change every year. Ultimately, you want to choose a school where you think you will be happy and thrive.<br><br>During my senior year, I was faced with similar issues and it can definitely be stressful. You are deciding where you will spend the next four years of your life and that is definitely a big decision to make. Luckily, it is hard to go wrong. I can honestly say I have had an incredible experience at Columbia. One of my best friends goes to Princeton and she has had a great time there.<br><br>Many people on this board have raised issues about difference in community and under/grad focus at both institutions. In terms of undergrad/grad focus, Princeton is largely an undergraduate campus. Columbia does have graduate schools (we have the top law, medical, business, dental, journalism etc schools in the country). Graduate students have not been a big part of my experience on campus. My classes have largely been comprised of undergraduate students. Student spaces like Lerner are dominated by undergraduate students. Graduate students live off campus and often have their own separate set of professors/classes. Particularly as a junior, when I have been thinking about graduate schools and post-college plans, however, Columbia's graduate schools have played more of a role in my life. For example, the economics society sets up a mentorship program with business school students that have had experiences on Wall Street . Students can explore different graduate school options if that is something they are interested in. I have found Columbia's graduate schools (especially since they are some of the best in the country) to serve as an great resource to the undergraduate population (my friend has been able to gain clinical experience useful in preparing her for the med school application process because of Columbia's Medical school).<br><br>In terms of community, my favorite part of Columbia's campus life is its activity. There is never a dull moment on campus. There will always be some sort of talk, cultural show, protest that is happening. One thing I can promise you is that you will never be bored. Because of everything going on around campus, I barely leave the Morningside Heights area (some students are better about exploring the city than me. Especially when it gets cold, I get a bit lazy haha). We have the traditional Greek college scene. Students especially when they start living in suites after their freshman year tend to host parties. You will meet a diverse group of students upon coming to Columbia and you won't be confined to one social group/activity, which I love. Columbia does not have the same kind of community as one might find at a state school, but it definitely has a strong community. Everyone is incredibly proud of their school and proud to be here.<br><br>Hope this helps!<br><br>", "<b>Username: onecircuit</b><br><br>\"\"does princeton news not state the 2009 (or for class of 2013) admit rate is 9.79% on april 1, 2010, or a year after the fact?\"\"<br><br>admissionsgeek, seriously?<br><br>Is there something to the statement<br><br>\"This compares to an admission rate of 9.79 percentat <b><u>this time last year</u></b>\"<br><br>that you really don't understand?<br><br>Princeton is correctly comparing the admit rate for the class of 2014 to that of 2013 as of the time the initial admit rate was announced and before the waiting list students were admitted for both years, in order to compare apples to apples...<br><br>seriously, there is something wrong with you when it comes to reviewing these things<br><br>", "<b>Username: onecircuit</b><br><br>columbiastu12, excellent post<br><br>thanks<br><br>", "<b>Username: monydad</b><br><br>Re #198:<br>\"..look at the combined increase in applications for Brown and Cornell this year. It was very small, 1.1% \"<br><br>I don't know anything about what's going on with Brown. But as for Cornell, It seems likely to me that applications were negatively impacted by adverse publicity surrounding the tragic suicide cluster that occurred there, which followed multiple years with no such incidents whatsoever.<br><br>Moreover, from 2001-2 to 2009-10 applications to Cornell increased by over 108%; the next greatest increase in the Ivy League was Yale at 77%. They are already getting over 36,000 applicants, and the national pool is no longer growing, so at some point the numbers will be hard to increase. Maybe that time has come earlier for Cornell than for some other schools, due to its greater increase in applicants during the prior period.<br><br>IIRC, during the prior admissions cycle, Yale applications were stagnant or declined.<br><br>", "<b>Username: onecircuit</b><br><br>monydad, Cornell with the one or two suicides - applications become stagnant, Yale with the one or two murders - applications become stagnant, and then there is Columbia where a student-run drug distribution ring gets uncovered and the applications go up by 35%..Go figure.<br><br>", "<b>Username: joso2015</b><br><br>^hell yeah.<br><br>", "<b>Username: admissionsgeek</b><br><br>onecircuit - news broke after most kids would've begun their applications, plus columbia isn't the first school with a drug bust, and the drug bust at cornell a few days after columbia was far bigger (<a href=\"http://www.huffingtonpost.com/2010/12/21/cornell-student-arrested-_n_799561.html\" rel=\"nofollow\">Cornell Student Keri Blakinger Arrested After Drug Bust Yields $150K In Heroin</a>).<br><br>beyond this - i have never seen a study that has measured attitudes of applicants after murders/suicides, etc. so i think we shouldn't yet make the claim that it is a reason for rise or fall. i am not saying it is not a possible reason, just that i think we need actual research and not speculation on the issue.<br><br>", "<b>Username: monydad</b><br><br>you may feel you need it, but you won't get it. There were no surveys conducted, studies, etc. of why someone did or did not apply, at least that have been, or will be, made public. So all there's left to do is speculate.<br><br>Personally I think it's a more reasonable explanation than the previously-advanced substitute of Columbia as Princeton's b**ch,<br>but if you have more affinity for the prior explanation the two of you are free to hold that viewpoint. Since there is, actually, no research available on the topic.<br><br>", "<b>Username: onecircuit</b><br><br>admissionsgeek, personally I find it hard to believe that applications would drop at a school because of a kid jumping into the Cayuga Waters or a lab assistant getting murdered in the school labs. But parents are strange in this way.<br><br>", "<b>Username: monydad</b><br><br>I can tell you that significant levels of concern were raised, at the time, on the CC Cornell sub-forum and also elsewhere on CC, FWIW.<br><br>", "<b>Username: beard tax</b><br><br>nanaba, where did you get the numbers on how many students from CC/SEAS attend graduate schools at Columbia or other institutions and could you post the link? Thanks, I've been looking for information on what the graduating class does.<br><br>", "<b>Username: StarsAligned</b><br><br>What about Columbia's MBA?<br><br>", "<b>Username: slipper1234</b><br><br>Nanaba's numbers seem totally off to me. Princeton does exceptionally well at graduate placement. Choosing Columbia over Princeton because you think its going to get you into a better grad school is probably the most ridiculous argument I've seen on CC. If anything its the other way around.<br><br>", "<b>Username: admissionsgeek</b><br><br>the pton numbers are from that page for sure, but that is also from a self-reported survey, so that is far from everyone. and then the issue of class size, where columbia is slightly bigger. and just going to grad school doesn't say which grad school you go to.<br><br>i'd agree, at present, princeton has better g-school placement. but things can change.<br><br>", "<b>Username: onecircuit</b><br><br>here you go<br><br>this might give you some idea of Princeton v. Columbia in terms of getting into top Business, Medical and Law graduate schools:<br><br><url>http://wsjclassroom.com/pdfs/wsj_college_092503.pdf</url><br><br>", "<b>Username: admissionsgeek</b><br><br>onecircuit, that is fair, i will say however that the schools they have chosen are slightly suspect.<br><br>\"So for medicine, our schools were Columbia; Harvard; Johns Hopkins; the University of California, San Francisco; and Yale, while our MBA programs were Chicago; Dartmouth's Tuck School; Harvard; MIT's Sloan School; and Penn's Wharton School. In law, we looked at Chicago; Columbia; Harvard; Michigan; and Yale.\"<br><br>why not sbs or sls? reasonable questions to ask. for law, why not nyu (which i know at least something like 30 kids from my class have attended) instead of mich or even columbia. so the selection would change things - for all the schools.<br><br>also of note \"Our team of reporters fanned out to these schools to find the alma maters for every student starting this fall, more than 5,100 in all. Nine of the schools gave us their own lists, but for the rest we relied mainly on \"face book\" directories schools give incoming students.\"<br><br>so let's not make a jump to conclusions mat. the biggest problem i have with the data is that what if you take 2 years off from school, does wsj (which i doubt) take that into effect, are they just referring to those who graduate (which would matter). you might find some schools more than others lead students to take time off or not. then there is the overall problem of who attends graduate schools, or who feels they need to attend graduate school.<br><br>but overall, as i've said before, i think you'd be hard pressed to say that the pton student doesn't, at present, do better than columbia when applying to graduate school, the wsj's bad survey or a more comprehensive or real one would affirm. it is just that it is not a) the whole story, b) doesn't mean it will always be the case.<br><br>", "<b>Username: admissionsgeek</b><br><br>and, not to belabor this point too much. it includes cc/seas/gs. gs students of course go to top grad programs, but a) it is not necessarily allowing one to compare apples to apples, b) many gs students i knew of were not necessarily hunting to go to pay more in debt again by going to grad school.<br><br>", "<b>Username: onecircuit</b><br><br>admissionsgeek, thanks for the info<br><br>", "<b>Username: slicedbread21</b><br><br>@one circuit<br><br><a href=\"http://www.columbiaspectator.com/2011/03/30/cc-admit-rate-drops-64-percent\" rel=\"nofollow\">Columbia College admit rate drops to 6.4 percent</a><br><br>what was that you were saying about columbia's admission rate again??<br><br>sucks to look like a ***** when reality hits you square in the chest doesnt it?<br><br>", "<b>Username: sour_lemon_1k</b><br><br>i wish columbia ppl would stop toting around that statistic. columbia only had a sharp rise in applicants b/c a) they allowed for the commonapp this year and b) they spent more on advertising than any of the other comparable schools. i mean, i've gotten 35 emails in my inbox during the application season from columbia alone. and i hear they keep sending emails to those admitted like every single freaking day. sounds like they're desperate, really.<br><br>", "<b>Username: admissionsgeek</b><br><br>a) but princeton already uses the common app and other schools, so how is this relevant. it means columbia is catching up.<br><br>b) prove it. seriously prove it. you can't because admissions office budgets are not publicly available, so stop saying things. columbia like most schools buy student names and they are often not responsible for the direct contact with students, but third parties do it for them. so your many emails may even be your fault for signing up for multiple lists than columbia's fault. ever thought of that?<br><br>anyhow great post!<br><br>", "<b>Username: JacobianNite</b><br><br>Yes, I agree that the statistics is rather flawed. First, they based the survey on just one year. Also, the more liberal arts focused colleges (with negligible engineering population) seems in general to situate on the top: this simply means that more liberal arts students are applying to Law Schools, Business Schools, and Medical Schools than engineering students, which is as expected. Therefore, the survey does not speak to the quality of the education. Third, you notice that the numbers for the top dozen schools (with similar student composition with respect to liberal arts vs engineering students) are very closely lumped (ex: Harvard, Princeton, Stanford, Yale; the liberal arts sister schools; Duke, Columbia, Dartmouth, MIT), so any statistical fluctuations could have yielded different results for the schools in each of these groups. The ranking also penalizes schools with more international students, because a large sum of these students would probably return to their home countries for Professional Schooling (Especially law schools). The survey also favors smaller schools, because a difference of 1 student (due to statistical fluctuations from year to year) could boost the percentage for the smaller school much more than the larger school; think about this like the game of rolling a dice and predicting its outcome. If you roll the dice fewer times, you get more fluctuations in probability.<br><br>This study to me is more like a publicity stunt than a reputable research conclusion.<br><br>", "<b>Username: phantasmagoric</b><br><br>To be honest, in the end, it doesn't matter what the acceptance rate is, or even how strong the applicant pool is (assume that Columbia is attracting the same proportion of strong students as HYPSM, and the recent boost in applications isn't all just weak applicants with no chance). What matters is where the strongest students attend, and the reality is that almost all the students admitted to Columbia and one or more of HYPSM will choose not to attend Columbia (at Stanford &lt;2% of the students who choose not to attend end up at Columbia, and I have a feeling that figure is even smaller for East Coast schools). That's the functional equivalent of having a lower selectivity. So the admit rate, no matter how artificially low, becomes useless.<br><br>I also think that's why P is the least selective of HYPSM. Princeton's yield is comparable to Columbia's because most of the cross-admits that it loses are to HYSM (and it loses to all of them). So that means the pecking order goes something like HYSM (not in order), Princeton, then Columbia. But it's a big deal for any school to be butting into HYPSM, so Columbia should be proud of that.<br><br>", "<b>Username: quantman</b><br><br>I would be more circumspect when making sweeping statements such as \"less than 2 % of cross admits choose Columbia\"..Making claims such as these without any basis reduces the value of forums such as these. Forums should be used to advise and support high school applicants with life-forming decisions..not table-thumping or wild assertions.<br><br>The only statistical way to study cross-admits would be a count of wait-list admissions by these schools. The hypothesis being that a cross-admit choosing between the HCYSP schools (those with less than 9% acceptance rate) would create a vacancy. Ultimately all these decisions would end up with the worst-off school ending up with taking the most students off the wait-list. The school which does the best will end up taking the least off the wait-list.<br><br>Instead of making claims out of the blue, I invite someone to post this information for the Ivies and SM. If I am not wrong, Columbia ended up taking no one off its waitlist. Princeton ended up taking 146 off its wait-list.<br><br>What this means is that Princeton used up all its 'excess', that is candidates in excess of the number of seats who were offered spots and then dipped down into its waitlist to fill the spots that were still available because of candidates who turned it down. If you assume that all these candidates took up an offer from one of the others you can form a better idea of how it did against all the others. By any reckoning, Columbia has fared extremely well in the cross-admit fight.<br><br>", "<b>Username: admissionsgeek</b><br><br>quant:<br><br>here is access to the report that says stanford only loses 2% (of all the students it loses) to Columbia. it is unclear how many it loses head to head.<br><br><a href=\"http://mathacle.blogspot.com/search/label/HYPSM%20Cross-Admit%20Data\" rel=\"nofollow\">Mathacle's Blog: HYPSM Cross-Admit Data</a><br><br>i still question how stanford arrives at this data (and its accuracy) because of what i know about admission statistics sharing and the legality of what would need to happen to share this information would involve breaking FERPA to create a common data set.<br><br>it does however, from a stanford perspective, give a good barometer of how things are going. that they only lose significantly to HYPM. it should not, however, be treated as gospel because there are some serious concerns with data collection.<br><br>i don't doubt that it is close to the truth (columbia is not outstripping stanford on head to head battles - about 200 or so students are admitted to both schools, though unclear how many of those are SCEA admits that columbia didn't really stand a chance on), but i think more information would be needed for us to call it the Truth.<br><br>and as for columbia's yield, it has steadily begun to increase. before when seas used to lose all students to mit and stanford for engineering, this stopped about 4 years ago and it is rising. like stanford should feel good about its progress, so should columbia. the last time cross admit data went public for all schools using an academic data set (the princeton article) columbia was losing to brown, and i doubt that is the case now. hopes of course remain that columbia will eek into the 60s+ over the coming years.<br><br>the one thing that we should always say to qualify stanford is that as amazing as it is it has something that no east school has: the west coast. it creates a level of difference that always makes it impossible to compare apples to apples.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"I would be more circumspect when making sweeping statements such as \"less than 2 % of cross admits choose Columbia\"\"<br><br>Sorry, I didn't predict that others would think that's just a \"wild assertion.\" It comes from data released by Stanford's admissions office: &lt;2% of the students who chose not to attend Stanford attended Columbia. I assume that that number would be even smaller for HYP, because they're geographically closer to Columbia.<br><br><url>http://talk.collegeconfidential.com/stanford-university/1118844-stanford-harvard-yale-princeton-mit-others.html</url><br>\"\"The only statistical way to study cross-admits would be a count of wait-list admissions by these schools.\"\"<br><br>Actually, how the admissions offices do it is by collecting data from the students who turn them down (when you decline your spot in the class, they ask you where you're attending). The admissions offices at different colleges then trade their data to do cross-admit analysis.<br><br>It doesn't make sense to look at the waitlist for cross-admit analysis, because a college can simply avoid taking any off the waitlist by accepting more people initially. If it's afraid that it might over-enroll (say, it just announced a new financial aid policy, and it's not sure how that might affect the yield), it'll accept fewer people initially, just to be sure, and then accept some off the waitlist. But if they weren't being so cautious in the first place, they would not have had to take any off the waitlist. So waitlists aren't helpful here.<br><br>", "<b>Username: phantasmagoric</b><br><br>By the way, the only way that the above data is \"suspect\" is if the students are lying when they say they're attending X when they turn a college down. But I doubt that's possible, since the colleges likely trade lists of names as well to verify. Considering that the top schools have been analyzing cross-admits (by trading their collected data) for many years, I have a feeling they have this down to a science, and it's pretty statistically accurate.<br><br>I seriously doubt that any of this is illegal or against any regulation, even trading names (e.g. how else would colleges enforce the ED policy if they can't mention student names?). It's for purely statistical purposes only, not for collusion or anything of the sort.<br><br>", "<b>Username: admissionsgeek</b><br><br>phantas: they don't trade names though. i know this for a fact. and the issue with ED students is handled case-by-case, and only on the rarest of cases will a university consult another university, when someone goes beyond the pale. almost always the responsibility for following the ED agreement is on the student. as far as i know, the sharing of ED names hasn't occurred for over 5 years.<br><br>ex. stanford would admit someone who does ED to columbia because the onus is on the student to not keep other applications open; stanford would just presume the student was not an ED admit. if someone lets the cat out of the bag - let's say a student tells their counselor, or tells someone while they are visiting stanford, then it is possible action could be taken against the student by both schools. but all schools with ED policies always account for a reasonable number of cheats who will just not come even though they signed an agreement. in cases where a student is known to be playing two hands, usually because someone informs, then maybe there is some communication, but columbia would choose to rescind their admission irrespective of whether or not stanford (or the other school) would comply with NACAC rules on the subject. each school decides on their own.<br><br>", "<b>Username: admissionsgeek</b><br><br>so the question as to how accurate the information is still up for grabs. as i said, i don't want to say it is widely inaccurate, it is probably close to the truth, but it doesn't say the whole story.<br><br>there are a lot of students that NEVER tell a school they are coming or not coming even though it is good etiquette to let all schools know of your decision to register.<br><br>", "<b>Username: quantman</b><br><br>Thanks for clarifying the source of the 2 percent number.<br><br>I do not understand at what point does a student tell a school that he/she is turning them down to go to another. It could be if the student was bargaining with different schools for aid. Otherwise unless Stanford does it with every student that it accepts...i fail to see how it collects good data. My son was accepted at nearly all the schools he applied to and being the lazy/nice chap he is, did not bother to tell of the schools he was not going to. Many of them did send reminders, some did call but Stanford certainly did not hear back from him.<br><br>I do agree that being the only beauty queen on the west coast has a powerful attraction. Surf, sand and sun are three more powerful incentives. And its leaders have displayed tremendous foresight and vision over the last fifty years while Columbia's slept on the job. It has very good financing: you can get more from Stanford than from any east coast school if you have gotten into a good ivy.<br><br>For a engineer, accepting Stanford over an east coast school would be very understandable for these reasons. But things are moving on. The nature of research is shifting away from Stanford's traditional strengths and the computer industry is now less about hardware than about monetizing existing knowledge. Here New York which is the center of the advertising, consumer,entertainment industries is the place where companies such as Google are hiring and relocating offices to. Columbia is well-placed to nudge Stanford out as Stanford did to it.<br><br>While Stanford should continue to do well, I do see less of a future for the traditional undergraduate liberal arts schools such as Princeton and Yale.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"they don't trade names though. i know this for a fact.\"\"<br><br>How do you know this?<br><br>Even if they didn't trade names, that still doesn't call the validity of the data into question, because if there were a few students who lied, it wouldn't make much of a difference. Plus, even if students were to lie, it would only make that number smaller--i.e. a student lying and saying they're going to Columbia when they're not. Even if students are lying to Columbia and saying they're going to Stanford when they're not, that just changes the cross-admit % (i.e. who wins more cross-admits; and I've never made any claim about that), but the # students who choose Columbia over Stanford is the same: it's still fewer than 13. Also, I honestly doubt that there's a significant number of students at Columbia who didn't bother to reply to Stanford's offer or who lied.<br><br>All this is immaterial to me, because I'm pretty certain they trade lists of names to be sure of cross-admits. They are all--Ivies + MIT and Stanford--pretty hellbent on getting this data right so that they know the reality and can try to improve the next year. But I have a friend who graduated last year and was hired by the admissions office to read for them, so I'll ask her whether she knows and get back to you.<br><br>The only reason to doubt it is if you really don't want to face the fact that Columbia is likely losing pretty badly to Stanford (and by extension, HYPM). Which is understandable; I don't like that Stanford only takes 40% with Harvard and other times under 30%. But I'm not going to assume that the data is wrong.<br><br>quantman,<br>\"\"I do not understand at what point does a student tell a school that he/she is turning them down to go to another. It could be if the student was bargaining with different schools for aid. Otherwise unless Stanford does it with every student that it accepts...i fail to see how it collects good data.\"\"<br><br>Each college gives students a reply card in their acceptance package. They also allow students to reply online. In both cases, they have a part that basically says \"If you're not coming, please state where you are attending\" and give a space for you to do that. It's the first (usually only) question they ask those who turn them down. So yes, Stanford does this with every student who turns them down. I know for a fact that all of HYPS do this, and the UCs as well, so while I didn't apply to Columbia or other Ivies, I'm pretty sure that they do as well.<br><br>But again, even if they didn't, trading names tells them all they need to know. I'm certain that Stanford's aware of where your son is attending. ;)<br>\"\"The nature of research is shifting away from Stanford's traditional strengths and the computer industry is now less about hardware than about monetizing existing knowledge.\"\"<br><br>But Stanford's \"traditional strengths\" extend far past hardware. You also forget that Stanford is always adapting. Google may have an office in NY, but its headquarters are still next to Stanford in Mountain View. Remember, also, that New York is currently trying to get a top engineering school to set up shop in their city, because they feel that they are not as competitive when it comes to IT/engineering.<br><br>", "<b>Username: admissionsgeek</b><br><br>phantas: i know with certainty. i have this kind of privileged knowledge. if you doubt me, feel free to private message me and i will explain more. but no, no schools trade names. saying so is a lie. stating things that are not true just because you're 'pretty sure,' really reduces your credibility.<br><br>as i stated above, it is not to say the data is not 'close to accurate,' it is just wrong to say that it is accurate. it is not verifiable because for it to be, would require a step that a) does not occur because names are not traded, and even beforehand in the 90s and early 2000s when ed names were shared, rd names were not shared, b) an invasion of students' privacy. so just be ok with the fact the data is a 'good proxy' for real data. it is for this reason that they are kept usually as internal memoranda and not for external use. columbia has similar data that it presents to trustees, and like stanford i presume it bases that data on its own collection of who goes where.<br><br>it doesn't mean that the numbers are not significant, indeed the sample size may be large enough to make the percentage values significant. but the actual number of students cross-admitted certainly is up for error. ever wonder why the report only deals in percentages?<br><br>i am quite puzzled by your insistence about facts that you do not have knowledge. being proud of stanford is fine, but being bull-headed is bad no matter where you went to school.<br><br>", "<b>Username: Smart Guy</b><br><br>If you go to Princeton, you have to watch Columbia professors from a video. ;-)<br><br><br><a href=\"http://www.dailyprincetonian.com/2011/04/12/28220/\" rel=\"nofollow\">Sachs lecture on poverty, charity streamed from Columbia - The Daily Princetonian</a><br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"i know with certainty. i have this kind of privileged knowledge. ... stating things that are not true just because you're 'pretty sure,' really reduces your credibility.\"\"<br><br>You need to provide a source. Saying that you are \"certain\" without providing any evidence to back up your claim really reduces <i>your</i> credibility.<br><br>I am waiting for my friend in the admissions office to respond to my question about how Stanford gathers its cross-admit data.<br>\"\"ever wonder why the report only deals in percentages?\"\"<br><br>In general they don't want people to reconstruct the data, because it shows where the school isn't doing well. But they have released enough info to reconstruct most of it.<br>\"\"i am quite puzzled by your insistence about facts that you do not have knowledge. being proud of stanford is fine, but being bull-headed is bad no matter where you went to school.\"\"<br><br>I am quite puzzled by your insistence that the facts are \"wrong\" because the dean of admissions is \"fishy.\" It's fine to be proud of Columbia, but being pigheaded about how it does in cross-admits simply because Columbia loses spectacularly to its peers is really unbecoming.<br><br>By the way, the default position is to assume the facts are right unless there's something to show that they're wrong (and there's plenty of reason to believe that they're right). You so far have not been able to give any reason to shed any real doubt on the numbers (especially in light of the reality that these numbers are meticulously studied, so there's a high probability that they're right), other than your gut instinct that they are \"fishy\" and that the dean is also \"fishy.\" And you're trying to say that I'm the one who's being \"bull-headed\" here and not making credible claims?<br><br>", "<b>Username: Haddon1267</b><br><br>phantasmagoric:<br>I have read everything you said in this thread. My conclusion? --What a obnoxious guy. My advice? --Get a life.<br><br>", "<b>Username: phantasmagoric</b><br><br>^ because I'm not properly praising Columbia and simply accepting the realities of how it does in cross-admits?<br><br>Way to contribute to the discussion, by the way<br><br>", "<b>Username: Haddon1267</b><br><br>^No, because you seem to be pathological in your effort to push a school down.<br><br>", "<b>Username: phantasmagoric</b><br><br>I have a feeling you're assuming I'm one of those people with a vendetta against a school and am only out to get it, etc. Here's the reality:<br><br>admissionsgeek is casting doubt (not once, but on different threads) on something that probably isn't wrong. I'm contesting that doubt. From that you're assuming that I'm trying to \"push a school down\"? Not at all. I have the utmost respect for Columbia and have no reason to put it down (I was recently admitted to one of their PhD programs and would be ecstatic to attend). But I'm not going to assume the data is wrong simply because it shows Columbia isn't doing well against Stanford and by extension HYPM. And that's what admissionsgeek has been doing, as in another thread when he cast doubt on it because the dean of admissions at Stanford is, in his words, \"fishy\" and that therefore the data is too.<br><br>", "<b>Username: Haddon1267</b><br><br>Adgeek is surly not the most objective person when it comes to his school; I can see that. But it's understandable that he is protective, and prideful, about his alma mater. My point is there are all kinds of schools, and they all have people who love them. You made your point about cross-admission many posts ago, and there is no need to force people to pity their school (it's sort of like force someone to admit his mother is ugly --I am not in any sense saying Columbia is ugly, far from it).<br><br>I don't argue with your cross-admit stats; I truly don't care. What I find distasteful is being fanatic about it. So whichever your college is, they got one minus point in my book.<br><br>", "<b>Username: admissionsgeek</b><br><br>Shaw is fishy, but that stands outside of the fact that the data is not verifiable. He is fishy for other reasons. I mean why did he leave Yale in such a huff? In fact most of the Deans of Admission in the Ivy+ are interesting characters. A good book could be written about them.<br><br>As I wrote above. I will be happy to tell you my source base privately. It comes because I have knowledge emanating from the admissions office at Columbia, Stanford, other schools and also inter-school admissions groups. I know. You, however, are 'pretty certain' and are waiting for your friend to get back to you. Let's put it this way, my friends already got back to me.<br><br>I will not however put all my cards out on this forum. In the long run it reduces my efficacy and anonymity.<br><br>", "<b>Username: admissionsgeek</b><br><br>and please read between the lines - first i have amended some of my statements in the face of reading the stanford minutes, and my critique has similarly changed. it is VERY clear that you are not reading my statements so i will present it for you simply.<br><br>a) universities do not trade names.<br>b) the data would probably be collected by the source school alone.<br>c) it probably utilizes statistics to try and arrive at general trends.<br>d) the data is not 'wrong' yet it not 'accurate/truthful/factual' either. it is an estimate of behavior with a possible room for error.<br>e) though i was/am saddened that columbia only wins 2% of all students that stanford loses, i retain some hope that this figure is possibly wrong and within a margin of error (it could be 3%! ha). further it does not allow us to see in actuality what is the head-on columbia v. stanford figure. we could assume, despite the fact that columbia admits 10% of stanford students (200 total cross admits), the vast majority of those students attended other schools (HYPM), 13 or so attended columbia, and a small number (20 or so) actually attended stanford. it would refute the stance that stanford is actually the main competition for columbia. indeed in this last part WE do not know because we actually do not have all the data. i could speculate this, all of which, merely to cast doubt on some things that you and ewho present as matters of fact. particularly your use of the 13 person number, and the claim you make that the 13 person number suggests that stanford clearly outstrips columbia. both of these statements are not verifiable with the data provided.<br><br>f) even though i don't discount the 'near accuracy' of the data, i universally and unquestionably reject your peddling of information as truth when it is not. specifically vis-a-vis the process of collecting information of which you have NO knowledge.<br>g) my ad hominem attacks against certain people are almost always meant to be slight in jest and slightly true. if you are Mr. Shaw's son, i do apologize. if you are not, then i ask if you've actually met the man in an informal setting.<br><br>", "<b>Username: phantasmagoric</b><br><br>Haddon1267,<br>\"\"You made your point about cross-admission many posts ago, and there is no need to force people to pity their school\"\"<br><br>I am by no means trying to \"force\" anyone to pity their school at all (and there's nothing to pity here--cross-admit data is not something to cry about). admissionsgeek has made new claims each time and it warranted response. I don't know why you're trying to stifle discussion because you misinterpret my intent. Next time, please try to contribute something constructive to the discussion.<br><br>@admissionsgeek<br>\"\"I will not however put all my cards out on this forum. In the long run it reduces my efficacy\"\"<br><br>And you don't think statements like this do worse?:<br>\"\"Shaw is fishy, but that stands outside of the fact that the data is not verifiable. He is fishy for other reasons. I mean why did he leave Yale in such a huff?\"\"<br><br>By the way, admissions officers switch schools all the time. When you look at where they were previously, it's usually other elite school admissions offices. Bob Patterson left Berkeley recently to become the director of admission. Doesn't mean he's \"fishy.\"<br>\"\"the data is not 'wrong' yet it not 'accurate/truthful/factual' either. it is an estimate of behavior with a possible room for error.\"\"<br><br>Wait, you say that there's some room for error. If so (assuming a small margin), it would be considered \"accurate.\"<br><br>The rest of your claims are unsubstantiated and unfounded, showing more your reluctance to admit fact than any substantive objection. You've also started to recycle all your points, at which time this discussion becomes boring. We've made our points, and I think we can agree to disagree (unless you have a source to prove your point).<br>\"\"if you are not, then i ask if you've actually met the man in an informal setting.\"\"<br><br>Yes, I have in fact--he, several other students and I had lunch together during orientation. He's a very nice man. Again, I don't know why you're making him a centerpiece of your argument...<br><br>", "<b>Username: admissionsgeek</b><br><br>what does this all mean? i can't figure it out. sounds like unconnected thoughts.<br><br>explain how 'small margin of error' allows accuracy. it allows the possibility of accuracy, but never the absolutism of accuracy.<br><br>and Deans of Admission never leave in a huff. especially from jobs as quality as Yale, unless with reason. but orientation during lunch during a structured time (where he acts in a structured way) is far from an informal setting. if you thought it was informal, i do apologize.<br><br>", "<b>Username: phantasmagoric</b><br><br>^ I can't believe you're actually contesting whether my judgment of him after lunch could possibly be accurate, because lunch in a small group is not an \"informal setting.\" Either way, you say everything I would need to by continuing with your claim that somehow the data is wrong because he left Yale \"in a huff.\" (No evidence, not that it even matters--his reasons for going to Stanford are completely irrelevant to the data, and it's just sad that you're grasping for anything to show that the data is wrong.)<br>\"\"explain how 'small margin of error' allows accuracy. it allows the possibility of accuracy, but never the absolutism of accuracy.\"\"<br><br>I'm saying that in <i>statistics</i>, a margin of error like +/- 3% gives you reason to call the data \"accurate.\" That's just how the word is used.<br><br>This topic has become pretty pointless, so until you're ready to make a convincing argument with actual evidence (as in, real citations, not just \"I'm certain, believe me, I know\") to back up your claims, we can just agree to disagree.<br><br>", "<b>Username: LETSGO2015</b><br><br>So..does 8.5% vs. 6.9% really matter.? and does +/- 3%, whatever that means, matter? You either get in or don't, and Columbia and Princeton both have their strengths and weaknesses (mostly strengths), so this discussion is pointless. Another one of those pointless College Confidential talks? I THINK SO.<br><br>", "<b>Username: projectmom1</b><br><br>Forgive me for backing up a page or two. I just had to say:<br><br>@admissionsgeek: I believe you are completely correct on students reporting to schools if they are not coming as early as soon as they know. This is what one would expect in the professional world, as well.<br><br>", "<b>Username: LadyGoGo</b><br><br>Geesh, all this debate, and for what?<br><br>the fact is that Columbia loses the HYPSM cross admit battle by more than 90/10.<br><br>This has not changed in decades and will continue.<br><br>", "<b>Username: stressedouttt</b><br><br>haha this has turned into war xD they both are excellent universities with their pros and cons. which one is better depends on the person and their priorites. let's not bring out the fire- breathing dragons ;)<br><br>", "<b>Username: admissionsgeek</b><br><br>actually ladygogo it has changed a lot in decades (ebbs and flows back and forward) knowing the long history of admissions changes things.<br><br>", "<b>Username: joso2015</b><br><br>to echo the last post, i've met 6 columbia-harvard cross admits, and 5/6 are choosing columbia.<br><br>", "<b>Username: Smart Guy</b><br><br>I have a funny feeling that my favorite poster Japanoko has been reincarnated as LadyGoGo...<br><br>Great to see you back! haha<br><br>", "<b>Username: kwu</b><br><br>It is ridiculous and pitiful that this thread has gone on for <i>eighteen</i> pages.<br><br>As if this were a matter of dispute.<br><br>", "<b>Username: LadyGoGo</b><br><br>^^^^kwu good point<br><br><b><i>As if this were a matter of dispute</i></b>.<br><br>", "<b>Username: LadyGoGo</b><br><br>\"\"to echo the last post, i've met 6 columbia-harvard cross admits, and 5/6 are choosing columbia.\"\"<br><br>ha!, well it appears that you met the ONLY Harvard/Columbia cross admits that decided on Columbia for your class...all 5 of them out of a couple hundred<br><br>", "<b>Username: confidentialcoll</b><br><br>\"\"It is ridiculous and pitiful that this thread has gone on for eighteen pages.<br><br>As if this were a matter of dispute.\"\"<br><br>Yup, I think we can all agree that Columbia is the better choice. Thanks for your keen insight kwu.<br><br>", "<b>Username: admissionsgeek</b><br><br>ladygogo: there are maybe 200 cross admits, but when you add the number of cross admits that are cross admitted with other schools the actual head to head is minimal. but that would take a level of analysis...<br><br>", "<b>Username: Indecisions</b><br><br>Looks like our token **** is back lol. I wonder if it's always the same person all these years.<br><br>", "<b>Username: kwu</b><br><br>\"\"Thanks for your keen insight kwu.\"\"<br><br>You're welcome, confidentialcoll. I do all I can to contribute to reasonable decision-making, especially when such decisions are life-changing. At times, the answers to questions are so clear to clearheaded people that one does not feel the need to explain one's reasoning. Particularly in this case, such an endeavor would be fruitless, like shouting at brick walls--a bad idea, especially when a brick wall happens to be insecure, unstable, and built so comically and inappropriately high that it threatens to collapse on all those who come up against it. Anyway, I digress.<br><br><url>http://talk.collegeconfidential.com/princeton-university/228907-princeton-vs-columbia.html#post2851897</url><br><br>The same topic posted on the Princeton board got 20 replies and 1,200 views compared to this one, currently at 300 replies and 27,000 views.<br><br>Draw what conclusions you will.<br><br>", "<b>Username: yeabsweaty</b><br><br>Princeton has better economics? Not even close. One can argue that being in the financial capital of the world makes Columbia an econ students heaven. Seeing as you're a Princeton alum, wouldn't it be fair to say you're biased? Seeing as the education is completely comparable at this level of institution, you're just saying things without anything to back them up. I mean, with THE Core, I could say Columbia is WAY better in the humanities and with its ridiculous chem and physics legacies, it's better in hard sciences. Our politically minded students have it better with the UN here and all the government positions available, making Columbia a much more attractive place for high profile professors and speakers. You see, there isn't a way to measure one school's superiority but, one can use actual facts to lead a prospective student in the right direction. Simply saying that Princeton has better programs is a joke when anyone can just walk up in this forum and say Columbia is way better. Doing that is worse than listing acceptance rates as method of comparison but, if you were to do that, Columbia's is lower :p<br><br>", "<b>Username: T26E4</b><br><br>\"Seeing as you're a Princeton alum, wouldn't it be fair to say you're biased?\"<br><br>Seeing as you're an entering freshman to Columbia, without the years of actual working experience as an Ivy grad, doesn't that make you <i>biased and inexperienced?</i><br><br>When you state this: \"Princeton has better economics? Not even close.\" YOu're equally as guilty of generalizing. My take: both are excellent. The \"mine is bigger\" arguments, plus a dollar, will get you a Sweet Tea at McDonalds.<br><br>", "<b>Username: Exodius</b><br><br>I prefer Columbia to Princeton (at least in theory), but is it a comparable academic experience? The Core, Columbia's flagship, comprises classes capped at 22 students. Chicago's are capped at 19; the optional humanities and seminars of Yale and Princeton are capped at eighteen and fifteen. Because of Chicago's culture and the fact that Y and P's seminars are optional and smaller, I assume that their students and teachers are better motivated, and the courses deeper and faster than Columbia's.<br><br>One could argue that the Great Books culture makes up for this, but in NYC, there won't be too much bonding on that front.<br><br>I'm just a disillusioned Columbia College admit that wants opinions.<br><br>", "<b>Username: tirakon</b><br><br>I have several points to make. As for UChicago, the only school you mention with a comparable core system, do you really think there's a substantive difference between 19 and 22 students in a classroom? This is the sort of statistical difference that seems meaningful on paper, but which makes no practical difference. They are roughly the same. What you're seeing here, by the way, is UChicago blatantly gaming the USNews rankings, which give credit for percentage of classes below 20 students. Columbia chooses not to play that game, yet still manages to provide nearly 2% more classes under 20 than UChicago (79.7 vs. 77.8). That 79.7% beats Harvard, Princeton, Yale, and Stanford respectively by: .2%, *8.4%*, 3.9%, and *9.3%*. If Columbia were to cap their core classes at 19, its lead in this category would skyrocket. So, we have plenty of small classes here.<br><br>As for Yale and Princeton, I don't think it's fair to compare their ability to cap optional humanities seminars, which only 100-200 students attend, with Columbia's ability to cap core classes which are provided for roughly 1400 students. In any case, it's a completely different experience at Columbia. At Princeton and Yale, if you take one of these Humanities classes, you are in a select group of people who care about these topics. At Columbia, *everyone* is in the same class at you at the same time. When you go to John Jay for dinner, you see hundreds of people who are carrying the same books that you're reading at that very moment. You can walk up to any student, even a complete stranger, and immediately start discussing the same books and the same classes. This is unique among top tier schools, even at Uchicago, where students have more of a distribution requirement and don't actually take the same classes. Columbia's experience is incredibly wonderful and extremely bonding.<br><br>Another benefit that Columbia's core classes have over self-selective and optional programs at Princeton and Yale: you get much more science/math people in your classes, who provide very different and interesting perspectives to the table. One example from my experiences that immediately jumps to mind: having an Econ-Math major in the room when we were discussing Adam Smith was wonderful.<br><br>This is not to say that there aren't math/science students in the programs at Princeton and Yale. But, those kinds of students are probably much rarer.<br><br>Now, does every student at Columbia love the core? No. Some people come here in spite of the core, not because of it. But, I think a significant majority does love the core. And the people who aren't into it don't speak up in class, which can make a 22 person seminar feel several students smaller.<br><br>In any event, not every core class actually has 22 people in it. But, in the ones of that size that I've been in, there's never been a lack of conversation or a difficulty getting my voice heard.<br><br>I also want to dispel the notion that NYC destroys any opportunity for bonding. This is a big myth that really ****es me off. Columbia's campus is extremely vibrant. You can go to school here, never enter the city, and not realize you're missing anything. Most people don't run off campus all the time. In fact, I'd say most people don't leave more than once a week.<br><br>What the city is great for is supplementing the college experience. Every music hum student goes with their class to see an opera at the Met. Every Art Hum student goes with their class to several of NYC's amazing museums. In my Postmodern Poetry seminar, we would study a famous and influential poet, and then go downtown together to see him or her give a poetry reading. In my Shakespeare seminar, the professor got us tickets to the hottest Shakespeare production in the city at the time that was sold out to the general public. Living in the city also has allowed me to intern on an NBC show that I consider to be the funniest on television (I don't want to give away too much personal information).<br><br>You're going to love Columbia. Stop worrying and get cracking on the Iliad.<br><br>", "<b>Username: swingtime</b><br><br>You say you are a disillusioned Columbia College admit? Reading TRULY ridiculous threads like this no doubt contributed to your disillusionment. FYI: for the past two years Columbia has received a significantly higher number of applications to its freshman class than has Princeton. For the past two years Columbia's admissions percentage has been lower than Princeton's, meaning that on some scale it has become more popular to high school applicants and more selective than Princeton. That says SOMETHING!!!!!<br><br>I went to undergrad at UChicago. It was fantastic. HOWEVER!!!!!!!!! In the years since I graduated Chicago has \"watered down\" -- made more \"user friendly\" -- its Core Curriculum. It is less rigorous; it is no longer as prescriptive. One result of Chicago's tinkering with its image and its curriculum is that its popularity has skyrocketed and its admissions rates have dropped. Big discussions at the UChicago forum. We Chicagoans are wondering, though, about the actual intellectual and academic COSTS of Chicago's bid for popularity.<br><br>By contrast, Columbia's commitment to its Core has remained steadfast for over eighty years. The Columbia Core remains one of the true jewels in undergraduate education. As the above poster told you, it is an intellectually stimulating, incredibly bonding experience. I just came back from the Summer Advising Session in Chicago, where as a family we attended with our little one who is an EXTREMELY proud and excited Columbia admit. We are thrilled by the opportunities our relative has, and this was little one's first choice Ivy. Little one applied to 11 schools and was only rejected from one. Because of its core, its Mind and Behavior program, its EXTRAORDINARY faculty, its resources, its opportunities, and, yes, New York, this was always little one's top choice school and favorite Ivy. I actually received my graduate degree from another Ivy -- Harvard, in fact -- we researched it assiduously, and yet little one could never get as on board Harvard as Columbia. For my little one, Columbia clicked, despite my trying to push both of my alma maters during the admissions cycle.<br><br>One thing that particularly strikes me about Columbia, as compared with the other top Ivies, is the relative lack of pretense and snobbery as compared with Harvard, Yale, and Princeton. There is still a vibe -- not as present at Harvard, as with those I have met from the other two -- as some kind of rich kid's entitlement, with which attitude I am uncomfortable. Maybe it is being in the great melting pot of New York that gives Columbia a grittier, seeemingly more tolerant air. I don't know. And, again, I am stating a personal opinion based upon my own experience.<br><br>Speaking as someone with degrees from two top schools, I can say from my own experience that Columbians are some of the smartest, least pretentious folk I have met. The curriculum and teaching are awesome. Everything is there for you to sieze and use.<br><br>So, what really is your problem? Go in late August and feast from the smorgasboard. Everything you need is there for you!<br><br>FYI: there is a kid on the Princeton forum who got into Princeton and was waitlisted by Columbia. His first choice was Columbia and he vented on the Princeton Forum. He complained about the difference in vibe between the two, both of which he visited. His perception was that Princeton was \"snobby.\" Now, that is HIS perception, for which he was roundly abused on the Princeton Forum, in a way that kind of validated his sense of Princeton, unfortunately. The point is, despite the ridiculous fetishization of Harvard, Princeton, and Yale by the kids on CC (which is not the way the real academic and professional world thinks, by the way, AT ALL), NOT EVERYONE automatically thinks they are the only great schools. For this kid, Columbia was his first choice, and he specifically cited as reasons the Core and the vibe, and he is not happy being \"stuck\" at Princeton. For some people, Columbia IS a first choice and there are good reasons why that is so.<br><br>", "<b>Username: FutureVpFinance</b><br><br>Compare the previous two posts with the sophomoric dialogue of the first 18.5 pages. And by sophomoric I mean literally written by 10th graders with an unhealthy obsession with a certain three universities.<br><br>", "<b>Username: CalvinTBOD</b><br><br>So I came here to look into the opinions of others and decide on which school to apply early. The first 9 pages were full of bickering and personal insults regarding which school is more awful and horrible. The next 11 pages were non-contributory fights over statistics using untrustworthy sources. And honestly, the posts I've seen on this thread alone makes me not want to apply to either of these schools. I'm visiting Columbia tomorrow and Princeton some time next week. If anyone would like to post objective information and personal experiences (that aren't taken to the extreme) regarding the social scene and academics of Princeton and Columbia University, it would be very much appreciated.<br><br>"]}