{"title": "michigan vs boston college", "comments": ["<b>Username: bunny27</b><br><br>Which school would you pick? Which is harder to get into?<br><br>", "<b>Username: nymets11</b><br><br>Michigan is more prestigous, BC is more selective. Both schools have D-1 sports and lots of school spirit. Personally, I tend to like private schools better (small classroom sizes, etc.) and would chose BC.<br><br>", "<b>Username: joev</b><br><br>Michigan probably has the better football team, but they lose to Ohio State every year, so it is what it is. In ice hockey the teams are probably equivalent.<br><br>", "<b>Username: TerrarumOrbis</b><br><br>I'd go with U. Mich<br><br>", "<b>Username: Seiken</b><br><br>isnt BC known as a really conservative catholic college?<br><br>", "<b>Username: hawkette</b><br><br>Boston College vs Michigan<br><br>The following numbers are drawn directly from the latest (2007 version) of USNWR.<br><br>Graduation &amp; Retention Rank<br>Boston College: 20th Michigan: 28th<br>-% of Students expected to graduate in 6 years:<br>Boston College: 83% Michigan: 77%<br>-% of students who do graduate in 6 years:<br>Boston College: 91% Michigan: 86%<br><br>Faculty Resources Rank:<br>Boston College: 72nd Michigan: 69th<br>-% of classes with 50+ students<br>Boston College: 8% Michigan: 16%<br>-% of classes with &lt;20 students<br>Boston College: 38% Michigan: 43%<br>-Faculty/student ratio<br>Boston College: 13/1 Michigan: 15/1<br><br>Student Selectivity Rank:<br>Boston College: 29th Michigan: 22nd<br>-Average SAT/ACT:<br>Boston College: 1250-1420 Michigan: 1220-1420<br>-% of students ranking in top 10% of high school class<br>: 75% Michigan: 89%<br>-% acceptance rate: Boston College 31% Michigan: 57%<br><br>Financial Resources Rank:<br>Boston College: 70th Michigan: 31st<br><br>Alumni Giving % and Rank:<br>Boston College: 25% (37th) Michigan: 15% (105th)<br><br>Peer Assessment:<br>Boston College: 3.6 Michigan: 4.5<br><br>While Michigan clearly has a higher profile on CC and Michigan supporters regularly present the school as a near-Ivy, in most respects, it is much more a near-BC. The numbers above indicate that Boston College and Michigan are highly similar in many important areas (Graduation/Retention rank, Selectivity and equally weak Faculty Resources). However, to Michigans credit, Michigan boasts a strong Peer Assessment ranking (although some would contend that this reputation is mostly owed to Michigans graduate faculty). This Peer Assessment (which contributes 25% of the USNWR score) advantage powers most of the numerical edge to give it the higher USNWR rank (Boston College: 34 Michigan: 24). Furthermore, BCs weak showing in Financial Resources, perhaps reflecting its Catholic nature, puts the school at a statistical disadvantage to Michigan. Both schools offer a solid undergraduate experience and have good reputations for providing a good social atmosphere but, on the academic numbers, slight edge to Michigan.<br><br>", "<b>Username: adidasjed</b><br><br>go to Michigan because i think BC is wicked over rated. It has only become selective since Flutie (because of the publicity) and before that there is really no history and it was a cake walk to get in. All BC has going for it is that it is smaller. Michigan better social scene and better academics.<br><br>", "<b>Username: WaleedF</b><br><br>I'm pretty sure that USNWR states that Peer Assessment is for the undergraduate program, meaning a grad program wouldn't be included.<br><br>Anyway, I'd clearly pick UMich over BC.<br><br>", "<b>Username: amadsjc</b><br><br>adidasjed do you know anything about BC or have any information that would back up your claim that BC is \"wicked\" over rated? I'm pretty sure that 99% of students don't apply to BC because of Doug Flutie, he hasnt gone there for over 25 years (or sometime around then). Better social scene, better academics? where are the facts to back that up<br><br>Coming from Massachussetts i can tell you that BC has an extremely good reputation in New England, and though im not going there when i visited i thought it had some of the most modern up to date buildings, while still having the nice campus feel, and its right outside of boston.<br><br>", "<b>Username: WaleedF</b><br><br>I think he may have deducted that UMich has better academics due to peer assessment scores:<br><br>4.5 UM<br>3.6 BC<br><br>USNWR states that the peer assessment is for strength of the ugrad program. Just saying that because people often claim that publics like UMich and Berkeley recieve high PA scores due to grad programs.<br><br>Michigan has a much larger population than BC, so I guess that could mean for more diversity and types of people to encounter. It probably won't be as hard finding a fit at Michigan as it would be at a smaller school like BC.<br><br>", "<b>Username: Pyar</b><br><br>I applied to both, I would choose Michigan over BC anyday.<br><br>", "<b>Username: ungst</b><br><br>It really depends on what you are interested in too. There are tons of top ten programs at michigan, but I doubt there are many at BC.<br><br>", "<b>Username: Ilovesoftball44</b><br><br>I would chose BC over Michigan, because the student population is so large.<br><br>", "<b>Username: barrons</b><br><br>FYI Hawkette, once and for all the same faculty at UM provides grad and UG teaching. There is no such thing as grad faculty except in areas like law and med school with no undergrad component. The fact that the grad programs are highly ranked just affirms the fact that the faculty at UM is one of the best. That is also reflected by the large number of NAS members and major annual awards (Guggenheims etc.) earned.<br><br>", "<b>Username: TourGuide446</b><br><br>I'm very familiar with both schools. They offer very very different college experiences, and attract very different types of students--though the actual academic qualifications of the student bodies are fairly similar.<br><br>Michigan clearly has the higher national and international reputation for having academic heavyweights in its faculty, and the high Peer Assessment score confirms this. BC's faculty is pretty damn good though, and its proximity to Boston makes it a place at which lots of people (many of whom are non-Catholic and even non-Christian) want to spend their time teaching and researching.<br><br>And about academic heavyweights...some of them DO only teach grad courses, and even if they do teach undergrads, it would seem open to debate how getting taught intro physics or English 101 by the #20 scholar in his field is any better than being taught by the #200 scholar in his field. In other words, the undergrads aren't exactly going to be in a position to take advantage of whatever margin the heavyweight is going to have over a light heavyweight.<br><br>There is no shortage of anti-Catholic sentiment among the intelligensia in this country, and I always wondered if that had any impact on BC's PA rating. Also, being in the shadow of places like Harvard and MIT probably doesn't help much.<br><br>I have a very close relative that spent a decade doing research at Michigan, and he said that the faculty seemed to have surprisingly little devotion to the university--he said too many professors there seemed to be \"punching their ticket\" before trying to move on to more glamorous schools.<br><br>Regardless, they are both among the top few colleges in the country at combining high-quality academics and first-rate sports programs (if you consider basketball, football, and hockey--pretty much the only sports that are popular enough to generate much cash--perhaps only Wisconsin is on par with them in this regard).<br><br>", "<b>Username: TourGuide446</b><br><br>B U-M p. Bc UMP.<br><br>", "<b>Username: nefer</b><br><br>collegeboard.com says:<br>Michigan SAT 1210-1420<br>BC SAT 1250-1420<br><br>BC is a better school. QED<br><br>", "<b>Username: hawkette</b><br><br>nefer,<br>There is a lot more that goes into evaluating a school than average SAT scores. While these can be an indication of the academic quality of the student body, there is a lot more to consider including the size of the classes, the quality of the teaching, the ability and willingness of a school to support its students and faculty, not to mention a number of intangibles that are commonly ignored in the USNWR and other rankings. I encourage you to consider more than SAT scores when evaluating which is a better college. BC may be a better school (and definitely is for some students), but it is not supportable to claim that one college is better than another simply based on standardized test scores.<br><br>BC is certainly a strong school and, as TourGuide's post points out, BC and Michigan both do an excellent job of combining academics with national quality athletic programs. The biggest problem for BC appears to be its faculty reputation (as measured by Peer Assessment ranking) which lags well behind Michigan's reputation. I am not well enough informed about the faculties of BC and Michigan to comment on that large difference (4.5 for Michigan vs 3.6 for BC) and whether it is justified , but clearly in the minds of academics, there is room for improvement in Chestnut Hill.<br><br>", "<b>Username: ckmets13</b><br><br>1. BC is catholic<br>2. BC is not a research institution (especially when compared with schools like Michigan, research powerhouses) and it is still being ranked in the research schools category. Similar schools like Wake, Lehigh, URochester, and even Notre Dame suffer lower PAs than their peer public schools because of this research factor. This is why PA is BS when it comes to evaluating undergraduate institutions.<br><br>of course michigan is a good school, but it is not 20% better than BC as the PA would like you to think<br><br>", "<b>Username: WaleedF</b><br><br>Michigan wins academically hands down.<br><br>4.5 vs. 3.6? Come on, guys. You can give all the excuses in the world, but it doesn't change the fact that int he minds of academics all over the country, Michigan ranks much higher academically.<br><br>", "<b>Username: ckmets13</b><br><br>dont you PA obsessed people get it? PA tells me that the University of Iowa is equal for undergraduates compared to Tufts? Are you kidding me? Now I am sure that Iowa has some good grad programs, whereas Tufts has relatively few of them, but this isnt about grad school. Believe it or not, quality of the students is actually a big factor in undergraduate experience. Despite the fact that Iowa is ranked better than BC in the PA, I dont hear students saying \"I really hope i can get into the University of Iowa!\" But yes you do hear that for Tufts and even BC, believe it or not. Of course, Michigan is a much better undergrad school than Iowa, and I believe it is about equal to BC, although there would be much more personalization at BC than a larger school like Michigan. For instance, my prof for intro physics actually enjoys teaching my class. Imagine that!<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"Michigan SAT 1210-1420<br>BC SAT 1250-1420<br><br>BC is a better school. QED\"\"<br>Make sure you are comparing apples to apples. BC takes the best combined scores while Michigan takes the best single sitting. Most students I know benefit from the combined scoring.<br>\"\"In other words, the undergrads aren't exactly going to be in a position to take advantage of whatever margin the heavyweight is going to have over a light heavyweight.\"\"<br>That's not necessarily true. Many aspiring juniors/seniors are taking graduate courses and even more do some independent studies before they graduate.<br>\"\"the faculty seemed to have surprisingly little devotion to the university--he said too many professors there seemed to be \"punching their ticket\" before trying to move on to more glamorous schools.\"\"<br>This must be a new thing. I can only speak for the Chem Engineering dept. All of the professors I know are still there or have retired as professor emiterus. And all of the younger professors who came on board after I left are still working there.<br><br>Q: How diverse is the BC student body? I had the impression that it is not that diverse ... that is before I read that BC has 24% AHANA (+2% int'l) and 71% on financial aids.<br><br>", "<b>Username: hawkette</b><br><br>While Michigan may only use the one sitting score for admissions purposes, I believe that their reported scores from the Common Data Set don't make that distinction. I believe that the 1210-1420 range for Michigan is correct.<br><br><url>http://sitemaker.umich.edu/obpinfo/files/umaa_freshprof.pdf</url><br><br>", "<b>Username: GoBlue81</b><br><br>\"\"While Michigan may only use the one sitting score for admissions purposes, I believe that their reported scores from the Common Data Set don't make that distinction. I believe that the 1210-1420 range for Michigan is correct.\"\"<br>You don't know that. I doubt if any university will keep the entire SAT history of each student on permanent file. It's more likely they extract what they need (i.e., BC keeps the highest component scores for each student, while Michigan keeps the component scores for the highest single sitting). May be hoedown can give us the definitive answer.<br><br>", "<b>Username: arvandm</b><br><br>The University of Michigan is a large state school, and, consequently, is not as selective as the smaller privates. The quality of the upper tier students at the University of Michigan is comparable to the students attending the top privates. Just look at the data that nefer used, and you'll see that both have the same 75th percentile score. You can also add what GoBlue81 has stated and it becomes obvious that...<br><br>Michigan is a better school. QED<br><br>", "<b>Username: sfgiants</b><br><br>\"\"Regardless, they are both among the top few colleges in the country at combining high-quality academics and first-rate sports programs (if you consider basketball, football, and hockey--pretty much the only sports that are popular enough to generate much cash--perhaps only Wisconsin is on par with them in this regard).\"\"<br><br>Taking hockey out of the equation, UCLA, USC, Wake Forrest fit the bill. I'm probably missing some others.<br><br>", "<b>Username: Sam Lee</b><br><br>Take out basketball too since Michigan isn't really that good at basketball. ;)<br>To me, both are a notch below Stanford/UCLA in terms of combining the two. I don't know why TG make it sound like they are that special.<br><br>", "<b>Username: GoBlue81</b><br><br>Michigan was good at basketball too ... remember the Fab Five and the Championship ... We are paying for that now.<br><br>Hey, Northwestern was good at football too ... even though it was only that one year.<br><br>", "<b>Username: hawkette</b><br><br>While the desire of Michigan partisans to compare their school to the Ivy League is understandable, the facts would certainly say otherwise. IMO Michigan is much more similar and qualitatively equal to BC than it is to the lower tier of the Ivies.<br><br>Using the SAT numbers as one proxy for student quality, Michigan supporters regularly trumpet the high end of the 25-75 range (1410) as proof that the scorers (representing over 6000 students) above that are every bit the equal to the students at Ivy League schools. That may be true, but consider also that there are another 6000+ students walking around in AA who have scored below 1220. In fact, 1000 current Michigan students have scored below 500 on the Verbal section and 500 students have scored below 500 on the Math section. Hardly Ivy level or anything near it.<br><br>Lets look closer at the lower 25% of Michigans undergraduate population representing 6000+ Michigans students (or more than 2/3 of the entire student body at BC). The Michigan SAT scores of 1210 or under put these students in the same league with some schools not often compared to Michigan. Examples include Syracuse (Average SAT of 1215, USNWR rank of 52nd), Rutgers (SAT-1215, USNWR 60th), UC-Irvine (SAT-1210, USNWR 44th), University of Washington (SAT-1210, USNWR 42nd), Penn State (SAT-1200, USNWR 47th), Virginia Tech (SAT-1200, USNWR 77th). There are others, but you get the idea. I think most dispassionate observers would conclude that it is very unlikely that these students would make it into ANY Ivy school or any of the top private schools. But it is a fact that there are over 6000 students at Michigan right now who are in the same academic league as the schools mentioned above. It is also a fact that 500-1000 of these Michigan students scored below 1000 on their SATs.<br><br>Yes, there is more to evaluating a student body than SAT scores and certainly there is more to evaluating a college than just the SAT scores, but Michigan fans consistently lack balance in their presentation and always try to associate up and never down. Their statements are often presented on CC as facts, but the real truth is that these statements/declarations are nothing more than (mostly wrong) opinions.<br><br>The point is not to insult Michigan, but to put their (false IMO) claims of academic equality to the lower level of the Ivy League and other top privates in the proper perspective. Michigan is an excellent state school and has a lot of good things, but it way overrated on CC. Boston College fans, you have nothing to apologize about in comparisons with Michigan.<br><br>", "<b>Username: GoBlue81</b><br><br>hawkette,<br>You would have to say the same thing about UCB and UCLA, wouldn't you?<br><br>", "<b>Username: CC Admin</b><br><br>Do you know how many varsity D1 recruits there are at Michigan? There are also a lot of people with less than 1000 on their SATs at Duke, Cornell, Stanford as well.<br><br>The thing that people don't know is that Michigan has a lot of world class specialized schools, such as the school of music and added to the 500+ athletes at this school, and considering that Michigan takes only the highest single setting SAT score, and considering how little weight is given to SAT scores in UM admissions, that 1330 SAT average isn't that bad.<br><br>", "<b>Username: hawkette</b><br><br>Michigan's SAT scores are impressive for a school its size.<br><br>Quantitatively, the SAT impact of the recruited athletes is much larger at places like Duke, Stanford, etc. because the class size is so much smaller.<br><br>You would probably say the same thing about UCB, UCLA, UVA, UNC, etc. or any other large state university. The difference is that most of the folks from those schools don't drone on constantly about how their school is the equal of several schools in the Ivy League. We all agree with the idea that at least 25% of the students at these state universities are talented. What the Michigan folks fail to acknowledge is that there is an equal number that is significantly less talented and this has an impact on the overall quality of a school. If you do a fair and full analysis of Michigan (student body, the quality of the undergraduate experience, after-school job prospects, etc.) and similar excellent state universities, the conclusion is inescapable that these can be good places, but on the whole, they are not uber selective or mega elite. Sort of like Boston College. Not like Penn, Dartmouth, Wash U, Northwestern, Emory, Rice, etc.<br><br>", "<b>Username: arvandm</b><br><br>I guess I have to agree with hawkette actually.<br><br>", "<b>Username: nefer</b><br><br>Michigan is a \"feeder\" school, one of 15-20 universities and LACs known to send disproportionately large numbers of their grads to the most exclusive employers and professional schools for generations.<br>This is where its megaluster comes from. You may question why it is so, but that's fact. (Yes, it's the Establishment)<br><br>I don't like ranking schools, because I think it does more harm than good. Michigan does command more prestige than BC, although it may appear unwarranted. Embedded within Michigan undergrad population is the entire undergrad body of BC, or Northwestern, or any comparable school (except HYPSM and such) with room to spare, which makes it impossible to compare and declare one is better. One can be more selective, more exclusive, yes. But not necessarily a better institution.<br><br>I don't think you can compare colleges like you compare country clubs. The mission of U Michigan, like other large universities, public or private, is to provide educational opportunities to a diverse student population.<br>The talented students receive the education and career opportunities comparable to that of any elite school, and the middling ones also benefit from the top-notch educational and social resources to help them<br>find their niche in the society and be productive members. That is the draw of such educational institutions. Apples and Mellons. Switzerland vs. US.<br><br>", "<b>Username: hawkette</b><br><br>nefer,<br>I'm not so sure about your feeder comment. There are feeders and there are FEEDERS. Michigan is probably one of the former, but not so sure about the latter. On the Michigan vs Northwestern thread, we tried to discover more about job placement coming out of Michigan. While Ross grads seem to do well with Wall Street (about 150 last year), it is not clear about the specifics and there apparently is very little data available on an institution-wide basis for job placement. Nor is there great information about professional school placement, particularly as it relates to an entire graduating class of students. Michigan posters regularly state that they have great job and grad school placement, but there is little to no documentation of this that anyone can point to. Again, I am sure that Michigan does a more than creditable job for at least a portion of that top 25%, but each year over 6000 students graduate. What about everybody else?<br><br>As for your comment about size, I am not sure I understand your point. Do you mean that, due to the strength of the top 25%, the quality of BC or Northwestern exists as well within the body of Michigan? That may be so, but the Michigan undergrad population ALSO includes the entire student body of Tulane or SMU or Howard. I just don't hear or read much about Michigan people comparing UM to those schools. Instead, I hear Northwestern, Penn, Dartmouth, etc.<br><br>Michigan is an excellent state university and does a good job of serving primarily the residents of the state of Michigan (69% of the current undergrad population acc to the most recently released CDS), and residents of other NE states (another 15% or so). With approximately 85% of its students from MI and the NE states, Michigan is not an exceptionally geographically diverse undergraduate institution. But I agree with your point that Michigan's location feeds its graduates into the Education Establishment of the Northeast. And to that I attribute much of its undergraduate reputation among people in the NE and among academics, a large number of who are located in the NE. People who went to the school and know the school like the school, but I also know that the people in Texas like their flagship, the people in Georgia like theirs, the people in Washington like theirs, etc. Should their attendance and good experience necessarily promote that school to the level of the Ivies and the top privates? I don't think so.<br><br>The fact that Michigan is not highly selective or highly elite or highly exclusive is not bad-it's just that many of the Michigan people on CC constantly promote the school as just that (highly selective/elite/exclusive) when those of us who have not drunk the Kook-Aid know better. It is an excellent state school, but with average quality of its students about on the level of Boston College or Georgia Tech or Tulane. I, for one, think that is pretty good. If only the Michigan people would agree......<br><br>", "<b>Username: CC Admin</b><br><br>I'm about to graduate from Michigan in April, with a degree in Engineering. To be honest, I've doubted my decision to enroll in Michigan, I'm an out of state student as well. But, I realized after visiting my friends in the lower Ivy league schools that there isn't any noticeable difference in student quality or the education that I received at Michigan. Speaking of career opportunities, any school in the top 50 in US News Rankings will offer similar opportunities, the only schools that do exceptionally better are the upper tier ivies and MIT, Caltech, Stanford. There are plenty of people who are unemployed upon graduation coming out of the lower ivies. Thinking that just because a school is ranked 10 spots higher will offer better career opportunities is childish.<br><br>There is often a perceived negativism towards public Universities in America. Perhaps this perception resembles the truth at Iowa state, or somewhere like that, but it should not be the case for schools like Berkeley, UVA, or Michigan.<br><br>It's funny that people never doubt the selectivity of Berkeley, I think this is due to their low acceptance rate. What many don't realize is that in the UC system, all you have to do to apply is check the campus name on your UC application. This at least doubles the number of applications that they receive.<br><br>", "<b>Username: nefer</b><br><br>hawkette, please clarify the differences between feeders and FEEDERS. Northwestern is a feeder, Michigan is a feeder. So are the ivies and the usual suspects. But BC, for examples, is not. HYPS and such perform better than others, of course, but all of them are in the same cabal.<br>The Establishment, as you call it, is not a conspiracy, as I'm sure you know. Large enterprises are conservative by nature. They are risk-averse. Once they find a formula for success, they stick with it. This is why the most desired employers keep coming back to the same ivy schools. In turn, the schools bend over backward to continue and improve the quality of the talents that their clients seek. Also, don't forget that the schools are also buyers of the products and services they sell. Education is a big business, resulting in much more nuanced relationships.<br>I am somewhat familiar with reputations of engineering programs as it's part of my job to know about them. Michigan is a \"feeder.\" So is Northwestern. I know Northwestern's journalism is highly regarded, although I doubt most journalists have a journalism degree. I live in NYC. I am no great fan of Broadway shows, but I hear Michigan is one of the top feeders to the stage. And so on. That's what makes them comparable, but hard to contrast. If Michigan cannot produce institution-wide post-graduate employment data, I guess we will never know how successful the weaker half of the graduating class is. But you know all schools have that issue. But at least the schools provided the opportunity, and hope that they do what they can do<br>help them utilize the resources to their advantage, and that's one of real measures of quality that I think would be meaningful.<br><br>I just browsed some of your past posts. If it's your thesis that it's the proximity to NE that gives Michigan its edge compared to other schools with similar institutional characteristics but with less reputation, you are wrong.<br>I've lived in NE for very long time, and I can tell you that to us NEers Michigan is way~~ out there. Michigan's excellence is more historical than geographical. Michigan has always been compared favorably to midwest powerhouses like U Chicago, Northwestern, Wisconsin. I've seen you mention U Texas more than once. I agree with you that UT is a great school despite its relative low rank in US News. To me, it's further evidence of the misleading folly of attempts at absolute ranking of undergrad education.<br>yet, I see you are quick to judge one school is better than another ?<br>When you really look deep into the way US News ranks schools, it essentially boils down to this: money, prestige and size. The larger the endowment, the better the school. The smaller the size, the better off, but on the other hand, less prestige. Due to their size state schools are shafted by the ranking. UPenn and Cornell suffer among the ivy peers. Smaller undergrad-oriented schools like Brown, Georgetown, etc. tend to get lower marks. Only HYPS seem impervious. And that's the folly.<br><br>", "<b>Username: hawkette</b><br><br>Nefer,<br>No, Im not a conspiracy theorist about the Education Establishment. But, having lived and worked in several regions of the country and appreciate the strength the areas outside of the NE, I guess I have become on CC an advocate for places, schools, people, companies, etc. whose names arent in the NYT on a daily or weekly basis, but which/who are nonetheless of great quality and merit better consideration.<br><br>For the feeder comment, my point was not well made. The 150 that went to Wall Street is good, but putting that in the context of 6000+ graduates, it seems like an awfully small number and hardly an institutionally defining number (like UPenn might be by how many of its students make it to Wall Street). Yet Michigan posters continually present that as their strong evidence that Michigan is this exclusive, elite school on the level of the top private schools in the country. While Michigan probably has a decent number of Wall Streeters, so do a lot of schools, including many of which you would not normally put in the first rank of American education (Indiana U, Fordham). This also relates to your comment about the most desired employers. Youre in NYC so you naturally would assume that Wall Street is the desired employer. It probably is among people in NY and the NE, but it most definitely is not elsewhere in the country.<br><br>As for how Michigan wants to be seen and is seen in NY and New England, I think you make my point for me. Michigan posters want UM to be associated with the top schools in the NE. But in NY and New England, Michigan is a tangential player. (A typical Manhattanite might ask, Michgan-isnt that that cold place where they make cars, they keep losing jobs overseas, and a lot of people get murdered?). But still Michigan posters seek the stamp of approval on CC that they can run with the Ivies because they have recruiters coming to AA from Wall Street. I think Michigan fans would be better advised to focus on their engineering grads, although that probably does not carry the same prestige.<br><br>Re judgments about schools, I do make them (this is a college forum after all), but I try to use facts to support my conclusions and opinions. Boston College and Michigan are an excellent example of this as the student bodies and other parts of these two schools are very, very close. Yet Michigans prestige is much higher among academics (who are historically very hostile to places like BC and Notre Dame) and a ranking result is created that will be accepted by the academics and will perpetuate the pecking order that was established decades ago. Change happens slowly in college surveys and rankings and people go crazy when some newcomer upsets the old order (Wash U, Duke). The folly, Im afraid, extends well beyond HYP.<br><br>", "<b>Username: Tim_ND08</b><br><br>This is really helpful because mich and bc are number 2 and 3 on my list<br><br>I think Mich is a bit more prestigious, and it has Ross on its side.<br><br>for me.. its business.... and I think lots would agree that Ross edges Carrol<br><br><br>I love teh combination of athletics and academics at both institutions, but size is better at BC<br><br>I honestly dont know which one I would chose it was accepted at both....<br><br>I think im leaning toward Mich....<br><br>", "<b>Username: nefer</b><br><br>You misunderstood my point completely, I am afraid. The average New Yorker may not be able to find the State of Michigan on a map, but the reputation of the University of Michigan is well known among those who care about such things. A large number of kids from NY go to UMich, and their alumni are all over NE. I work with UMich alumni daily. And did I ever mention that my daughter is a freshman there? I cannot speak for other NEers because I don't know what they think, but I, for one, don't have negative or biased opinions about the midwest region. Historically, the midwest was the center of population, commerce and industry outside of the eastern seaboard until the rise of the west coast. That prosperity was the engine that propelled some of the finest universities in the region to national prominence. UMichiganites have great pride and enthusiasm for their alma mater, to which you seem to attribute an unusual motive, which I think is groundless. When I look at their academics, happy people, campus, town, I see every reason for them to be proud. Those in-state kids and their parents, in particular, are lucky to have such a fine, affordable educational option in their State. And I should know. Here in NE the mentality is Ivy League or bust.<br><br>With regard to Wall St. placement, the subject has been exhausted, so there isn't anything more to add. There are many kinds of jobs on the Street, and many schools are represented there, but only a fraction gets to work in megabuck high finance. Therefore I think that's a poor way to assess the overall value of a university. I think Alexander summarizes the value of UMich best: No doors will be closed to Michigan graduates.<br><br>Yes, the domanance of Blue States in academia is still deeply entrenched. I know it's changing, albeit slowly, and I think that' is a good thing. In any case, it's a topic of a different color. I get on this board once in a while mostly for the amusement value, and I just wanted to share my perspective on college selection. And I actually enjoyed reading your posts.<br><br>", "<b>Username: nefer</b><br><br>Chillin, you can't go wrong with either one. But if the cost or location is not a factor, Michigan might be more fun. Don't worry about the size too much. Visit both schools and get the feel. It's mostly about personal taste. Just be prepared for some early morning or late evening classes.<br><br>", "<b>Username: ckmets13</b><br><br>Carroll is good regionally, but if you dont plan on getting a job in the Boston area then Ross is definitely better nationally<br><br>", "<b>Username: Pre-medwannabe</b><br><br>I would definitely choose Michigan over BC, its not even a close call in my opinion. Plus, when people talk about class size being overly large, they are mainly referring to the intro classes which you take freshmen and sophomore year, which are a joke anyway because everyone I asked about said that you can just study straight from the textbook for these. By the time your a junior classes are way smaller and you know your professor's on a close basis.<br><br>", "<b>Username: hawkette</b><br><br>nefer,<br>Congrats on your daughter being a Michigan student. I hope that she is having a good experience and learning a lot and surviving those early morning wake-up calls :)<br><br>In rereading some of my posts, I realize that I may have come off harsher than I intend. I have continually stated that Michigan is a fine school, but this thought seems to get overlooked. My comments and most of my arguments go to RELATIVE comparisons. What is Michigan's caliber relative to the schools to which it is being compared? Michigan is not an Ivy level school-Michigan is an excellent and large state university with student quality (as measured by average SAT score) nearly on par with Boston College.<br><br>I completely agree with your comment about personal taste. When schools are as qualitatively close as Boston College and Michigan, personal taste is everything. The comments made by some about class size and intro classes and fun have important experiential implications that will appeal to different people in different ways. Hopefully, students, alums or family associated with Boston College will provide their comments about the academics, the job placement and other areas at BC today (not ten years ago) and, if possible, compare this to Michigan today.<br><br>", "<b>Username: nefer</b><br><br>Thank you. Over the winter break she bought a big alarm clock for that 8:00 (?) AM class, and so far she says she hasn't missed a lecture. That's good to hear, but I'm not sure I should believe it or not. lol<br><br>When we talk about schools like U Michigan, we agree on some things, but at the same time we have disagreements. Neither point of view is wrong, I think it's just that we are coming from different perspectives. You see a super-sized BC, I see a BC and a Northwestern rolled into one.<br>One can cite all the numbers, scores, ratios, or whatnot, but they can never tell the whole story. I was a math major as an undergrad, so I know how numbers can be misused. U Michigan is unique having both great and not so great attributes, and it's up to each individual to decide whether it's the right place for him/her.<br><br>", "<b>Username: hawkette</b><br><br>On the narrow basis of evaluating a study body by SAT, you could argue that Michigan with an average SAT score of 1315 would have the following peers:<br><br>Top 25% comparable to Northwestern (average SAT score of 1410)<br>25-75% comparable to BC (1335) although this may a bit unfair to BC<br>Bottom 25% comparable to Howard University (1140)<br><br>I anticipate strong reaction from the Michigan fans and there is obviously much more to compare in schools than just SAT scores. Nonetheless, student body quality is a critical piece of any college evaluation and, if my calculations are accurate, these SAT school comparisons are not far off the mark.<br><br>", "<b>Username: kazz</b><br><br>\"\"I anticipate strong reaction from the Michigan fans and there is obviously much more to compare in schools than just SAT scores. Nonetheless, student body quality is a critical piece of any college evaluation and, if my calculations are accurate, these SAT school comparisons are not far off the mark.\"\"<br><br>Not really... all I'm saying is that if Northwestern offered ALL of the same programs that Michigan does, including the obscure ones, they'd see a dramatic drop in their SAT average<br><br>nevermind the reporting issue between one-sitting and multiple sittings, which favor privates like Northwestern.<br><br>I guarantee that, among the students in traditional academic majors (engineering/business/liberal arts/etc), there's very little difference between those at Northwestern and those at Michigan.<br><br>Let's face it, the ONLY reason student quality matters in the first place is the competency of peers in your classes... and if you're an engineering undergraduate, you won't be taking classes with the students/student-athletes in athletic training/physical education/sport administration.. infact, at Michigan, the odds of you even crossing paths is slim.<br><br>You carry quite elitist attitude regarding these two schools, citing this SAT difference, when in reality they are vastly different schools that are hard to compare as apples to apples... it seems you've made it a personal mission to convince everyone at CC that the top publics aren't comparable to some of the top privates (Northwestern) when EVERYONE that matters thinks otherwise (employers/graduate admissions).... quite the chip you have on that shoulder man.<br><br>If Northwestern students in traditional academic majors were THAT much more capable, I'd imagine employers and graduate admissions officers would be well-aware and employment/admissions statistics would reflect that. However, they don't. They must see something you're failing to see, no? perhaps something akin to that which I described above?<br><br>", "<b>Username: nefer</b><br><br>hawkette,<br>A couple of comments.<br>First, you can't compare statistical distributions like that. It just so happens that I posted a chart comparing SAT score distributions of Michigan and Northwestern in another thread a few days ago.<br>Here it is again. <url>http://www.imagedump.com/index.cgi?pick=get&amp;tp=487950</url><br>This is not real data, mind you. It's my rough approximation. The real curves would certainly not be smooth, and there would probably be sharp drop-offs at both ends instead of long tails.<br>The top 25% of Mich is comparable to the top 50% of NW. Put another way, the bottom 50% of NW is no better than the average Mich range.<br>Draw an imaginary curve for BC centered at its average with a near identical shape but scaled to its relative size. Mid Mich 25-50% will be comparable to mid 25-50% of BC. You may be confusing percentages with sizes.<br>Now, do the same for Howard. In this case, however, I would say Howard, as a whole, is stronger than the bottom 25% of Mich. In fact, a significant portion of NW would be no stelar students at Howard, either. Nevertheless, NW student body is clearly stronger than Howard overall. So is Michigan's. Just making an observation. If some Michigan fan said every Michigan student is a SAT stud, it's obviously wrong. And I haven't seen anyone saying it.<br><br>Second. As you said, there's more to the quality and institutional character than SAT scores. Even though the compositions of the student bodies of Mich and BC as measured in terms SAT are similar, Michigan arguably has faculty, academic, job &amp; graduate school placement resources that are more comparable to NW than BC. That's Michigan's edge as I see it. If you want to rank schools and put NW above Mich, I have no problem with that. In fact, I would do the same if forced to, but then I would toss it afterwards.<br>(BTW, My apology to BC folks. BC is a great school. Who dragged BC into this dog fight? My daughter applied to BC last year. Had she chosen to attend it, I would have supported her)<br><br>", "<b>Username: hawkette</b><br><br>Kazz ,<br>I think your argument weakens considerably when you start explaining how all of the obscure majors bring down the Michigan SAT average and that everyone else at Michigan is much stronger. I think you do those in the less traditional majors a disservice and, more importantly, I dont think you have any data to support your opinion. If you do, then please share.<br><br>Your guarantees are opinions. I accept that there are many fine students at Michigan, but please remember that there are 26,000 undergraduates in AA and total student population is over 40,000.<br><br>Your claim of my take on the top publics is way off. Michigan and several other states have excellent state universities. Their size is an advantage in many comparisons with the private schools as they normally offer a greater variety of majors than the privates. The rankings surveys (eg, USNWR) reward this breadth of offering with higher Peer Assessment scores. Without PA, it is a fact that the publics would be ranked lower and in some cases, significantly lower. The disadvantages of publics are obvious-larger class size particularly in a students first two years, less resources available per capita to support both faculty and students and, most important in my mind, a lower average student quality. If pointing that out is elitist, then I guess I am elitist, but these seem like pretty well established and non-controversial observations.<br><br>As for your comment about EVERYBODY that matters, well I am an employer and so are several other posters on this thread and other Michigan-related threads. No one doubts that Michigan has some fine students, but many employers could care less about Michigan (or Northwestern or BC for that matter). It depends on the employer and the industry. Michigan draws 69% of its current students from Michigan and 85% from the Northeast (btw, BC only draws 66% from the NE). Do you really think that an employer in the Southeast, the Southwest, the West, the Northwest, and the Mid-Atlantic really believe that Michigan is an essential source of students? Work for a few years and then come back and tell me that ones undergraduate school has great importance for the employer. Grad school yes, but undergrad generally no unless there is some specialized skill that is being developed.<br><br>And, dear Kazz, tis not me who has the chip on the shoulder, but rather the Michigan folks who insist on being associated up and never down.<br><br><br>Nefer,<br>I was responding to your last comment about how Michigan was BC and Northwestern rolled into one. I agreed with a caveat, that caveat being that the bottom 25% at Michigan is weaker. I agree that Howards average is probably a touch stronger than Michigans bottom 25%. My numbers from the earlier post were meant only as very rough approximations. BTW, I liked your diagram.<br><br>For your comment on the usefulness of using SATs to judge institutional quality, I agree with you. On three separate occasions in this thread alone (#18, 29, and 46), I have stated that SATs arent everything for judging a school or student quality. But SAT scores are hard numbers and do allow quantitative comparisons across different types of schools (Michigan, BC, Northwestern, Howard), different regions of the country (NE, MW, Mid Atl), different sizes of schools (7000-26,000), etc.<br><br>We commonly read many strongly expressed opinions about how such and such a school is great or has terrific faculty or the class sizes really arent that big or the job/grad school placement is superb, etc, etc, etc. Coming from partisans and without supporting data, these statements are revealed for what they are-opinions. I prefer to look at the measurable data. While some intangible qualities of a school are certainly missed in the raw numbers, the quantitative data does provide a solid foundation for analysis and initial comparison. In that at least, I can put a large degree of confidence.<br><br>", "<b>Username: CC Admin</b><br><br>The University of Michigan is in the Midwest, just thought you should know that.<br><br>", "<b>Username: hawkette</b><br><br>^^^Not sure what your point is, but if related to my comment about employers outside of the Midwest and Northeast, please recognize that Michigan posters persistently claim that their graduates have national appeal. I would argue that generally-educated Michigan undergraduates have no special appeal outside of its region. The same would be true for the vast majority of undergraduate schools in America.<br><br>", "<b>Username: CC Admin</b><br><br>\"Michigan draws 69% of its current students from Michigan and 85% from the Northeast (btw, BC only draws 66% from the NE). \"<br><br>this is what i was referring to.<br><br>Everyone knows about Michigan, my cousins in China knows Michigan is a world class University. I really don't know what you mean by appeal, at the engineering career fair, California Department of Transportation actually came to hire Michigan Engineers. I interviewed with several startups in silicone valley on campus. Although I would say 50% of the employers on campus are looking to fill positions in the midwest, there are opportunities throughout the country.<br><br>", "<b>Username: nefer</b><br><br>hawkette,<br>re: point #1, we are in agreement. That there is a good percentage of \"weak\" students has never been disputed by anyone, partisan or not (BTW, I put \"weak\" in quotes because 90% of the student body were in top 10% of their high school graduating class)<br>A school that strives to provide Northwestern caliber education to a combined Northwestern and BC student body, and high school honor students to bring up the rear, is quite impressive to me. A feat which I think no metrics used to rank schools today can adequately capture and express.<br><br>With regard to using SAT scores, if you look at the chart again, Michigan is so large that one cannot easily draw a straightforward comparison. Rather, interpretations need to be made. That was the main point that I wanted to show. If the chart gave some readers pause, it has served its purpose.<br><br>One last comment before I hit the sack. I think you are putting too much stock in US News ranking methodology. It has been criticized repeatedly for lacking an empirical or theoretical foundation. I will spare the readers of technical details (they can read it on the Web), but suffice to say that it should only be used as a rough guideline. It does a pretty decent job, but it is not on a firm ground. Many US News metrics, such as faculty/student ratio, class size, alumni giving rate, even selectivity, are in reality a veiled measure of the wealth of the school. Nothing that money can't solve in time. I am more interested in seeing placement rates, satisfaction rates, etc, and some data that points to Michigan's success is available as has been discussed. It's my belief that just because sufficient data is not at hand does not mean we must rely only on things that are only peripherally important. Let us agree to disagree on that.<br><br>", "<b>Username: nefer</b><br><br>kazz,<br>In all fairness, hawkette does not come across as a elitist to me. On the contrary she seems anti-elitist. She just thinks that Michigan's reputation is unsubstantiated based upon her evaluation. I have tried to explain why I think her opinion is unjustified.<br><br>", "<b>Username: Pre-medwannabe</b><br><br>If your interested in Business, Michigan has much better recruitment from investment banks, consulting firms and top companies when compared to BC. Also, most Michigan departments are generally ranked quite high in their field and therefore I feel that Michigan definitely has more name nationwide and more prestige. You should go with your personal choice, but when it comes to finding top flight type jobs out of college Umich has a landslide of an advantage.<br><br>", "<b>Username: Alexandre</b><br><br>I am staying out of this thread and as such will not offer my take on this whole BC vs Michigan debate. However, I agree with nefers. Hawkette does not strike me as elitist. Rather, I think her attention to detail, her belief that Michigan supporters are somehow trying to aggrandize its excellence and reputation and her reliance on raw statistics somehow impede her ability to see the big picture. In short, we attach value to different aspects of education and as such, come up with utterly different conclusions. That can be said of any university, Harvard included.<br><br>", "<b>Username: hawkette</b><br><br>This thread, I'm afraid, is becoming way tooooo much about me. I am not the topic-Boston College vs Michigan is the topic. I happen to think that the two schools are very, very close in a number of important respects. I have provided several data points to support my conclusions. You may not like my conclusions and that's fine, but please respond with facts and supporting data as your argument will be much stronger and a heckuva lot more relevant.<br><br>jeffl,<br>You indicate that you have had a good experience with Michigan engineering which represents 17% of Michigan's undergrads (or nearly 4500 students out of 26,000). I certainly don't agree with your comment about \"everyone knows Michigan\" (ever been to Texas, Louisiana, Florida, Pacific Northwest, etc?). Nonetheless, engineering is known as one of the stronger undergrad programs and also, for many students, probably has a level of specialized training that puts it into a different category than the generally educated student at Michigan. Good luck with your job search. I think if you work somewhere outside of the NE or MW, in a few years you will come to understand and accept my comments.<br><br>nefer,<br>I agree that \"weak\" is too strong a word to describe Michigan's bottom 25%. A better word choice might be less competitive. As you rightly point out, a very high percentage of Michigan students did achieve Top 10% high school rankings.<br><br>I am not so much putting stock into USNWR rankings as I am putting the USNWR data out there for all to see and evaluate for themselves. I am interested in the details behind the rankings and would be interested to read your thoughts on its lackings. Too often in these \"debates\" on CC, posters present opinions that they fervently believe (and do so I am sure with good intentions), but diminish objective data that might lead one to a different conclusion. I believe that there is value in pointing out the differences in things like class sizes or SAT levels or in financial resources to support faculty hiring and student services. The reader can draw his or her own conclusions about the importance of this data. My complaint is that some want to accept some (subjective) information (Peer Assessment) when it suits their purpose and reject other (objective) data when it presents a less rosy picture.<br><br>There are great intangibles to every university and accounting for this is sorely lacking in the USNWR rankings. Both Boston College and Michigan would likely score highly on any discussion of a school's intangibles. I hope to pursue this topic in a different forum.<br><br>pre-medwannabe<br>Do you even know BC's numbers for investment bank recruiting or is this your perception? You may be right (I don't know), but voicing an opinion without evidence from both sides greatly undermines the value of the opinion. Also, can you explain the basis on which you conclude that Michigan has a \"landslide of an advantage\" in finding what you describe as \"top flight\" jobs?<br><br>Alexandre,<br>Don't stay out of this discussion because of me. You and I may reach different conclusions about the relative strength of Michigan as an undergraduate school, but your comments are always interesting (if not always well supported). In particular, I'd like to read more of your thoughts on what aspects of education you believe I am undervaluing and how you would rate these in the current Boston College vs. Michigan discussion. Also, I would be interested to know your take on the bottom quartile at Michigan and how these students stack up vs the average at other schools.<br><br>", "<b>Username: CC Admin</b><br><br>i really don't understand your logic, there are plenty of laymen in the state of Michigan that thinks Michigan State is a better college. Two of my friends have gotten jobs in Austin and Houston, with Dell and Shell Oil, and gets paid very well compared to average salaries. Of course Michigan goesn't garner the same wow factor as Harvard or MIT. The average person would never have heard of Rice either, or Emory but both are very fine schools, and of course the employers recognize this.<br><br>btw, I will be working in the mid-atlantic region as a business consultant.<br><br>", "<b>Username: hawkette</b><br><br>^^May I ask what business will you consult on and where in the Mid-Atlantic will you be?<br><br>", "<b>Username: CC Admin</b><br><br>i can't say specifically, but its Virginia.<br><br>", "<b>Username: hawkette</b><br><br>I can't speak for Northern Virginia as that area is filled with people from outside of the state, but if you will be located more than an hour south of DC, I think you will come to understand much of what I have been saying about Michigan's impact. Good luck in whatever the work will be.<br><br>", "<b>Username: k&amp;s</b><br><br>hawkette sums it up pretty well here.<br>\"\"Michigan's SAT scores are impressive for a school its size.<br><br>Quantitatively, the SAT impact of the recruited athletes is much larger at places like Duke, Stanford, etc. because the class size is so much smaller.<br><br>You would probably say the same thing about UCB, UCLA, UVA, UNC, etc. or any other large state university. The difference is that most of the folks from those schools don't drone on constantly about how their school is the equal of several schools in the Ivy League. We all agree with the idea that at least 25% of the students at these state universities are talented. What the Michigan folks fail to acknowledge is that there is an equal number that is significantly less talented and this has an impact on the overall quality of a school. If you do a fair and full analysis of Michigan (student body, the quality of the undergraduate experience, after-school job prospects, etc.) and similar excellent state universities, the conclusion is inescapable that these can be good places, but on the whole, they are not uber selective or mega elite. Sort of like Boston College. Not like Penn, Dartmouth, Wash U, Northwestern, Emory, Rice, etc.\"\"<br><br>Really, this is a pretty simple concept.<br><br>", "<b>Username: ckmets13</b><br><br>I will just ask a simple question. I have nothing against Michigan, it is a great school. I go to BC, but I dont love it, and I may be transferring, so I am not biased.<br><br>Most people that go to BC would get into Michigan (in fact, probably all of them, except recruited athletes, mostly football, that wouldnt cut it athletically to play at Michigan). If Michigan were a better school \"By a landslide,\" then why would anyone ever choose to attend BC? I say this about any public school that people claim is far superior to BC based on Peer Assessment. Based on this logic, nobody should be attending BC since all of these higher PA rated schools are obviously more prestigious. By the way, I have stats from my school, OOS for Michigan and in one of the main feeder areas outside MA for BC, that can show that getting into Michigan from out of state is not as difficult as many would seem to believe.<br><br>Undergrad- i guess its a toss up, but i think BC wins slightly<br><br>Grad- Michigan>>>>>>>>>>>>>>BC<br><br>", "<b>Username: CC Admin</b><br><br>I don't think you can say most would get into Michigan Out of State. They could, but it is not a given. The average Michigan student can also get into Cornell, Carnegie Mellon, Vanderbilt. When I applied to colleges 4 years ago, I learned that college admissions is largely a crapshoot, I got into all but one school that I applied to, but it is still a game of luck, there are people who were more qualified than me who didn't get into some of the schools that I got into.<br><br>I think Alexandre's point, and I agree is that there is no distinguishable difference in the overall student quality in the top 40 schools, with the exception of HYPS, MIT, Caltech.<br><br>Michigan offers a great alumni network, best faculty in the world, great resources,very studious 24,000 students. People often cite huge differences between graduate programs and undergraduate programs as a negative for public Universities such as Michigan and Berkeley, but I've been taking graduate level classes for the past 3 semesters, and I think the undergraduate classes are just as good, if not better than the graduate classes. The profs that teach graduate courses, also teach undergrad.<br><br>", "<b>Username: k&amp;s</b><br><br>\"\"The average Michigan student can also get into Cornell, Carnegie Mellon, Vanderbilt.\"\"<br><br>Not true.<br>\"\"I think Alexandre's point, and I agree is that there is no distinguishable difference in the overall student quality in the top 40 schools, with the exception of HYPS, MIT, Caltech.\"\"<br><br>Not true (esp. among the top 20 privates and the top publics).<br><br>", "<b>Username: CC Admin</b><br><br>when did you graduate from college K&amp;S?<br><br>", "<b>Username: hawkette</b><br><br>Once again, the arrogance of Michigan posters is on full display:<br><br>The average Michigan student can also get into Cornell, Carnegie Mellon, Vanderbilt.<br><br>As the following facts reveal, the truth is that the average Michigan student may not get into Boston College, much less Cornell, Carnegie Mellon, and Vanderbilt.<br><br>MICHIGAN<br>SAT range for middle 50%: 1210-1420<br>Applicants: 25,806\tAcceptances: 12,246<br>Acceptance Rate: 47.4%<br><br>BOSTON COLLEGE<br>SAT range for middle 50%: 1250-1420<br>Applicants: 26,584\tAcceptances: 7736<br>Acceptance Rate: 29.1%<br><br>CORNELL<br>SAT range for middle 50%: 1280-1490<br>Applicants: 28,098\tAcceptances: 6935<br>Acceptance Rate: 24.7%<br><br>CARNEGIE MELLON<br>SAT range for middle 50%: 1300-1490<br>Applicants: 18,864\tAcceptances: 6357<br>Acceptance Rate: 33.7%<br><br>VANDERBILT<br>SAT range for middle 50%: 1300-1470<br>Applicants: 12,189\tAcceptances: 4128<br>Acceptance Rate: 33.9%<br><br>Jeffl,<br>Be proud of your school, but also be respectful of others. You are living in a dreamworld where the Michigan people tell each other how great their school is and is sooooo much better than everywhere else and everybody completely swallows the Kook-Aid. Michigan is a good school, but you need to get out more. There are lots of great schools and IMO many of them have superior student bodies and faculties and alumni networks. BC is one of them.<br><br>", "<b>Username: CC Admin</b><br><br>First, I have never been disrespectful to anyone. College admissions is not a purely numbers game. It comprises of many factors. I said simply that an average Michigan student has the credentials to be admitted at those schools. Also, You should really post numbers carefully.<br><br>Michigan's SAT 25%-75% range is 1260-1480(<url>http://www.admissions.umich.edu/fastfacts.html</url>)<br><br>I got into CMU and Vandy 4 years ago. Back then, the SAT range for Vandy was about 1240-1410, with acceptance rate in the mid 40s. Universities do not change that much in a 4 year span of time, in fact it doesn't change much in a decade. What did change was that USNews boosted Vandy's rankings, which prompted more SAT conscious seniors to apply and results in higher SAT scores, is Vandy really different from 4 years ago, i can't see that.<br><br>This is also the case for CMU, their Tepper School of Business had poor yield rates when I was applying, with acceptance rate in the 40s, now its below 20%, due to increase in yield and applications. Did Tepper really improve that much in 4 years?<br><br>", "<b>Username: GoBlue81</b><br><br>Jeffl's statement would be more valid if you qualify it as follows:<br>\"Statistically, the average OOS Michigan student can also get into Cornell, Carnegie Mellon, Vanderbilt.<br><br>It's as least as valid as saying:<br>\"Most people that go to BC would get into Michigan (in fact, probably all of them, except recruited athletes, mostly football, that wouldnt cut it athletically to play at Michigan).\"<br><br>So you see, Michigan posters are not the only ones that are \"arrogant\". LOL!<br><br>", "<b>Username: ckmets13</b><br><br>The quality of the students at Vandy and CMU Tepper improved over the last four years, so yes, the schools have improved. 10 years ago, anyone could get into BC (well, you know what I mean), and now the acceptance rate is under 30% and it will go down to almost 25% next year as apps increase to 32K supposedly. If you dont think student quality matters, then I dont know what to say to you. If you have the best profs in the world teaching not so great students, does that make a great school?<br><br>", "<b>Username: ckmets13</b><br><br>I am not arrogant, just stating facts. I have seen many weaker students get into Michigan and get rejected/waitlisted from BC, and I am from a big area that BC draws from. Maybe these were just a few isolated years, but I dont think so. As I said, I dont even like BC, I am just stating facts.<br><br>", "<b>Username: CC Admin</b><br><br>Also, a fact that rarely gets talked about is that Cornell, Boston College, Carnegie Mellon, Vanderbilt all accept the Common Application, while the University of Michigan does not. This increases the applicant pool tremendously, similar to the effect of the UC application, that I talked about previously. (<url>http://www.commonapp.org/index1.cfm?fuseaction=AllMembers</url>)<br><br>Also, if you are really happy about selectivity of CMU, take a look at this:<br>The average gpa for CMU's H&amp;SS(like Michigan's LSA) is 3.39, with class rank average of top 12%.<br><br>(<url>http://my.cmu.edu/site/admission/menuitem.edce48707aab43c019300710d4a02008/</url>)<br><br>", "<b>Username: hawkette</b><br><br>Jeffl<br>Your facts are wrong. First, the numbers you provide are for admitted students. Please see the attached link (provided by Hoedown) for Michigans enrolled students. Michigans SAT range is 1220-1410 with a 47% admit rate. For BC, it is 1250-1420 with a 29% admit rate. And as shown above, BC actually received more applications than Michigan.<br><br><url>http://sitemaker.umich.edu/obpinfo/files/umaa_freshprof.pdf</url><br><br>Second, one has to decide which is the reality-Carnegie Mellon and Vanderbilt of four years ago or those schools today. As you correctly point out, those schools have markedly increased their selectivity and now boast numbers a good deal stronger than Michigan although Michigan has also improved over Fall, 2003 when its acceptance rate was 53.1% and 1200-1390. Things do change in colleges, but reputations change far more slowly and that works for a status quo schools like Michigan which relies heavily on its historical reputation. I wont comment directly on CMU and Vanderbilt (this is a BC thread after all), but the reader will have to make his/her own judgments about the numbers and what they say about all of these schools (Michigan, Boston College, Cornell, Carnegie Mellon, Vanderbilt) today and their trend over the last four years.<br><br>Third, your comment about USNWR rankings inaccurately implies major ranking changes for these schools. That has not happened. The facts are:<br><br>Carnegie Mellon: 21 (2007), 22 (2006), 22 (2005), 23 (2004)<br>Cornell: 12, 13, 14, 14<br>Vanderbilt: 18, 18, 18, 19<br>Michigan: 24, 25, 22, 25<br>BC: I dont have the numbers. If anyone can supply them, please do.<br><br>GoBlueMom or anyone who might have them,<br>Can you provide any OOS admission and SAT statistics? I have not been able to find any so there is no way to verify claims about the difficulty of OOS admission to Michigan.<br><br>", "<b>Username: hawkette</b><br><br>jeffl,<br>Your response is classic Michigan. If the facts don't fit, then blame something-in this case, the use of the Common Application. Lame. Very lame.<br><br>As for the CMU data, you may not have realized that those numbers you criticize indicate a class rank of top 12% and an average SAT of 1300-1480, ie, an average of 1370 which is well above Michigan's average of 1315. To put this difference in perspective, it is as wide as the gap between Michigan and the University of Florida (1260 average) or UC-San Diego (1260). If you want to consider the gap between Michigan and CMU to be negligible and that they are peers, then you must also accept that the gap with the lower ranked schools is also negligible and that they too are peers. You can accept CMU's average student superiority or you can associate Michigan with the likes of Florida and UC-San Diego? Which do you choose?<br><br>", "<b>Username: ckmets13</b><br><br>I know BC has spent the majority of the last 10 years between 36-40 in US News, 40 last year, ill try to find the other rankings. 34 i believe is our highest in a while, if not ever<br><br>", "<b>Username: CC Admin</b><br><br>I'm tired of arguing with you on this point. You won't convince me of anything, because i've met countless brilliant minds at Michigan throughout my 4 years here, as an OOS student. And I realized that I won't convince you of anything either. You can say that I gave up because you have cited so many facts.<br><br>I believe that I've received just as good of an education as I would have at CMU, or Vandy, or Cornell. I'm tired of arguing about selectivity when I know Michigan is full of bright students. My friends and I have gotten great jobs because of the name of this University, and the alumni connections. With my employer, which is a fairly prestigious consulting firm, when I interviewed, the interviewer actually said \"wow, Michigan!\" I'm not going to discuss about this anymore, the OP, having gotten into both schools has the intelligence to choose the best school for him/her. Spring Break next week!<br><br>", "<b>Username: hawkette</b><br><br>Aw, Jeffl, come on. We were just starting to have fun.<br><br>Look, I know that I appear hard on Michigan, but let me just conclude our interactions in this thread as follows. You have had a good four years at an excellent state university. They have prepared you well and you're off to a new state and a job that you value. Hopefully, you will remember fondly your past four years in AA and in the future, you will learn that there are a lot of other great students and great schools out there (like BC). I am happy for you and wish you well.<br><br>", "<b>Username: hawkette</b><br><br>Next.........<br><br>", "<b>Username: hawkette</b><br><br>Regarding recent posts about Michigan's student strength vs some other schools, it might be useful to couch this discussion in terms that Michigan fans profess to know something about-football. As you know, high school recruiting is critical to the success of any college football team and getting the best players possible is the objective of every school.<br><br>Let's suppose that, for whatever reason and for more than a season or two, top high school football players decided to matriculate elsewhere (like at Boston College) and Michigan was forced to take lower ranked high school prospects for their team. What would the end result likely be? Boston College would have a better football team than Michigan. Michigan would still have the same group of coaches that everybody thinks is so great. Michigan would still get to play in a huge stadium in front of lots of adoring students and alumni and would probably still get more media airtime than Boston College. Michigan would still have some very good players and probably even a star or two on its team. But that would not change the fact that the average football player at Boston College was more talented than the average football player at Michigan when they went to college.<br><br>If you think about this objectively, this is a pretty good analogy. While Michigan might still have several institutional advantages over BC, student quality is not one of them.<br><br>", "<b>Username: Rabban</b><br><br>Hawket,<br><br>I mean no disrespect, but you are being a message hog give it upit really doesnt matter if youve posted thousands stats after thousand useless stats. The reality (that you seemed to fail to realize) is that Michigan is a much better school than BC.<br><br>What this means without doing much tap dance around is that if a student has a choice between the two and if he likes to get the best bang for his buck he should go to UMich nine out of ten shots- because its a better school. Period. lol Im sorry that I had to but stick to u this way, but sometimes youve gotta learn things hard way. Have a good day<br><br>", "<b>Username: hawkette</b><br><br>Rabban,<br>I'm relieved to know that you think that facts don't matter in the admission of a college class or in the evaluation of a student body. And all this time I thought that the academic world valued measurable data.<br><br>What is up with you people. Boston College gets more applications, admits almost 5000 fewer people, has an SAT average that is higher and Michigan people still claim that Michigan is more selective. I may not be the brightest bulb on CC, but something does not add up here. Please explain that one to me.<br><br>And what are you saying about the quality of the students at Boston College? It seems that you (and other posters) are implying that they are a bunch of dolts who would never get into Michigan. Am I reading you right? No need to tap dance in your answer-give it to me and the world straight so that we can unambigously know what a Michigan man thinks of everybody else.<br><br>", "<b>Username: ckmets13</b><br><br>I couldve got into Michigan...but I didnt even apply. Why? Because the simple fact is that many students at Michigan do not deserve to be attending a \"top\" school. And let me tell you, I am from Long Island and if I had gone to Michigan, people would not have been \"wowed\" at all. They would just say..oh, Michigan, theyre the ones that got destroyed by OSU in football this year. Michigan is a good public school, but let me ask you think. If Harvard had all the same facilities and endowment, but had students with 1100 SAT scores and 3.0 HS GPAs, would it still be considered the same as it is today? Seems to be a silly question, but it really isnt considering what the Michigan people on this thread are saying. Why does the fact that Michigan has more well known academics make it a better school than BC? We are talking about undergraduate education here, not quantity of research or anything like that. How is having a professor who is a great researcher but hates being in a class of freshmen going to help me learn intro physics? Quality of students has much more bearing on undergraduate experience than any other factor, and the simple fact is that the average BC student is better than the average Michigan student. Sorry.<br><br>", "<b>Username: ckmets13</b><br><br>Stats obviously dont matter to these people unless they back up the fact that the current rankings should look like<br><br>1. Michigan<br>2. Harvard<br>3. Everyone Else<br><br>", "<b>Username: Rabban</b><br><br>lol, dont get mad. Im not bagging BC or other any school for that matter. What I said was UMichgan is a much better school than BC. Period. No need to google stats after stats for refuting that- The world knows that. Heck, even my dog knows that.<br><br>Well, Ive never said I dont trust stats. What Ive said was that I found all the irrelevant stats that you posted for your sake completely useless. However, since you are insisting on hard facts, I guess Ill just play along for the time being. Then lets see.. (turning around and putting on an academic cap). The ultimate holy gral , aka USNEWS ;) , says:<br><br>Mich: 24<br>BC: 34<br><br><br>The Newsweek says:<br><br><url>http://www.msnbc.msn.com/id/14321230/site/newsweek/</url><br><br>Mich: 11<br>BC : ??? (um I cannot find BC )<br><br>The THES says:<br><br><url>http://www.paked.net/higher_education/rankings/times_rankings.htm</url><br><br>Mich : 29<br>BC: ???<br><br>Well, I dont know about you, but to me they are all saying the same thing: UMich is better than BC. In fact, I will challenge you to go find any ranking that says otherwise.<br><br>", "<b>Username: barrons</b><br><br>The fact is people who are great researchers are often great people too and make great teachers. Most research work involves managing and motivating a small group of people--there is little research that is done by just one person. You have to have the ability to get the best out of people--just like in teaching.<br><br>", "<b>Username: hawkette</b><br><br>Rabban,<br>I have posted many times on the unreliability of rankings that include subjective data. Beyond the obvious personal bias inherent to each response, it is quite likely that these opinions are the remnant of impressions formed many years ago and may no longer reflect a current environment. Peer Assessment certainly falls into this category. This completely untransparent measure does not tell who responded, what schools they commented on nor what they said. Out of curiosity, how do you feel about using assessment by employers rather than by academics? Would you agree with the thought that employers are better placed to judge the quality of a college and its graduates as our capitalistic society is interested in results?<br><br>For USNWR, Ex-Peer Assessment, BC and Michigan are virtually tied. Which hard stats do you consider to be \"useless\" and \"completely irrelevant?\" Which ones do you believe are useful and relevant?<br><br>barrons,<br>Would you mind expanding on those comments? I'm not sure how you relate those to the quality of the students at a school, the quality of the education that they receive and, perhaps most important of all, how you would measure the effectiveness of the teaching from institution to institution? And regardless of your answer, how do you know about the quality of the teaching that goes on outside of your own environment? Does a provost or some other academic at Michigan really have any idea what is currently going on at Brigham Young...or what is currrently going on at the University of Tulsa...or what is currently going at the University of Georgia...or what is currently going on at Boston College, etc? Maybe you can help me and others interested learn how these evaluations and judgments about colleges are made.<br><br>", "<b>Username: Tim_ND08</b><br><br>just to add a little fuel to the fire<br><br>My cousin applied to both schools<br><br>-was rejected by Michigan<br>- accepted by boston college<br><br>take that for what its worth<br><br>", "<b>Username: Alexandre</b><br><br>Not really Hawkette. In fact, I think it is a very superficial analogy. Player talent is far and away the primary determinent in putting together a winning athletic team, assuming the coach is semi-decent. In fact, most Michigan Football fans say that Coach Carr at Michigan is a good and decent man, a fine recruiter, a great representative of the University of Michigan and a good role model for his players. But, at the same time, those same fans will tell you that given the talent Michigan recruits year-in, year-out, Michigan should be doing a lot better. The primary reason for Michigan football's disapointing seasons has been average coaching Carr seems to keep his teams predictible and more often than not relies on Michigan's raw talent to win games.<br><br>The same cannot be said a an academic institution. Without the best professors, a university can never hope to reach the top, no matter how good its students are. Student talent also matters a great deal of course, but not as much as the faculty.<br><br>At any rate Hawkette, you seem to like nunbers a great deal. Why don't you interpret the following numbers? Check out #30 (#5 when considering absolute nunbers) and then, go all the way down to #45 to see who checks in at #79. Michigan's ratio is comparable to Northwestern, Cornell and Caltech. BC is obviously much lower.<br><br><url>http://www.collegejournal.com/special/top50feeder.pdf</url><br><br>Also keep in mind that schools like Michigan, Chicago and Northwestern do well despite their location. The study above admitedly has an East Coast bias. The Ivies and schools like Georgetown, Johns Hopkins, Tufts, Boston College, MIT, UVa and Duke are at a clear advantage. If you substitued a few of those East Coast graduate programs with Midwestern graduate programs, you'd probably have a very different picture. I realize that Law, MBA and Medical school matriculations are just a microcosm, but they are revealing nonetheless.<br><br>Those numbers indicate one of two things:<br><br>1) Michigan has far weaker students than schools like Cornell and Northwestern, but since it places as high a ratio of its students into top graduate programs, it is necessarily a better university, doing just as much with sub-standard students.<br><br>or, more likely,<br><br>2) There really isn't that much of a drop in talent between Michigan and the likes of Northwestern and Cornell and Michigan's student body is in fact better than BCs.<br><br>", "<b>Username: hawkette</b><br><br>...and my hairdresser's sister's mailman has a nephew whose best friend applied to both schools and got into Michigan but not BC.<br><br>Come on chillin...try a little harder. You're too smart a high schooler to take some random data point and expect that to be helpful and substantive in judging anything. For someone in your position and your age, this discussion can have real value. Think critically.<br><br>", "<b>Username: barrons</b><br><br>I think looking at the overall average quality of students is about the 10th most important thing in looking at a school. Now that UM is unable to give minorities a lift in admissions those stats should improve a fair amount. Is UM all of a sudden a better school?<br><br><url>http://media.www.michigandaily.com/media/storage/paper851/news/2007/02/19/Academics/Minority.Admissions.Plummet-2727909.shtml</url><br><br>", "<b>Username: hawkette</b><br><br>Alexandre,<br>Welcome back from the back alleys.<br><br>Yeah, I agree that the football analogy is not the cleanest and I don't have any idea about the football coach at Michigan. But you must agree that players do matter on any team and that there are a lot of good players playing college football, just as there are a lot of good students out there and a lot of good schools. Not sure, however, why you feel that the coaches (faculty) are more important than the players (students). Great players (students) will thrive regardless and oftentimes in spite of the coaches (faculty). And as for how universities become the \"best\" in academia, their research efforts have considerably more impact in deciding this than their teaching efforts.<br><br>On the link you provided for Collegejournal, I want to congratulate you on your ability to unearth a really obscure bit of information. Before I get to my response, congrats to Michigan for almost beating out Morehouse and Bryn Mawr College! And mega congrats for narrowly beating out the New College of Florida and Vassar College (and killed BC!!).<br><br>Alexandre, this chart actually reinforces my frequently stated point about Michigan's strength of student body. The school has some excellent students and this chart reflects that 156 of them got into some high prestige grad programs. But 156 Michigan students does not an entire graduating class make. Doesn't Michigan have 26,000 undergrads or 6500 graduates every year? What about everybody else? Don't they count?<br><br>", "<b>Username: NextMikeSays</b><br><br>\"\"I think looking at the overall average quality of students is about the 10th most important thing in looking at a school. Now that UM is unable to give minorities a lift in admissions those stats should improve a fair amount. Is UM all of a sudden a better school?\"\"<br><br>Student quality is a top reason many firms recruit at certain schools. It should definitely be a strong consideration depending upon certain career choices someone may have.<br><br>", "<b>Username: hawkette</b><br><br>barrons,<br>If, in your estimation, the quality of the student body is the 10th most important thing in looking at a college, then what factors would you rank 1-9? And I would still love to hear your thoughts on my questions posed in # 86.<br><br>", "<b>Username: xcjimmy1228</b><br><br>No offense to the Michigan homers, but I would daresay that the general public (especially in the Northeast) would a) have no idea where Michigan is geographically and b) would have no idea that UM is actually a decent school. Boston College definitely garners much more prestige here, if not nationally.<br><br>", "<b>Username: Rabban</b><br><br>Hawkette:<br><br>It would give me so much pleasure to further discuss these important subjects with you. However, 1) I dont have time nor desire to sift thru all your past posts, but Im sure they are all well thought out and 2) its about time for me to stop warming my seat and go home and wash my dog. Sowithout much trouble of going thru your posts, Id like to pinpoint some of the fallacies in your thinking based on your few posts in this thread.<br><br>You seemed to think that all those numbers can somehow substantiate your claim that College X is better than College Y because the average GPAs &amp; SAT scores of X are higher than those of Y so and so forth. Nothing is farther from the truth. What you fail to realize is that college, broadly speaking education in general, is more than just numbers. Further, I would point to you that if you want to play by the stats, you must consider all other important stats, such as the caliber of faculties in terms of research outputs (the number of journal articles, open literature presentations, reports), students opportunities for researches, academic learning and social environments, just to name a few. You cannot just pick and choose the numbers for the sake of your arguments. For example, you marginalize the PA scores while you put way too much stock on the SAT numbers and like. So there- I cannot possibly give you more than B- on your write-up. You can do better than that. Have a nice day<br><br>", "<b>Username: ckmets13</b><br><br>come on, i know someone who got into Harvard but not BC<br><br>therefore BC>Harvard of course (:<br><br>", "<b>Username: ckmets13</b><br><br>did anyone actually read what I said about people in the northeast. Michigan is known for football only in the northeast, BC has more regional prestige. Its not like i care about that, I am just interested in which school is better for undergrad, as the OP wanted to know.<br><br>", "<b>Username: ckmets13</b><br><br>Rabban with the way you end your posts, you deserve absolutely no respect from anyone, but I guess because I want to show that BC students arent jerks, ill give you some. I will ask once again, how to undergrads benefit by the number of journal articles published by the school's faculty. Last time I checked, these articles do not make me learn. What does make for a better learning environment is being around higher quality students on average, and this is why BC is better for undergrad than Michigan. If I were in state for UMich, there is no doubt thats where I would go, but being out of state, I wouldnt pay 45K or whatever it is for Michigan, just like I would go to Wake any day over UNC, or any other examples you can think of (Rice>UT-Austin i guess, as some here seem to think UT-Austin is a much better school)<br><br>", "<b>Username: Rabban</b><br><br>very well done. I am proud of you<br><br>", "<b>Username: hawkette</b><br><br>Ok everyone,<br>How do you guys score that one (post # 95)? ^^^ Another knockout? These Michigan guys are S-O-F-T. I mean, someone comes and makes a facts-based argument and these guys get all red and hot under the collar and go storming off. Keep that dog inside because it's cold outside.<br><br>Rabban,<br>Ok, enough of the sarcasm and whatnot. I happen to agree with a large part of what you are saying. Analyzing and grading a school is not easy and there is more to it than just looking at a bunch of data. But you and others do nothing more than stamp your feet, insist that Michigan is better (isn't it obvious!!!), and act like the world should just accept it because you or some academic said it was so.<br><br>When I first posted in this thread, I actually indicated that IMO Michigan had the slight advantage over Boston College based on the USNWR numbers (including PA). I stand by that statement. But the reaction of Michigan posters not to give any respect to Boston College (which after all gets as many applications, rejects 5000 more students and has a higher average SAT than Michigan) is representative of what I see from Michigan posters all over CC. Michigan is a very good school with a nice portion of excellent students, but, overall, its student body is not that special. There are plenty of schools that have stronger or equal student bodies. BC is one of them.<br><br>As for your comments about making a broader review of a school and quantitative factors, bring it on if you think it will advance the discussion and support your conclusions because so far you've brought very little other than your opinions and your indignation.<br><br>", "<b>Username: barrons</b><br><br>1-5. Faculty quality<br>6. Campus environment--lively vs boring etc., political or country-clubbers<br>7. College town atmosphere<br>8. Campus facilities in my major and overall<br>9. Social scene and sports<br>10. SATs of other students.<br><br>The guys that founded The Onion went to Wisconsin. I have no idea what their SAT scores were but the paper is a hoot. It was published on campus for years before the rest of the country got to see it.<br><br>Michigan was the founding home for SDS with Tom Hayden. Please advise me of one interesting thing that ever happened at BC. Besides Doug Flutie throwing a long TD pass.<br><br>", "<b>Username: Rabban</b><br><br>\"\"Please advise me of one interesting thing that ever happened at BC.\"\"<br><br>Doug Flutie Hail Mary Perhaps<br><br>", "<b>Username: Rabban</b><br><br>Lol, Hawkette oh comeon what indignation? Somehow I think you are a woman..<br>A woman of mystery Dark lady<br><br>Dark lady laughed and danced<br>And lit the candles one by one<br>Danced to her gypsy music<br>Till her brew was done<br>Dark lady played black magic<br>Till the clock struck on the twelve<br>She told me more about me<br>Than I knew myself<br><br>", "<b>Username: Rabban</b><br><br>Barron beat me to it :(<br><br>", "<b>Username: hawkette</b><br><br>barrons,<br>According to your methodology, I have an announcement. Move over Princeton, move over Harvard. The University of Texas is the number one school in the country (I knew all along it wasn't one of those danged northeastern schools). Great faculty, great college town (Austin is everything that AA is and more and also not freezing), fabulous campus environment (I bet they have both political types AND country clubbers!), campus facilities (more than you could want and then some), social scene and sports (I don't think you want to compare Texas's social scene with Michigan as it would get embarrassing for Michigan in a hurry). And as for the creativity and success level of some of the students, have you ever heard of Michael Dell? He only spent a year at Texas and look what he created.<br><br>Alright, I asked so I guess I shouldn't belittle your ideas, but I thought that we were debating the academic strength of a school and the relative importance of/need for a high quality student body. Your points (college town, campus environment, facilities, social scene, sports) mostly go to helping a student decide on \"fit.\" Very important aspects to consider in choosing a college, but they do next to nothing to measure the academic quality of the institution or its student body.<br><br>And Rabban, I welcome you back to the discussion and your dog thanks you. And I thank you for the poem. Beats the hell out of a Hallmark card.<br><br>", "<b>Username: ckmets13</b><br><br>tons of schools beat Michigan in that category. And Boston isnt such a bad college town either, i would even venture to guess its a little more exciting than AA. Maybe.<br><br>", "<b>Username: barrons</b><br><br>Hawkette--See numbers 1-5.<br>I lived in Austin in its halcyon days when Dell was still building computers in his garage. While good the faculty is not on the harvard level yet--or even up with the top state schools. Now as a fun town to enjoy life and music--it was hard to top. Fabulous T Birds one night, Stevie Ray the next, and Marcia Ball or the Pretenders or the Clash the next. Work off the hangover with a big cheap plate of migas and beans next morning and life was sweet.<br><br>", "<b>Username: barrons</b><br><br>Which category was that mets??<br><br>", "<b>Username: ckmets13</b><br><br>6-10 on your \"list\" BC beats Michigan in. You Michigan supporters can keep thinking that your faculty can teach 100 times better than BC's, it doesnt affect me. You probably think we get taught by priests, you have no idea about the academics at BC.<br><br>", "<b>Username: hawkette</b><br><br>barrons,<br>Believe it or not, I agree with a lot of the thinking behind your proposed rankings methodology ideas although I might reorder a few of the items and weight some things differently. I want to incorporate them in a separate forum, if that is ok with you.<br><br>While I enjoy the banter of these discussions, I can't help but feel badly that there are a lot of places that have very strong faculties and even stronger records in your other categories and yet which get short shrift from high school students and all of the prestige-seekers and hangers-on. If the ranking process can be expanded to consider the attractiveness of a school's entire package (academic, environmental, social, post-graduate), this would almost certainly lower the rankings of the (IMO) overrated Ivies and raise those schools focused on providing a total experience. Both Boston College and Michigan have a lot to offer on these intangible factors and both would almost certainly compare better vs their more highly ranked Northeastern competitors.<br><br>Oh, and that sounds like some good times in Austin. As for the faculty ratings, anything Texas and UT is definitely not part of the Education Establishment. In turn, I would suspect that members of the East Coast intelligentsia are seen as having about as much credibility with Texans as the Dixie Chicks.<br><br>", "<b>Username: MattEisn</b><br><br>It really depends on what you want to major in.<br><br>", "<b>Username: ckmets13</b><br><br>thats not true..michigan people will tell you that everyone of their departments outranks BC's. they fail to mention that these departmental rankings are grad school based and mean little for undergraduate education<br><br>", "<b>Username: barrons</b><br><br>Grad school rankings are essentially faculty based. The only difference between grad and undergrad is the course numbers. The faculty is the same thus the grad ranking can also be applied to the quality of the undergrad at least so far as having top faculty is concerned. If you think it does not matter why are schools like BC trying so hard to hire faculty away from schools like Michigan?<br><br>", "<b>Username: kazz</b><br><br>Exactly, Michigan doesn't have top-10 departments across the board for nothing.<br><br>and what ckmets13, you think Michigan has a separate faculty for undergraduates? lol<br><br>furthermore, most universities have GSI's teaching at least some classes... and at Michigan, you know they're among the best in their fields (top graduate programs = top students)<br><br>", "<b>Username: Alexandre</b><br><br>Hawkette, you are feisty, I will give you that!<br><br>\"On the link you provided for Collegejournal, I want to congratulate you on your ability to unearth a really obscure bit of information.\"<br><br>Obscure? The information on that link was published by the Wall Street Journal. There is nothing obscure about the WSJ.<br><br>\"Before I get to my response, congrats to Michigan for almost beating out Morehouse and Bryn Mawr College! And mega congrats for narrowly beating out the New College of Florida and Vassar College (and killed BC!!).\"<br><br>What's wrong with Bryn Mawr and Vassar? They are top LACs. Bryn Mawr is Penn's sister school and is comparable to Wellesley and Smith. Vassar is one of the top 10 or 15 LACs. Besides, LACs are so small that a very small fluctuation in those numbers can send them soaring or tumbling. I mean just look at the New College of South Florida (which is a highly regarded LAC). Placing just 3 (THREE) students into top 5 graduate programs was enough to send them soaring. Had they managed to place anouther 5 of their students into top 5 programs, they would have made the top 10 list. Small LACs with fewer than 500 students per class are hard to analyze. As for Morehouse, it is one of the few outliers, primarily because 100% of its students are URMs. I don't think I need to explain further why it has such a successful placement ratio.<br><br>\"Alexandre, this chart actually reinforces my frequently stated point about Michigan's strength of student body. The school has some excellent students and this chart reflects that 156 of them got into some high prestige grad programs. But 156 Michigan students does not an entire graduating class make. Doesn't Michigan have 26,000 undergrads or 6500 graduates every year? What about everybody else? Don't they count?\"<br><br>First of all, Michigan graduates roughly 5,300-5,800 undergrads annually, not 6,500. Anyway, by that reckoning Northwestern places just 73 of its students into \"high prestige\" programs out of a class of 2,000 and Cornell 115 out of a class of 3,600. What about everybody else? Don't they count? Remember Hawkette, this is a ranking according to placement rates, not sheer numbers. According to raw numbers, Michigan is #5. As a ratio of its student body, Michigan places as high a percentage of its students into those top 5 graduate programs as Cornell and Northwestern.<br><br>But let me take this a step further, you always say the same thing. Only 150 out of 5,500 get into top 5 graduate professional programs, what about the remaining students? Only 150 students get into top Investment Banks and Management Consulting firms, ehat about the remaining students. Well Hawkette, those numbers keep adding on. Do you really want to do some serious math? Let's go:<br><br>The Wall Street Journal study was actually very accurate and quite telling, but it was very narrow. It only looked at matriculations intop 5 top Medical schools, 5 top MBA programs and 5 top Law schools. For medicine, they selected Columbia Medical School, Harvard Medical School, Johns Hopkins Medical School, the University of California-San Francisco Medical School and and Yale Medical School. For the 5 MBA programs, they selected the University of Chicago Business school, Dartmouth's Tuck School, Harvard Business School, MIT's Sloan School and Penn's Wharton School. In law, they looked at the University of Chicago Law School, Columbia Law School, Harvard Law School, the University of Michigan Law School and Yale Law School.<br><br>So, 156 Michigan graduates enrolled into those 15 mega-elite programs. But I think we can agree that for each of those professional fields, there are a handful or so other excellent programs.<br><br>Among Medical schools, the survey left out some definite top 10 Medical schools like Duke Medical School, Stanford Medical School, the University of Michigan Medical School, Washington University Medical School and Cornell Medical School. 50 or so Michigan graduates enroll into the University of Michigan medical school each year. I am not sure how many enroll into Stanford, Duke, Cornell and WUSTL, but let us assume, for argument's sake that Michigan manages to enroll 10 of its students into those 4 top medical schools. 156 + 50 + 10 = 216.<br><br>Among MBA programs, the survey left out a few top 10 MBA programs like Northwestern's Kellogg, Stanford Business School, Columbia Business School and Michigan's Ross. I have no actual numbers, but I do know that Michigan places an average of 15 of its students into Wharton and another 10 or so into Harvard BS annually and I also know that Michigan places more of its students into Kellogg and Ross. So let us be very conservative and say that Michigan places 50 additional students into Ross, Kellogg, Stanford BS and Columbia BS. 216+50 = 266. 50 is more like the number of Michigan grads who get into Ross alone, but like I said, I am being very conservative because I really don't have the exact figures.<br><br>Among Law schools, the survey left out some major players, like NYU, Stanford, UVa, Cal, Penn, Georgetown, Northwestern, Cornell and Duke. I don't have the exact matriculation information into those 9 top LAW schools for the year this survey was made (2004 I believe), but I do have the exact figures for last year. Last year, Michigan placed 41 students into those 9 Law schools. So, 266 + 41 = 307.<br><br>Alrighty then, 300+ Michigan graduates make it into the very top Law Schools, Medical, Law and MBA programs annually. Keep in mind we are only looking into the very best and most prestigious, most exclusive graduate professional programs. I left out decent MBA programs like Duke (Fuqua), UVa (Darden), NYU (Stern), Cal (Haas), UCLA (Anderson), Yale SOM, Cornell (Johnson), Carnegie Mellon (Tepper), Indiana University (Kelley), UNC-Chapel Hill (Kenan Flagler) etc... I left out some very decent Medical schools like UCLA, UDub, Baylor, Chicago, NYU, Northwestern, Vanderbilt, Pitt, Emory and UCSD. I also left out some decent Law schools, like George Washington, Notre Dame, USC, UCLA, UT-Austin, Vanderbilt, Minnesota, Iowa, Boston University, Boston College, Notre Dame and WUSTL. Do you know how many 100s of Michigan students enroll into those \"decent\" graduate programs? Last year, 75 Michigan students enrolled into those \"decent\" law schools listed above. That's just the law schools. Michigan does not publish numbers on Medical and MBA matriculations, but I can tell you that those numbers would be pretty high.<br><br>Of course, we aren't even looking into matriculations into top 10 graduate Engineering programs or into top PhD programs. I won't assign any numbers because I have none to go by, but I can imagine that number is high.<br><br>Overall, I would be very surprised if fewer than 500 Michigan students matriculated into top 10 graduate programs annually and another 500 into \"decent\" (you know, like Vanderbilt Law School or UCLA Medical school or Yale SOM) graduate programs annually. That's a total of 1,000 students getting into good-amazing graduate programs.<br><br>I also recall your commenting that Ross placing 150 undergraduate students into Wall street was good, but insignificant when considering out of 5,700. Well Hawkette, as you and I both agreed, most people don't care to work in IBanking or live in NYC. Ross places another 50 or so undergrads into companies like Intel, Microsoft and Cisco in the West Coast, IBM, Kraft and GE in the East Coast and Bank of America in the Southeast. And that's just Ross. I also recall sharing the college of Engineering's placement into major companies. You saw the long range of companies (100s of major companies from all over the World, including PB, Schlumberger, McKinsey, Bain, Goldman Sachs, Boeing, NASA, Lockheed Martin, GE etc...) that recruit at the College of Engineering. Lockheed Martin and Intel hired 16 Engineers each last year. GE, Raytheon and Microsoft hired 10+ Engineers each as well. And unlike Ross, the College of Engineering only has access to limited information. Far more students get jobs with major companies but the college has no way of knowing about it. And the college of LSA also manages to place a lot of its students into major companies. LSA is as highy regarded as the College of Engineering and has similar college fairs and recruitment activity. Unfortunately, LSA's career office has almost no way of keep record of placement statistics.<br><br>So Hawkette, as you can plainly see, it's not just 156 Michigan undergraduate students who get into good graduate programs or just 150 undergraduate students who land jobs with top IBanks and top Management Consulting firms on Wall Street annually. We are talking about well over 1,500 students annually getting into top graduate programs and into top companies around the country and globe. Sure, that's not a 100% ratio, but even Harvard doesn't have a 100% success rate. As a ratio of successful students to the total student population, Michigan is definitely among the top 20 in the nation among national universities. I have said it before and I will say it again, Michigan opens all sorts of doors and provides students with every opportunity imaginable for a solid education and a good future.<br><br>So, I repeat, this sort of success means one of two things. Either Michigan does in fact have a relatively weak student body as you claim, but somehow, manages to do as much with its students as schools with superior students do. If that's the case, then we must conclude that Michigan somehow takes a sub-standard product and does more with it than its peers, thus making it a better university. Or, more likely, Michigan's student body is more gifted than you think. Pick your poison, but something's got to give.<br><br>", "<b>Username: Tim_ND08</b><br><br>oh no hawkette<br><br>I was not saying that just because my cousin was rejected by Michigan and accepted at BC that Michigan is a better school<br><br>No way<br><br>I think they are both great schools, but honestly I do not know enough about them to know which is better.<br><br>Im a Notre Dame guy.<br><br>In my cousin's circumstance though, Michigan was obvi more selective, you know?<br><br>So, by no means was I advocating Mich's superiority, however all I was doing what , like I said ..\" adding fuel to the fire\"<br><br>that was just my own personal expierence so far with both schools, so I was just offering some of my knowledge in the field of these two schools...<br><br>", "<b>Username: hawkette</b><br><br>Hey chillin,<br>No biggie. I was just teasing. I have read your ND posts and hope you make it. Good luck.<br><br>Alexandre,<br>Thank you, thank you, thank you for taking the time and making the effort to support your argument with some data and some guesstimates (unlike so many other Michigan posters who, in zombie-like fashion, repeat the same drivel over and over again that God is great and so is Michigan). I will take a closer look at your comments and be back.<br><br>", "<b>Username: Rabban</b><br><br>\"\"First of all, Michigan graduates roughly 5,300-5,800 undergrads annually, not 6,500. Anyway, by that reckoning Northwestern places just 73 of its students into \"high prestige\" programs out of a class of 2,000 and Cornell 115 out of a class of 3,600. What about everybody else? Don't they count? Remember Hawkette, this is a ranking according to placement rates, not sheer numbers. According to raw numbers, Michigan is #5. As a ratio of its student body, Michigan places as high a percentage of its students into those top 5 graduate programs as Cornell and Northwestern.<br><br>But let me take this a step further, you always say the same thing. Only 150 out of 5,500 get into top 5 graduate professional programs, what about the remaining students? Only 150 students get into top Investment Banks and Management Consulting firms, ehat about the remaining students. Well Hawkette, those numbers keep adding on. Do you really want to do some serious math? Let's go:<br><br>The Wall Street Journal study was actually very accurate and quite telling, but it was very narrow. It only looked at matriculations intop 5 top Medical schools, 5 top MBA programs and 5 top Law schools. For medicine, they selected Columbia Medical School, Harvard Medical School, Johns Hopkins Medical School, the University of California-San Francisco Medical School and and Yale Medical School. For the 5 MBA programs, they selected the University of Chicago Business school, Dartmouth's Tuck School, Harvard Business School, MIT's Sloan School and Penn's Wharton School. In law, they looked at the University of Chicago Law School, Columbia Law School, Harvard Law School, the University of Michigan Law School and Yale Law School.<br><br>So, 156 Michigan graduates enrolled into those 15 mega-elite programs. But I think we can agree that for each of those professional fields, there are a handful or so other excellent programs.<br><br>Among Medical schools, the survey left out some definite top 10 Medical schools like Duke Medical School, Stanford Medical School, the University of Michigan Medical School, Washington University Medical School and Cornell Medical School. 50 or so Michigan graduates enroll into the University of Michigan medical school each year. I am not sure how many enroll into Stanford, Duke, Cornell and WUSTL, but let us assume, for argument's sake that Michigan manages to enroll 10 of its students into those 4 top medical schools. 156 + 50 + 10 = 216.<br><br>Among MBA programs, the survey left out a few top 10 MBA programs like Northwestern's Kellogg, Stanford Business School, Columbia Business School and Michigan's Ross. I have no actual numbers, but I do know that Michigan places an average of 15 of its students into Wharton and another 10 or so into Harvard BS annually and I also know that Michigan places more of its students into Kellogg and Ross. So let us be very conservative and say that Michigan places 50 additional students into Ross, Kellogg, Stanford BS and Columbia BS. 216+50 = 266. 50 is more like the number of Michigan grads who get into Ross alone, but like I said, I am being very conservative because I really don't have the exact figures.<br><br>Among Law schools, the survey left out some major players, like NYU, Stanford, UVa, Cal, Penn, Georgetown, Northwestern, Cornell and Duke. I don't have the exact matriculation information into those 9 top LAW schools for the year this survey was made (2004 I believe), but I do have the exact figures for last year. Last year, Michigan placed 41 students into those 9 Law schools. So, 266 + 41 = 307.<br><br>Alrighty then, 300+ Michigan graduates make it into the very top Law Schools, Medical, Law and MBA programs annually. Keep in mind we are only looking into the very best and most prestigious, most exclusive graduate professional programs. I left out decent MBA programs like Duke (Fuqua), UVa (Darden), NYU (Stern), Cal (Haas), UCLA (Anderson), Yale SOM, Cornell (Johnson), Carnegie Mellon (Tepper), Indiana University (Kelley), UNC-Chapel Hill (Kenan Flagler) etc... I left out some very decent Medical schools like UCLA, UDub, Baylor, Chicago, NYU, Northwestern, Vanderbilt, Pitt, Emory and UCSD. I also left out some decent Law schools, like George Washington, Notre Dame, USC, UCLA, UT-Austin, Vanderbilt, Minnesota, Iowa, Boston University, Boston College, Notre Dame and WUSTL. Do you know how many 100s of Michigan students enroll into those \"decent\" graduate programs? Last year, 75 Michigan students enrolled into those \"decent\" law schools listed above. That's just the law schools. Michigan does not publish numbers on Medical and MBA matriculations, but I can tell you that those numbers would be pretty high.<br><br>Of course, we aren't even looking into matriculations into top 10 graduate Engineering programs or into top PhD programs. I won't assign any numbers because I have none to go by, but I can imagine that number is high.<br><br>Overall, I would be very surprised if fewer than 500 Michigan students matriculated into top 10 graduate programs annually and another 500 into \"decent\" (you know, like Vanderbilt Law School or UCLA Medical school or Yale SOM) graduate programs annually. That's a total of 1,000 students getting into good-amazing graduate programs.<br><br>I also recall your commenting that Ross placing 150 undergraduate students into Wall street was good, but insignificant when considering out of 5,700. Well Hawkette, as you and I both agreed, most people don't care to work in IBanking or live in NYC. Ross places another 50 or so undergrads into companies like Intel, Microsoft and Cisco in the West Coast, IBM, Kraft and GE in the East Coast and Bank of America in the Southeast. And that's just Ross. I also recall sharing the college of Engineering's placement into major companies. You saw the long range of companies (100s of major companies from all over the World, including PB, Schlumberger, McKinsey, Bain, Goldman Sachs, Boeing, NASA, Lockheed Martin, GE etc...) that recruit at the College of Engineering. Lockheed Martin and Intel hired 16 Engineers each last year. GE, Raytheon and Microsoft hired 10+ Engineers each as well. And unlike Ross, the College of Engineering only has access to limited information. Far more students get jobs with major companies but the college has no way of knowing about it. And the college of LSA also manages to place a lot of its students into major companies. LSA is as highy regarded as the College of Engineering and has similar college fairs and recruitment activity. Unfortunately, LSA's career office has almost no way of keep record of placement statistics.<br><br>So Hawkette, as you can plainly see, it's not just 156 Michigan undergraduate students who get into good graduate programs or just 150 undergraduate students who land jobs with top IBanks and top Management Consulting firms on Wall Street annually. We are talking about well over 1,500 students annually getting into top graduate programs and into top companies around the country and globe. Sure, that's not a 100% ratio, but even Harvard doesn't have a 100% success rate. As a ratio of successful students to the total student population, Michigan is definitely among the top 20 in the nation among national universities. I have said it before and I will say it again, Michigan opens all sorts of doors and provides students with every opportunity imaginable for a solid education and a good future.<br><br>So, I repeat, this sort of success means one of two things. Either Michigan does in fact have a relatively weak student body as you claim, but somehow, manages to do as much with its students as schools with superior students do. If that's the case, then we must conclude that Michigan somehow takes a sub-standard product and does more with it than its peers, thus making it a better university. Or, more likely, Michigan's student body is more gifted than you think. Pick your poison, but something's got to give.\"\"<br><br>well, well, well that is pretty much slam dunk!!! I was toying with the idea of responding to her, but now I dont see any need to do so. ;)<br><br>", "<b>Username: Alexandre</b><br><br>Unfortunately, there isn't enough information for me to give you exact figures. All of my Law school nunbers were accurate, as was my Michigan matriculation into Michigan medical school. In fact, those numbers come from the official website. My College of Engineering and Ross professional placement figures also come from the offical website.<br><br>My guesstimates were conservative. Like I said, Ross alone probably accepts more than 50 Michigan grads each year. I am pretty sure Kellogg is second highest among the top MBA programs that Michigan graduates gravitate to. I really wish Michigan would invest some time and resources to keeping an accurate record of placement statistics.<br><br>", "<b>Username: ckmets13</b><br><br>well I could always transfer to Michigan..haha<br><br>", "<b>Username: nefer</b><br><br>hawkette,<br>Glad to see you now acknowledging that evaluting and ranking colleges is not as easy as throwing some numbers around. You are coming around.<br>If you are still interested in the US News ranking methodology and its problems, I can suggest you start by reading some material on the web.<br>Google \"US News and World Report college ranking criticism,\" and read some of the top hits, and go from there. After that, if you want to talk about it, I can offer my opinions.<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"Of course, we aren't even looking into matriculations into top 10 graduate Engineering programs or into top PhD programs. I won't assign any numbers because I have none to go by, but I can imagine that number is high.\"\"<br>Continuing with the math lesson... About 20% of Michigan undergrad are in engineering. Most people will agree that Michigan is one of the traditional powerhouses in engineering. There shouldn't be any question about the placement of our engineering grads, in the industry or in top PhD programs.<br><br>And about top PhD programs, this is where top research universities like Berkeley, Michigan and Wisconsin have the advantage ... remember the grad departmental peer assessment?<br><br>Btw, 93.3% of the Ross BBA grads received their first offer by graduation.<br><br>", "<b>Username: ckmets13</b><br><br>BC doesnt even have engineering, so I dont see why we would be comparing anything that has to with engineering<br><br>", "<b>Username: hawkette</b><br><br>rabban,<br>You sound like you are about to wet your pants. The game is far from over and frankly is never over.<br><br>nefer,<br>Please read post # 18.<br><br>BTW, I would love to see USNWR completely revamp its rankings methodology. For example, give it some real teeth by judging colleges as employers do. Employers care about talent, intelligence, the ability to work with others, an ability to think critically, personal and professional values, work ethic, a measure of humility, etc. The vast, vast majority of employers in the real world could care less about how many research papers a certain professor or school has turned out. That is akin to a bunch of little girls putting on costume jewelry to try and impress each other of who is the prettiest.<br><br>", "<b>Username: Rabban</b><br><br>Um, what is this? Have some respect, even to yourself. I pity you, I really do.<br><br>", "<b>Username: Rabban</b><br><br>\"\"you are about to wet your pants\"\"<br><br>What are you trying to do here? This is a message board, not a chatting room. No need to go colorful.<br><br>You dont need to tell the world that you are a woman who is being unloved .<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"BC doesnt even have engineering, so I dont see why we would be comparing anything that has to with engineering\"\"<br>My post was not intended to compare Michigan and BC in engineering. It is to account for a significant portion (20%) of the Michigan graduates ... that we are doing just fine, thank you!<br><br>Btw, a top engineering program should be a plus for Michigan ... more choices and more chances for collaborative research (yes, for the undergrads too).<br><br>", "<b>Username: hawkette</b><br><br>Alexandre,<br>If only you and I were being paid by the word.<br><br>Ok, let's check the math:<br>1. Fairly hard numbers<br>156 Michigan grads into the Top 15 grad programs<br>150 Ross students going to Wall Street firms<br>50 Ross students getting jobs with Intel &amp; other major employers<br>50 engineers getting jobs with Lockheed Martin &amp; other major employers<br><br>2. General Estimates (based on Alexandre's opinion)<br>60 additional students into Michigan and other med schools<br>50 additional students into other highly regarded MBA programs<br>40 additional students into other highly regarded law programs<br>75 additional students into next tier of law schools<br><br>3. Wilder guestimates (based on almost nothing..er, I mean Alexandre's opinion)<br>500 students getting into \"decent\" grad programs<br><br>4. Unknown<br># of students into Top 10 grad Engineering and PhD programs<br><br>Totals<br>406 Fairly Hard Numbers<br>225 Next tier of guesstimates<br>500 Next tier of wilder guesstimates<br><br>Ignoring the fact that virtually all of the MBA matriculants will not go to business school right out of undergrad (and this may also be true for a lesser number of the other disciplines), this is a total number of about 600-1000 students (out of an average class size of 6500). Certainly some of these jobs/schools have greater import than others, but for purposes of your calculation, we have weighed them all equally. Overall, I would describe the results as good, but the numbers don't strike me as overly unique, particularly for a school the size of Michigan. Frankly, they are about what I would expect for one of the top state universities. And there are still an awfully large number of students that are not getting these \"prized\" jobs or grad school assignments.<br><br>Lots of schools send students to Wall Street or to work for Lockheed Martin or Intel. I'm not sure when getting a job with Merrill Lynch became the barometer for measuring college success, but it must be important to you. Anyway, I don't know much about the University of Indiana or Fordham, but I wouldn't be surprised to learn that they send as many or more to Wall Street (and I never hear Michigan posters accepting them as comparable schools). What does this prove? Very little other than Michigan is on the list of campuses where Merrill Lynch and others recruit. So are lots of schools.<br><br>Or how about schools that are visited by Lockheed Martin or Intel or Kraft Foods. It is nice that Michigan is on the list, but again so are lots of schools. How does this prove that Michigan is better than a BC? These big companies recruit at many other schools of lesser repute, eg, University of Minnesota, University of Washington, University of Arizona, San Jose State. If those schools place as many or more students at places like Intel or Kraft, does that make them institutionally equal or better than Michigan?<br><br>As for grad placement, again Michigan sends a nice number, but are these numbers (which have a large amount of guesswork built in) particularly unique? I don't think so. And while we will never know, it would be interesting to see the acceptance rate for applicants from Michigan vs those from other schools. That would probably be the most telling statistic of how Michigan is viewed by these grad schools vs other undergraduate schools.<br><br>Perhaps Michigan's greatest strength is the breadth of its academic offerings, eg, Boston College has no engineering and so no basis for comparison in this area. Does this necessarily make Michigan superior to BC? You would probably say yes, I would probably say no. To me, it just means that Michigan is a bigger school and thus, by its very nature, offers more.<br><br>My point all along is that Michigan, like many schools, has some talented students who go on to some nice jobs or high profile grad schools, but is their (absolute or relative) number so strong and compelling as to equate Michigan with America's top private universities? The data that you provide is helpful to the discovery of the answer. My interpretation is that a portion of Michigan's students (about 25%, or more than 6000 students) could be considered at a similar level to that of the top privates. There is a much larger percentage (about 50%) who appear pretty equal to a lot of other schools and there is a lower portion (about 25%) that would be considered comparatively weak. The top group likely does fairly well in job placement with \"top\" companies and \"top\" grad schools. But there are many more students at Michigan than this top group and their caliber is undeniably weaker. My interpretation is not that Michigan is bad, but rather that, taken as a whole, it is not excellent as you continually contend. I suspect that the vast majority of opinion outside of the Michigan booster ranks would concur with my assessment.<br><br>GoBlue81,<br>The Engineering Department at Michigan represents 17% of the student body and is the largest area of study. Given that engineering students typically score higher on SAT exams, I would expect them to have a strong positive impact on Michigan's overall weighted SAT score, particularly its Math component. Michigan's 75% level is 1420 overall and 730 for math. At Boston College, with no engineers, it is 1450 overall and 720 math. If it is true that Michigan engineers score higher on average than other Michigan students, that says to me that, among non-engineers, the overall SAT deficit of Michigan to Boston College is even greater than it appears.<br><br>(see continuation on next post)<br><br>", "<b>Username: hawkette</b><br><br>I agree with your comment that having an engineering department at Michigan gives students more choices, but I'm not sure of the practical value of that vis-a-vis BC. Self-selection would tell us that students interested in Engineering would be highly unlikely to even apply to Boston College. Good for Michigan, but probably irrelevant for all of BC and nearly all of the 83% of Michigan students who are not engineers.<br><br>Michigan's next largest group of students is in Social Sciences, representing 16% of the student body, or over 4000 students.<br><br>Rabban,<br>Sorry if you were offended-just trying to inject a little levity. Also, no pity needed or desired and certainly not from you.<br><br>", "<b>Username: ckmets13</b><br><br>UChicago doesnt have engineering either..so I suppose Michigan is superior to them as well?<br><br>", "<b>Username: ckmets13</b><br><br>And to Rabban, until you can make a positive contribution to this thread, just go away.<br><br>", "<b>Username: Rabban</b><br><br>WHat? a little levity? O K... Allow me to do the same to you.<br><br>Hawkette - Bring me a leather and lace- NOW!!! Oh btw, while you bring your-victoria-secret-camouflaged- body to me, dont forget to bring a Rienzi CD  I especially enjoy Wagner while I am doing all the werk.<br><br>Ok- ckmets  thats pretty much all of my contribution. Of course, you can also bring yourself to me. I will fix you up nicely as your little go-away present lol<br><br>", "<b>Username: ckmets13</b><br><br>please get a life, thats all I have to say<br><br>", "<b>Username: Rabban</b><br><br>Lol dont get mad. No need to get bitter. I was just injecting a little levity<br><br>", "<b>Username: GoBlue81</b><br><br>The Engineering Dept of Michigan represents 19.5% of the student body, not 17% as you stated (4,978/25,555; <a href=\"www.engin.umich.edu/about/ataglance.html)\" rel=\"nofollow\">www.engin.umich.edu/about/ataglance.html)</a>. I am pointing this out as you are so keen on stats.<br><br>Also, BC's overall SAT was 1420 not 1450 (<a href=\"www.bc.edu/publications/factbook/meta-elements/pdf/06-07/06-07_freshman_admission.pdf)\" rel=\"nofollow\">www.bc.edu/publications/factbook/meta-elements/pdf/06-07/06-07_freshman_admission.pdf)</a>.<br>\"\"having an engineering department at Michigan gives students more choices, but I'm not sure of the practical value of that vis-a-vis BC.\"\"<br>The benefit is in collaborative programs and research. In Michigan, engineering is involved with life sciences, computer science, geology, natural resources, etc. In fact, engineering may have a part in anything that is related to health sciences, energy and the environment.<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"UChicago doesnt have engineering either..so I suppose Michigan is superior to them as well?\"\"<br>I don't see how you can come to that conclusion based on my post.<br><br>", "<b>Username: ckmets13</b><br><br>Well as long as you were just giving stats about Michigan and not attempting to compare it to BC, the stats are fine. But if you are going to say that Michigan is better because if offers engineering and BC doesnt, then I disagree<br><br>", "<b>Username: hawkette</b><br><br>GoBlue,<br>These are very minor points, but just for the record, my source for Michigan's engineering size of 17% is the most recently available Common Data Set. Here is the link. Look in Section E.<br><br><url>http://sitemaker.umich.edu/obpinfo/files/umaa_cds2006.pdf</url><br><br>For Boston College, my source is their Fact Book showing a 1250 SAT level for the 75th percentile. Here is the link:<br><br><url>http://www.bc.edu/publications/factbook/meta-elements/pdf/06-07/06-07_freshman_admission.pdf</url><br><br>I believe that the 1220 that you are referencing for BC is for last year (as reported by USNWR).<br><br>", "<b>Username: barrons</b><br><br>The more choices a school has the better and engineering is a very expensive major for a school to have so overall a school having engineering is \"better\".<br><br>", "<b>Username: Rabban</b><br><br>Ok, enough of hanky panky ;)<br><br>Switching gears,<br><br>I would agree with barron that one of the most important factors to consider for selecting college is Quality of Faculty. To have best minded professors teaching your class is very important. To me, this factor does differentiate colleges from vocational schools. This can be easily measurable by their research output, like number of patents, number of papers (written or oral presentations), number of a book or book chapters written, number of citations, amount of grants received and whatnot.<br><br>Luckily, there is a published NRC data pertaining to the factor<br><br>Best Research Programs (NRC)<br><br>Engineering: MIT-Berkeley-Stanford-Caltech-Princeton<br><br>Hard Sciences (inc. Math): MIT-Caltech-Berkeley-Princeton-Harvard-Stanford-Chicago<br><br>Biological Sciences: Harvard-MIT-Berkeley-Stanford-UCSD<br><br>Social Sciences: Berkeley-Harvard-Chicago-Stanford-Michigan-Wisconsin<br><br>Humanities : Harvard-Berkeley-Princeton-Columbia-Cornell<br><br><br>Every school mentioned in the survey is a truly world-class school.<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"my source for Michigan's engineering size of 17% is the most recently available Common Data Set. Here is the link. Look in Section E.\"\"<br>I presume you meant Section B. You didn't count the 3% for computer science. In Michigan, Computer Science is jointly offered between LSA and Engineering. In fact, if you click on the computer science link at LSA, it will point you to the Dept of EECS. CSE is a division of EECS.<br>\"\"For Boston College, my source is their Fact Book showing a 1250 SAT level for the 75th percentile.\"\"<br>I got my number also from the BC 2006-07 factbook. In fact, your link is the same as the one I posted. Here is what it shows for the Class of 2010:<br><br>CR: 610-700; WR: 620-710; Math: 640-720; Composite: 1900-2100<br><br>I still come up with 1250-1420. So where did you find 1250?<br><br>Btw, BC takes the highest composite while Michigan takes the highest single sitting. Most students I know benefit from the highest composite, especially those taking the test more than twice.<br><br>", "<b>Username: GoBlue81</b><br><br>ckmets,<br>I said Michigan having a top engineering program is a plus (more choices and more collaboration). That fact ALONE will not make Michigan a better school than BC. However, it is still one point for Michigan.<br><br>", "<b>Username: CC Admin</b><br><br>i need to say something about SATs. I don't know if Hawkette has ever taken the SAT, it doesn't measure a lot. A swing of 50 points could be only 4 multiple choice questions. Especially the math sections, it measures nothing but 9th grade math ability. I have a personal anecdote, my friend who competed in the Intel talent search with me, he had a 1280 on his SAT, he got in Cornell for Engineering, according to Hawkette, he would be near the bottom at Cornell, but he graduated with highest honors, and went on to work for a very prestigious consulting firm. Obviously, there is a big difference between a 1100 and a 1500, but most folks that I knew in high school who prepared for the SAT got 1300+, those who didn't got 1200+, when their abilities as students are the same.<br><br>", "<b>Username: hawkette</b><br><br>GoBlue,<br>Lots of minutiae and not overly impactful one way or the other.<br><br>I did mean Section E. Engineering is listed at 17%. But you are correct that Computer Science is listed at 3% so if you consider these together, then you get 20%. Not sure it's meaningful one way or the other.<br><br>For 25% &amp; 75% SAT scores,<br>Boston College: 1250-1420<br>Michigan: 1220-1410<br>Again, not a huge difference or really meaningful one way or the other.<br><br>As for single sitting vs highest composite, the CDS formula fortunately breaks it out individually for us by Verbal &amp; Math. This is a regulatory reporting requirement and is not open to interpretation for reporting purposes. However, Michigan, like any institution, is free to apply the information however it sees fit in its admission processes.<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"As for single sitting vs highest composite, the CDS formula fortunately breaks it out individually for us by Verbal &amp; Math. This is a regulatory reporting requirement and is not open to interpretation for reporting purposes. However, Michigan, like any institution, is free to apply the information however it sees fit in its admission processes.\"\"<br>You got it backwards. Each university follows its own admission process. BC keeps the highest composite scores for its applicants while Michigan keeps the highest single-sitting scores for its applicants. Thus the same applicant applying to BC and Michigan will likely have higher SAT scores for BC.<br><br>When it's time to report to CDS at the end of the season, BC's report will reflect the highest verbal and highest math scores for each enrolled student, while Michigan's will reflect the verbal and math score from the highest single sitting.<br><br>There is no way for Michigan to report the highest component scores unless it keeps two sets of scores for each student.<br><br>p.s. Section E is on Academic Offerings and Policies; not much information there.<br><br>", "<b>Username: hawkette</b><br><br>jeffl,<br>While I am over 25 (and thus probably a dinosaur in your eyes), I have taken the SAT. As I scored very highly, I am convinced of its 100% accuracy. :) :)<br>You are right that some very good high school students can underperform on these tests. There are students like this in the universe of students at any school (including BC).<br><br>Nice anecdote about your friend who got the job with the \"prestigious\" consulting firm (IMO your generation has an unhealthy affixation with prestige and labels, but that is a different topic). But such anecdotes don't do anything for evaluating undergraduate institutional quality at Michigan, at BC, or any college.<br><br>", "<b>Username: hawkette</b><br><br>GoBlue,<br>Sorry-Section J. It's the last chart in the CDS. It is for degrees conferred which is most relevant as we were talking about job placement. Engineering is 17%, Computer Sciences is 3%.<br><br>CDS is a regulatory filing that is the source data for things like USNWR and for comparison among colleges. As for CDS and public display of numbers, Michigan would have every incentive to keep two sets of numbers. It is quite simple to keep standardized test scores in two separate categories. Businesses do it all the time with different types of financial reporting, eg, one for tax purposes and one for bookkeeping purposes.<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"Michigan would have every incentive to keep two sets of numbers.\"\"<br>Again, you don't know that and it's pure speculation. I'd like to see some hard evidence.<br><br>", "<b>Username: CC Admin</b><br><br>hawkette, i only asked, because i remember from somewhere that u said u were 50 years old. I mean I always hoped that I would develop some other hobbies by the time i'm 50. But, everyone's different.<br><br>", "<b>Username: hawkette</b><br><br>GoBlue<br>If you believe that Michigan is an intelligent university (and I am sure that you think it is), it is quite a leap to believe that Michigan would not present the SAT material in a fashion that would put the school in the strongest light compared to its competitors. To do otherwise would be stupid, would potentially be a breach of the duties of the school's fiduciaries, and would not serve the interests of the school. As has been pointed out here, Michigan's reported SAT scores (1220-1410) already show a weakness vs schools that Michigan fans consider inferior, eg, Boston College (1250-1420).<br><br>", "<b>Username: k&amp;s</b><br><br>barrons - <b>The more choices a school has the better and engineering is a very expensive major for a school to have so overall a school having engineering is \"better\".</b><br><br>So I guess the majority of student applicants would pick UoM over schools like Dartmouth or Brown (not to mention employers) - please.<br><br>Btw, how are students in the Ross BBA program, comprising of a class size of <b>360</b> or so, indicative of the overall quality of the UoM student body?<br><br>", "<b>Username: barrons</b><br><br>If they might want to major in engineering some day, yes. What if a school only had one major that it was very good in. Would that still make it a good school? I think it would be a very limited school despite being very good in one major. And for most majors there is little need to select Dartmouth or Brown over UM unless they offer better aid.<br><br>How are the better students at any school the measure of that school? Ross is pretty selective within UM and the top employers only look at the better grads of Dartmouth or Brown too. If you are in the lower portion of the class you won't get a look either.<br><br>", "<b>Username: hawkette</b><br><br>Over five hours ago, I posted a detailed response to Alexandre's well conceived (though IMO ultimately unspectacular) treatise on Michigan's job and grad school record. Since that time, my new Michigan buddies (Rabban, kazz, GoBlue, jeffl) have been working overtime here and on the other Michigan \"debate\" to slice and dice this new CC blasphemer who dares suggest that mighty Michigan is actually less than is repeatedly proclaimed by the noble Michigan defenders.<br><br>While your efforts at various levels of attack (and some constructive comment from GoBlue) are recognized, I (and no doubt anyone else reading this cr--) would most prefer that we get back to the topic. Alexandre made a good presentation. If I may say so myself, I made a decent reply, although I'm not sure how the Michigan partisans feel about any of it. As yet none of you have responded at all to the substance of the job/grad school placement exchange. Can you guys add anything helpful to the discussion or are you guys just gonna make Alexandre do all the work<br><br>", "<b>Username: CC Admin</b><br><br>hey hawkette, as I said I really don't want to get in this fact debate with you, I know all the facts that Alexandre presents well, Alexandre is responsible for recruitment of Michigan students in the United Arabs Emirates. Therefore, he's in a much better position to offer these sort of facts. The fact that you have not even heard of the Wall Street Journal Feeder Ranking shows that you really don't know a lot about college rankings. I frankly, think he's wasting time on you, even if he shows that 50% of the Michigan students get into the best graduate schools, you will go back to your bread and butter SAT differences.<br><br>I am just here to offer my take on experiences as a student, who is about to graduate from Michigan and my thoughts on the incompetence of SAT as a way of measuring student quality.<br><br>", "<b>Username: k&amp;s</b><br><br>\"\"If they might want to major in engineering some day, yes. What if a school only had one major that it was very good in. Would that still make it a good school? I think it would be a very limited school despite being very good in one major. And for most majors there is little need to select Dartmouth or Brown over UM unless they offer better aid.\"\"<br><br>Right - and engineering majors wouldn't pick MIT or CIT over UoM as well.<br><br>You really are delusional if you think ($$ being equal) that the vast majority of applicants wouldn't pick Dartmouth or Brown over UoM.<br>\"\"How are the better students at any school the measure of that school? Ross is pretty selective within UM and the top employers only look at the better grads of Dartmouth or Brown too. If you are in the lower portion of the class you won't get a look either.\"\"<br><br>There are about 1,400 students at Ross in a university which has over 25,000 students (do the math).<br><br>The top 1/3 or 1/2 of students at Brown/Dartmouth have a shot at a finance job. That % is significantly lower at UoM (can we have a little more insightful analysis here, rather than this UoM lovefest?).<br><br>Gee, I wonder if students at Penn, who don't go to Wharton, have a better shot at these jobs than UoM students?<br><br>jeff -<br>\"\"I know all the facts that Alexandre presents well, Alexandre is responsible for recruitment of Michigan students in the United Arabs Emirates. Therefore, he's in a much better position to offer these sort of facts. The fact that you have not even heard of the Wall Street Journal Feeder Ranking shows that you really don't know a lot about college rankings. I frankly, think he's wasting time on you, even if he shows that 50% of the Michigan students get into the best graduate schools, you will go back to your bread and butter SAT differences.\"\"<br><br>Well, for someone who knows so much about recruiting, Alex was ignorant of the fact that many employers do take a look at SAT scores.<br>\"\"I am just here to offer my take on experiences as a student, who is about to graduate from Michigan and my thoughts on the <b>incompetence of SAT as a way of measuring student quality.</b>\"\"<br><br>Which is why all the elite universities (heck, pretty much all of them) consider SAT or ACT scores and many Wall Street/finance/consulting firms do as well.<br><br>(If SAT scores don't mean much - then this whole \"rankings thing\" is pretty much moot.)<br><br>", "<b>Username: barrons</b><br><br>Did you ever stop to think there are lots of people with zero interest in working on Wall Street or consulting? They are hardly the jobs most conducive to having an enjoyable balanced life. Many people in the Midwest would rather eat paste than live and work in NYC.<br><br>", "<b>Username: nefer</b><br><br>hawkette,<br>I agree a survey of employers would be a good component. But there would be logistical problems. Who, out of a million corporations and privately-held firms, do you ask? Also, they woundn't cooperate unless there is an incentive to do so, not to mention the whole effort would be too costly. I ain't gonna happen.<br><br>US News, no matter what better methodology they may want to use, cannot produce results that significantly vary from the generally conceived notion of where schools rank relative to each other. HYP must be on top, followed by elite privates, with top public schools in modest positions. The rest don't matter. Otherwise, they would lose \"credibility.\" It's a ranking of prestige not quality. That's the constraint they have to work with. So, they have to develop a methodology that fits the result, rather than the result being a result of a methodology.<br><br>", "<b>Username: k&amp;s</b><br><br>barrons -<br>\"\"Did you ever stop to think there are lots of people with zero interest in working on Wall Street or consulting? They are hardly the jobs most conducive to having an enjoyable balanced life. Many people in the Midwest would rather eat paste than live and work in NYC\"\"<br><br>Please - it's not just Wall St/consulting jobs and it's not just NYC.<br><br>The same thing applies to jobs in publishing, advertising, etc. and to cities all across the US (from Chicago to Dallas to SF to Boston to Atlanta).<br><br>", "<b>Username: barrons</b><br><br>Oh please yourself. You have nothing to back that up but hot air. More large corporartions are now run by grads of the top state schools than the big name privates. You can look that up.<br><br>", "<b>Username: hawkette</b><br><br>jeffl,<br>I can understand your unwillingness to join in the debate. It is difficult when the other side presents multiple facts to support their position, particularly when those facts and the conclusions they suggest run counter to your own opinions.<br><br>Making a winning argument takes more than just making an assertion and expecting everyone else to buy it (eg, \"the average Michigan student can get into Cornell, Carnegie Mellon, Vanderbilt\"). Facts are sticky things and, when applied to issues like standardized test scores, financial resources, acceptance rates, job/grad school placement, etc, they can be particularly powerful. You can argue the usefulness of a measure (as I do repeatedly against the Peer Assessment), but the measure itself can have great persuasive power and it is a fact that Michigan scores highly on this (I suspect that you fully embrace the use of Peer Assessment as it casts Michigan in a favorable light).<br><br>I would love to be a fly on the wall when you get to Virginia and you start hearing the people there talk about the most prominent state universities of Virginia (UVA &amp; W&amp;M) and North Carolina (UNC) in the same reverential way that you now talk about Michigan. You will see even more that Michigan is little more than an afterthought (if even that) for those people (and I would argue that this is the case for most areas of the country). Here is what they are thinking: \"Michigan. Good state university, but not among the nation's most elite universities.\" Sorry.<br><br>", "<b>Username: k&amp;s</b><br><br>\"\"Oh please yourself. You have nothing to back that up but hot air. More large corporartions are now run by grads of the top state schools than the big name privates. You can look that up.\"\"<br><br>You've got to think a little more critically than that.<br><br>Individual talent (often things other than grades) gets people to the top of the corporate world - otoh, when corporations hire and look for the \"best and brightest\" - they know that the top privates have done much of their prescreening for them.<br><br>", "<b>Username: CC Admin</b><br><br>I don't know what facts you are talking about, you present very little relevant information, besides this continuous assertion about SAT differences. Furthermore, you have never been to Umich or BC, but continue to distort the facts presented by Alexandre, (who is an alum of both Michigan and Cornell) Alexandre offers post-graduation statistics of Michigan, where is the statistics for BC? If you mention the SAT ranges any more than you already have, you would have permanently burned those words on my LCD. Just pick something else to talk about!<br><br>", "<b>Username: UCLAri</b><br><br>Courtesy, please. If you can't say what you're going to say nicely, then go back and reconsider your position.<br><br>Arguments should be based on facts, not personal jabs. That goes for everyone.<br><br>", "<b>Username: hawkette</b><br><br>jeffl,<br>You missed my point. The point was that you consistently make assertions and present little to nothing to back it up. I was not trying to score any points in my last post, only trying to make clear the idea that arguments need supporting evidence. I mentioned 5 things in my post-3 where BC has an advantage, one where Michigan has an advantage and one where the data thus far is only been presented from one side (job/grad placement). There are plenty of other facts out there that I or others have or could touch on. The only point that I am trying to make is that all of these facts influence and support an argument. We can disagree (and almost certainly do) about their relative importance, but they are data points. Use them and others rather than just making unsupported statements of how you see the world. We may still not agree with each other's conclusions, but at least the arguments presented will have some basis, not to mention some consideration of how the other side sees it.<br><br>UCLAri,<br>You are absolutely right. For my part, I submit my apologies and hope to return to more fact-based discussion.<br><br>", "<b>Username: barrons</b><br><br>Yes that screening worked well for Enron (Mr Skilling) and most of the Wall Street firms that had their top people up on serious charges for attempting to manipulate markets and engage in outrageous log rolling not so long ago. Maybe they just forgot the ethics classes.<br><br>I would bet you Hawk the presidents of all the major universities would but UM well above the \"good\" category. I think you are just flat wrong on that. Uva would make that list for undergrad only. UNC even less so.<br><br>", "<b>Username: ckmets13</b><br><br>Barrons admitted there is a difference between grad and undergrad!<br><br>", "<b>Username: collegebound_07</b><br><br>Michigan > Boston College<br><br>", "<b>Username: hawkette</b><br><br>Barrons,<br>You may be right about the university presidents, but that just highlights a major difference between you and most business people. Most business people could give a fig what the president of a major university thinks. What would the President of, the Chief Financial Officer of, the Human Resources head of, the Chief Marketing Officer of, the Chief Technical Officer of, etc in a for-profit business think of the various schools? That's what we care about and we aren't looking for nor do we value a lot of the things that go on in academia. Now, undergraduate students are rarely being hired into positions of such responsibility, but these corporate leaders know where the talent is to be found to serve their needs. Depending on the region of the country, I am certain that their valuation of universities would look quite different from yours, from university presidents, from USNWR, etc. And, remember, these capitalists have to get it right for, if not, the consequences could be severe or worse (like at Enron).<br><br>", "<b>Username: Alexandre</b><br><br>ckmets, not all universities with amazing undergraduate offerings have amazing graduate programs. However, a university with amazing graduate programs accross the board will generally have amazing undergraduate offerings.<br><br>The reason for this is quite simple. Some universities have no wish to have excellent graduate programs and as such, do not invest resources into graduate programs. Dartmouth, Brown, the top LACs are examples of such universities. However, universities with amazing graduate programs, like Harvard, Cal, Stanford, Columbia, Chicago, Michigan, Cornell, Penn etc...will also have amazing undergraduate offerings because the resources, facilities and faculties that make their graduate programs great will be availlble to their undergrads. The two are inseperable.<br><br>", "<b>Username: Alexandre</b><br><br>So Hawkette, what do you think the corporate world thinks of the University of Michigan? And do you believe academe's opinion on the quality of universities is meaningless? I would say both are equally important wouldn't you?<br><br>", "<b>Username: CC Admin</b><br><br>The basis for my arguments is my 4 years of experience at the University of Michigan, which includes talking to professors, listening to Bill Gates and Al Gore speak about the influence of a Michigan education, in Ann Arbor, countless other world renowned figures that come to the University on a weekly basis to speak to the students. I'm not doing a research paper here on a college advice board.<br><br>Your praise of BC, i guess, comes from <a href=\"www.google.com?\" rel=\"nofollow\">www.google.com?</a><br><br>", "<b>Username: hawkette</b><br><br>I think that the corporate world in the Northeast thinks that Michigan is an excellent state university and that it is appropriately ranked in USNWR. Probably also true in the Midwest. Michigan would probably be seen best in Chicago (1 of top 3 with Northwestern and Notre Dame). In NYC, it is part of the scene, but well down the list. Not much of a factor in Boston although I'm less confident in saying this as I don't know Boston businesses very well. In other parts of the country, Michigan is barely on the radar screen compared to local schools and many (but certainly not all) of the top privates.<br><br>I wouldn't be so dismissive of academia as to say that what they say is meaningless. Good research in the technical fields is one of America's great competitive advantages and some of this work is happening in top research universities. But if someone is a Social Sciences major or something of a non-technical nature, the value of academia is considerably less. For jobs outside of the technical fields, the employer is going to have to teach the undergraduate anyway and that's true if you come from Boston College, Michigan, or Ole Miss and whether you work on Wall Street or work for Xerox selling copiers.<br><br>Both business and academia have their role in society, but I think the answer to which is more important is pretty easy. Business is so much more critical to our country and our everyday lives.<br><br>", "<b>Username: hawkette</b><br><br>jeffl,<br>You make the point perfectly. Your view is completely from the inside out.<br><br>The world is big place and there are a lot of good students and great schools out there. Be proud of your school. But withhold judgment on others til you know a little more about them. I think you'll be surprised at the quality of students and faculty and recruiting opportunities at many other places.<br><br>", "<b>Username: ckmets13</b><br><br>jeff, I go to BC<br><br>", "<b>Username: Alexandre</b><br><br>Hawkette, you are the one who is judging. Jeffl never said Michigan was the best. It is you who is saying Michigan is not that good.<br><br>", "<b>Username: willmingtonwave</b><br><br>Well, the op is a very lucky person if he is deciding between both of these schools. You really can't go wrong with either, but for undergraduate experience I feel BC is the better school. I won't deny that for graduate school Michigan is among the best schools in the country. Besides the better undergraduate experience, BC is in a better location and the total student body is better than Michigans. That is why I could never consider a school like UCB, UCLA, Michigan, UNC, etc. better than BC, Tufts, Wake, Vanderbilt just because those state schools are simply not as competitive to get into. Being at Wake, I know damn well instate that I would have gotten into Carolina no problem. Carolina is not terribly hard to get into OOS, perhaps comparable to Boston University or Syracuse. Personally, I'd go with BC.<br><br>", "<b>Username: Alexandre</b><br><br>Michigan is actually slightly harder to get into than Boston College. Mean SAT scores are about the same, but Michigan expects a much higher GPA and class rank. I am not sure how you figured that BC, Vanderbilt and Tufts have better students than Cal or Michigan. Michigan and Cal enroll a higher percentage of their students into top graduate schools.<br><br>", "<b>Username: hawkette</b><br><br>Alexandre,<br>You ask me to give my impressions of how businesses view Michigan and then point out that I am judging. What is this-entrapment? In any event, those are my thoughts based on personal and professional experiences and interactions with others in social, business and familial circumstances.<br><br>As for Jeff, my point to him was only to provide some supporting evidence to assertions like \"the average student is better than the average student at Cornell, CMU, Vanderbilt\" or \"everyone knows Michigan\" or \"best faculty in the world\" or US News changed the methodology and that boosted CMU and Vanderbilt. I could go on.<br><br>I have not stated that Michigan is not good-it is certainly an excellent state university with 26,000 undergraduates. I have stated that, based on the data that I have presented here and elsewhere, Michigan is not uber selective or mega elite with a student body on the same level as Boston College, Georgia Tech, and Tulane.<br><br>", "<b>Username: hawkette</b><br><br>Alex,<br>If BC gets more applications than Michigan, rejects over 5000 more applicants and has a higher SAT 25/75 range and average, and has a 29% acceptance rate vs 47% for Michigan, how in the world can you conclude that Michigan is harder to get into? I think you'd have a hard time convincing anyone outside of the Michigan family.<br><br>As for the high class rank, this is true with nearly all public universities. Look at UC Irvine and Stanford. UC Irvine has 98% Top 10%, Stanford only 89%. Class rank is not a good barometer of selectivity.<br><br>", "<b>Username: Alexandre</b><br><br>Hawkette, given its reputation in the real world and academic world (not necessarily in our little social, professional and familial circles), given the quality of its curriculum, faculty, facilities and resources, given the success and power of its alums, ranking michigan out of the top 15 or top 20 is underrating it. It is, quite frankly, insulting to the university and its alums. I can see how some would object to Michigan being a top 10 university, but to drop it all the way out of the top 20 is not justified. When you say that Michigan is merely a \"good state school\" rather than acknlowedge it for the excellent university that it is, you are in fact insulting the university.<br><br>At any rate, I was not trying to entrap you. My question regarding your opinion of how Michigan is viewed in the Business world and my comment about your judging Michigan were based on two separate things. I am not sure how the entire Business world views Michigan. As you pointed out, in the midwest, Michigan is generally regarded as one of the very best universities. I would say that Michigan is also very highly regarded in the Northeast and on the West Coast.<br><br>", "<b>Username: Alexandre</b><br><br>Hawkette, % accepted means nothing. Chicago accepts 40% of its applicants and it is much tougher to get into than BC. I'd say acceptance rate is as bad a barometer as class rank wouldn't you? And you are wrong about public universities have better class rank statistics than private universities. Most publics have far fewer than 50% of their students graduating from high school in the top 10% of their class. The California publics are the exception and that's because California's public high schools are generally weaker than the rest of the nation's, so graduating in the top 10% of their class isn't that difficult.<br><br>As far as SAT scores go, Michigan's mean SAT score is pretty much equal to BCs. I don't differentiate between 1300 and 1400, let alone between 1320 and 1330. If you think BC has a better student body than Michigan based on that 10 point difference, that's your prerogative. I will rate the quality of a university's student body by the bottom line; what percentage of its students enroll into good-excellent graduate programs and what percentage of its students land jobs at good-exclusive companies. From the actual evidence availlable, Michigan has the advantage on both fronts.<br><br>", "<b>Username: Tim_ND08</b><br><br>I am saving every message of this thread for next year<br><br>thanks for this argument, its actually quite productive<br><br>", "<b>Username: Alexandre</b><br><br>Productive? LOL! I'd say it is destructive!<br><br>", "<b>Username: hawkette</b><br><br>Alexandre,<br>We have been over this ad nauseaum about the relative strength of Boston College to Michigan. Based on the available data, the two groups appear relatively equal with a very slight edge to Boston College on SAT and a slight edge to Michigan on class rank. Neither difference is so stark as to conclusively prove that one student body is stronger than the other. IMO, they are roughly equal.<br><br>Re % accepted, it may not mean everything for some schools (eg, how it applies to schools with student populations that are clearly self-selecting like U Chicago and other highly technical schools), but it means a lot about selectivity for schools with a broad mandate like Michigan. IMO, it is a very weak and contradictory argument to say, on the one hand, Michigan is very strong because of the breadth of its offerings, and then on the other, say that Michigan's 47% acceptance rate should be ignored because it has a wide variety of academic offerings and must serve a state population. Boston College's acceptance rate is 29%.<br><br>Re class rank for publics, much of this is determined by state population and quantity of available state university options. As the most populous state, California has the highest percentage of Top 10% ranking students and no other state is really that close (eg, UC-Santa Cruz and others at 95% or higher, U Michigan at 89%, U Virginia 86%, U Florida 85%, U Washington 82%). Boston College's Top Ten % number is 75%.<br><br>Interesting to see you argue that schools with a 100 point differential in average SAT scores have student bodies that are not differentiated. The result of this conclusion, of course, is that you raise Michigan's average student (1315) to the level of a (what you consider to be peer) school with SAT scores 100 points higher (eg, Northwestern with 1410). The other side of that, of course, that you must accept is that it equates the average Michigan student with the scores of schools 100 points lower. Peer schools for Michigan would thus be the University of Delaware (1205), Clemson (1225), Fordham (1215), Texas A&amp;M (1200), etc. There are many, many more. If you contend that Michigan is a peer for higher ranked schools (Northwestern), then it is also a peer for these other lower ranked schools.<br><br>", "<b>Username: Alexandre</b><br><br>I disagree Hawkette. Michigan's student body is similar to NUs and Cornell's. BCs is weaker. I only go according to accomplishments of alums, not according to SATs, which are meaningless. Show me how well those students do when they graduate. Why is Michigan sending as high a percentage of its students to elite graduate schools as Cornell and NU and BC doesn't even come close? Prove to me that 1) universities report SATs in a similar fashion, 2) SATs actually measure intelleigence and 3) Michigan students prepare as hard for their SATs as BC students. Until you can show me statistics that show BC students doing as well as Michigan students after graduation as I have clearly proven, I will stand by the facts. Michigan has a higher calibre student body.<br><br>", "<b>Username: hawkette</b><br><br>Alexandre,<br>I see that the Michigan pattern continues. Knock down the numbers that puts Michigan in a weak position and heavily promote the numbers that puts Michigan in a good light. I understand your reasoning, but your arguments IMO continue to fail for making Michigan and its student body sound equivalent school to its higher ranks competitors.<br><br>As for your constant refrain re grad school placement, you falsely assume that the kids actually all want to do this. The truth is that, out of the entire college student population, only a small number even consider going to graduate school. Furthermore, getting into a grad school is not the sine qua non of establishing the quality of a school. It is a self selecting group. It says nothing about the quality of the students who choose this path, only that they have this interest. The grad school-track kids predominate in the sciences and engineering and those pursuing a business grad experience wait several years at least before applying and going. Do you really think that the 75% of Michigan students who graduate outside of engineering/sciences are planning to go to grad school right after college? And even if more of them do than their counterparts at a Boston College or a University of Washington, whats the point? Are you really intending to imply that those who choose not to apply to grad school are dumber or less successful?<br><br>Re job placement, your focus has been on Wall Street placement and some major companies coming to AA (just as they visit dozens of schools across the country). Either you dont know because you have not lived and worked there or youre just in denial, but the fact among business people is that Michigan is just another school and this sentiment is widespread. As stated elsewhere, Michigans reputation with employers is strongest in Chicago (would be considered in the top 5-6 with U Illinois, Northwestern, U Chicago, Notre Dame and U Wisconsin). In NYC, it is a small to modest player and is viewed about in line with its USNWR ranking though some local schools (eg, Fordham) probably outplace it as well. Outside of the Midwest and the Northeast, the University of Michigan is just another school.<br><br>Lets play a game for a second. Think about the following cities and tell me if you really think that business people in those locales think of Michigan as an elite university comparable to the lower level of the Ivies and other top privates:<br>Richmond, VA<br>Raleigh-Durham, NC<br>Charleston, SC<br>Atlanta, GA<br>Orlando, FL<br>Tampa, FL<br>Birmingham, AL<br>Nashville, TN<br>Memphis, TN<br>Little Rock, AR<br>New Orleans, LA<br>Dallas, TX<br>Tulsa, OK<br>Phoenix, AZ<br>San Diego, CA<br>Los Angeles, CA<br>San Francisco, CA<br>Portland, OR<br>Seattle, WA<br>Salt Lake City, UT<br><br>I could go on, but the point is that people in these places have hardly heard of Michigan (outside perhaps of its football team which regularly get walloped in the bowl games) and they certainly dont think of it as an academic or job placement elite. Ask business people in these areas how they would compare Michigan to Clemson in South Carolina, Tulane in Louisiana, Baylor in Texas, etc. Michigan would lose over and over again. Its not that Michigan is bad, its that it is not well known in most regions of the country and certainly not seen in many places as anywhere near the elite school that you promote it as. Granted, these are all my opinions, but I would be happy to hear a few of the locals from around the country who are business people in some of these locales and have them comment on the accuracy of my statements. I feel very comfortable that I have a clearer understanding than you of how Michigan is viewed around the country by business people, particularly outside of the Northeast and Midwest. I have no vested interest in Michigan and, for the record, I am promoting no school. In fact, I would have the same comments about Boston College outside of its primary area in the Northeast.<br><br>Headed out of town for a few days. I look forward to your response and the comments of others (especially business people).<br><br>", "<b>Username: UCLAri</b><br><br>Michigan is definitely well-known in Los Angeles and San Diego by anyone who knows top schools.<br><br>", "<b>Username: Alexandre</b><br><br>Hawkette, like I said, I don't believe the SAT is reliable. First of all, it has never been proven to measure intelligence, ability or success. All it measures is preparation. Students who apply to private universities prepare longer for the SAT and take the test more often. I only care about the bottom line. Yes, students who go to top universities generally want one of two things:<br><br>1) A high paying job in NYC or Chicago or another major amalgamation with a sexy and pretigious company.<br><br>2) Admission into a top graduate school.<br><br>There is no third direction. NONE! You can downplay the significance of this all-important fact all you want, but you can see it all over this forum. Allt he kids on this forum ask about placement into companies and placement into graduate school.<br><br>As for how well known and highly regarded Michigan is in various parts of the country. I have no idea. You are way off about NYC though. Michigan is valued correctly in NY as one of the nation's top 10 or top 15 universities. If you think Fordham is as highly respected as Michigan in NYC, you really know very little about Michigan or NYC.<br><br>I also know that Michigan's peer assessment score is sky high which means that among intellectuals and academe, Michigan is very highly respected all over the nation. The only truly universal university in the US is Harvard. Yale and Princeton are up there too. Other than those, universities are for the most part, regional. Even the likes of Stanford and MIT are somewhat regional if you drift away from a highly educated population.<br><br>", "<b>Username: willmingtonwave</b><br><br>\"\"also know that Michigan's peer assessment score is sky high which means that among intellectuals and academe, Michigan is very highly respected all over the nation.\"\"<br><br>We both know that Peer Assessment is a stat which is both arbitrary and highly misleading. First of all, many of the surveys that get sent out to the Deans, Presidents, etc. are not returned. Also, don't you think that their vision of a college is somewhat distorted? Do you honestly think that they distinguish between Graduate and Undergraduate education? Of course not. That is why schools with strong graduate programs also have higher peer assessment scores. This offends me particuarly, because at my school you get a top notch undergraduate education, yet we are routinely screwed in the Peer Assessment section of the rankings, ranking near and behind mediocre state schools.<br>Now, both of us are biased. You love University of Michigan, which I do think is among is the best schools in the country for Graduate education, but to say that the education is far superior to schools like BC, Tufts, Wake Forest, etc which are much more personal, is a little bit pretentious in my opinion. Harvard has great faculty and such, but a routine complain among the students is that there is no interaction between faculty and students. At my school, some classmates and I went to dinner at a teacher's house during the first week of school. Our classes are small and the priority of our instructors (and no they are not TAs) is teaching, not their own research or their own agenda. This is not to say that I am not biased, because I am. Nonetheless other factors do have to be considered.<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"Lets play a game for a second. Think about the following cities and tell me if you really think that business people in those locales think of Michigan as an elite university comparable to the lower level of the Ivies and other top privates:\"\"<br>A.T.Kearney, Citigroup, Boston Consulting, Microsoft, McKinsey, Amazon, Intel, Johnson &amp; Johnson, Bain &amp; Company, B.A. Hamilton, UBS, Bank of America, DiamonCluster Int'l, General Mills, Kraft Foods, Lehman Brothers, Proctor &amp; Gamble, American Express, Cisco, General Electric, JPMorganChase, Samsung, United Airlines, 3M, Deloitte...<br><br>AMD, General Motors, General Electric, Capital One, Lockheed Martin, Microsoft, Bank of America, Boeing, Raytheon, Dow Corning, Exxon, Chevron, Shell, BP...<br><br>These are some of the top hiring companies for Michigan grads. I can go on and on, but I think you see my point. Most, if not all, of the Fortune 500 companies recruit at Michigan. If they don't think highly of Michigan grads, why would they come to recruit year after year? Now may be some of the local businesses at those cities have not heard of Michigan, so what? Michigan certainly gets the attention at their corporate HQs and nation-wide recruiting. Can you make the same claim about BC (afterall, this is the Michigan vs. BC thread)? Btw, you may find a lot of Michigan grads working in those cities.<br><br>I used to work in Houston and my Michigan diploma certainly got the respect in the professional circle. I'm not sure BC has the same reputation down south. Michigan is well know in Asia whereas few has heard of BC. Alexandre will probably tell you the same in Europe.<br><br>", "<b>Username: GoBlue81</b><br><br>\"\"At my school, some classmates and I went to dinner at a teacher's house during the first week of school. Our classes are small and the priority of our instructors (and no they are not TAs) is teaching, not their own research or their own agenda.\"\"<br>Are you talking about Boston College? I presume you are not ... 'cause according to US News, Michigan has more smaller classes than BC (43% vs 38%) and more full-time faculties (92% vs 79%).<br><br>This thing about TA teaching is exaggerated. In Michigan, there are only a few courses taught by TAs. For introductory courses, it's more likely that a professor will do the lecture 3-4 times a week and the TAs will handle the discussion sessions. If you place out of Calculus 1 and 2, chances are you may not have any TA-lecture classes.<br>\"\"the priority of our instructors...is teaching, not their own research or their own agenda.\"\"<br>Good for them. On the other hand, they have to make some sacrifice on their own research and publication, right?... Don't get me wrong. I agree that universities should put more emphasis on teaching. It's just that the current system at major research universities places a lot more emphasis on research and grants.<br><br>", "<b>Username: ckmets13</b><br><br>he goes to Wake<br><br>", "<b>Username: Alexandre</b><br><br>Willmingtonwave, you say...<br><br>\"We both know that Peer Assessment is a stat which is both arbitrary and highly misleading. First of all, many of the surveys that get sent out to the Deans, Presidents, etc. are not returned. Also, don't you think that their vision of a college is somewhat distorted? Do you honestly think that they distinguish between Graduate and Undergraduate education? Of course not. That is why schools with strong graduate programs also have higher peer assessment scores. This offends me particuarly, because at my school you get a top notch undergraduate education, yet we are routinely screwed in the Peer Assessment section of the rankings, ranking near and behind mediocre state schools.\"<br><br>No, I don't know! What do you mean we \"both know?\" I actually think the PA is a very good indicator of undergraduate academic excellence. It is the only part of the USNWR I agree with. The rest of it is based on numbers reported by universities. Take a few accounting classes and then you will understand how numbers can be manipulated. Of course, the PA is not 100% accurate, but it is generally spot on. This said, many people misinterpret or misunderstand the PAS. It does not measure a university's learning environment. That cannot be measured because it depends on the individual students. We each have our personal learning styles and preferences. Some universities suit some students better than others. We each have our ideal learning environment. As you pointed out, many students at Harvard complain about their profs. Those students went to Harvard because they expected it to be the best or because they wanted the brand name. But they may not have been suited for Harvard's academic invironment. At top research universities, students are expected to be independent self-starters. Professors at those universities care for their students, but they only have time for those who are engaged and interested. The USNWR does not distinguish according to learning style or environment because it can't, and that's not what the PAS is measuring. The PAS measures the academic reputation and academic excellence of a university.<br><br>And I don't agree with you about research universities having higher PASs than non-research universities by virtue of their graduate programs. Brown, Dartmouth, Vanderbilt, Emory, Georgetown, Rice etc... have no trouble maintaining very high PASs and none of them have prominent graduate programs. On the other hand, USC, NYU, UT-Austin, UIUC, UCSD, UDub and several others have huge and elite graduate programs and their PASs aren't sky high. You do realize that university presidents and Deans of admissions are asked to rate undergraduate excellence, and only in the case of universities they are familiar with. Now, if the PAS was derived from a few biased individuals, I would question it. But when 2,500 of the nation's leading and most experienced academics from all over the country with affiliations to all the universities in their peer group are being surveyed, and then the statistical outliers are removed from the equation, I'd say the final product should be relatively telling.<br><br>", "<b>Username: ckmets13</b><br><br>Ok, first you say that Georgetown has a high PA rating (4.1) and then you say that UT-A has a low PA rating (4.1). How is 4.1 both high and low? With regards to NYU, its PA of 3.8 is in fact higher than it should be. It is much more a peer of BC than it is of schools ranked higher than it in USNWR. Brown and Dartmouth in fact do have low PAs compared to the rest of the Ivy League. Who are you comparing Brown and Dartmouth to when you say that they have no problem maintaining their PA. I know you are biased towards Cornell, but if this were truly an undergraduate ranking, dont you think Dartmouth would rank at least equal to Cornell, if not maybe 0.1 above? But Cornell, because of its many top ranked Graduate programs in the sciences and engineering, gets the higher PA.<br>If you can convince me that the University of Iowa is a better undergraduate institution than BC, Wake Forest, Lehigh, U of Rochester...., then maybe I will buy into your argument, but I would be extremely impressed if you could do this.<br><br>", "<b>Username: ckmets13</b><br><br>So Alexandre I assume you mean also by the previous post that since you only agree with PA, you would take a high quality faculty teaching kids with HS GPAs of 2.5 and SATs of 900 over a pretty good faculty teaching kids ranking right around the top 6 or 7% of their high school classes with over 1300 SATs. Since faculty is all that matters for academic excellence, after all.<br><br>", "<b>Username: Alexandre</b><br><br>ckmets, a 0.3 or even 0.4 + or - rating is negligible. It is crazy to assume that anything in this world can be 100% accurate. Cornell isn't better than Dartmouth simply because its PA score is 0.2 higher. And NYU is not better than BC simply because its PA is 0.2 higher. Those universities are pretty equal and the PA score shows that. And my point about UT-Austin and Georgetown is that if the PA measured research and graduate school quality, the latter's PA would be significantly lower than the former's because UT-Austin is better than Georgetown at the graduate level. And yet, they have equal PAs. That tells me that the PA measures undergraduate quality, not graduate school quality. Finally, don't underestimate Iowa. It is a much better university than you think, and members of academe obviously know that. Iowa isn't a major research university and has average graduate programs. If its PA is high is because it does a good job at the undergraduate level. And no, it is not better than Lehigh, BC, Wake or UofR. But it is very arrogant and shallow to assume that it is worse just because it is located in Iowa or because it is a state university. Like I said, a peer assessment score difference of 0.3 or even 0.4 doesn't say much. That can indeed be atrributed to size and research activity.<br><br>Now I definitely think that a university with high profile graduate programs, like Cal, Columbia, Cornell, Michigan etc... will stand to benefit a little when it comes to measuring the PAS. And why not? The same faculty teaches graduate students and undergraduate students. In most top research universities, and certainly at Cornell and Michigan, the curriculum for juniors and seniors is very similar to the course load taken by graduate strudents. The main difference is the level of detail graduate students go into. Econ 401, 402, 413 etc... are taught by the same professors as Econ 601, 601, 613 etc... They cover almost the same concepts and principles. The main difference is extent to which math is used. Undergrads also get to do cutting edge research with the same faculty and use the same World class facilities as graduate students.<br><br>\"So Alexandre I assume you mean also by the previous post that since you only agree with PA, you would take a high quality faculty teaching kids with HS GPAs of 2.5 and SATs of 900 over a pretty good faculty teaching kids ranking right around the top 6 or 7% of their high school classes with over 1300 SATs. Since faculty is all that matters for academic excellence, after all.\"<br><br>Did I say that faculty is all that matters? I don't recall ever saying that. I said faculty is the most important aspect of a top university. Resources, facilities and student quality all matter too. It's not like Michigan suffers in any of those departments. Michigan's endowment is the 7th largest among US universities. Michigan's facilties are among the very best to be found anywhere. Student quality is hard to measure because each university evaluates talent differently and reports statisitics differently. Suffice it to say, regardless of how you measure student quality, Michigan's student body is good enough to provide fellow students with a competitive academic environment and to meet the expectations of a very demanding, world class faculty.<br><br>So, to answer your question, between chosing a university with a World class faculty an below average students (can you point such a university out for me, I am having trouble finding a university with a World class faculty that has a student body with average cumulative HS GPAs under 3.3 or mean SAT scores below 1100) or a university with merely a \"good\" faculty and excellent (average cumulative HS GPA over 3.7 average and mean SAT score over 1300) I would probably pick neither. I would rather pick a university with a World class faculty AND with excellent students.<br><br>", "<b>Username: ckmets13</b><br><br>I was just making an extreme case, of course there are no schools exactly like that. And I was not picking on Iowa specifically, only because it happens to have a 3.7 PA. I couldve said Texas A&amp;M or any other number of public schools. What difference in PA is negligible and what isnt? Lehigh has a 3.2 but A&amp;M is a 3.8. Do you consider A&amp;M better then?<br><br>", "<b>Username: Alexandre</b><br><br>The mean SAT score at Texas A&amp;M is 1200, not 900. That's not even close! And no, I do not think Texas A&amp;M is better than Lehigh, but I don't think Lehigh is better than Texas A&amp;M either. They are completely different universities. A&amp;M, as the name suggests, is primarely an Engineering and Agriculture school.<br><br>", "<b>Username: ckmets13</b><br><br>Lehigh is primarily an engineering school as well, although it has shifted away over the past few years. Note that their former mascot was the engineer. And that question in no way had to do with schools with 900 SAT scores. I know A&amp;M's SAT range, actually I nearly applied to A&amp;M (meteorology program)<br><br>", "<b>Username: ckmets13</b><br><br>And that means that a 0.6 in PA is negligible too, you know what that means, we are getting dangerously close to the all important 0.9.<br><br>", "<b>Username: willmingtonwave</b><br><br>\"\"They are completely different universities.\"\"<br>Exactly, so why are you trying to compare Boston College and Michigan? They too are two completely different universities. It is the same exact thing, you cannot say Michigan is better, when they are two totally differently orientated schools.<br><br>", "<b>Username: Alexandre</b><br><br>I do believe that a 0.6 difference in the PA is significant. The reason I don't think Texas A&amp;M is better than Lehigh isn't because of their PA but rahter, because they are so different. I agree, Michigan and BC are different. I do not recall saying Michigan is better than BC either. I believe that overall, Michigan is a more complete university, similar to Cornell or Cal, but for many, I am certain BC makes better sense.<br><br>", "<b>Username: nefer</b><br><br>Alexandre, the Lehigh vs. Texas A&amp;M example does illustrate a degree of weakness inherent in PA rating when comparing schools that one may not consider peer institutions.<br>As far as undergrad education goes, both schools are regional, and maybe, the research prowess of Texas A&amp;M magnifies its relatively high standing among its peers in the southwest region, whereas Lehigh is rated by many national powerhouses in its surrounding area. That said, I think PA rating is a reliable academic quality indicator for colleges with national renown. Just my guess.<br><br>", "<b>Username: hawkette</b><br><br>According to the National Association of Colleges &amp; Employers, the top five characteristics that employers seek are:<br>1.\tCommunication skills (oral &amp; written)<br>2.\tHonesty/integrity<br>3.\tTeamwork skills (works well with others)<br>4.\tInterpersonal skills (relates well to others)<br>5.\tStrong work ethic<br><br>Obviously these are personal traits that are not unique to any one college. As a result, major employers of undergraduates cast a wide net and hope to identify students with these qualities and also the intelligence and, in the cases of engineering and science-related fields, the relevant academic skill set for potential success in an industry. In the work world, the expectation of the vast majority of employers is that they will have to train and develop whoever they hire. This is true whether the student comes from Boston College or Michigan.<br><br>As for the value of a BC or Michigan degree, IMO the difference is noticeable in certain locales and industries, but overall it is negligible. Both place a large number of their students into the Northeast (and Michigan likewise places many in the Midwest) and both schools have extensive local networks of alumni (although Michigans large size is an advantage here). Clearly Michigan will be stronger in its home state and in the Midwest while Boston College is stronger in Massachusetts and much of New England, particularly in the locally important asset management and insurance industries.<br><br>As for NYC, both are present, but neither has a profile much different than their USNWR rankings (Michigan-24 and Boston College-34). In addition in NYC, many LACs are more highly favored than either Michigan or Boston College. A major factor in the recruiting for Wall Street is the existence of graduates in the hiring networks of the Wall Street firms. More so than Michigan, Boston Colleges network extends more to the trading side of Wall Street. Both schools send a good representative number of students to Wall Street, but neither is truly a major player. At this point, Michigans network is more developed, but Boston College has shown great growth over the last decade as the quality of its students and graduates have improved to the point where the strength of the two student bodies is very, very close.<br><br>Outside of the NE and the MW, neither school has much of a profile or much cachet. In these geographies, Michigan may have slightly stronger brand awareness due to its sports teams and its engineering program (BC has no engineering). Both schools would be at a deficit to the schools in these other regions, including many schools ranked considerably below them. Why? Because employers value the five characteristics named above and they can find plenty of this also in students from local schools that may have inferior rankings, but dont necessarily have inferior students.<br><br>", "<b>Username: hoedown</b><br><br>Hey, I actually have some data on this! A little something to throw out for the numbers-hungry folk among us<br><br>U-M gets feedback from the hundred of recruiters who come to campus each year. Here are the top skills recruiters tell U-M they are looking for; in parentheses is the percentage of U-M students who met or exceeded their expectations on that skill/quality:<br><br>\tCommunication (93%)<br>\tMotivation/Initiative (92%)<br>\tStrong work ethic (90%)<br>\tAnalytical skills (90%)<br>\tLeadership skills (82%)<br>\tRelated work experience (89%)<br><br>So U-M may be a little weak in leadership skills. Still decent though. I should note that this survey is done by the Central Career center, and is going to exclude those recruiters who come on campus looking primarily for business majors or engineering majors. Those recruiters go through the recruiting offices of these schools. This essentially measures how recruiters feel about U-M's liberal arts grads.<br><br>Of course, I have little doubt that recruiters as Boston College would have the same kind of overall glowing reports for those students.<br><br>", "<b>Username: hawkette</b><br><br>hoedown,<br>Thanks for the data which looks very complimentary of Michigan's students.<br><br>Several follow-up questions: Does Michigan require the recruiting companies to evaluate the students in this format? Do all of the companies comply? How many companies in all do ths? Is this information that is compiled by all colleges and is there a way to evaluate this from the recruiters' perspective across multiple colleges?<br><br>", "<b>Username: hoedown</b><br><br>This is a survey that U-M's employer liaison sends to every company that comes to campus to interview. They have a genuine interest in knowing if U-M students are found wanting in any key areas, and I would imagine recruiters appreciate having the chance to give the feedback. I doubt returning the survey is \"required,\" however; the last thing an institution wants to do is make recruiting onerous.<br><br>I have assumed it's an in-house instrument, so I don't know if any other institution asks exactly comparable questions. In any event, I don't have access to that research done by other campuses. The U-M data is shared with me because I have a need for it in some of my other work.<br><br>MSU does a big employer survey every year asking companies what they are looking for in college graduates in general, but I don't believe companies are asked to rank one schools' grad's against another. I mention it, however, because some people might be interested in hearing about recruiter impressions in a general sense.<br><br>"]}