{"title": "wpi vs rit vs rpi", "comments": ["<b>Username: ajayc</b><br><br>your views people...<br><br>", "<b>Username: weenie</b><br><br>My son is looking at those three school plus a few others. So far he has no clue...<br><br>", "<b>Username: ajayc</b><br><br>I personally kinda love WPI....I dont have a specific reason but i just do....<br><br>", "<b>Username: weenie</b><br><br>I also like WPI. I like the small size. But it is turning out to be about $5K/year more than RPI, so that will definitely hurt it.<br><br>", "<b>Username: palermo</b><br><br>weenie: Too bad we couldn't switch. WPI gave my daughter more money than RPI, but she prefers RPI. Never fails, does it? We didn't look at RIT -too far away for us.<br><br>", "<b>Username: ajayc</b><br><br>i would literally do anything to go to WPI :)<br><br>", "<b>Username: palermo</b><br><br>ajayc: What do you like about WPI over the other two?<br><br>", "<b>Username: ajayc</b><br><br>almost everything...They give out aid to intls too!!! Their teach methodology too!<br><br>", "<b>Username: weenie</b><br><br>palermo: Isn't that funny?! Well, either way they both work out to be really expensive. We are really trying to keep this under $25K/year. His financial safety (coming in about $10K/year now) is a low ranked school, but one we really liked regardless (Ohio Univ). RIT comes in at about $23K. So we'll see what he decides...Yikes. Two in college and we still have a high EFC.<br><br>", "<b>Username: palermo</b><br><br>weenie : We will also have two in college next year and our EFC is out-of-this world. Four more years and we can start eating, heating our house, all those nice little things.<br><br>", "<b>Username: wackymother</b><br><br>Do you think WPI students are happier? Somehow I get that feeling--WPI students happiest, then RPI, then RIT students. What do you think?<br><br>", "<b>Username: ajayc</b><br><br>i feel the same....<br><br>", "<b>Username: weenie</b><br><br>Actually the RIT kids I know (being from Rochester) are significantly happier than it appears online. I just get a different vibe off the tech school students in general. Maybe because so many are boys? I don't know.<br><br>", "<b>Username: ajayc</b><br><br>I have been talking to students at WPI, especially indian all of them love WPI!<br><br>", "<b>Username: hl2016</b><br><br>That's great to know that people are happy there :)<br>It's hard to study when you are depressed and/or bored :)<br><br>", "<b>Username: iamtim</b><br><br>Rensellaer will cost me $31000 per year. Worcester will cost $30800 and RIT will cost me $27500. Seriously. I might just go to SUNY Buff, even though I'd rather die. lol<br><br>", "<b>Username: ajayc</b><br><br>the students with whom I had a talk told me that there were lot of transefers from RIT to WPI they didnt like it at RIT<br><br>", "<b>Username: PrincessPaige76</b><br><br>Coming from a current WPI freshman, I can tell you I love it here! From my classes, to the activities I'm involved with on campus, to living in the dorms, all of it is great! So if anyone has any questions, feel free to ask.<br><br>", "<b>Username: ajayc</b><br><br>Am I in at wpi? :D<br><br>", "<b>Username: ajayc</b><br><br>If i get a recommendation letter from a WPI student does that matter?<br><br>", "<b>Username: PrincessPaige76</b><br><br>Ok so I can't answer admissions questions haha... sorry!<br><br>", "<b>Username: ajayc</b><br><br>gotcha!!! :P<br><br>", "<b>Username: vampiro</b><br><br>^^ It wouldn't matter...Get the reccomendations from your teachers or people who know you well...maintain a cool head...and just letting you know the max scholarship that WPI dishes out to internationals is about 26k, so plan accordingly....That being said..WPI is a very good engineering school and they have a lot of credibility...A lot of project opportunities and stuff ( i have already been to Greece before the end of my freshman year and did my sufficiency...although it was through my choral club and not the school)...<br><br>", "<b>Username: LakeWashington</b><br><br>As a parent (not a WPI parent) I am impressed with WPI's intensive preparation in the sciences, but also its surprisingly good Humanities offerings. WPI appears to have a really good balance of strong academics and an active life for students outside of the classroom. I also think that the Worcester Consortium is a great advantage for students, allowing them to register and get credit for courses at other colleges in the town. A student can seal himself/herself in a dorm room [i.e. Dungeons and Dragons, ugh!], or the student can explore and expand their individual horizons at WPI.<br><br>", "<b>Username: youknowme</b><br><br>Does WPI has biophysics major? If not, how is the biochemistry and physics department at WPI?<br><br>", "<b>Username: Tigrael</b><br><br>You can't seal yourself in your room with Dungeons and Dragons. That requires social interaction ;)<br><br>I haven't heard of a biophysics major, but the bio people just got a huge facility right off the highway. And the physics program is excellent.<br><br>", "<b>Username: nycomari</b><br><br>I went to WPI. My daughter looked at WPI,RIT, RPI, Stevens, and chose Stevens. Son is going to Purdue.<br><br>It depends on what you value.<br><br>Want the most eclectic (project based) experience, that will develop maturity skills you won't get anywhere else? WPI<br><br>Want the best national reputation? RPI<br><br>Want the advantages of co-op education that is truly integrated into curriculum? RIT<br><br>Best campus? WPI, then RPI, then RIT<br><br>Best city environment? they all pretty much suck. Rochester is OK, but RIT is nowhere near the city. Troy sucks. Worcester has tried, but never really made it. WPI wins because the commuter rail goes to Boston.<br><br>Best employment oppottunities? a tie. all have solid reputations, but somewhat better known in their respective regions<br><br>", "<b>Username: weenie</b><br><br>^ That post is SO accurate.<br><br>", "<b>Username: sat123</b><br><br>WPI's location kind of stinks, since there is a lot of crime in Worcester, I've read. But then RPI's location is extremely boring, so I guess it balances out. I've heard RPI has better facilities too. But that's just the word around my school, so it could be biased of course.<br><br>", "<b>Username: ojnabieoot</b><br><br>As a WPI student, I'm somewhat biased, but I'll try to give an objective assessment:<br><br>As far as undergraduate study goes, WPI and RPI are virtually identical in terms of quality and available opportunities. As a physics and math major with interests in continuum mechanics (fluids) and partial differential equations, WPI's smaller programs and term-based curriculum works out well for me, as I can do independent studies and \"pick and choose\" math courses to supplement my study more freely than I could have at RPI. On the flip side, RPI's engineering sciences are a bit stronger overall than WPI, and RPI is much more of a research institution. If you want a bit more flexibility in research opportunities, and if you want to go to graduate school at the same institution as your undergrad, RPI is the better choice. As far as course rigor/quality, WPI and RPI are probably equivalent.<br><br>RIT is quite a different school from the two of them; it's more of a technical-oriented Northeastern. From what I gather, students are pushed towards research less than WPI and RPI, but pushed more strongly towards co-ops, design projects, etc. If you are interested in being a \"working\" engineer, RIT offers a lot of advantages over WPI and RPI, but it's somewhat weaker for graduate school preparation.<br><br>Basically, all three schools are top-notch (even if WPI and RIT are somewhat unfairly ranked; there's no way UCSD offers a better academic experience). It really falls on personal preference - which campus do you prefer? Do you want a small school? How will you fit in socially?<br><br>And now for something a bit more strongly biased: I turned down many prestigious universities for WPI (Rice, Vanderbilt, Harvard) due to financial reasons, and I couldn't be happier here. I'm sure the same would be true at RPI, and possibly RIT if I didn't plan on going for my PhD.<br><br>", "<b>Username: delton</b><br><br>Yeah, well I go to RPI, and I never considered WPI too seriously, because everyone I heard indicated it was a smaller scaled down version of RPI. The academic experience is probably similar between the 2, although RPI certainly has more research opportunities as has been noted, and probably a slightly wider selection of courses. RIT's academic experience is different, they have a 3 semester program, and seem to be very bent on Co-op and gaining job experience so you can transition to a job right after graduation: which didn't appeal to me either.<br><br>Another thing that can be said about RPI they are doing major things to improve the institute, like building major new research centers in new niche fields such as Biotechnology and Electronic arts (EMPAC center). The endowment has been growing (currently 850mil) and they have a goal of reaching 1 billion in the next few years, which is higher the WPI (369 mil) or RIT (580 mil).<br><br>Also, I haven't had any problems with being in Troy, because there are so many things to do on campus here, I've only left campus a few times, and those few times it wasn't really that bad. I know RIT and RPI both have a lot of student clubs, and I suspect WPI does too.<br><br>", "<b>Username: weldon</b><br><br>Can any current/past WPI students comment on the quality of the undergrad. Computer Science program? Specifically, what is your experience with the quality of the faculty and their teaching?<br><br>", "<b>Username: Tigrael</b><br><br>If you can put up with the retarded intro class (I HATE scheme), then I hear it is pretty good. Two of my CS friends are seniors now. One will probably be getting a job with IBM. The other was considering grad school at MIT but got a very lucrative job offer. Both of them made something like 22 bucks an hour from their summer jobs.<br><br>Myself, I switched out and became a physics/math major.<br><br>", "<b>Username: aath18</b><br><br>My brother went to RPI for architecture and he found that all of the learning was really on his own. He ended up being a TA his sophomore year for a calculus class and the real teacher wouldnt even show up. I personally have been thinking about RPI and that really turned me off. If I'm paying that much for a school, I really want to be around teachers who care enough to come to the class they are teaching. Just a thought..<br><br>", "<b>Username: al6200</b><br><br>My experience so far at WPI is that the engineering teachers are very strong. I've met two engineering professors thus far, and they're probably the two best teachers I've ever had in my life.<br><br>The CS teachers are mixed (consider that we teach intro classes in Lisp, not C++ or Java, even the way we're taught to use Java is obscure). Consider that in Object Oriented Programming, you're not taught to define arrays the normal way, like int[] intList = new int[3]. Rather you're taught to create an interface ILoInt, and then use recursive objects.<br><br>And my experience so far with the math professors is mixed, but treading towards the low side. They always showed up to class, but some of them had trouble speaking English or teaching effectively.<br><br>One of the nice things about WPI, that I honestly did not consider before I came here, was the diversity. There are a lot of international students (I think like 12%) and professors, and it definitely keeps things interesting.<br><br>", "<b>Username: Dorkdorkdork</b><br><br>Even with the most fin. aid available for a domestic student (household income of ~65K), will I still be paying around 20K+ a year? I was really starting to like this school but the power of the purse reigns supreme. :I<br><br>", "<b>Username: jackbauer24</b><br><br>can someone comment on the social life in the 3 schools<br><br>", "<b>Username: al6200</b><br><br>\"\"can someone comment on the social life in the 3 schools\"\"<br><br>I think the biggest difference is that WPI/RPI are almost entirely engineers, while RIT is mostly non-engineer (most people I know who go to RIT are \"artists\" who also have a practical side).<br><br>Size is also a major factor. RIT is more likely to have a clique that fits you simply because it is much larger.<br><br>", "<b>Username: #theorymom</b><br><br>Son applied to RPI and WPI but not RIT because RIT does not offer a major in pure math. I am hoping the comment about the math profs at WPI relates to just the core math classes, as I would hope the faculty who teach the upper division math classes are accessible AND understandable. (actually they all should be)<br><br>", "<b>Username: al6200</b><br><br>\"\"Son applied to RPI and WPI but not RIT because RIT does not offer a major in pure math.\"\"<br><br>Really, I thought they had mathematical sciences or something along those lines.<br>\"\"I am hoping the comment about the math profs at WPI relates to just the core math classes, as I would hope the faculty who teach the upper division math classes are accessible AND understandable. (actually they all should be)\"\"<br><br>Yeah, there really are some good teachers in the bunch, it's just that a lot of them (at least that I've had) understand the research and everything well but aren't really very good at teaching or public speaking.<br><br>That said most of them are understandable and accessible. But perhaps some are not as skilled at teaching as they are at mathematics.<br><br>", "<b>Username: Tigrael</b><br><br>Virtually all the physics professors at WPI are at least competent at teaching. Two that stand out are Professor Germano Iacchionne (Prof Germano) and Professor Carol Koleci.<br><br>The math department isn't as good. Professor Volkov is excellent, as is another prof whom I can't recall the name of right now. Prof Lui is hilarious and relatively easy to understand (he's Chinese), but AVOID him for intro classes as he's been known to fail an entire class just because he hates teaching intro classes. I have great animosity towards Prof Fehribach who drove me off of a double-major MQP, and that is why I have a BS in just Physics and not Physics and Math. He does not seem to have a basic understanding of physics.<br><br>(Class of '08)<br><br>", "<b>Username: #theorymom</b><br><br>al6200<br>RIT has applied math only<br><br>and I would guess a lot of mathematicians are better mathematicians than they are teachers. A great math teacher is worth his/her weight in gold.<br><br>Tigrael<br>Thanks for the heads up<br><br>", "<b>Username: al6200</b><br><br>\"\"Virtually all the physics professors at WPI are at least competent at teaching. Two that stand out are Professor Germano Iacchionne (Prof Germano) and Professor Carol Koleci.\"\"<br><br>Oh yeah, they're both really good. Every ECE professor I've met thus far is really good. Cyganski definitely stands out.<br><br>", "<b>Username: Orinox18</b><br><br>Which school, RPI or RIT, is more likely to dish out more financial aid?<br><br>", "<b>Username: Jessephen</b><br><br>My son is a junior at WPI and absolutely loves it. He has gotten very close to some of his professors and feels he gets a LOT of personal attention. WPI does a GREAT job of getting jobs for their graduates as they are 9th out of all colleges in the country in this area. My son has had two internships at Cisco computer systems (considered one of the premier employers in the US) and it is mostly because of exposure at WPI's job fairs. He already has two senior friends who were offered employment (for after they graduate) at 74K per year. Getting a great education and then getting a good job is high on my list of what is important in a college. It may come with a higher price tag but may be worth it in the long run.<br><br>", "<b>Username: lmesfin10</b><br><br>anybody know about the academic rigor or prowess of their biomed programs?<br><br>", "<b>Username: Apollo6</b><br><br>What about computer software engineering/ computer game design? Any thoughts on any of these schools? S could go to Purdue instate but not sure it has the program he wants.<br><br>", "<b>Username: CBBBlinker</b><br><br>IMGD is the fastest growing major at WPI.<br><br>", "<b>Username: IndianPwnerDude</b><br><br>\"\"anybody know about the academic rigor or prowess of their biomed programs?\"\"<br><br>The biomed programs are strong but I don't think the biomed programs are particularly famous. However, there are many options available at WPI in biomed (bioelectronics with ECE, biomechanics w/Mech) and the faculty are generally good (I am not a BME but this is what I hear). The program is quite hands-on, which is a good thing.<br><br>More recently, the research program at WPI BME has really grown with Gateway Park and there are many project opportunities at UMass Medical School. Career and graduate school options are good for WPI BME (recent students have been admitted to grad school at Duke, JHU, Purdue, and Cornell, among others).<br><br>", "<b>Username: fireflyscout</b><br><br>S is an IMGD major. IMGD has two tracks - technical and artistic. The IMGD department brings in lots of speakers (weekly?) and seems to be well-connected. There's also a Game Development Club that is pretty active. Next year S will be living with other IMGD majors in a campus-owned house.<br><br>", "<b>Username: giusbabs</b><br><br>Thank you ojnabaioot. This was thoughtfully written. Very helpful as my son was accepted to WPI, RIT, Wentworth (safe school) but would really like UPenn. Haven't heard from them, only an alum interview and visited the school. But! the information you posted about WPI is very insightful. Thanks, again!<br><br>", "<b>Username: AdvisorMom20878</b><br><br>Congrats, giusbabs. My daughter was also accepted at both WPI and RIT. WPI gave scholarship award, RIT decision will probably take another couple of weeks. Did you have personal preference as to WPI vs. RIT?? Just curious?<br><br>", "<b>Username: HPuck35</b><br><br>I don't know anything about RIT, but my daughter is a freshman at WPI and just loves it there. It is a much smaller school than RIT, about a quarter or third the size, which fits her well.<br><br>You can compare the two school by some of the numbers at [url=<url>http://www.****]College</url> Results Online[/url]. There is a compare tab that is quite usefull. Several numbers stand out to me, the 4 year grad rates (as it does factor into the cost equation, which maters to me) and the first year retention rates (which signifies how satisfied the students are). Both favor WPI. But numbers aren't everything.<br><br>Good luck in your choice.<br><br>", "<b>Username: Maya430</b><br><br>which is better for Electrical Engineering ?<br>NJIT or RIT?<br><br>", "<b>Username: lookatme</b><br><br>No one mentioned the IQP program. My daughter has been very happy at WPI. had a great experience traveling for the IQP and enjoys the social life. The Greek system is fun but more down to earth than at non tech schools. I have heard that many have been unhappy with RPI as a harsh academic environment. WPI faculty are very accessible and supportive but teach. A WPI mom's opinion.<br><br>", "<b>Username: mihcal1</b><br><br>How is the quality of life at WPI, especially for a girl?<br>Do you ever get off campus, or go into Boston?<br>How's the food?<br><br>", "<b>Username: HPuck35</b><br><br>My daughter is a freshman this year. She is enjoying her time at school.<br><br>She is in a triple in Morgan Hall. It was originally designed to be a large double but doesn't seem to be cramped as a triple.<br><br>My wife and I were there for parent's weekend and ate once in the cafeteria. It seemed quite good and my daughter said that what they had was the usual fare (so they didn't make it special just for parent's weekend). However, she likes to cook and there are no student cooking facilities in her dorm (or I beileve most of the freshman dorms). She and her roommates have a small fridge and microwave in their room for extra snackage.<br><br>Worcester doesn't have any major league sports but there are minor league sports games (which typically means tickets are cheaper and easier to get). She went to a baseball game once as a WPI outing. The arena for the Worcester Sharks (AHL hockey) is about a mile away (ie. walking distance) and she and her friends have gone to several games (their secret, when it is raining, is to tell the WPI transportation that they need a ride to the train station, which is just across the street from the arena as the arena).<br><br>I don't know what the music scene is like in Worcester, but she and her girl friends were in Boston the other night at the Boston House of Blues. Got the tickets online and it is about an hour drive each way.<br><br>As a parent, I was concerned that, with the male to female ratio, she would get a lot of attention from the boys. Either it is not occuring or she doesn't consider it a problem as she has never said anything to my wife or myself (not as likely).<br><br>", "<b>Username: wearymachine</b><br><br>i personally think RPI is more of a nationally well known, prestigious school with better students and tougher curriculum...like more in line with places like Cornell, Georgia Tech, and CMU...like those top notch schools that try to compete with MIT...<br><br>WPI...i'd place it like right behind RPI...like high second tier...i also think WPI is VERY underrated...<br><br>RIT...i think both RPI and WPI are much better than RIT...<br><br>now that is for undergrad...as far as grad goes...RPI def has the most research...RIT and WPI probably have about the same...but in the end, i think for grad school, it doesn't really matter where u go, so long they have the research and concentration you look for...be it MIT, RPI, WPI, RIT, Penn State, Arizona State...ANYWHERE...<br><br>and i think at any tech school, the lack of girls leads to some level of unwanted attention for the ladies (esp if she's not ugly...note i'm not even saying \"pretty\"...i say \"not ugly\")<br><br>", "<b>Username: IndianPwnerDude</b><br><br>\"\"i personally think RPI is more of a nationally well known, prestigious school with better students and tougher curriculum...like more in line with places like Cornell, Georgia Tech, and CMU...like those top notch schools that try to compete with MIT...\"\"<br><br>I agree RPI is nationally better known but it is tough to compare the curricula of schools unless you have attended both of them. Many of the intro courses at WPI are a joke though although the 3000/4000/grad-level courses are very challenging as is the electromagnetic fields course.<br><br>All three are fine schools and prepare you well for job/grad school. Engineering is hard no matter where you go but regardless of the school reputation or anything else, there is no doubt that the very top students are often above the general curriculum level and can achieve extra opportunities for research, project work, etc.<br><br>", "<b>Username: HPuck35</b><br><br>I will agree that RPI is better known than WPI. However, when it comes to hiring, a company hires a person, not a school.<br><br>I worked in engineering for a aerospace company in SoCal for 33 years. Funny, being so far from Massachusetts that I never worked with any RPI grads but did with several WPI grads. They were very good engineers and usually had to explain where WPI is located. They obviously got their jobs because of their skills and not the awareness of their college.<br><br>", "<b>Username: wearymachine</b><br><br>i agree with IndianPwnerDude...btw i have a question...is the undergrad E-Mag class at WPI required??...i'm starting grad school at WPI this fall and i was looking to TA eventually, and the E-Mag class was something i pwned (in your username style) when i did my undergrad at RPI...the lady who works in the ECE dept said something about the EM class not being offered every term...<br><br>also about grad school...i think grad students anywhere are top of the line...i think getting into a thesis based, funded MS program is like the equivalent of getting a top notch R&amp;D job...<br><br>i agree with HPuck's comment too<br><br>", "<b>Username: mihcal1</b><br><br>Thanks HPuck &amp; others!<br><br>", "<b>Username: booksngardens</b><br><br>We are in the process of deciding between WPI and RPI for a major in electrical and computer engineering. We liked RPI, but on both visits to WPI the atmosphere was so positive. We met at least 4 full professors, saw the labs up close, and overall the college community seemed close and supportive. Its hard to resist the reputation of RPI, but WPI has so many positives. Any advice?<br><br>", "<b>Username: cc367</b><br><br>I understand, but I think you need to forget about reputation, and consider where the student will be happiest.<br><br>Do they like project work/team work or traditional classes; a collaborative vs. competitive atmosphere; geographic location; 3 class focused 7 week terms vs. traditional semesters; a study abroad program that is project oriented and not classes in a foreign university...reputation won't mean anything if it's not the right fit. At least these were the considerations which helped us chose WPI over RPI.<br><br>Good luck.<br><br>", "<b>Username: booksngardens</b><br><br>thank you cc37.<br><br>", "<b>Username: jo1214</b><br><br>We are trying to decide between the IMGD (interactive media and game development) program at WPI and the GSAS (games and simulation arts and sciences) program at RPI. Any advice will be appreciated!<br><br>", "<b>Username: decisiontimemom</b><br><br>HPuck35 - do you have any experience working with Stevens Institute of Technology grads? Thanks<br><br>", "<b>Username: decisiontimemom</b><br><br>wearymachine - what is social life like at RPI? Thanks.<br><br>", "<b>Username: wearymachine</b><br><br>social life at RPI...people complain about it a lot...the lack of girls, Troy bein all hood and not having much around there for miles, not much to do on campus...yata yata yata...<br><br>to be honest...lack of girls...it's somewhat of an issue...but it's getting better...i mean it's not on like normal school standards...but you see some girls here and there...<br><br>area...Troy is kinda hood...i mean it's not awful by any means...south and north Troy can be more hood...but this ain't South Bronx by any means...the downtown area is kinda nice actually...they have some neat little shops and whatnot...i personally like the small city feel the entire area (Troy / Albany) has...other than that, plenty of outdoorsy stuff within an hour (Adirondacks, Catskills, Berkshires, etc)...and then NYC is 145 miles away (that's like 2 hours...not even)<br><br>things to do on campus...the greek system is big...but i found them to be rather lame and cliche (like frats at any school...just a lame place for generic caucasian peeps to drink lol)...RPI had a couple neat frats though...some geeky frats (it is RPI after all)...as well as a latino frat that i used to hang out at...the school has decent diversity (esp if u factor in grad students)...and the Union hosts a lot of events like concerts, comedy shows, etc...<br><br>"]}