{"title": "stanford vs princeton", "comments": ["<b>Username: Eiswein</b><br><br>I just got admitted by these 2 wonderful schools and am doing tons of research on where to go. But the general comments on these schools do tend to contradict each other and I am getting a bit overwhelmed with all the points I need to focus on, so I thought I'd post some info about myself and ask for everyone's opinion.<br><br>", "<b>Username: TheGFG</b><br><br>Well, Princeton Professor Anthony Grafton praised Stanfords interdepartmental collaboration in social sciences research in his October 26, 2009 editorial in The Daily Princetonian <url>http://www.dailyprince-tonian.com/2009/10/26/24264/</url><br>Thus, I don't think you need to worry about Stanford being weaker in the social sciences. It certainly isn't weak in the field of psychology, for example.<br><br>Princeton's proximity to New York might give it a slight advantage as far as recruitiing for jobs in finance, however Stanford isn't overlooked by recruiters. My son, who graduated from an Ivy, was flown to San Francisco for a banking interview, so I would imagine the reverse happens too. Princeton doesn't have a law school, but Stanford's is one of the best in the country. I don't know about law school placement, however.<br><br>If you are \"chill\" and are accustomed to warm harbor cities, then I think you'd feel more at home socially at Stanford. However, college is a time to explore new things, so that might be a reason to choose a different environment. Still, my daughter experienced the eating club thing first hand and was disgusted by the snobbery: bouncers at the door with a list of who may be admitted to the clubs, certain clubs only being the province of students whose parents were multimillionaires, etc. My guess is that you'd find the afmosphere at Princeton to be more intellectual, however.<br><br>", "<b>Username: TheGFG</b><br><br><a href=\"http://humanexperience.stanford.edu/\" rel=\"nofollow\">Humanities at Stanford | Inside the humanities at Stanford University</a><br><br>This link about the humanities at Stanford is currently on the front page of Stanford's website, if you are interested in learning more.<br><br>", "<b>Username: phantasmagoric</b><br><br>For what it's worth, every ranking of disciplines out there either puts Stanford and Princeton on par with each other for social sciences and humanities, or Stanford ahead. A small sampling:<br><br><url>http://www.timeshighereducation.co.uk/world-university-rankings/2010-2011/social-sciences.html</url> (tied)<br><br><url>http://www.wsjclassroomedition.com/pdfs/wsj_college_092503.pdf</url><br><br>Stanford produces a slightly higher # of future MBA/JD/MD students than Princeton, though a lower proportion since Stanford's larger (so Princeton is #3, Stanford #4). That may or may not be a bad thing; it's good because it does well, but bad because it means more of the student body is pre-professional, which for many students is annoying.<br><br>At any rate, none of the differences you're afraid of actually exist. So for you it's really going to come down to fit and which one you can see yourself at for four years.<br><br>", "<b>Username: Senior0991</b><br><br>San Francisco and LA have tons of jobs in the finance industry, not to mention that it is common for NYC companies to fly students out to New York for interviews or to host interviews on campus. Name any top finance firm, and they will recruit Stanford students. I don't know as much about law though. I'm sure both have very comparable job placement rates in finance. Although if you would much prefer to intern on the east coast versus out west, than that would be a bump in Princeton's favor. Stanford students often get internships out east, although that generally entails being away from most of one's friends for the summer, so it's not that popular.<br><br>I'm not sure Stanford is inferior to Princeton in humanities and social sciences, but even if it were, I'd argue at the undergrad level that a \"fit\" is more important (provided the two were on similar ground, which I think they definitely are).<br><br>I think whatever school you end up at you'll do more than fine in the long run. So I'd ask myself which is more affordable and which will give me the most rewarding undergraduate experience.<br><br>", "<b>Username: CoolRunning</b><br><br>2 Semesters vs. 3 quarters. I think that is the only difference that we can find.<br><br>Edit: Cold vs. warm is an issue too.<br><br>", "<b>Username: soomoo</b><br><br>Mostly I post on the Princeton forum since S1 is a happy freshman there. However, S2 loved his visit to Stanford this past March so I have been poking around a bit in this forum.<br><br>A poster above had a daughter \"who was disgusted by the snobbery of the eating clubs\". I just wanted to say that I think this is a gross misrepresentation of the system. Please take the time to learn more about them if you are considering Princeton.<br><br>Princeton and Stanford are both great schools. You can't go wrong either way. You should choose what feel right to you.<br><br>", "<b>Username: CoolRunning</b><br><br>Soomoo: Thanks for that S1 and S2 confirmation. It helps!<br><br>", "<b>Username: phantasmagoric</b><br><br>I don't think that it's a misrepresentation of the clubs. Sure, many have a different opinion, but since many people think that of the clubs, including current students, it can't be a \"misrepresentation.\"<br><br><a href=\"http://www.dailyprincetonian.com/2009/12/18/24808/\" rel=\"nofollow\">Should we end Bicker? - The Daily Princetonian</a><br><a href=\"http://www.dailyprincetonian.com/2010/05/03/26083/\" rel=\"nofollow\">Feb. 4, 1980: Bicker: A damaging tradition - The Daily Princetonian</a><br><br>I turned down Princeton in part because of institutions like eating clubs (and because of institutions like Stanford :))--and yes, I did look quite a bit into them, but when you hear students themselves complain about the clubs' perpetuation of elitism, divisiveness, etc. constantly, you can't help but feel like it's the last bastion of Princeton's rich-white-protestant history.<br><br>", "<b>Username: Eiswein</b><br><br>Thanks a lot for those replies! All were very helpful!!<br>I was mainly influenced by the NRC ranking when I stated that Stanford's humanities were generally slightly weaker than Pton's.<br><url>http://chronicle.com/article/NRC-Rankings-Overview-/124718/</url><br>However I agree that the gap is neglectable (except for History, perhaps) and I should try to see which school fits me better.<br><br>", "<b>Username: phantasmagoric</b><br><br>^ the link you posted isn't working (looks like CC deleted the thread), but the other thread you posted in the Princeton forum had the same lists you posted above.<br><br>That's why I called the poster out on trying to pass off his own rankings as the NRC. The ones he posted were tailored to what he likes (which is what phds.org allows you to do), using data from the NRC rankings. But they are <i>not</i> NRC, and it's disingenuous to call them that.<br><br>As I said in that thread:<br>\"\"For comparative literature, in the S-rank Princeton's 1-7, Stanford 1-13. In the R-rank, both are 1-6. (essentially the same)<br><br>For history, in the S-rank Princeton is 1-4, Stanford is 9-21. In the R-rank, Princeton is 2-12, and Stanford is 2-10. (essentially the same)<br><br>For econ, in the S-rank Princeton is 2-4, Stanford is 7-12. In the R-rank, Princeton is 4-8, Stanford is 5-12. (slight edge to Princeton)<br><br>For communication, Stanford is 1 across the board, Princeton unranked.\"\"<br><br>If you want to see the real rankings, you can access them here:<br><br><a href=\"http://chronicle.com/article/NRC-Rankings-Overview-/124718/\" rel=\"nofollow\">NRC Rankings Overview: Comparative Literature - Faculty - The Chronicle of Higher Education</a><br><br>As you implied, Stanford and Princeton are equal for those disciplines, including history (Stanford and Princeton are tied for #1 in history in the US News ranking), although Princeton doesn't have communication.<br><br>", "<b>Username: Eiswein</b><br><br>@Phanta: I think my link is working...are you referring to the link I posted before I edited my post? In that case, thanks for pointing out the problem! I was indeed misled.<br><br>", "<b>Username: SunDiego</b><br><br>Eis, you are lucky/talented to be presented with these two options. Everyone's being very tactful regarding what they say about these two schools here but at the risk of summoning the flame throwers:<br><br>Stanford or Princeton? Are you kidding? The joy and beauty of living in Calif's Bay Area v living in New Jersey? The attractive and diverse student body at Stanford v elitist plain vanilla Princeton? Modern energetic vibe v old school gothic?<br><br>Forget the rankings, think about where you'll be living for four years - Stanford.<br><br>", "<b>Username: NJDS</b><br><br>as someone who made that choice a year ago, i'd say it really depends on your personality<br><br>", "<b>Username: japanoko</b><br><br>Eiswein, for finance on Wall Street and with the better Investment Banking firms, Stanford is good but not at the level of the top tier and this could be because of its location on the west coast.<br><br>The top tier is Harvard, Wharton and Princeton<br><br>", "<b>Username: japanoko</b><br><br>and here are the NRC departmental rankings for Comparative Literature, History and Economics. As you can see, Princeton is ranked higher than Stanford in all three, but the difference is not too significant in 2 of the fields:<br><br><br>COMPARATIVE LITERATURE<br><b>1---Princeton</b><br>2---Harvard<br><b>3---Stanford</b><br>4---Berkeley<br>5---U. of Maryland<br>6---Duke<br>7---Yale<br>8---Brown<br>9---Penn<br>10---NYU<br><br>HISTORY<br><b>1---Princeton</b><br>2---Harvard<br>3---Princeton (different department)<br>4---JHU<br>5---U. of Chicago<br>6---Columbia<br>7---Harvard (different department)<br>8---Penn<br><b>9---Stanford</b><br>10--Berkeley<br><br>ECONOMICS<br>1---Harvard<br>2---MIT<br>3---U. of Chicago<br><b>4---Princeton</b><br>5---Berkeley<br>6---Harvard (different department)<br><b>7---Stanford</b><br>8---Cal Tech<br>9---Yale<br>10--NYU<br><br>", "<b>Username: DarkDwarf</b><br><br>LOL HARD AT NRC RANKINGS.<br><br>A quote: The NRC ranking \"does not pass even a rudimentary sanity check\"<br><br>Check:<br><url>http://chronicle.com/article/Computer-Scientists-Cry-Foul/124840/</url><br><br>Granted, half of that is CS, but still, these rankings suck. They hardly apply to anything. Besides, most of these rankings are evaluative of the Doctorate programs at those schools. At least, more focused on their research, not really the quality of the UG education.<br><br>", "<b>Username: japanoko</b><br><br>^^^^DarkDwarf, oh, ok...then why don't YOU supply us with any type of comparison for the undergraduate departments of History, Economics and Comparitive Literature....<br><br>looking forward to your response on this...<br><br>", "<b>Username: NeoTycoon</b><br><br>I wouldn't waste time nitpicking the nuances in arbitrary NRC rankings in Humanities/Social Science courses between the schools because in the end, how you deeply you discuss Nietzsche (forgive the oversimplification) plays a minor role in the kind of work you're interested in post-grad. Since you're interested in journalism and law, think about which school provides more opportunities/points of entry into these fields. These include academic crossovers into these fields (professors, courses), companies that operate in the surrounding area, internship availability, and professional journalism/law clubs at these schools.<br><br>Since you are chill and love to socialize, Stanford and Silicon Valley seem like a better fit.<br><br>", "<b>Username: person18</b><br><br>When looking at the eating clubs/social climbing of Princeton, I think there is really no contest. I think the social climbing aspect is the biggest turn off from the big name ivies. Stanford is probably the best school for someone who is \"chill and social.\" Stanford and Princeton are pretty comparable academically in the social sciences, so where would you want to spend the next four years of your life? A lot of people have the sentiment that it is nice to say you went to Princeton, but not nice to actually go there. Go to Stanford, you'll enjoy it a lot more. xD<br><br>", "<b>Username: phantasmagoric</b><br><br>The rankings posted above have already been posted in another thread that the OP made, and I debunked those rankings as the NRC ones. They aren't. They're rankings produced by phds.org, from data used in the NRC rankings. But not the same.<br><br>Either way, here are some US News ones:<br><br><a href=\"http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-humanities-schools/economics-rankings\" rel=\"nofollow\">Best Economics Programs | Top Economics Schools | US News Best Graduate Schools</a> (Princeton 1, Stanford 5, but there's a four-way tie for 1)<br><br><a href=\"http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-humanities-schools/history-rankings\" rel=\"nofollow\">Best History Programs | Top History Schools | US News Best Graduate Schools</a> (Princeton 1, Stanford 1)<br><br><a href=\"http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-humanities-schools/english-rankings\" rel=\"nofollow\">Best English Programs | Top Humanities Schools | US News Best Graduate Schools</a> (Princeton 7, Stanford 2)<br><br>DarkDwarf,<br><br>Thanks for those links! I'm soon to be getting my PhD in CS, and wasn't aware of those. I think it's interesting that they managed to persuade the NRC to change the methodology for CS. For the longest, I've understood that CS in particular places an emphasis on conference publications over journal publications, but I didn't know it was such a stark difference from other fields that the NRC would actually change its methodology.<br><br>", "<b>Username: japanoko</b><br><br>\"\"When looking at the eating clubs/social climbing of Princeton, I think there is really no contest. I think the social climbing aspect is the biggest turn off from the big name ivies. Stanford is probably the best school for someone who is \"chill and social.\" Stanford and Princeton are pretty comparable academically in the social sciences, so where would you want to spend the next four years of your life? <b>A lot of people have the sentiment that it is nice to say you went to Princeton, but not nice to actually go there. Go to Stanford, you'll enjoy it a lot more</b>. xD\"\"<br><br>Alumni Giving Rate<br>60% - Princeton<br>34% - Stanford<br><br>", "<b>Username: phantasmagoric</b><br><br>Amount raised in 2010<br><br>Stanford: $599 million (#1)<br>Princeton: $207 million (not in top 25)<br>\"\"A lot of people have the sentiment that it is nice to say you went to Princeton, but not nice to actually go there. Go to Stanford, you'll enjoy it a lot more.\"\"<br><br>Princeton Review's top 20 lists:<br><br>Happiest students<br>Stanford - #3 (often #1)<br>Princeton - not in top 20<br><br>Best quality of life<br>Stanford - #17<br>Princeton - not in top 20<br><br>School runs like butter<br>Stanford - #3<br>Princeton - #12<br><br>Best classroom experience<br>Stanford - #3<br>Princeton - #10<br><br>", "<b>Username: NeoTycoon</b><br><br>\"\"Alumni Giving Rate<br>60% - Princeton<br>34% - Stanford\"\"<br><br>1 Larry Page donation is approx. > 9000 lesser-known Princeton donations to put it bluntly.<br><br>", "<b>Username: japanoko</b><br><br>\"\"Amount raised in 2010<br><br>Stanford: $599 million (#1)<br>Princeton: $207 million (not in top 25)\"\"<br><br>phanta, wow, thanks for the info<br><br>now<br><br>take the amounts raised from non-alumni sources and those that have gone towards the Stanford Medical School out of your $599 million Stanford figure<br><br>then divide the result by 18,000 students for Stanford and compare to the $207 million divided by 7,500 students for Princeton.<br><br>what would the result be?<br><br>", "<b>Username: japanoko</b><br><br>\"\"Quote:<br>1 Larry Page donation is approx. > 9000 lesser-known Princeton donations to put it bluntly.\"\"<br><br>thanks for the comment, Neotycoon, but the purpose of posting the alumni giving rate, which is from the undergraduate students is to find out how happy the undergraduates in general were at their respective schools and the 60% to 34% giving rate is quite a difference don't you think?<br><br>besides, you do KNOW that Page was not a Stanford undergraduate (Michigan undergraduate), don't you?<br><br>On the other hand, you do know that Eric Schmidt, the recent CEO of Page's company, Google, can be counted on as an undergraduate alumnus of Princeton, don't you? --- besides, how much more do you think Page will donate to Stanford, a graduate school alma mater, compared to Schmidt to Princeton, an undergraduate alma mater?<br><br>", "<b>Username: japanoko</b><br><br>\"\"Princeton Review's top 20 lists:<br><br>Happiest students<br>Stanford - #3 (often #1)<br>Princeton - not in top 20<br><br>Best quality of life<br>Stanford - #17<br>Princeton - not in top 20<br><br>School runs like butter<br>Stanford - #3<br>Princeton - #12<br><br>Best classroom experience<br>Stanford - #3<br>Princeton - #10\"\"<br><br>phanta, well thank you<br><br>it is good to know that <b>my alma mater</b>, Stanford University, is doing well as per the Princeton Review top 20 lists...<br><br>", "<b>Username: phantasmagoric</b><br><br>^ nobody believes you when you say you've spent time at Stanford. You said the weather is dry at Stanford... and all you do is **** for Princeton on every forum.<br><br>", "<b>Username: ewho</b><br><br>@phantasmagoric, I believe that he has a MBA from GSB. Let's make peace with each other.<br><br>", "<b>Username: phantasmagoric</b><br><br>^ so he claims. He started posting a few days ago and given how rude he is to everyone, people are pretty sure it's a certain poster with a new account.<br><br>", "<b>Username: ewho</b><br><br>I can see his complex feelings toward Stanford, and certainly he loves Princeton more.<br><br>", "<b>Username: japanoko</b><br><br>\"\"^ nobody believes you when you say you've spent time at Stanford. You said the weather is dry at Stanford... and all you do is **** for Princeton on every forum.\"\"<br><br>Phanta, of course the weather is dry at Stanford. Some months have averaged as low as 3/100's of an inch of rain for decades...In fact, in the 5 months of May to September, the Stanford area has averaged only 3/4's of an inch in total of precipitation for the 5 months added together. This would truly be considered dry.<br><br><br><url>http://www.idcide.com/weather/ca/palo-alto.htm</url><br><br>Normal Precipitation<br>(PALO ALTO Weather station, 0.86 miles from Palo Alto)<br>Month Jan Feb Mar Apr May Jun Jul Aug Sep Oct Nov Dec Annual<br>Inch 3.24 3.18 2.65 0.89 0.35 0.11 0.03 0.08 0.19 0.85 1.83 2.31 15.71<br><br><br>YOU, on the hand, have claimed that the Stanford campus is much greener than the Princeton Campus, which averages about 3 inches of precipitation MORE <b>per month </b>than the Stanford campus area.<br><br>", "<b>Username: phantasmagoric</b><br><br>^ if you consider Stanford dry when it's constantly humid, that's fine. But those who actually live here know otherwise.<br><br>And Stanford's campus <i>is</i> greener--it isn't covered in snow for a few months, unlike other schools.<br><br>", "<b>Username: japanoko</b><br><br>\"\"if you consider Stanford dry when it's constantly humid, that's fine. But those who actually live here know otherwise.\"\"<br><br>constantly humid?<br><br>are you kidding me?<br><br>there is very little humidity in the Stanford campus area during the months of June, July and August. In fact, the average afternoon relative humity in the Stanford area drops below 30% during July and August, considered very very low compared to the national average which is in the 40%-65% range..<br><br>It is really sounding more and more like you have never even stepped foot on the Stanford Campus - and if you have, it appears that it occurred only during a week or so during the Nov. to March season.<br><br>", "<b>Username: phantasmagoric</b><br><br>^ I'm willing to bet that you're from a very humid area, and so Stanford doesn't seem humid. That would make sense, since you think Stanford is \"dry.\" I grew up partly on a desert (completely dry) and partly in northern Illinois (very humid) and can tell you that yes, Stanford always has humidity, and no, Stanford is not dry in the slightest.<br><br>I've also spent the past four years here, and each summer as well. It's pretty humid during the summer. Know why? Because no matter what time of the year it is, Stanford is still next to a large body of water. ;)<br><br>", "<b>Username: japanoko</b><br><br>phanta, no problem<br><br>on a side note, you might want to talk a walk for a few mintues on a hot humid day in Houston or NYC to see what humidity really feels...<br><br>", "<b>Username: NeoTycoon</b><br><br>\"\"take the amounts raised from non-alumni sources and those that have gone towards the Stanford Medical School out of your $599 million Stanford figure\"\"<br><br>Comparative alumni giving rate isn't very telling of student happiness at Stanford vs Princeton. Why?<br><br>Stanford's endowment and investment portfolio is so huge that it doesn't solicit alumni giving as actively as other schools. Princeton probably sends out more frequent and annoying \"donate to Princeton\" alumni letters soliciting $5-$20 donations :).<br><br>Students also recognize Stanford's financial security and make better use of their money investing in their own entrepreneurial projects/startups (and cost of living in Silicon Valley where many stay). The ones who make it big then give back in pretty huge sums.<br><br>Ugs have plenty of access to the non-alumni resources. Ain't surprising Human Biology is one of the most popular ug majors in light of the med school figure.<br>\"\"then divide the result by 18,000 students for Stanford and compare to the $207 million divided by 7,500 students for Princeton.\"\"<br><br>When you're receiving more alumni dollars there is the feedback effect of boosting the culture of alumni donations straight out of school.<br>But when you're receiving non-alumni dollars (that are effectively alumni dollars masked as stock options), you realize the value of enterprise, go out and start your own high-scaling startup business straight out of/during school, and make your alma mater hundreds of millions because it decides to be a shareholder in your company rather than an institution that prematurely picks away at your post-grad daily living expenses. You know all those Stanford alumni that worked for early-stage Google effectively \"gave\" Stanford several hundred million in stock options - they didn't have to write a \"donation\" check to do it. Apply this same process to the volume of Stanford students that work at Facebook and the number of shares Stanford has in Facebook indirectly with funding vehicles like Accel/Greylock partners.<br><br>japanoko, some tidbits -<br>Page has given more to Stanford via Google than to his ug alma mater<br>Schmidt is no longer CEO of Google for its failure to adapt to social networking, among other reasons<br><br>Princeton is a respectable institution but again, all this nitpicking over statistical interpretation belies the underlying forces at work. At the end of the day, if you want to play big in innovation and technology of the future go Stanford. If you like old school Ivy tradition, then go Princeton.<br><br>Also, Stanford men and women are hotter. WIN<br><br>", "<b>Username: NeoTycoon</b><br><br>as for the amount of time one spends on this site - it's pretty funny to see posts about HUMIDITY statistics. frankly, the students who actually make use of this site will never care or bother to read them.<br><br>what you do with your free time is your choice, but all choices have consequences, opportunity costs, and are subject to judgment by others, like it or not. i don't care if you're HYPS - how you make use of your life (that includes free time) after graduation for society is what really counts. forum ****/time wasted on the net is a pretty significant problem in a society facing unprecedented debt, unemployment and education problems. hope this little comment, as blunt as it seems, brings some people back to reality. as such, i don't see any point in participating in this thread any further. good luck, and carpe diem<br><br>", "<b>Username: PrincetonDreams</b><br><br><u>I withdrew my Princeton application after receiving an early acceptance to Stanford.</u><br><br>Princeton's a great school, and is an equal to Stanford in its undergraduate experience. [H and Y don't really compare to these two]. Just ask yourself though, which school are you just more excited about? Whichever one comes to your mind first is the school for you. But honestly, you REALLY can't go wrong either way.<br><br>", "<b>Username: japanoko</b><br><br>\"\"I am disappointed you thought I was working on Wall Street this summer.\"\"<br><br>AvidStudent, nope, not this summer...<br><br>", "<b>Username: Doss12</b><br><br>Eiswein, gp to Princeton. Princeton's emphasis is on undergraduate education. Stanford's is on graduate. With a relatively equal endowment, a smaller undergraduate population, much smaller graduate population and a much lower local cost of living you get a lot more bang for the buck at Princeton.<br><br>", "<b>Username: AvidStudent</b><br><br>I already have my first finance internship lined up this summer so why don't you show up at their office. Good luck circumventing security! :)<br>\"\"AvidStudent, well, we certainly are going to find out...lets just see what happens........\"\"<br><br>Yes, we'll see what happens you lifeless lowlife scum. :D<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"Princeton's emphasis is on undergraduate education. Stanford's is on graduate.\"\"<br><br>What makes you say that? Both have top grad programs. In fact, Princeton does as well as Stanford in the recent NRC rankings. Both have the same class sizes. Stanford was ranked #3 best classroom experience (vs. Princeton #10).<br><br>I think it's all BS that Princeton could somehow provide a better undergrad experience than Stanford. In fact, this rumor has been debunked many times on this site--and not by Stanford people, but people who realize that Princeton isn't doing anything better than Stanford is.<br><br>", "<b>Username: japanoko</b><br><br>\"\"by AvidStudent<br>Yes, we'll see what happens you lifeless lowlife scum\"\"<br><br>AvidStudent, I see that you continue with the personal attacks, foul language and insults...<br><br>good luck there...<br><br>", "<b>Username: japanoko</b><br><br>\"\"by AvidStudent:<br>I already have my first finance internship lined up this summer so why don't you show up at their office. Good luck circumventing security!\"\"<br><br>ha!, now you are really funny. But that is not the way the world works...<br><br>the person that is going to hand you copies of your posted messages of personal attacks and foul language on CC will be the person that hired you. No one else....<br><br>", "<b>Username: japanoko</b><br><br>\"\"Stanford was ranked #3 best classroom experience (vs. Princeton #10).\"\"<br><br>thanks phanta, that was from Princeton Review<br><br>and from USNWR:<br><br><br><br><b>USNWR Best Undergraduate Teaching</b><br><br>Save Rank School<br><br>#1 Dartmouth College<br>Hanover, NH<br><br>#2 Miami University--Oxford<br>Oxford, OH<br><br><b>#2 Princeton University </b><br>Princeton, NJ<br><br>#4 University of Notre Dame<br>Notre Dame, IN<br><br>#5 College of William and Mary<br>Williamsburg, VA<br><br>#6 Brown University<br>Providence, RI<br><br>#6 University of California--Berkeley<br>Berkeley, CA<br><br>#8 University of Michigan--Ann Arbor<br>Ann Arbor, MI<br><br>#8 University of Virginia<br>Charlottesville, VA<br><br><b>#10 Stanford University </b><br>Stanford, CA<br><br>#10 Yale University<br>New Haven, CT<br><br>#12 Clemson University<br>Clemson, SC<br><br>#12 Purdue University--West Lafayette<br>West Lafayette, IN<br><br>#12 University of Maryland--Baltimore County<br>Baltimore, MD<br><br>#12 University of Vermont<br>Burlington, VT<br><br>#12 Wake Forest University<br>Winston-Salem, NC<br><br>", "<b>Username: PrincetonDreams</b><br><br>japanoko, how can anyone ever take that seriously?! Miami U over Brown and Stanford!! LOL<br><br>", "<b>Username: japanoko</b><br><br>^^^^PrincetonDreams, so is this the question: How can anyone take a USNWR rankings seriously?<br><br>is this the question or should we discuss how can anyone take the Princeton Review rankings seriously, which include schools such as Wittenberg Univ. in Ohio, St Johns College/MD and Bennington among the top 20 in \"the best classroom experience\" category?<br><br>", "<b>Username: phantasmagoric</b><br><br>japanoko, my point is that Princeton is not better than Stanford for undergrad experience, plain and simple.<br><br>", "<b>Username: japanoko</b><br><br>phanta, this is the original post from the OP:<br><br><url>http://talk.collegeconfidential.com/12346832-post1.html</url><br><br>I think that we would both agree that he would be very happy at both Princeton and Stanford, don't you think?<br><br>", "<b>Username: PrincetonDreams</b><br><br>\"\"PrincetonDreams, so is this the question: How can anyone take a USNWR rankings seriously?\"\"<br><br>No person with any common sense would take the UNSWR rankings too seriously. The way CC'ers quote those rankings is, frankly, idiotic. Just because Caltech, for example, is ranked below Stanford doesn't make Stanford the 'better' school. Both are amazing, but suit different personalities.<br><br>", "<b>Username: Senior0991</b><br><br>\"\"japanoko, my point is that Princeton is not better than Stanford for undergrad experience, plain and simple.\"\"<br>That's a bit extreme, don't you think? Suppose we say that, <b>for many students</b>, Princeton is not better than Stanford for undergraduate experience.<br><br>I daresay that's more agreeable.<br><br>", "<b>Username: japanoko</b><br><br>PrincetonDream, I think that the mere ranking of Stanford, MIT and Caltech below Columbia in the USNWR rankings this year would underscore you comment about USNWR, don't you think?<br><br>", "<b>Username: PrincetonDreams</b><br><br>^ Selectivity-wise, Columbia is ahead of MIT and Caltech, but behind Stanford (with which it might share the fourth rank in this year's issue). Quality-wise, they're really all equal. In the UK, where I live, Columbia is considered to be the best back-up for HYP, and everyone has immense respect for the school.<br><br>So to answer your question, no it doesn't.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"That's a bit extreme, don't you think? Suppose we say that, for many students, Princeton is not better than Stanford for undergraduate experience.<br><br>I daresay that's more agreeable.\"\"<br><br>I think that's a useless addition, because you can say the same thing about the opposite. So saying \"for many students\" is implied.<br><br>And US News is pointless, as everyone knows. I mean, honestly, Columbia above Stanford? Right.<br><br>", "<b>Username: japanoko</b><br><br>\"\"^ Selectivity-wise, Columbia is ahead of MIT and Caltech, but behind Stanford (with which it might share the fourth rank in this year's issue). Quality-wise, they're really all equal. In the UK, where I live, Columbia is considered to be the best back-up for HYP, and everyone has immense respect for the school.<br><br>So to answer your question, no it doesn't.\"\"<br><br>PrincetonDreams, ahhh, but you do know that the USNWR rankings are more than just the acceptance rate selectivity, don't you?<br><br>In fact, the acceptance rate only accounts for 1.5% of the total to determine the rankings...<br><br>so are you saying that Columbia and not Stanford, MIT and a few others are the backup for HYP in the UK FOR UNDERGRADUATE SCHOOL?<br><br>", "<b>Username: Senior0991</b><br><br>\"\"I think that's a useless addition, because you can say the same thing about the opposite. So saying \"for many students\" is implied.\"\"<br>It certainly was not implied. You made a blunt statement that Stanford is better for undergraduate education. That's a very hefty claim with no apparent intent at qualification and, from what I gathered from your tone and other posts, no implied intent either.<br><br>Actually my point was that you can say the same about the opposite. One is not necessarily better than the other for undergraduate education. They are different, and should be treated as such.<br><br>If a vast majority of students agreed that one was significantly better than the other, and physical metrics backed that up, then I might have let you get away with your blatant oversimplification. However I think we can all agree Stanford and Princeton are on the same general level for academics, therefore any absolutes should be avoided in my opinion.<br><br>", "<b>Username: japanoko</b><br><br><url>http://talk.collegeconfidential.com/12368752-post8.html</url><br><br><i><b>\"^Somewhat correct. Also do not underestimate the power of cold calling. This summer I will be interning at a PE firm that has $2.5 billion in assets under management. \"</b></i><br><br>", "<b>Username: PrincetonDreams</b><br><br>On second thought, I can't advise you to choose Stanford over Princeton. Even though I'll be attending the former this fall, I'd give up anything to go to Princeton. That's just me though. Your idea of an ideal college may be entirely different from mine.<br><br>japanoko, yes. There's an annoying fascination with the Ivy League here. And there are more Columbia grads here in top jobs than MIT and Caltech ones so that helps Columbia too.<br><br>", "<b>Username: japanoko</b><br><br>\"\"japanoko, yes. There's an annoying fascination with the Ivy League here. And there are more Columbia grads here in top jobs than MIT and Caltech ones so that helps Columbia too\"\"<br><br>ok thanks...<br><br>and could that be because of the graduate schools at Columbia, such as the Business School and Law School, which are first class?<br><br>", "<b>Username: PrincetonDreams</b><br><br>\"\"and could that be because of the graduate schools at Columbia, such as the Business School and Law School, which are first class?\"\"<br><br>I interned at an MBB consulting firm last summer, and there were an equal amount of Columbia, Stanford and Princeton students there. Not that many compared to Harvard, LSE, Wharton and Oxbridge. They were mostly undergrads. Some of the UK grads had multiple masters degrees though. Columbia, in general, has a very strong reputation in the UK.<br><br>", "<b>Username: AvidStudent</b><br><br>@lifeless lowlife scum, why do you quote me out of context from another thread that has little to nothing to do with this thread?<br><br>Btw the weather forecast for tomorrow is 49F - 70F.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"It certainly was not implied. You made a blunt statement that Stanford is better for undergraduate education.\"\"<br><br>No, I didn't. Please re-read what I said: Princeton <b>is not better</b> than Stanford for undergrad experience. You took from that that I was saying Stanford is better than Princeton, a conclusion which can't be drawn from what I said. I was simply un-skewing the claim that japanoko seemed to be making. I do have enough experience here to know not to claim that Stanford is \"better\" for undergrad. They are equal but attract different students who will like them, etc.<br><br>", "<b>Username: beenthere2</b><br><br>To the OP:<br>Have you visited the campuses? P looks like out of Harry Potter (some buildings), campus is quite small. S is more wide spread, Mexican architecture, fountains, and PALMS!<br>Climate<br>Look at the kinds of classes and imagine what you would sign up for?<br>How far from home?<br>Honestly, don't worry about the rankings (especially graduate program rankings)<br>S would let you take classes in business, law, a wider range of course offerings. P is a bit more traditional in course offerings.<br>Grading. P has grade deflation, S doesn't.<br>In the end, go by your gut feeling.<br><br>", "<b>Username: japanoko</b><br><br>\"\"campus is quite small\"\"<br><br>ha!<br><br>been around for a while and this is the first time that I have heard that a 500 acre college campus for a 7,500 total student population is \"quite small\"...<br><br>", "<b>Username: Doss12</b><br><br>phantasmagoric, I'm just going by Princeton's history. Their emphasis has always been on undergraduate education. Yes, they have some excellent graduate programs. But their history is to create graduate programs to take advantage of the faculty they have accumulated to teach undergraduates.<br><br>Mostly I think you can evaluate these two colleges by looking at the numbers. No one goes to either for the weather, party scene, or the faculty's positive personalities - not unless they have VERY low standards in those areas. Which I think is a good thing. Once you are 18 you are an adult. It's time to put aside childish things. (Sorry, couldn't resist.)<br><br>PRINCETON<br>Endowment: $14.4 billion<br>Undergraduates: 5,044<br>Graduates: 2,450<br><br>STANFORD<br>Endowment: $13.8 billion<br>Undergraduates: 6,887<br>Graduates: 8,779<br><br>The numbers are that Princeton has a larger endowment which it spends on fewer students, most of whom are undergrads. The cost of living is also lower in Princeton than Palo Alto. At which college do you think you'll have access to more resources? Get more bang for the buck?<br><br>", "<b>Username: Doss12</b><br><br>OP, assuming you didn't long ago abandon trying to follow this meandering thread, I'd take anything you read here with a grain of salt. Most of the people offering advice either have an axe to grind or they are one of the students hired by Undergraduate Admissions to say good things.<br><br>Your better bet is to visit these colleges and speak with real people. And don't restrict yourself to the people and events that the Admissions Office schedule. Go visit the departments in which you are interested. Ask students not working for Admissions about the pros and cons of their school. How helpful was their advisor? Was the advisor a member of the faculty or an administrator or secretary. (Yes, I've known more than one student who's frosh advisor was a secretary.)<br><br>And get an idea just how much \"intellectual\" discussion really takes place. You might be surprised how little.<br><br>", "<b>Username: japanoko</b><br><br>\"\"STANFORD<br>Endowment: $13.8 billion<br>Undergraduates: 6,887<br>Graduates: <b>8,779</b>\"\"<br><br>From Stanford's 2010-11 Common Data Set:<br><br>Total all undergraduates: 6,940<br>Total all graduate students:<b>12,595</b><br>GRAND TOTAL ALL STUDENTS:19,535<br><br>", "<b>Username: japanoko</b><br><br>\"\"The numbers are that Princeton has a larger endowment which it spends on fewer students, most of whom are undergrads. The cost of living is also lower in Princeton than Palo Alto. At which college do you think you'll have access to more resources? Get more bang for the buck?\"\"<br><br><u>Endowment/Student\t--\tCollege</u><br><br><b>$1,895,607 --\tPrinceton</b><br>$1,436,384 --\tYale<br>$1,419,680 --\tHarvard<br>$941,274 ----\tPomona<br>$819,183 ----\tSwarthmore<br>$800,975 ----\tMIT<br>$794,579 ----\tAmherst<br>$749,309 ----\tGrinnell<br><b>$748,952 ----\tStanford</b><br>$725,554 ----\tCaltech<br>$719,063 ----\tWilliams<br>$668,647 ----\tRice<br><br>", "<b>Username: zenkoan</b><br><br>Much as I hate to contribute to one of the most asinine threads I've ever seen on this forum, I feel the need to point out that (1) japanoko's data is incorrect. Per Stanford's current webpage for Graduate Studies, there are a total of 8779 graduate students enrolled, not the 12,595 japanoko cited above, and AFAIK there have never been anywhere near that number of grad students; and (2) contrary to the assertion of Doss, pom pom waver for Princeton, Stanford doesn't hire students to come to this forum to say good things about Stanford. They don't have to. ;)<br><br>", "<b>Username: liv4physicz</b><br><br>Neither counting frosh year grades = win! :)<br><br>", "<b>Username: texaspg</b><br><br>The difference between the two graduate student numbers seems to be full time vs part time where Stanford is listing part timers as part of their final total.<br><br>", "<b>Username: japanoko</b><br><br>\"\"<b>by texaspg</b>The difference between the two graduate student numbers seems to be full time vs part time where Stanford is listing part timers as part of their final total.\"\"<br><br>yes, you are correct<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"The numbers are that Princeton has a larger endowment which it spends on fewer students, most of whom are undergrads.\"\"<br><br>This has been debunked a number of times. Endowment per student does not make sense and is used more by those who don't understand how endowments work. For one, most of the endowment is restricted for specific purposes, in specific funds, most of which undergrads will never see. Just having the money does not mean that any money is being spent on the undergrads. For another, only a tiny portion of the endowment is spent each year, and it varies by college how much they rely on the endowment. Finally, and most importantly, most revenue--what gets spent on students--doesn't come from the endowment! There are many sources of revenue, and all of these combine to support the students. Stanford's annual budget is roughly $4 billion dollars. Granted, much of that is devoted to things only tangentially related to undergrads, but if we're going to look at useless numbers, why not look at the actual spending of the university?<br><br>Simply having more undergrads does not mean that they are prioritized. The grad:undergrad ratio at Berkeley is 2.5:1 but you don't think they have a better undergraduate experience, do you? Princeton's \"history\" by the way has emphasized graduate education. Why do you think Princeton does so well in the NRC rankings? It emphasizes graduate education as well. So does Stanford. Neither gives you a better undergraduate experience, and it's Princeton fans who keep trying to promote that so that they can maintain some semblance of competitiveness with HYSM (all of which P loses to in cross-admits).<br><br>japanoko, that graduate number you're using from the CDS includes all the people who are enrolled in courses, including those who are enrolled through the Stanford Center for Professional Development in <i>distance learning</i> courses for professionals (the classes they \"attend\" are videos of the lectures). It doesn't make sense to include them in the figure of graduate students, because they don't cost the school any resources (and in fact, contribute lots of $$ to enroll in a course).<br><br>I've just realized something japanoko--are you aware that when you use all caps and bold text, it sounds to other users that you are screaming at the top of your lungs? Kind of an over-the-top response to a simple claim that you were using an erroneous figure for graduate students.<br>\"\"it is hard to understand why someone would vicioiusly attack a completely anonymous person on the Internet without knowing anything about them\"\"<br><br>It's hard to understand why you viciously attack others over simple claims of local climate and student body size! Yet you do...<br><br>", "<b>Username: PrincetonDreams</b><br><br>japanoko, lol did Princeton pay you to BS this much? If not, you're just sad.<br>Mods, please close this thread.<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"sorry phanta, but I just copied the EXACT figure issued by Stanford from the Common Data Set and the EXACT name that Stanford labeled this figure, in addition to stating that it was from the Stanford Common Data Set.\"\"<br><br>japanoko, I did not contest that it came from the CDS. But if you look closely at the CDS, almost 4,000 of the \"graduate students\" are \"enrolled in credit courses.\" So my point stands: they are not graduate students, but just people enrolled in graduate courses (most of them likely through SCPD, which is for distance learning).<br><br>And you want to know what uses the real figure of graduate students?<br><br><a href=\"http://www.stanford.edu/about/facts/graduate.html\" rel=\"nofollow\">Graduate Program: Stanford University Facts</a><br><br>", "<b>Username: japanoko</b><br><br>\"\"japanoko, I did not contest that it came from the CDS. But if you look closely at the CDS, almost 4,000 of the \"graduate students\" are \"enrolled in credit courses.\" So my point stands: they are not graduate students, but just people enrolled in graduate courses (most of them likely through SCPD, which is for distance learning).\"\"<br><br>sorry phanta, but as I have stated many times, all I did was copy/paste the very same figures and label to the figures that were released by Stanford in their common data set, stated that it was from their common data set and posted the link to the common data set.<br><br>what else do you want from me here?<br><br>", "<b>Username: phantasmagoric</b><br><br>^ I know what you're doing, but I was<i> simply adding the additional caveat </i>that the figure included people who are never on campus and don't take up any resources (and are not actual graduate students).<br><br>", "<b>Username: japanoko</b><br><br>^ no problem<br><br>in reality, when reporting these figures, the FTE (full-time equivalent) should be used which assigns a 1/3 to part time students and 1/3 to part time faculty.<br><br>this methodology is used for determining the student/faculty ratio in the common data set...<br><br>", "<b>Username: phantasmagoric</b><br><br>But they're not even actual students. They're just enrolled in credit courses, and from a distance. They don't take up resources. Therefore, they shouldn't be used in calculating grad:undergrad ratio.<br><br>", "<b>Username: ewho</b><br><br>@Doss12,<br>\"\"Most of the people offering advice either have an axe to grind or they are one of the students hired by Undergraduate Admissions to say good things.\"\"<br><br>Proofs?<br><br>Why didn't you check what Harvard was doing:<br><br><a href=\"http://www.thecrimson.com/article/2011/4/13/students-harvard-hope-many/\" rel=\"nofollow\">The Admissions Office Needs Your Help?Now and in the Future! | Opinion | The Harvard Crimson</a><br><br>Isn't Harvard's name enough? Or the only thing left is its name? :)<br><br>Will the Stanford students do the same thing?<br><br>", "<b>Username: Doss12</b><br><br>@Doss12, Quote:<br>Most of the people offering advice either have an axe to grind or they are one of the students hired by Undergraduate Admissions to say good things.<br><br>@ewho, Quote:<br>Proofs?<br>Why didn't you check what Harvard was doing:<br>The Admissions Office Needs Your Help?Now and in the Future!<br>Isn't Harvard's name enough? Or the only thing left is its name?<br>Will the Stanford students do the same thing?<br><hr><br>I have friends who have been hired to post messages. Stanford looks at it the same as hiring students as tour guides or as staff for Admit Weekend, Orientation, Parents Weekend, Alumni Reunion Weekend, etc.<br><br>And then look at some of the posts and their authors. Specifically look at the posts by users advocating for Stanford. Notice how many of their responses parrot official responses/arguments used by the University. And not just on one or two issues. But on a wide variety of issues that are often raised by admits and their families. And finally look at the volume of of posts. Hundreds and in some cases thousands of posts. What Stanford student leads such a sad life that they have nothing better to do than to post thousands of messages on CC, let alone learn all the official responses to issues admits usually raise.<br><br>Same goes for supposed parents. I just saw a post from someone who claims to be someone's mom. She has posted over 1200 messages since 2007. Whose mother would stay registered on CC for four years let alone post 1200 times?<br><br>And yes, I know that other colleges do the same. My warning to the OP was just to make sure that s/he realized the source of many posts here. College Admissions offices look at CC as another marketing pipeline. Users shouldn't assume they are reading posts from current students or recent alums.<br><br>As for users with an axe to grind, just look at this thread.<br><br>", "<b>Username: zenkoan</b><br><br>And Doss, I have friends who would aver that you are full of cr*p. Stanford doesn't hire people to participate here, and unlike lots of other colleges, they don't send an official admissions person to post here either. Apparently they either have little interest in this site (and I'm beginning to see why, if that's the case, given the very high BS quotient on it) or they believe that the students who take the time to post here in an effort to help prospective students learn about Stanford are doing a good job as it is. I do agree that people with axes to grind come to these forums, and that can be a big drag, but they are pretty easy to identify for the most part.<br><br>", "<b>Username: texaspg</b><br><br>Doss12 - There are a lot of parents here who support their school or their kids school.<br>I guess they have made friends and decided to stick around and make it their facebook. I dont see any reason you need to suspect everyone's intentions on why they need to be here? If they have an overt bias, it comes across clearly and they dont need to be hired by the schools to pretend to be someone's parent. However, there does seem to be a balance when half the people say one thing and the other half another thing, OP can sort it out and say there is no consensus decision here and it is all upto me?<br><br>", "<b>Username: kelsyshanes</b><br><br>hi is it possible for you to share how you got in? like your SAT grades and probably extracurriculars and stuff. i am an international student too and i feel so desperate. thank you :D<br><br>", "<b>Username: tryingforcollege</b><br><br>Princeton is great for literature and humanities. Stanford is great for sciences/engineering. Again, both are great schools but I have seen the kids who are into literature chose princeton over Stanford. My cousin went to Princeton and a friend is at Stanford. In the end, you blend in anywhere.....but I think Princeton's Fin Aid is better than Stanford (at least that is what it worked out for my cousin). GPA wise, Princeton is tougher...again just basing it on heresay. I'd lean to Princeton for your humanities interest.<br><br>", "<b>Username: tryingforcollege</b><br><br>Oops ..just realized I posted to last year's post.It would be good if people not bump up old threads and create a new thread for new questions (kelsyshanes).<br><br>", "<b>Username: phantasmagoric</b><br><br>\"\"Princeton is great for literature and humanities. Stanford is great for sciences/engineering.\"\"<br>\"\"I'd lean to Princeton for your humanities interest.\"\"<br><br>Actually, Stanford is ranked in the top 5 across all broad disciplines and nearly always ahead of Princeton: humanities, arts, social sciences, natural sciences, engineering, and health sciences. Stanford always outranks Princeton in the humanities. For example, most recently Stanford came in #1 in the world for humanities, ahead of even Harvard.<br><br><a href=\"http://www.timeshighereducation.co.uk/world-university-rankings/2011-2012/arts-and-humanities.html\" rel=\"nofollow\">Top Universities for Arts &amp; Humanities 2011-2012</a><br><br>In English lit and comp lit, the two are pretty much identical:<br><br><a href=\"http://chronicle.com/article/NRC-Rankings-Overview-English/124728/\" rel=\"nofollow\">NRC Rankings Overview: English Language and Literature - Faculty - The Chronicle of Higher Education</a><br><a href=\"http://chronicle.com/article/NRC-Rankings-Overview-/124718/\" rel=\"nofollow\">NRC Rankings Overview: Comparative Literature - Faculty - The Chronicle of Higher Education</a><br><a href=\"http://grad-schools.usnews.rankingsandreviews.com/best-graduate-schools/top-humanities-schools/english-rankings\" rel=\"nofollow\">Best English Programs | Top Humanities Schools | US News Best Graduate Schools</a><br><br>Also, regarding GPA, Princeton isn't much different - since it instituted its grade deflation, its average GPA has gone down from 3.46 to 3.39, not really different. Stanford hasn't released average GPA info in a long time, but I imagine that the two are about the same.<br><br>", "<b>Username: zenkoan</b><br><br>phantasmagoric is correct--the humanities at Stanford are really superb. In particular I have been thrilled with the depth and quality of the philosophy department, which is amazing. (I have legacy at Princeton, btw, and Princeton also has a great philosophy department, but Stanford's is comparably wonderful.) Stanford maintains academic excellence across the board, even though its tech/engineering get more media attention, and thus shape public perception of the school's strengths. It's easier to grab the media spotlight with stories about amazing inventions and tech titans than by talking about humanities colloquia, after all. ; )<br><br>", "<b>Username: JamieBrown</b><br><br>\"\"by phantasmajoric<br>Actually, Stanford is ranked in the top 5 across all broad disciplines and nearly always ahead of Princeton: humanities, arts, social sciences, natural sciences, engineering, and health sciences. <u><b>Stanford always outranks Princeton in the humanities</b></u>. For example, most recently Stanford came in #1 in the world for humanities, ahead of even Harvard.\"\"<br><br>USNWR Graduate School Ranking Social Sciences and Humanties<br><br>Economics<br><b>1. Princeton</b><br>5. Stanford<br><br>English<br>2. Stanford<br>7. Princeton<br><br>History<br><b>1. Princeton</b><br>1. Stanford<br><br>Political Science<br><b>1. Princeton</b><br>1. Stanford<br><br>Psychology<br>1. Stanford<br>8. Princeton<br><br>Sociology<br><b>3. Princeton</b><br>5. Stanford<br><br><br>so the above <b><u>doesn't</u></b> exactly show that <b>Stanford always outranks Princeton in the Humanities</b>, does it?<br><br>if anything, it is a close race, very close<br><br>", "<b>Username: JamieBrown</b><br><br>\"\"by phantasmajoric<br>Actually, Stanford is ranked in the top 5 across all broad disciplines and nearly always ahead of Princeton: humanities, arts, social sciences, natural sciences, engineering, and health sciences.<b> Stanford always outranks Princeton in the humanities.</b> For example, most recently Stanford came in #1 in the world for humanities, ahead of even Harvard.\"\"<br><br><br><br><br><u><b>NRC Graduate School Rankings Arts and Humanities major programs</b></u><br><br>Classics<br>1. Stanford<br>4. Princeton<br><br>Comparative Literature<br><b>2. Princeton</b><br>3. Stanford<br><br>English Language and Literature<br><b>2. Princeton</b><br>3. Stanford<br><br>French<br><b>3. Princeton</b><br>4. Stanford<br><br>German<br>12. Stanford<br>15. Princeton<br><br>History<br><b>1. Princeton</b><br>6. Stanford<br><br>History of Art, Architecture, and Archaeology<br><b>7. Princeton</b><br>24. Stanford<br><br>Music<br><b>8. Princeton</b><br>25. Stanford<br><br>Philosophy<br><b>1. Princeton</b><br>9. Stanford<br><br>Religion<br><b>3. Princeton</b><br>19. Stanford<br><br>Spanish<br>13. Stanford<br>18. Princeton<br><br><br>so the above doesn't exactly show that Stanford always outranks Princeton in the Arts and Humanities, does it?<br><br>if anything, it is Princeton that almost always outranks Stanford in the Arts and Humanities<br><br>", "<b>Username: jkreine</b><br><br>Just got into HYPS (and all others).<br>I'm going to Princeton. I felt a stronger sense of community and don't like Stanford's emphasis on sports.<br><br>", "<b>Username: phantasmagoric</b><br><br>For one, you are misinterpreting the intent of that statement. I was replying to the statement \"Princeton is great for literature and humanities,\" in contrast to Stanford's strength in science/engineering. Stanford usually ranks ahead of Princeton in humanities taken as a whole.<br><br>Also, the \"NRC rankings\" that you're citing are your own, not the real NRC rankings, which are ranges in two separate ratings. And of all the US News rankings you point out, only two are humanities.<br><br>JamieBrown, why are you still **** these boards waiting to pounce so you can proclaim Princeton's greatness? We know it's great. There's no need to try to one-up other posters constantly.<br><br>", "<b>Username: JamieBrown</b><br><br>^^^^ so phanta, when you very specifically stated that Stanford always outranks Princeton in the humanities, what exactly did you mean?...because obviously you were completely and absolutely WRONG.<br><br>", "<b>Username: solemn</b><br><br>@JamieBrown et. al.<br><br>I'm going to jump to phantasmagoric's defense here: He isn't ABSOLUTELY wrong, because the strength of the humanities departments at Stanford are, taken together, stronger than those at Princeton. <a href=\"http://www.timeshighereducation.co.uk/world-university-rankings/2011-2012/arts-and-humanities.html\" rel=\"nofollow\">Top Universities for Arts &amp; Humanities 2011-2012</a><br><br>It's not that one individual department is better than another. Their _total_ strength at Stanford is better than at Princeton, despite individual differences in departments.<br><br>As a recent cross-admit between Stanford and Princeton, I'm definitely leaning toward Stanford because of the aggregate strength of their humanities programs (in addition to a range of other factors).<br><br>"]}