{"title": "duke vs davidson", "comments": ["<b>Username: indecisive6</b><br><br>I love Davidson, but I got in off of the waitlist at Duke which I like just as much and I don't know what to do!! Help!!!<br><br>", "<b>Username: ninja.of.love</b><br><br>I take it you've visited both schools. What do you plan on majoring in? Is the financial aid situation different at either school? What kind of social scene do you like? Does Duke's location in Durham bother you? Do you mind taking buses across campus to get around rather than walking for 10-15 minutes?<br><br>I would choose Davidson because I believe the student body is more down-to-earth and that the campus is vastly superior.<br><br>", "<b>Username: VertigoFrog</b><br><br>I don't usually condone picking schools on a prestige basis but...if you love two schools equally, and the financial situation is similar, just use prestige as the tie-breaker. That would be Duke.<br><br>", "<b>Username: missybear25_2004</b><br><br>If you have to be on the waitlist for duke, and you've already been directly admitted to davidson, and you love me both equally, i'd say davidson. that relieves and waitlist stresses you could have.<br><br>", "<b>Username: Motherdear</b><br><br>Definitely Davidson<br><br>", "<b>Username: Sheed30</b><br><br>Why? I think Duke is a lot better.<br><br>", "<b>Username: VertigoFrog</b><br><br>he's off the waitlist. There's no more stress in choosing Duke than in choosing Davidson. Academically, Duke is a bit stronger. Prestige wise, Duke is stronger. If you love both schools equally, as you said, I don't see what reason you would have to pick Davidson over Duke.<br><br>", "<b>Username: ninja.of.love</b><br><br>Academics are better chosen based on the anticipated programs. Duke is not necessarily an academically superior school to Davidson (as a person who knows professors from both, students from both, and has attended classes at both).<br><br>", "<b>Username: indecisive6</b><br><br>I agree with vertigofrog about using prestige as a tie breaker, because NO ONE in az (including my guidance counselor) has heard of Davidson, which, if I don't end up going to graduate school is a big downside. But, on the other hand, Duke's location does bother me a bit and I did like the down-to-earthness of Davidson students. On the other hand, I feel like if I hadn't been waitlisted at Duke, I would have chosen Duke hands down. Basically, I'm completely stuck.<br><br>", "<b>Username: MikeU</b><br><br>I agree with the posters who said that if elements are equal in your decision-making process, then the prestige or name recognition of the college or university should be the decider. With this in mind, Duke should be chosen over Davidson.<br><br>", "<b>Username: gadad</b><br><br>I know a family who sent two kids to Duke and one to Davidson. The Mom says that the Davidson grad had an education and an experience that the siblings at Duke couldn't touch.<br><br>", "<b>Username: missybear25_2004</b><br><br>i still say davidson. who wants to mess with the waitlisting stress when you've already been accepted to a great school? Besides that, worse comes to worst you could try to transfer if you absolutely hate it.<br><br>", "<b>Username: ckmets13</b><br><br>Duke has about a 3% transfer rate...and why is there stress involved? the OP got in off the waitlist, no stress at all, just accept the place in Duke's class and thats all the OP has to do.<br><br>I would say Duke in this situation, but the difference is not as great as some make it out to be.<br><br>", "<b>Username: bluetissues</b><br><br>Well Davidson and Duke are different in a lot of key ways. Because Davidson is a small LAC, there's a lot more focus on undergraduate research (no grad students to give the research jobs to), personal interaction between professor and student, and campus wide community. Duke is going to have a different feel in those respects. I'm sure you could get an amazing education at both institutions, assuming you do well in a big environment. I personally have chosen to attend Davidson (not over Duke, but over larger schools) because I feel like I will be able to challenge myself most in a close environment where my teachers will know me well, be personally invested in my education and be pushing me to succeed. That said - that's not for everyone.<br><br>I don't think prestige is an issue you. When it comes to grad school, I'd say they're looked at equally. Many more people will have heard of Duke, but that case applies for many LAC's and bigger universities. For example, tons of people haven't heard of Williams, but they know all about the large state schools and sports power houses. So yeah - I wouldn't worry about Davidson not being pretigious enough. Assuming you're planning on grad school, you'll get somewhere great from both of those schools.<br><br>", "<b>Username: warblersrule</b><br><br>I'm a Duke student, live ~15 minutes from Davidson, and am doing a Davidson study abroad program this summer, so here's my $0.02. I <b>strongly</b> disagree that the OP should choose Duke simply because it's more prestigious. Although they're more similar than different, there are several things that set them apart.<br><br>1) Location- Duke is in Durham. While not as sketchy as some posters would have you believe, Durham is not the best place to be for friendly student-town relations. Chapel Hill is a short ride away via the Robertson bus or car, and Raleigh isn't too far. Nonetheless, the surrounding area doesn't have much to offer. Davidson is in a small, quiet town that's very college student friendly. In fact, one of my friends told me people baked cookies for the Davidson students during exam week! Charlotte is ~15-20 minutes away, and the area around Davidson is exploding with development.<br><br>2) Honor Code- Duke students are generally trustworthy people. I've seen laptops and textbooks left unattended in the library and not touched. However, the Honor Code at Davidson is taken very seriously. Bicycles are left around campus for students to use, and exams can be taken on your own time.<br><br>3) Size- The size of the student bodies is misleading when comparing class sizes. Although much larger, Duke's classes match Davidson's in size. My largest classes have 30 or so students, and my smallest had 4. I know all of my professors well, have had lunch or dinner with several of them, and have done independent research with a renowned professor. Duke can offer resources that Davidson can't. Renowned medical, environment, divinity, business, and public policy graduate programs are great resources for undergrads, many of whom actively pursue research with professors in these fields. The brand new French Science Center, Nasher Museum, and CIEMAS are awesome for Duke students. To increase opportunities even more, Duke has an inter-institutional agreement with UNC Chapel Hill that allows students to take one course per semester there. Davidson definitely has great facilities for a LAC, but many Davidson students have to mooch off other colleges for specialized subjects (like studying at the Duke marine lab).<br><br>4) Housing- Duke freshmen are housed on East campus, which fosters an excellent sense of community. Freshmen have their own library, dining hall, gym, etc. Davidson students, on the other hand, are mixed on campus. A nice thing about Davidson is the free laundry, if you're lazy.<br><br>5) Financial Aid- Duke has made tremendous strides to improve financial aid, but Davidson has gone loan free.<br><br>", "<b>Username: Sheed30</b><br><br>easier to transfer to Davidson than to Duke<br><br>", "<b>Username: evil_asian_dictator</b><br><br>What in the world is Davidson? Is that like a college or something? Duke is the #8 school in the country buddy, so if you have any hopes of making money when you grow up, then I suggest you go to Duke.<br><br>", "<b>Username: VertigoFrog</b><br><br>I wasn't advocating Duke like a prestige-whore. I was just commenting that since the OP claimed to love both schools equally (I assumed that included location, style, atmosphere etc....) that it was a stalemate. If you ever need to decide between two schools and it is truly a stalemate, I think it's safe to say: go with prestige.<br><br>", "<b>Username: SarahsDad</b><br><br>Duke is a better \"University\" than Davidson is a \"LAC\" - and is consistent with USNWR rankings (Duke #8 University vs. Davidson #10 LAC).<br><br>Class size is actually very similar (71% of classes with less than 20 students at Duke vs. 64% at Davidson; 5% of classes with over 50 student at Duke vs. 0% at Davidson).<br><br>Graduation rate is 93% at Duke vs. 87% at Davidson.<br><br>SATs are higher at Duke (1360-1540) vs. Davidson (1280-1440).<br><br>Other than the obvious University vs. LAC difference, Duke seems to win here...<br><br>", "<b>Username: ninja.of.love</b><br><br>I think it's also important to note that both schools have nearly identical retention rates for their freshmen classes, at around 95%. The graduation rates for 4 and 6 years depend on the source, also. Some reputable sources have different figures than those SarahsDad cited. For instance, Princeton Review has these numbers. Davidson: 89%/91% (4/6) and Duke: 86%/92%.<br><br>Just goes to show that the schools are more statistically similar than they are different.<br><br>", "<b>Username: mj93</b><br><br>you guys throw out all these statistics, but obivously the OP has already visited and done his/her own research. he loves these two schools EQUALLY. so why not choose Duke?<br><br>", "<b>Username: ninja.of.love</b><br><br>Same logic says, \"Why not choose Davidson?\"<br><br>I would rather be around Davidson students than Duke students and I'd rather <b>not</b> be in Durham for 4 years.<br><br>", "<b>Username: smcnair21</b><br><br>i definitely agree with warbler- both are great schools and it really depends on what you want- prestigee should not be a factor in the decision<br>also, duke is in durham but the campus is overall nice as is davidsons-<br>and asian dictator- if u have never heard of davidson and u were being serious u should get off this board<br><br>", "<b>Username: thethoughtprocess</b><br><br>Duke wins academically.<br>-Ranked 8th feeding undergrads into top 10 law, biz, and med schools, Davidson is ranked outside the top 15<br>-Ranked 7th highest SAT scores in the country...Davidson is not anywhere close<br>-Duke has the highest proportion of National Merit Scholars outside of HYPSM<br><br>Socially, that depends on the person, but if you are looking for the school that will put you with the smartest people, and open up the most doors for you, obviously Duke is the choice.<br><br>Davidson is a very legit safety school for people who get into Duke. Also, why even mention Durham? Duke is so superior academically that even if the surrounding town was bad, it shouldn't even be an issue.<br><br>", "<b>Username: bluetissues</b><br><br>Did you just call Davidson a safety school? With an admission rate under 20% and average SATs from 680-740 per section (as published by their school paper) it's a far cry from a safety for anyone.<br><br>", "<b>Username: VertigoFrog</b><br><br>\"Same logic says, \"Why not choose Davidson?\"<br><br>I would rather be around Davidson students than Duke students and I'd rather not be in Durham for 4 years.\"<br><br>Does it? The logic was that since the OP liked both schools equally, he should go with prestige. If he says he loves Duke, then he must not have a problem with Durham.<br><br>", "<b>Username: screwitlah</b><br><br>.....................................lol<br><br>", "<b>Username: Sheed30</b><br><br>Wel, if he goes to Duke and doesn't like it, he can easily transfer to Davidson...not so easy vice-versa, if he does not like Davidson...<br><br>", "<b>Username: warblersrule</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/SarahsDad\">SarahsDad</a> wrote:\"\"<br>*blinks*<br>Did you actually try to back up that claim with a ranking difference of two points? Considering that the US has over 4000 colleges, I <i>really</i> don't think that's very significant. You might as well compare PhD production at Duke and Davidson (8.5% and 7.5%, respectively).<br><br>I do believe that Duke is the better institution (however biased I may be), but I really don't think it's enough to make a difference in education.<br>\"\"<a rel=\"nofollow\" href=\"/profile/ninja.of.love\">ninja.of.love</a> wrote:\"\"<br>Agreed. People choose colleges like Middlebury and Swarthmore all the time, although most people have never heard of these schools.<br><br>My U Chicago interviewer teaches German at Davidson. Although his job was to quiz me about my interests and Chicago, he did his best to convince me to come to Davidson! He said that, in his opinion, Davidson provides an equally good education.<br>\"\"<a rel=\"nofollow\" href=\"/profile/Lollipopbabe\">Lollipopbabe</a> wrote:\"\"<br>Um...you DO know that Charlotte is the <a href=\"http://www.post-gazette.com/pg/06176/701039-28.stm\" rel=\"nofollow\">#2 banking center</a> after NYC, right? And that Davidson students usually get jobs there?<br><br>I'm equally annoyed/amused by the comment about \"Ivy League\" Duke. Duke >>> Ivies. ;)<br><br>", "<b>Username: ninja.of.love</b><br><br>I never said that <i>I</i> loved the schools equally, as the OP did. I do not love these schools equally for personal reasons.<br><br>I believe Warblers has a good point about professors. I've known three Duke professors and all three attempted to convince me <b>NOT</b> to attend Duke and not because they thought I couldn't get in and were sparing me the disappointment.<br><br>As for my comments about Durham, I stand by them. Durham is not a nice place to live and much of the local community has disdain for the school and its students. I spent almost a year in Durham and we moved because a woman was raped and murdered in our apartment complex. This may not spill over onto campus but there is crime and poverty in the city itself. Consider this: on the TPR town-gown relations are good list, Davidson is #6; on the TPR town-gown relations are strained list, Duke is #4. There is animosity in the largely poor and black city of Durham about the behavior of the students and there are frequently newspaper articles that have local residents complaining about the behavior of <b>some</b> Duke students (ie - loud parties, public urination, extreme intoxication).<br><br>I would rather advocate the use of the town and the character of the student body as criteria for a decision than prestige.<br><br>I really believe the academic argument depends on what the OP wants to study and the relative strength of those deptartments, rather than arbitrary USNWR statistics about the relative strength of Davidson as a LAC and Duke as a University.<br><br>", "<b>Username: evil_asian_dictator</b><br><br>Is there still even a debate going on? I have never EVEN HEARD OF Davidson in my whole life. Do you really want to go to a school that has no prestige and whose name will only bring about puzzled faces and laughs from others for the rest of your life?<br><br>", "<b>Username: hubbellgardner</b><br><br>and we wonder why asians get sterotyped......<br><br>", "<b>Username: mattmom</b><br><br>A school no one has heard of? You mean the way Bowdoin does among most people? Or Williams, which one has to explain to almost everyone is in the northwest corner of Massachsetts, just a few miles from the Vermont border? Most people just have not heard of most LACs, and that is okay. Different strokes...<br><br>But, and this is an aside to HG, you used to make such great and cosntructive comments about Davidson, please don't fall into negative stereotyping trashtalking even when or if provoked. You and Davidson are better than that (at least I know Davidson is:))<br><br>", "<b>Username: thethoughtprocess</b><br><br>Anyone who says Davidson is as good as Duke academically is not looking out for your best interest or your future. Duke is CLEARLY superior academically, its not even a competition.<br><br>Mattmom, no offense, but Williams is much better than Davidson. Davidson is a safety school for most people who get into Duke. This shouldn't be a surprise if you look at the caliber of students who go to Duke and then the caliber of students who go to Davidson.<br><br>I like Davidson and think its very pretty, but Duke is definitely the better choice if your looking for the most opportunities and want to be around the smartest people.<br><br>", "<b>Username: thethoughtprocess</b><br><br>Oh yeah, and in case the pro-Davidson folk on this thread keep trying to deceive everyone about how Davidson actually stacks up to Duke...<br><br>Average SATs:<br>Duke: 1360 - 1540<br>Davidson: 1240 - 1430<br><br>Duke students score much better<br><br>Feeder rankings (% students going to top 10 law/biz/med schools)<br>Duke: Ranked top 10, sending 8.6% of students, slightly better than Columbia or Penn<br>Davidson: Not in the top 25, which is the lowest rank the survey goes to<br><br>Duke obviously wins again<br><br>Student HS Class Rank:<br>Duke: 87% in top 10%<br>Davidson: 78% in top 10%<br><br>This one is close, but again Duke takes it<br><br>If you take the time to look up other things, like Rhodes/Truman/Marshall scholars, or National Merit Scholars, or ratings from global businesses on how much they like students from certain colleges, Duke clearly wins in all categories<br><br>So, as I said before and now have displayed with facts, Duke is totally superior to Davidson academically, and those who are pretending Davidson is as good as Duke are not being straightforward with you<br><br>", "<b>Username: mattmom</b><br><br>thethoughtprocess: In my earlier post I was not saying OP should choose one or the other, simply mildly making fun of the later poster who had never heard of the school I think of as Little D. I do feel that LACs and universities are two separate kettles of fish and offer quite different experiences; some people might thrive in one setting and not another. Being the parent of a Williams alum and a longtime New England vacationer, I can assure you that I have known about Williams since I was a little girl a very long time ago and that when I was a Williams parent, not quite as long ago, I often had to explain to people where it was. I make no claims about one school's superiority over another. I do find, however, that when people feel it is necessary to say \"no offense\" they generally suspect they are being offensive to the person they are addressing. (And never having had a child apply to Duke I would not know what students who apply to Duke use as a safety school but certainly admire students whose credentials are strong enough for them to use Davidson as their safety.)<br><br>Incidentally, \"its very pretty\" in post 34 is incorrect; it should be \"it's very pretty\" the usage is the contraction for \"it is.\" I am usually very sympathetic about typos because I make so many myself, but...superior people should be aware of such details. No offense intended of course.<br><br>", "<b>Username: 1sokkermom</b><br><br>I think that anyone who has seriously researched colleges recently has heard of Davidson. Kaplan had it listed as a \"hot\" school in 2002. I think it has since gotten \"hotter\".<br><br><url>http://www2.davidson.edu/common/templates/news/news_tmp01.asp?newsid=930</url><br><br>A more recent article (2007) refers to Davidson as one of the 25 New Ivies. ;)<br><br><url>http://www.msnbc.msn.com/id/14325172...wsweek/page/4/</url><br><br>In case you can't open the 2007 new ivy article.<br><br>\"Davidson College<br>Davidson, N.C.<br>This private liberal-arts college of 1,600 has benefited from a recent surge in interest. Last year, 3,900 students applied for the class of 2010; only 30 percent were accepted. A decade earlier, admissions officers were sifting through about 2,800 applications. \"We look, feel, sound like a New England liberal-arts collegebut we're in North Carolina,\" says Christopher Gruber, dean of admission and financial aid. About a third of students are from the Southeast. The most popular majors are biology, economics, English, history and political science. Students can also concentrate in a particular area within a majorfor example, biology with a concentration in medical humanities. Overlap schools: University of North Carolina, Duke, University of Virginia, Georgetown, Vanderbilt, Rice, Boston College, Pomona, Stanford and the Ivies.\"<br><br>", "<b>Username: ninja.of.love</b><br><br>I guess some of y'all don't read Time magazine. Davidson was featured on the cover for a story called, \"Who Needs Harvard?\" Maybe some folks want to attend a school based on the campus feel and the personality of the students. Consider the recent business school cheating scandal for instance. It never would have happened at Davidson because all students believe in the Honor Code. The schools are different and it's ridiculous to say that one school is a better match for a student based on the other students' past performances and standardized test scores.<br><br>", "<b>Username: VertigoFrog</b><br><br>\"It never would have happened at Davidson because all students believe in the Honor Code.\"<br><br>Naive.<br><br>", "<b>Username: ninja.of.love</b><br><br>I have never met or heard of a single Davidson student who would actively or passively allow cheating. 30 some students? Definitely not.<br><br>", "<b>Username: thethoughtprocess</b><br><br>Davidson is a good school. But Duke is still a completely superior school looking at academics.<br><br>If I said no offense, I guess I take it back if you really do think that Davidson is on par with Duke. Because that simply isn't true.<br>Davidson is up and coming, which is why it was mentioned in the Times. Duke is already elite. See the difference?<br><br>You are saying LAC's can't be compared to Universities. They can. LAC's that are on par with Duke include Amherst and Williams...both schools are superior to Davidson though. You can compare Williams to Duke because Williams is one of the best LACs, and has a similarly competitive student body - Davidson does not.<br><br><br>Mattmom, did you really correct my grammar? I guess its good to finally know what a contraction is.<br><br>", "<b>Username: mattmom</b><br><br>Not grammar. Spelling. Correcting grammar would have involved something like telling you not to use \"ain't\" instead of \"isn't.\"<br><br>", "<b>Username: warblersrule</b><br><br>\"\"If you take the time to look up other things, like Rhodes/Truman/Marshall scholars, or National Merit Scholars, or ratings from global businesses on how much they like students from certain colleges, Duke clearly wins in all categories.\"\"<br>Berkeley doesn't do very well in those awards despite having an enormous number of 1500+ (out of 1600) SAT scorers. I'm not saying this isn't an indicator of quality (I frequently cite the Goldwater scholarship), but it's important to note that not all excellent colleges do well in this area.<br>\"\"So, as I said before and now have displayed with facts, Duke is totally superior to Davidson academically, and those who are pretending Davidson is as good as Duke are not being straightforward with you.\"\"<br>I wrote earlier that I thought Duke offered more academically, but I also noted that I thought the difference wasn't enough to significantly impact an education. Your statement implies that a top biology student at Davidson wouldn't be able to get into the same graduate programs as a top biology student at Duke, for example. I find this hard to believe.<br><br>On the other hand, things like location and student body WILL make a significant difference in one's college education.<br><br>", "<b>Username: screwitlah</b><br><br>\"\"Not grammar. Spelling. Correcting grammar would have involved something like telling you not to use \"ain't\" instead of \"isn't.\"\"\"<br><br>it's not about spelling, either. and it gets pretty pathetic to watch when someone resorts to being pedantic just to take a weak jab at someone else, only to sound like a loser doing so.<br><br>", "<b>Username: cad</b><br><br>Duke has had 41 Rhodes Scholars<br>Davidson has had 23 Rhodes Scholars<br>Duke has 6200 undergrads<br>Davidson has 1700 undergrads<br><br>", "<b>Username: mattmom</b><br><br>The OP has undoubtedly made up his or her mind by now, and I hope it works out for the best. I would like to respond on this particular thread one last time, this time to the rude and tangential \"pathetic/pedantic\" post 44. I was deliberately pointing out a careless but real error because I found (and continue to find) the tone of that poster's observations foolish, arrogant, and, in fact, somewhat offensive. Also, I am one of those old-school people who really does believe grammar and correct use of language are important. In any case, youth, ignorance, honest pride, or desire to be among the best are no excuse for putting down other schools, and the more people you meet at all ages the more you will realize that excellence comes in a lot of different shapes and sizes, with degrees from a lot of different schools.<br><br>And of course a nod of recognition to the poster who noticed that a school's percentage of Rhodes Scholars can be quite impressive even if absolute numbers seem lower. I am sure there are many other small schools that have even higher percentages, but it was still interesting to see that Davidson's Rhodes Scholar percentage is noticeably higher than Duke's.<br><br>", "<b>Username: LakeWashington</b><br><br>Again, I am compelled to say, with regard to criteria for comparing schools, what rot!! If anyone in Arizona has never heard of Davidson, I would opine that that is more a reflection of their lack of knowledge. If we were to define the term \"heard of...,\" many folks mean that they are aware of the exploits of a school's football or basketball team. That's no comment on academic standards. I mean, how many people say \"I heard that XYZ University's point guard is a Rhodes Scholar?\"<br><br>", "<b>Username: 1sokkermom</b><br><br>^ The flip side of that coin is that many people associate a school like Duke with the exploits of it's athletic teams, not completely realizing that it really does have outstanding academics. Many kids really do decide to attend Duke because of the academic excellence, NOT because of the athletic programs... ;)<br><br>(You really could find an excellent athlete at Duke who is also a Rhodes Scholar.)<br><br>", "<b>Username: indecisive6</b><br><br>Hi everyone! I have decided on Duke, although I have to agree with the people who defended Davidson as well--it's amazing as well, which was what made it such a difficult decision. Thanks for your input!<br><br>", "<b>Username: COlsen573</b><br><br>DEFINITELY duke.<br><br>", "<b>Username: thethoughtprocess</b><br><br>MattMom - its pretty ridiculous you consider my comments \"foolish, arrogant, and, in fact, somewhat offensive\" - I guess you find facts offensive and arrogant. After all, I was just paraphrasing the following websites:<br><br><url>http://www.nationalmerit.org/06_annual_report.pdf</url><br>Duke has 120 National Merit Scholars, Davidson has 8...to put it in perspective, Penn has 100, Columbia has 70, Harvard has 210, Yale has 180, and Dartmouth has 70<br><br><url>http://www.wsjclassroomedition.com/pdfs/wsj_college_092503.pdf</url><br>Duke is a top 10 feeder school into top biz/med/law schools, Davidson is NOT in the top 50 (unless I missed it somewhere)<br><br>There we go MattMom, that should resolve any questions you've had about how good Duke is...and again, sorry about the facts disagreeing with you. At the end of the day, your son or daughter will definitely be successful - regardless of whether a Davidson or Duke grad. Plus its nice to see parents vouching for their children's schools.<br><br>Sorry to all if I sound abrasive, I just honestly don't think Davidson is comparable to Duke in quality. Overrating Davidson is basically underrating Duke, which is why I wanted to make the facts clear to all.<br><br>", "<b>Username: mattmom</b><br><br>Well, I'd say Williams trumps them both at least in some of the numbers games...but thank you. I too have every confidence in my children and in their schools and I'm sure if they had chosen to apply to Duke and attend I would have found a place in my heart and mind for it as well.<br><br>"]}