{"title": "mit vs nyit", "comments": ["<b>Username: CrazyAstronaut</b><br><br>Wich skool is betta? wich is da betta tech skool?<br><br>", "<b>Username: stasterisk</b><br><br>um. Do some research. Or watch any cheesy scifi movie. The genius is *always* from MIT.<br><br>:P<br><br>", "<b>Username: irock1ce</b><br><br>whats NYIT?...... New York Institute of Technology?.... holy crap. I didn't know New York had an institute of Technology.<br><br><br>btw. this should kind of tell you how \"prestigious\" NYIT is... if it exists.<br><br>", "<b>Username: CrazyAstronaut</b><br><br>r da grls at MIT hot<br>r da grls at MIT horni<br>r da grls at MIT da same as at NYIT<br><br>n i tink NYIT is betta :) sry<br><br>", "<b>Username: chibearsfan17</b><br><br>This is really too good to be true. If you really want horny girls, try a state school bro. I'm too lazy to research whether or not NYIT is actually a school, but if it comes down between the two and you're lookin for horny girls, I'd say NYIT. But generally this isn't a criterion most people consider at MIT. Either way, I assume most of this is a joke, and it's well taken it if is. You're a funny guy.<br><br>", "<b>Username: CrazyAstronaut</b><br><br>wait MIT iznt hrd rite?<br><br>da peeps jus parti rite<br><br>", "<b>Username: CrazyAstronaut</b><br><br>wait MIT vs NYIT vs SUNY Farmingdale for engineering?<br><br>wat has da best tech skool and wat has da bes grls?<br><br>", "<b>Username: chibearsfan17</b><br><br>I actually take back what I said about MIT. Upon further inspection, it's probably the easiest school in the country. Most students don't go to any of their classes and usually don't bother showing up for tests, but the profs just give them A's anyways because they know that waking up at 1 p.m. is a challenge for their students. The women at MIT are unparalleled. Think Pamela Anderson but dumber and with bigger boobs. All of them. Every guy there feels like Hugh Heffner in the playboy mansion, but dont worry, guys are only like 2% of the students there anyways. So, based on what you want in a school, I'd say MIT is the perfect fit for you. Based on your amazing command of the English language, I assume you were already accepted, so I'd pick them if I were you.<br><br>", "<b>Username: l33twinkie</b><br><br>haha, love your comment, chibearsfan. that is some annoying english.<br><br>", "<b>Username: tastyb33f</b><br><br>hmmm...well apparently NYIT IS an actual school (<url>http://www.nyit.edu</url>) but...hahaha. This is funny! Thanks for giving us some much-needed entertainment in this time of stress.<br><br>", "<b>Username: nomad</b><br><br>wait isnt nyit the number oen school in MA?? the awesome top ranked school?<br><br>and whats this MIT everyone is talking about? is it really a schoool? where is this MIT ?<br><br>", "<b>Username: neha1</b><br><br>haha.........funny......makes me take my rejection lighter... :D<br><br>", "<b>Username: h88</b><br><br>CrazyAstronaut,<br><br>My advice? Don't apply/go (that is, if you were accepted) to MIT/NYIT. Both schools won't do you justice. By the way, taking Physics in the 12th grade is a huge accomplisment; that alone will get you in anywhere!<br><br>", "<b>Username: neha1</b><br><br>sigh, if only i had the guts to take physics...... :D<br><br>", "<b>Username: h0riz0n</b><br><br>In conclusion, I guess everyone apreciates more MIT than NYIT :D<br><br>", "<b>Username: vecter</b><br><br>nyit > mit fo sho<br><br>", "<b>Username: bruklin</b><br><br>mit>cit>git>iit(il)>rit>njit=nyit=fit>wit>oit>iit(in) no wadameen. all dees it's r fo reel.<br><br>", "<b>Username: collegehunter</b><br><br>Are you guys serious? MIT is definetely BETTER. NYIT is a joke school. MIT is so much more prestigious and tougher to get into. In fact, it is one of the hardest schools to get into in the country. Haha, ANYONE can get into NYIT. NYIT is for the rejects!!! MIT > NYIT.<br><br>NYIT REALLY SUCKS. WHY WOULD YOU GO THERE?!<br><br>", "<b>Username: UltimateFrisbee</b><br><br>We would go there because we don't want to be surrounded by Chinese nerds with big glasses that are afraid of asking girls out and that don't take showers.<br><br>", "<b>Username: easternboarder</b><br><br>Way better than being near guys who pat each other on the ass during ultimate frisbee and then proceed to bro down together in the shower.<br><br>", "<b>Username: CoolaTroopa</b><br><br>I'm going to NYIT...<br><br><br>TO TAKE THE SAT'S!!!!<br><br>", "<b>Username: Apollo1331</b><br><br>you disgust me.<br><br>", "<b>Username: gigog</b><br><br>i'm pretty sure that this post started off as a joke... but whatever. NYIT is an accredited university, but it started off as a diploma mill!<br><br>", "<b>Username: stasterisk</b><br><br>why is this thread back?<br><br>", "<b>Username: Mara19</b><br><br>Go to MIT! I don't trust NYIT. They are dishonest people. They support VIP (Vocational Indepenence Program- <a href=\"http://www.nyit.edu/vip/index.html\" rel=\"nofollow\">NYIT :: Vocational Independence Program (VIP)</a>) which is a dumping ground for low performing college students.<br><br>Therefore NYIT sucks. Go to MIT.<br><br>", "<b>Username: collegealum314</b><br><br>\"\"r da grls at MIT hot<br>r da grls at MIT horni<br>r da grls at MIT da same as at NYIT\"\"<br><br>As Mollie would say, go look at the \"common data set.\" All your questions will be answered.<br><br>", "<b>Username: molliebatmit</b><br><br>Yes, it's under section G, \"Wht r da grls lyk?\"<br><br>", "<b>Username: hpa10</b><br><br>LMAO! This thread just made my day. :)<br><br>", "<b>Username: lizzardfire</b><br><br>Oh, snap! Section G? Now I'm jealous, mollie. I clearly picked the wrong party school :P<br><br>", "<b>Username: phishfan0969</b><br><br>LOL at all the people that took this thread seriously.<br><br>", "<b>Username: pebbles</b><br><br>figure out which school is the most expensive and then don't not go to that one.<br><br>", "<b>Username: Yaile</b><br><br>ok i dont mean to offend anyone (don't hte me guys)<br>but i think that MIT is better honestly than NTIT cuz it is a bit of a better school<br>but NYIT mite be a bit cheaper for yuo since you live in NY so rememmeber to consider that and not forget<br>good luck :)<br><br>", "<b>Username: SYNCHROTRON</b><br><br>Don't go to MIT, it is a school for people with SAT scores of 200 on each section; 2.0 GPA; lazy ECs like eating Sushi all day long etc.<br><br>Therefore, got to NYIT, best school EVER.<br><br>&lt;&lt;&lt;&lt;&lt; even Hercules went to NYIT (look at my location).<br><br>", "<b>Username: pnptruong</b><br><br>Man, MITers dont even get 600s on the SAT. They get 0s for it because they get all the questions wrong...(maybe due to the fact that they know all the right answers to avoid choosing them.)<br><br>", "<b>Username: flux_capacitor</b><br><br>The person who started this thread is the next Shakespeare. I am almost 100% certain (my confidence level is 99%!)<br><br>", "<b>Username: kevdo</b><br><br>this is the funniest thing ive read today. lolz<br><br>", "<b>Username: SYNCHROTRON</b><br><br>What's your margin of error, flux_capacitor?<br><br>", "<b>Username: flux_capacitor</b><br><br>I have an extremely low margin of error because my sample size was so large. I interviewed 314 people and asked them if they thought the poster was going to be the next Shakespeare.<br><br>Furthermore, I assigned an arbitrary value Vs to the literary value of Shakespeare. The starter of this thread has a literary value of Vs2. So my null, Ho: Vs2 &lt; or = Vs and my alternate, Ha: Vs2 > Vs. I won't bore you with the extremely brilliant (and I am being modest when I say that) procedures I used, but I can safely reject the null hypothesis. There is a very low chance that the literary brilliance exhibited by the thread starter was due to random variability.<br><br>:) :) :)<br><br>", "<b>Username: sonicexx</b><br><br>You haven't taken a trickery into consideration. Maybe he went to Russia, disintired Rasputin's corpse, and with his help woke up Shakespeare?<br><br>Then, Shakespeare was intimidated to write a post \"MIT vs. NYIT\" on CC, and to keep responsing.<br><br>But now, he went to saint sleep again, as most of you.<br><br>So, Vs=Vs, and this is true for every xE~R<br><br>", "<b>Username: MedullaPancreas</b><br><br>If anyone finds this or the flunk-out who started this thread funny they really have lowered the bar on message board applicants. Here's the truth: the curriculums are all standardized (that means they all teach the same things) except the \"elite\" school cost about 30 thousand dollars more (a son of a rich sucker is you). You get the same education from a city college that you get at a Harvard. As for design on NYIT -the names Edwin Catmull (Pixar, Disney, Lucasfilm), Alvy Ray Smith, Walt Disney Feature Animation Chief Scientist Lance Joseph Williams, Dreamworks animator Hank Grebe; andNetscape and Silicon Graphics founder Jim Clark mean nothing to you. Then again you know nothing about anything other than rhetoric about \"eeleet skoolz, yo!\" When you get older you'll realize how much you actually don't know and how much more complex the world is around you.<br><br>", "<b>Username: PiperXP</b><br><br>\"\"You get the same education from a city college that you get at a Harvard.\"\"<br><br>Could you back up your claim, specifically with respect to MIT?<br><br>As a current MIT student and former CSULA student (I spend two terms there in 2008), I found CSULA easier than my high school (which was a very decent high school, though not by MIT standards) - and I've found MIT to be something of a wonderful academic hell. I took CSULA's hard intro chemistry class (one designed for engineers) and MIT's standard chemistry class (meaning, not the theoretically advanced one). I found the second <i>much</i> harder than the first. Whereas at Calstate LA we would have something like 25 more algebraic questions to answer for each session of class, MIT has much more difficult theory even in the normal class. You can't memorize and punch out numbers in MIT classes. Hell, a lot of the psets don't have numbers at all.<br><br>Moreover, it's always an experience to show my friends at other institutions my psets - many things that can be easily found freely on OCW. My friends are often <i>astounded</i> by the stuff I'm doing. These are friends at UCLA, Cal Poly Pomona, Harvey Mudd, etc.<br><br>So, from first-hand and second-hand experience, I'll say that I think your claim is bull. At least, if broadly applied to include MIT.<br><br>", "<b>Username: Chardo</b><br><br>And you get the same education from a good private high school as you would at a public school in south Bronx or Bed-Sty. It's a standardized curriculum, right?<br><br>I live near NYIT. Grew up here. Until I was around college age, I thought all schools with Tech in the name were crap, largely due to the reputation of New York Tech. I thought it was like Apex Tech or one of those other infomercial places. As I got older I realized it's not all that bad, even had some friends who went there. However, to mention it in the same breath as MIT is ridiculous. Frankly, if you list all the schools with Tech in the name, NYIT probably doesn't make the top 100.<br><br>", "<b>Username: collegealum314</b><br><br>Though in general \"elite\" status doesn't mean the curriculum is deeper or more difficult, it is true in MIT's case. There are only a few schools that are truly comparable. Caltech and Berkeley come to mind. In general, Berkeley is probably harder than any ivy, so your sentiment that a public can be just as rigorous or moreso is sometimes true.<br><br>I don't know anything about NYIT specifically.<br><br>", "<b>Username: k4r3n2</b><br><br>My question is actually \"why did you feel a need to create an account just to reply to a 2-year-old thread\".<br><br>", "<b>Username: boomshakalaka</b><br><br>**** thread... Someone please remove this.<br><br>", "<b>Username: ssad0763</b><br><br>Got accepted into NYiT for Electrical and Computer Engineering. Is the school really that bad?<br><br>", "<b>Username: 7YearsPerHour</b><br><br>@ssad0763 That bad? I would hesitate to call any college or university bad.<br><br>I guess it depends on what you're trying to measure. Perhaps you're looking to get a job right outside of college. NYiT looks good for that (they brag about it). Maybe you're looking for low tuition. I don't know, but you can't just call something good or bad unless they're exploiting you.<br><br>Also this thread is like 11 years old? Pretty sure I was just a fetus.<br><br>", "<b>Username: Mrduque</b><br><br>This post and the clam fart EC post are the most hilarious posts I've seen so far in CC<br><br>", "<b>Username: mer377</b><br><br>d gls at MiT ar nrd<br><br>"]}