{"title": "yale vs harvard economics", "comments": ["<b>Username: ibtelling</b><br><br>I know that Yale has 'Economics and Mathematics' beyond 'Economics' alone as a major. Which is better suited for one who wishes to learn more econ. and finance? And how does Yale's Econ. program compare with that of Harvard?<br><br>", "<b>Username: truazn8948532</b><br><br>If your username is any indication, I'm going to presume you harbor some desire to be an Investment Banker.<br><br>With that in mind, as much as I think Yale is awesome and would choose it over Harvard anyday, go to Harvard. Harvard/Wharton are unmatched in terms of IB/HF/PE recruiting. Yale is a notch \"below\".<br><br>Traditionally the top economic programs (at the graduate level) have been:<br><br>UChicago<br>Harvard<br>Princeton<br>MIT<br>Berkeley<br><br>The next tier includes Yale, Columbia, Penn etc.<br><br>WHen it comes to IB Recruiting, Harvard, Wharton PRinceton makes up the top bracket (as in the absolute top), with MIT, Columbia, Stanford, Dartmouth and then Yale coming in the second tier. Yale, for whatever reason, isn't as well known for churning out bankers compared to say (besides the obvious H,Wharton,P) Dartmouth or Columbia. It's more a mecca for premeds and pre-laws although Yale is definitely still highly respected on wall-street.<br><br>", "<b>Username: ibtelling</b><br><br>Haha... it's literally slang --> I be telling (don't ask me where I got this from :D)<br><br>I know that by the time I graduate, these jobs such as bankings and hedge funds will only decrease in money, positions, and power, so I'm not quite looking 4 years from now. :D Just a comparison on ECONOMICS, not what the program will afford... :D<br><br>", "<b>Username: truazn8948532</b><br><br>read bottom<br><br>", "<b>Username: truazn8948532</b><br><br>Here's an excerpt from this article: <a href=\"http://nymag.com/nymetro/urban/education/features/14642/index2.html\" rel=\"nofollow\">The Freakonomics of Columbia University's Economics Department</a><br><br>Economists like to joke that there are always at least fifteen departments in the top ten. Be that as it may, the consensus is that Columbias recent hiring spree legitimately places it in that group. They can fight with Berkeley and Yale for six, seven, and eight, says Gene Grossman, Princetons outgoing chairman. Much of the buzz at this summers annual National Bureau of Economic Research conference in Cambridge, Massachusetts, was about the remarkable run Columbia had on the job market this year. The appointments are excellentjust what they need to consolidate their leap forward, says Daniel McFadden, the Berkeley economist who won the Nobel Prize in 2000.<br><br>Beyond the immediate buzz, the beauty of having so many top faculty is that they attract top graduate students, who in turn get top jobs at other schools. These professors then encourage their top undergrads to get their Ph.D.s at Columbia, which increases the schools cachet even more. Eventually, everyone wants to be associated with Columbia. Thats the way it percolates, says Robert Solow, a Nobel laureate from MIT.<br><br>Despite these advantages, cracking the top five is extremely difficult, if not impossible. Once you get to number seven, its hard, hard slogging, says McFaddens colleague David Card. In the past three decades, Card points out, there has been almost no turnover in the standing of the MITs, Harvards, and Princetons of the world. One of the last major shifts in the top five was Columbias movement out of it in the late sixties.<br><br>But Davis believes the brutal logic of rankings gets turned on its head in the case of his departmentthat it may actually be easier to break into the top five the closer he gets to it. For at least a decade, many of the top economists in the world have wanted to work in New Yorkparticularly those from nearby schools like Princeton (the fourth-ranked department in the country) and Yale (probably number seven). Many faculty at these schools either live in New York and commute to campus, or they live in Princeton and New Haven but have spouses who commute the other way. That makes sense when you dont have a good alternative in New York City, allows Weinstein. But [the commute] is much harder to sell to your family when you do have an alternative. Its a point not lost on Princeton. Grossman, who has already lost two top people to Columbia in the past two years, says hes watched anxiously as the number of Princeton faculty members living in New York has risen to about 10 percent of the department. I think that there actually are right now a lot of targets of opportunity because people have spouses who work in New York City, says Weinstein.<br><br>", "<b>Username: slipper1234</b><br><br>Econ rankings don't matter for finance recruiting and success on wall street. You should be asking what firms do the best with getting people into top econ grad schools or into finance. the answer to that question is:<br><br>1. Harvard, Princeton, Wharton, Yale<br>2. Dartmouth, Columbia, MIT, Stanford<br><br>", "<b>Username: White_Rabbit</b><br><br>I think it would be foolish to leave Chicago, Berkeley, or even Swarthmore off of that list.<br><br>", "<b>Username: tetrishead</b><br><br>\"\"Econ rankings don't matter for finance recruiting and success on wall street. You should be asking what firms do the best with getting people into top econ grad schools or into finance. the answer to that question is:<br><br>1. Harvard, Princeton, Wharton, Yale<br>2. Dartmouth, Columbia, MIT, Stanford\"\"<br>Close, but no cigar. (my ranking is only based on job placement, though)<br>\"\"1. Wharton, Harvard, Columbia, Princeton, MIT<br>2. Stanford, Dartmouth, Claremont Colleges, UCB<br>3. Northwestern, Chicago, CMU, Yale\"\"<br><br>", "<b>Username: bmwdan13</b><br><br>My understanding was always that Yale matched Harvard for Econ, but I am by no means an expert.<br><br>", "<b>Username: slipper1234</b><br><br>Swarthmore is actually pretty weak with finance recruiting, UCB and Chicago are behind as well. These places do well if you want to work at an econ think tank after undergrad, not if you want to go into high finance.<br><br>Tetris, I disagree that the claremont colleges are even close to the top for finance placement. UCB is also a couple steps behind in my experience.<br><br>", "<b>Username: tetrishead</b><br><br>I'm not going to disagree that UCB is a couple steps behind, and I was actually thinking of moving Northwestern or CMU to the second tier (CMU's placement for their IS and BBA graduates really, <i>really</i> surprised me. Tepper is on fire over the last few years, and 5 years from now I honestly wouldn't be surprised if they're the top 10 for everything), but from what I know Claremont and Pomona people do very well out of school with the financials that have branches in the area (and there are many).<br><br>", "<b>Username: datalook</b><br><br>1. Massachusetts Institute of Technology 5.0<br>University of Chicago 5.0<br>3. Harvard University (MA) 4.9<br>Princeton University (NJ) 4.9<br>Stanford University (CA) 4.9<br>University of CaliforniaBerkeley 4.9<br><br>All these 6 institutions are better than Yale for sure. Again, Yale is a top 10, not a top 5.<br><br>", "<b>Username: posterX</b><br><br>Princeton, MIT, Yale and Harvard are the top four at the undergraduate level, in terms of placement rates into the top programs, jobs and such. They're all about equal, so pick the one that you like best. Runner-ups would be Wharton and Dartmouth and possibly Chicago.<br><br>In terms of economics departments overall, the piece above about Columbia is largely a bunch of hot air -- the top departments are always hiring large numbers of faculty from time to time, and the composition of the departments changes, especially when they are large departments such as econ. Columbia may have committed $10M to hiring faculty, but schools like Harvard &amp; Yale have recently committed many times that.<br><br>", "<b>Username: slipper1234</b><br><br>Datalock those are graduate rankings. Yale's undergrad focus and reputation with recruiters/ grad programs brings it into the top 5, just as those factors elevate Dartmouth to the top level and remove cal.<br><br>", "<b>Username: truazn8948532</b><br><br>PosterX is also a huge Yale ****...<br><br>\"Columbia is largely a bunch of hot air...\"<br><br>There are currently 27 Columbia MD's at BB firms and 14 Yale MD's.<br>Goldman SA recently had 8 Columbia hires and only 4 Yalies.<br><br>But back to the OP, finance DOES NOT EQUAL economics and the two are distinctly different. If it's Economics you're looking to really get into, it's really the grad school that matters and what grad school you get into is largely a function of your recommendation, research, and GPA.<br><br>", "<b>Username: CJinCH</b><br><br>How would liberal arts colleges compare? Would Econ/Maths from Amherst or Williams get you a decent job?<br><br>", "<b>Username: SourApplezz</b><br><br>Datalook, are you just downright stpuid, or can you not distinguish between the words \"undergraduate\" and \"graduate?\"<br><br>I wouldn't be surprised if this kid has a shrine dedicated to USNews Graduate Rankings.<br><br>", "<b>Username: tetrishead</b><br><br>\"\"Princeton, MIT, Yale and Harvard are the top four at the undergraduate level, in terms of placement rates into the top programs, jobs and such. They're all about equal, so pick the one that you like best. Runner-ups would be Wharton and Dartmouth and possibly Chicago.\"\"<br>If you think Yale has better placement rates in the job market than Wharton then I have to question whether or not you're posting to this forum from Earth. Yale is good. Yale has a high-quality economics program. Yale has a strong alumni network. Yale is not Wharton. Yale has nowhere near the placement of Harvard or Princeton in the job market. It's not near Columbia, either. In reality it also lags behind Stern, MIT, Stanford and Northwestern in the job market. Will you get a good job if you go to Yale? Absolutely. But let's not pretend it's one of those schools--it isn't.<br><br>datalook using graduate rankings was kind of out of left-field because Chicago's placement from graduate school is generally considered a lot better than their placement from undergrad, which is why the graduate school rankings don't really apply to undergrad. But the general statement that the prestige of the graduate program factors into the undergraduate program is correct.<br><br>", "<b>Username: Tami</b><br><br>I'm not sure why, but I get the feeling that tetrishead and datalook are both one and the same...;)<br>Maybe it's because of their extreme anti-Yale-ridden comments?<br>When posters are so keen to point out the negatives of a college this much, you really have to question what event took place to make them feel that way, don't you think?<br><br>Anyways...<br>\"\"If you think Yale has better placement rates in the job market than Wharton then I have to question whether or not you're posting to this forum from Earth. Yale is good. Yale has a high-quality economics program. Yale has a strong alumni network. Yale is not Wharton. Yale has nowhere near the placement of Harvard or Princeton in the job market. It's not near Columbia, either. In reality it also lags behind Stern, MIT, Stanford and Northwestern in the job market. Will you get a good job if you go to Yale? Absolutely. But let's not pretend it's one of those schools--it isn't.\"\"<br><br>I vote for the above paragraph to be quoted in the next \"1001 dumbest things ever said\" book.<br><br>", "<b>Username: ibtelling</b><br><br>Thanks for the advice, albeit some were completely off the mark.<br><br>*coughs* Anti-Yalies up in here *coughs*<br><br>", "<b>Username: tetrishead</b><br><br>\"\"I'm not sure why, but I get the feeling that tetrishead and datalook are both one and the same...<br>Maybe it's because of their extreme anti-Yale-ridden comments?<br>When posters are so keen to point out the negatives of a college this much, you really have to question what event took place to make them feel that way, don't you think?<br>Anyways...\"\"<br>Uh, I'm not really sure what you're trying to claim here. Wharton is known for basically having the best possible placement of any undergraduate business school. Saying Yale econ has better job placement than Wharton is just completely inaccurate.<br><br>I like Yale. It's an amazing school. If I wanted to major in economics and I had to choose between Yale or Northwestern, I'd choose Yale because of the intangibles of the rest of the school--but not because the economics department is superior to NU. The economics department is probably in the top 10-15, and that's saying something considering just how many schools there are in this world. But if you're really talking about undergraduate job placement coming out of the econ program--it's just not where Yale is its strongest. It's still in elite company, and you'll still get a great job. But it's not where Yale is #1. The graduate program is relatively well-respected, but it's understood to not be at the level of a Chicago or Harvard in theory, or a MIT or UCB at the quant level.<br>\"\"I vote for the above paragraph to be quoted in the next \"1001 dumbest things ever said\" book.\"\"<br>Economics department != entire schools. Is Yale a better school than NYU, Stanford or Northwestern? Yeah, in most instances I think so. But are those schools undergraduate economic departments better than Yale's? Yes. Is their job placement better out of the economics program? Absolutely. It doesn't take anything away from Yale to have just one major that isn't in the top 3 in the country. You're not going to go wrong majoring in economics at Yale, whether you want to get a doctorate and be a researcher or work in finance. But there are other schools that are <i>known</i> for their economics departments, and for those departments practically alone. There's a reason for that.<br><br>", "<b>Username: tetrishead</b><br><br>And, by the way Tami, for someone who's smart enough to go to Wellesley I would have thought you'd have been introduced to analytical thinking by now. Just because &lt;person> loves Yale doesn't mean &lt;person> can't separate themselves from their biases and assess Yale's position from as neutral a standpoint as possible. You made statements that were simultaneously unsubstantiated and irrelevant to my stance on the issue all while providing nothing of substance on your own, and that's quite the feat.<br><br>", "<b>Username: Tami</b><br><br>You definitely softened your stance there a bit, eh? ;)<br><br>How do you exactly back up your rather adament claim that Yale is \"no where near\" the job placements in comparison to NU, Stern, Columbia, Princeton, etc.?<br><br>I never said econ departments are the makeup of entire schools, nor did I imply that. I was directly countering your \"job placement\" argument, and I still stand by my comment.<br><br>", "<b>Username: Tami</b><br><br>Tetrishead, for someone who's smart enough to point out that Wellesley ladies are quite the bright bunch (;)), I think you've failed to recognize that there is little need for analytical thinking in this situation.<br><br>There's hardly anything neutral about lowering a school's image with no factual evidence. I consider neutral as one who can speak on both the strengths and the weaknesses on both sides, of all institutions.<br><br>", "<b>Username: bmwdan13</b><br><br>Okay, if Yale isn't known for econ, what IS it the best at? Yale is clearly among the best undergraduate schools in the country, but all I hear is how these \"less elite\" schools like NU and UChic are better at one thing or another... what is Yale exceptional at?<br><br>", "<b>Username: tetrishead</b><br><br>\"\"You definitely softened your stance there a bit, eh? ;)\"\"<br>I softened nothing. Your reading comprehension ability resulted in you believing I said Yale was not on-par with those schools, even when we are both aware that the discussion was specifically relating to economics department and any statements made about schools in that context should have been assumed to be about said topic and not needed a qualifier every single sentence.<br>\"\"How do you exactly back up your rather adament claim that Yale is \"no where near\" the job placements in comparison to NU, Stern, Columbia, Princeton, etc.?\"\"<br>Well, for graduate school I suppose we could go through the normalized institution rankings for students eventually receiving Ph.D's in economics per 1,000 students. That's probably a not great indicator of quality, though, is it?<br><br>So then what you're effectively left with is (1) either trying to assess undergraduate programs, which is basically impossible and arbitrary, or (2) assessing the general opinion of the programs of such schools in the business world and assessing their graduate programs. The only exceptions to this are NU and Stern, where I suppose we can look at NU's strength in the fed challenge as a boon to their undergraduate program (as well as the new Kellogg undergraduate certificate in financial economics), and we can give a (somewhat) unfair bonus to Stern by virtue of its position so close to Wallstreet, which from logically you can deduce that intern and externship availability is superior, which directly correlate to job offers coming out of school. This also applies to Columbia, which is effectively starting to become incestuous with Wallstreet.<br><br>Then I suppose there's the reputation factor, which while obviously is incredibly unreliable still places Yale further down the totem pole than the rest of the schools we're discussing.<br><br>As for job placement Yale economics v. Wharton, that can be quantitative. I don't think anyone who's seriously ever looked at how well Wharton places in general \"business\" (which is a lot of things, obviously) job market thinks they're anything but the single best undergraduate school for job placement in business.<br>\"\"I never said econ departments are the makeup of entire schools, nor did I imply that. I was directly countering your \"job placement\" argument, and I still stand by my comment.\"\"<br>Your comment is that I'm anti-Yale because I said Yale has a 10-15 economics program instead of a 1-5. I don't seriously see how that can be considered an \"extreme anti-Yale-ridden comment.\" Anyone who sees that as an insult or the ramblings of some bitter internet poster is absolutely delusional, and seriously needs to reassess the way they view the world. 10-15 is great, and it signals that there's a great program. If that tweaks you, then you're going to have big problems throughout the rest of your life dealing with other human beings.<br><br>", "<b>Username: Tami</b><br><br>\"\"Well, for graduate school I suppose we could go through the normalized institution rankings for students eventually receiving Ph.D's in economics per 1,000 students. That's probably a not great indicator of quality, though, is it?\"\"<br><br>Nope!<br>\"\"2) assessing the general opinion of the programs of such schools in the business world and assessing their graduate programs.\"\"<br><br>Right. Sadly, this cannot be done by you, either. I guess I have to spell this one out for you--you don't represent the \"general opinon.\" Period. What position are you in to know the \"reputation factor\" of these schools? Internships, etc. Fine. But what makes, for example, Princeton. a no match winner against Yale in job placements? You've still avoided in giving me concrete evidence besides your opinion, which I couldn't care less about (just like you couldn't care less about mine).<br>\"\"Your comment is that I'm anti-Yale because I said Yale has a 10-15 economics program instead of a 1-5. I don't seriously see how that can be considered an \"extreme anti-Yale-ridden comment.\" Anyone who sees that as an insult or the ramblings of some bitter internet poster is absolutely delusional, and seriously needs to reassess the way they view the world. If that tweaks you, then you're going to have big problems throughout the rest of your life dealing with other human beings.\"\"<br><br>No, you're right. But you continue to put an anti-Yale sentiment in your comments by repeating that people who think Yale has a better econ program are \"delusional\" or are \"not commenting from Earth.\" Can you really say that is neutral?<br>\"\"If that tweaks you, then you're going to have big problems throughout the rest of your life dealing with other human beings.\"\"<br><br>No.<br><br>", "<b>Username: datalook</b><br><br>To SourApplezz,<br><br>NOT sure if datalook is really more stupid than you are. If you can not tell the strong correlation between the quality of a graduate program and the quality of an undergraduate program for the same school, you may want to take an IQ test. I bet your IQ is not high.<br><br>Hint: look at any usnews ranking in a specific major, such as business and engineering. See if you can find any notable difference between undergraduate ranking and graduate ranking.<br><br>", "<b>Username: datalook</b><br><br>bmwdan,<br><br>To be fair, Yale does have some super strong programs, such as law, English, history, psycolology, and some arts and humanity programs. Yale is also very good at science and social science, just not top-notched (I mean not top 5). Obviously, some Yale people always over-promote Yale. Mr. PosterX even claimed Yale is #1 in engineering. That is laughable.<br><br>", "<b>Username: Trix-D</b><br><br>Datalook, it's ok if Yale didn't take you. I'm sure the college you're going to is awesome. Cheer up!<br><br>", "<b>Username: datalook</b><br><br>Trix-D, you are funny.<br><br>I never applied for Yale. Yale is not so great in the areas I'm interested in.<br><br>Because datalook pointed out Yale is not top-notched in some areas, he/she must have been rejected by Yale?<br><br>Don't be too naive.<br><br>", "<b>Username: Trix-D</b><br><br>There are a couple support threads if you use the search function for denied students. Some great ones are in the parent cafe.<br><br>", "<b>Username: Trix-D</b><br><br>Oh, and if you have the time, you should really swing back to the \"Yale vs. Harvard: Biology\" thread to answer a couple concerns that people have been posting rather than ignoring it!<br><br>Good luck with all your future endeavors!<br><br>", "<b>Username: truazn8948532</b><br><br>Among the large research Ivies (Harvard, Yale, Columbia, Penn, Cornell, Princeton), Yale is comparably weak in some of the sciences (like physics) but its working to improve that (e.g recruiting more science students).<br><br>For finance, Yale also lags behind its peers (Harvard, Princeton, Wharton, about equal to Columbia). This is not anti-Yale ****, this is simply a matter of fact. Yale has an excellent rep on wall-street as all Ivies do, but it's not Harvard, Wharton, or Princeton when it comes to recruiting.<br><br>What Yale IS KNOWN for however, is its phenomenal history, english, and in general humanities program. One reason Yale has produced a couple of presidents in the recent decades is because about 50 years ago, Yale's president then decided that the University would be focused on PUBLIC SERVICE. In fact, Bush Sr. himself cites Yale as the reason he eventually pursued politics.<br><br>Additionally, Yale is very strong for premed and prelaw. If you want to become a doctor or lawyer, Harvard and Yale are as good as it gets. If you want to become a BANKER/Economist however... IF you can gain admittance into Yale, you can gain admittance into schools that would serve that purpose better.<br><br>", "<b>Username: tetrishead</b><br><br>\"\"Right. Sadly, this cannot be done by you, either. I guess I have to spell this one out for you--you don't represent the \"general opinon.\" Period. What position are you in to know the \"reputation factor\" of these schools?\"\"<br>Well, persumably I'm in a better position than you are since I'm more familiar with the financial industry, but your point is taken and accurate. We'll leave this part of the conversation aside, then.<br>\"\"Internships, etc. Fine. But what makes, for example, Princeton. a no match winner against Yale in job placements?\"\"<br>I'll talk about quality because that's what generally leads to job placement (the alumni networks are about equal, although Yale has more blue bloods). The graduate program in economics at Princeton is stronger quantitatively, ranked better and at the undergraduate level there's greater specialization. AFAIK Yale has no program that allows any specialization in finance, while Princeton has the Bendheim Center. Princeton is also stronger in CS and EE in general, which applies itself to the financial engineering and finance postgraduate degrees (and is generally the hallmark of good quant programs).<br>\"\"You've still avoided in giving me concrete evidence besides your opinion, which I couldn't care less about (just like you couldn't care less about mine).\"\"<br>Schools aren't historically, uh, forthcoming with data about the future career paths of everyone that graduates from X program. They list a couple of top-flight employers who a few kids went to, say some are going to graduate schools here and here and here, and that's about it. My understanding of the perception of Yale compared to Princeton is that they're not on the same level, that Princeton is stronger quantitatively and quant work is a requirement for any form of financial analysis--that last bit is true, regardless of the unreliability of perceptions. Since we have agreed that my understanding of the perception is irrelevant (even though this is one of the few areas where I consider myself knowledgable), it goes back to the part above this.<br>\"\"No, you're right. But you continue to put an anti-Yale sentiment in your comments by repeating that people who think Yale has a better econ program are \"delusional\" or are \"not commenting from Earth.\" Can you really say that is neutral?\"\"<br>That's my assessment from a neutral position. I don't go to any of the schools we're discussing, even though I'm probably applying to all of them RD. Ironically, Yale has been my dream school since I was a kid, and it's my #1 choice. Neutrality does not require you to be watered-down, it can result in a fairly extreme opinion. Yes, people who think Yale has a better economics program than Harvard are delusional, and yes, anyone who seriously ranks Yale as a top 4 school in job placement out of econ in business and bumps out Wharton to a 'second tier' is either literally, certifiably insane, or just completely ignorant. When I saw the post posterX made I was incredulous.<br>\"\"No.\"\"<br>In that context what you just said is basically the equivalent of \"fail,\" and if you know I already don't care about your opinion then you know that I won't exactly consider that no in the firm tone it's written. When I read it I heard Yakkety Sax playing in my mind.<br><br>", "<b>Username: svalbardlutefisk</b><br><br>tetrishead,<br>Yale's economics department, whether by reputation or ranking is better than top 10-15. It is somewhere in the 5-10 (7-9 to be more specific) range. NYU, Columbia and Northwestern do not have definitely better economics departments. Though all are very good, they are approximately equal to Yale (with NYU and Columbia weaker). Chicago, MIT, Berkeley, Stanford, Princeton and Harvard (not in that order) are the top 6 economics departments in the country. There is a strong argument for placing Yale 7th, but there are arguments for others as well. Regardless, though, almost any economist would tell you that Yale is a top-10 program.<br>Of course, this is all graduate level anyway. At the undergrad level, Berkeley immediately becomes weaker because of overall undergrad reputation, size, and other factors. Wharton is stronger if you are talking about employment in finance, but is no better for grad school (in general, academics don't take undergrad business school very seriously). NU and NYU certainly fall behind at the undergrad level (and NYU was already definitely behind at grad school). Columbia may stay level - hurt by weaker prestige, helped by location (though location doesn't help for grad school).<br>I don't see how you can say reputation hurts Yale. The cachet of the school's name gives it tremendous prestige. And, in fact, for getting a job, the reputation of a school will almost always trump the reputation of its economics department. So for that reason, Yale probably has an advantage over Chicago, and is even with MIT, Princeton, and Stanford. Wharton maintains an advantage due to business-school prestige, and Harvard because it is the most famous name in higher education.<br>But basically what this comes down to is that it is ludicrous to say that NYU and NU grads have better opportunities than Yale, and incorrect to say that Columbia grads do. It's also wrong to argue that PSM grads have any significant advantage over graduates from Yale (or that the Wharton/Harvard advantage is particularly large).<br>And lest you think I'm saying this out of personal bias as a Yale student, I'm planing to go to grad school (not in economics), have no interest in finance or finance jobs, and frankly think that most people who want such jobs are uninteresting and arrogant and not people I like having at Yale. If they all wanted to go elsewhere (and fill Yale with people interested in academia and public service, not money-making) it would be fine with me, but I'm not going to pretend it would be better for them.<br><br>", "<b>Username: tetrishead</b><br><br>Northwestern has a better economics program if your goal is working in finance. Their job opportunities, alone, might be inferior to Yale--but the network consists of Kellogg as well, which is leaps and bounds better than YSM. I'm relatively confident they have the better economics program overall, but at the least the fed results and the increasing interaction with Kellogg is enough for me to put Northwestern above Yale. I'm not going to comment on whether or not NYU or Columbia have better economics programs because I surmise NYU is inferior and Columbia is about equal, but my rationale in placing them above Yale is that they're literally <i>right there</i> and they often times have unparalleled opportunities <i>during</i> the school year. I also agree with you that Berkeley largely falls out of the top grouping at the undergraduate level.<br><br>Name is incredibly important in business, even moreso than in academia, so of course I agree with you there. But Stanford and the Claremont's have practically unfettered access to the financials on the West Coast, and I genuinely (for whatever reason) have always held the belief that Claremont and Pomona especially have the most underrated undergraduate economics departments in the country. I don't see Yale have a prestige bonus over Chicago in consulting, finance and business. If anything, I would imagine it's the other way around, while Yale has the prestige in policy, medicine and the humanities. I would agree that it's probably even in name, in business, with the others. And yes, Wharton isn't great for graduate school placement, but the question is job placement, and no one is better than Wharton at that.<br><br>", "<b>Username: Tami</b><br><br>Tetris, I understand. My neutral position is that you are ludicrous and ignorant as well! ;)<br>\"\"When I read it I heard Yakkety Sax playing in my mind.\"\"<br><br>Puahahah! :) That one actually made me laugh out loud. My \"No\" was the fact that I really am not going to take \"life advice\" from some unknown internet poster. I really don't care how you consider my \"no,\" in fact, I take your advice to be quite pathetic. But that's my \"neutral opinion\" again! Tell me--how is calling someone who disagrees with you as \"delusional\" considered neutral? Just because you are in a position of applying to both schools, does not make you so--you are one sided in the sense that you strongly disagree with people who think otherwise. That is hardly neutral. Dictionary time? ;)<br>\"\"My understanding of the perception of Yale compared to Princeton is that they're not on the same level, that Princeton is stronger quantitatively and quant work is a requirement for any form of financial analysis--that last bit is true, regardless of the unreliability of perceptions.\"\"<br><br>Your \"understanding of the perception?\" Based on what? Some narrow scope of your closest friends and peers? Ranking systems? Oh, for god sakes, is it USNEWS?<br><br>Quant work? So you're basically arguing that Princeton > Yale in math, hard sciences, and fnancial analysis requires such skills, and THUS Princeton is better for job placements? That is the <i>most ridiculous</i> evidence for \"better job placement\" I've ever seen presented.<br><br>Is financial analysis skills the only criteria for BETTER JOB PLACEMENT?<br>\"\"Well, persumably I'm in a better position than you are since I'm more familiar with the financial industry,\"\"<br><br>Whatever you say.<br><br>", "<b>Username: tetrishead</b><br><br>\"\"Puahahah! That one actually made me laugh out loud. My \"No\" was the fact that I really am not going to take \"life advice\" from some unknown internet poster. I really don't care how you consider my \"no,\" in fact, I take your advice to be quite pathetic. But that's my \"neutral opinion\" again! Tell me--how is calling someone who disagrees with you as \"delusional\" considered neutral? Just because you are in a position of applying to both schools, does not make you so--you are one sided in the sense that you strongly disagree with people who think otherwise. That is hardly neutral. Dictionary time?\"\"<br>We can go to the dictionary if you like. The end-result of an assessment is only biased if the initial position of the person making the assessment is biased. It is neutrality at the beginning, not at the end, that matters. If we were all neutral in our opinions then we really wouldn't have any opinions.<br>\"\"Your \"understanding of the perception?\" Based on what? Some narrow scope of your closest friends and peers? Ranking systems? Oh, for god sakes, is it USNEWS?\"\"<br>My understanding of the perception comes from time spent on forums where a deluge of financial professionals are members and my perception is partially influenced by what schools are targets for recruitment.<br><br>The USNews is irrelevant when it comes to measurements of job placement out of school, even for their b-school rankings. They aren't necessarily bad at ranking the quality of educations, though.<br>\"\"Quant work? So you're basically arguing that Princeton > Yale in math, hard sciences, and fnancial analysis requires such skills, and THUS Princeton is better for job placements? That is the most ridiculous evidence for \"better job placement\" I've ever seen presented.\"\"<br>Actually I'm basically arguing that Princeton's graduate offerings are superior to Yale's, by proxy that influences the undergraduate offerings since Princeton isn't in the same position as a Berkeley, and their strength in CS and EE give them added clout in the world of finance because quant work, at the end of the day, is what matters. The same strength in CS and EE also pretty much guarantees that you'll find more Princeton graduates in the back office.<br>\"\"Is financial analysis skills the only criteria for BETTER JOB PLACEMENT?\"\"<br>In the financial industry it's a pretty major one. It's also a qualification for what the OP was asking, whch was learning more about econ and finance--and economics very rarely just = finance. In general, does it equal better job placement? Yes and no, quantitative analysis skills are all the rage in managerial analysis and efficacy consulting work. Princeton and Yale are pretty much equal in strength of alumni networks and location RE: proximity to major hubs of business, wouldn't you agree? So what you're left with are these other things we've been talking about, and Princeton is ahead there.<br>\"\"Whatever you say.\"\"<br>That is the way you should have felt from the beginning.<br><br>", "<b>Username: Tami</b><br><br>\"\"We can go to the dictionary if you like. The end-result of an assessment is only biased if the initial position of the person making the assessment is biased. It is neutrality at the beginning, not at the end, that matters. If we were all neutral in our opinions then we really wouldn't have any opinions.\"\"<br><br>Right....this makes sense. So if a high school student is applying to both Princeton and Cornell, but says \"Cornell is much better than Princeton in math, and if anyone disagrees, they are delusional,\" they are neutral?? I mean...wow. I'm speechless. What? Please--explain how \"your stance makes me think you are delusional\" is neutral? You are \"strongly one-sided\" to the fact that Yale is weaker in the economics area. You can't be one-sided and neutral at the same time.<br>\"\"If we were all neutral in our opinions then we really wouldn't have any opinions.\"\"<br><br>What? Again, makes no sense. An opinion that both sides are equally good, would be a neutral opinion.<br>\"\"My understanding of the perception comes from time spent on forums where a deluge of financial professionals are members and my perception is partially influenced by what schools are targets for recruitment.\"\"<br><br>Then I believe your understanding is not quite as solid as you believe it to be. \"Time spent on forums?\" Are you serious? And how do you know what companies \"target\" what schools? Does it mean they do interviews at Stanford and Princeton but not at Yale? Are more recruited from Stanford and Princeton compared to Yale? Data please?<br>\"\"The same strength in CS and EE also pretty much guarantees that you'll find more Princeton graduates in the back office.\"\"<br><br>What? No, it does not.<br><br>I don't even know how to argue your empty statements. You think job placement is so cut-and-dry that I can't help feel a bit of pity. \"Princeton and Yale are pretty much equal in name, so we turn to the rankings of their quantitative programs. Princeton wins there. So Princeton students get better job placements.\" Are you so blind that you don't see a fault in that statement?<br>\"\"So what you're left with are these other things we've been talking about, and Princeton is ahead there.\"\"<br>What about interviews? Writing and oratory skills? Social skills? Personality? For other jobs, how about test scores? Recommendations?<br>\"\"That is correct.\"\"<br><br>Nice changing the above quote to \"That is the way should have felt from the beginning.\" ;)<br>Of course.<br><br>", "<b>Username: tetrishead</b><br><br>\"\"Right....this makes sense. So if a high school student is applying to both Princeton and Cornell, but says \"Cornell is much better than Princeton in math, and if anyone disagrees, they are delusional,\" they are neutral?? I mean...wow. I'm speechless. What? Please--explain how \"your stance makes me think you are delusional\" is neutral? You are \"strongly one-sided\" to the fact that Yale is weaker in the economics area. You can't be one-sided and neutral at the same time.\"\"<br>I wasn't biased prior to the assessment. I was biased after the assessment, like you should be, because I had drawn my conclusion. Had my foundation been biased then the conclusion could be shaky on personal grounds, but it's not.<br><br>RE: the Wharton v. Yale thing, Wharton is basically the Grand Poobah of job placement out of undergraduate. Putting Yale above Wharton, and listing it amongst Harvard and MIT as an equal in economics is delusional. My assessment of that starts with neutrality too. First, is the statement incorrect? Yes, the statement is incorrect because MIT and Harvard have better economics programs, and there are other schools that should be slotted in the top 4 posterX listed above Yale. Second, is the person making the statement delusional? Yes, the person is delusional, because Wharton is the king of the Thunderdome. Two schools enter, one school leaves. Wharton and Harvard have a truce for control of Bartertown. Yale, because of its strength in humanities, will refuse to kill Wharton when it realizes that Wharton is retarded. Subsequently, Yale will be sent into the desert wastes.<br>\"\"What? Again, makes no sense. An opinion that both sides are equally good, would be a neutral opinion.\"\"<br>My statement was more general, which is to say that if all our opinions are neutral then we would envitably not have opinions. If all is equal on varying measurements of its merits, you cannot differentiate between anything, and you would be left with one opinion: there is equality in everything. So I stand by my statement that if all is neutral you cannot have opinion<b>s</b>.<br>\"\"Then I believe your understanding is not quite as solid as you believe it to be. \"Time spent on forums?\" Are you serious? And how do you know what companies \"target\" what schools? Does it mean they do interviews at Stanford and Princeton but not at Yale? Are more recruited from Stanford and Princeton compared to Yale? Data please?\"\"<br>I was expecting that first bit. If years and various friendships with people in the financial industry and time spent watching those already in the industry talk about a multitude of topics isn't sufficient knowledge, then the reality is that no one but the head of a industry advocacy group for the financials would have enough information to draw conclusions. You know what companies target what schools because they openly say what job fairs they go to. <a href=\"http://www.google.com\" rel=\"nofollow\">Google</a><br>\"\"What? No, it does not.\"\"<br>Yes it does. They recruit direct out of the stronger CS and EE programs for ETF and intranet work. Most people in the back offices are recruited straight out of college unless they're going into a managerial position. Yale doesn't have the strength to have a serious amount of recruiting go on for that kind of work.<br>\"\"I don't even know how to argue your empty statements. You think job placement is so cut-and-dry that I can't help feel a bit of pity. \"Princeton and Yale are pretty much equal in name, so we turn to the rankings of their quantitative programs. Princeton wins there. So Princeton students get better job placements.\" Are you so blind that you don't see a fault in that statement?\"\"<br>Princeton students get better job placements in finance because finance is a heavily analytical industry and Yale does not have the quantitative strength of Princeton while all other things are equal. Princeton also has programs Yale does not. Of course job placement isn't that cut and dry, there are thousands of variables in the process from your ability to network to how hard you work to simple luck. Again, Princeton > Yale in economics. Princeton > Yale in graduate economics. Princeton > in CS and EE. Princeton > Yale in spcific financial programs (although yeah, Yale doesn't really have those). With so many boons specific to one industry you logically have to assume they do better in job placement.<br>\"\"Nice changing the above quote to \"That is the way should have felt from the beginning.\" ;)<br>Of course.\"\"<br>I thought it fit better.<br><br>You know I'm secretly in love with you, right?<br><br>Let me ask you something, no one else is online and I'm driving myself crazy trying to get my application essay to stay below 1700 words. I don't like the way this reads:<br>\"..., taking a test I didnt expect and didnt think I could pass satisfactorily.\"<br>Satisfactorily doesn't sound great in that context when I'm reading. How would you restructure that?<br><br>", "<b>Username: Tami</b><br><br>Thanks for the love, sweetie. ;)<br><br>\"Taking an unexpected test that I was not confident about...\" perhaps?<br>\"\"With so many boons specific to one industry you logically have to assume they do better in job placement.\"\"<br><br>No, you don't. Do all hiring companies really see those greater-than signs and agree with you? I doubt it. How is princeton > Yale in econ? Or CS? EE? If you base such things on pointless rankings (completely based on the opinion of what factors the ranker considers important), you consequently also state that employers hold those rankings as factual? I doubt that as well.<br>\"\"You know what companies target what schools because they openly say what job fairs they go to.\"\"<br><br>So, show me them. And also justify how the companies you show me (if any), can be deemed evidence to support the following statement: \"The financial job market of the United States favors Princeton over Yale.\" Since you're so keen on being cut-and-dry, we should say that \"given 1000 companies exist in the US, 501 must explicitly say they like Princeton grads more than Yale grads,\" correct?<br>\"\"I was expecting that first bit. If years and various friendships with people in the financial industry and time spent watching those already in the industry talk about a multitude of topics isn't sufficient knowledge, then the reality is that no one but the head of a industry advocacy group for the financials would have enough information to draw conclusions.\"\"<br><br>You are applying to college now. Years? How many? Also, no, not just industry advocacy groups. The only people who do have enough information are the job recruiters themselves. People who've actually engaged in finance. Who are in the business industry, working right now. CEO's. Employers.<br>\"\"I wasn't biased prior to the assessment. I was biased after the assessment, like you should be, because I had drawn my conclusion. Had my foundation been biased then the conclusion could be shaky on personal grounds, but it's not.\"\"<br><br>Your sentence is so convoluted, that it really detracts from the argument. Yes, you drew your conclusion. I called your conclusion non-neutral. You said you were in a neutral position. But how so, exactly? Because you are applying to both schools? Who cares if you stand in a neutral place when the words you type are one-sided? Answer me the question I've been consistently asking: How is \"your stance makes me think you are delusional\" neutral?<br><br>", "<b>Username: tetrishead</b><br><br>Your sentence helps me think of different structures, but in the context of what I'm writing about satisfactory is the word I'm looking to get in over satisfactorily just because satisfactorily sounds weird. Princeton is better than Yale in economics because it has a heavier quant focus, and yes, because rankings say so. As far as CS and EE, well, I kind of thought that was common knowledge. How is Yale better than anyone else in the humanities, then? Princeton has programs Yale does not, a lot of the recruiting that goes on for the back office work is going to be direct out of those programs. Back office is different than what we're talking about anyway, but I thought I'd throw it in there.<br><br>If you honestly believe I'm going to go through the websites of 50+ companies looking for the schools they target so I can show them to you you're nuts. If you don't want to believe me then you can go ahead and do it yourself, navigate to most of their HR/\"Job Opportunity\" pages and look and see if they have anything for college students. If they don't, you'll have to do more digging, but most of them furnish a list. The financial job market of the United States favors Princeton over Yale because for any intangible Yale could have to compensate for weaker programs that correlate directly with the financial industry (alumni network, resources, prestige, internship opportunities) Princeton is not at a disadvantage.<br><br>Four years, and yes, pretty much just industry advocacy groups. HR does the filtering, for entry-level positions that matter managers do the interviews themselves. Managers will only care what reaches their desk, HR is not engaged in finance although they're given directives. This, obviously, does not apply at all companies, but it's how it works in general. The only people who would have enough information from varying sources would be a consulting firm brought in to audit the hiring process or an advocacy group.<br><br>When you say my conclusion isn't neutral you're not <i>really</i> saying my conclusion isn't neutral, because most conclusions aren't neutral so it wouldn't make any sense. What your saying is that my conclusion is inaccurate, and it's a result of problems with impartiality. I was not biased to begin with, I began from neutrality. I had no reason to believe &lt;school> was better than Yale, I formed the opinion on my own, over time, with information and opinions from varying sources. My conclusion isn't neutral because the conclusion I came to favors one over the other. Expecting neutrality from every conclusion, as I said, doesn't make sense.<br><br>", "<b>Username: Tami</b><br><br>Uhm, no. I'm pretty sure I know what I'm saying, and I am saying that your conclusion isn't neutral.<br><br>All you are stating in that long paragraph is that conclusions cannot be neutral, so expecting neutrality makes no sense. You starting from a neutral position has no bearing on this argument what so ever, because that is not the issue here. My statement was that calling the opposition delusional is not neutral. You cannot be neutral and have an opposition.<br><br>No one starts out impartial to something. But someone who says \"people who think Yale is better are delusional\" connotes anti-Yale sentiments. How is that neutral? It matters not if you started out neutral, or are in a position of neutrality as a student, when what you say is anti-Yale. That was my statement from the beginning, and that is my statement now. So perhaps we finally agree--you are right NOW, with time PASSED, have formed the conclusion which is negative towards Yale.<br>\"\"Expecting neutrality from every conclusion, as I said, doesn't make sense.\"\"<br><br>And...this is completely irrelevant, as no one here expected such from 'every conclusion.'<br>\"\"As far as CS and EE, well, I kind of thought that was common knowledge.\"\"<br><br>So...based on assumptions. Not factual. Got it. Moving on.<br>\"\"How is Yale better than anyone else in the humanities, then?\"\"<br><br>Uhm...I never said that. Yale's humanities are awesome. So is Princeton's. Stanford's is amazing. Harvard's rules. Northwestern is great, especially their journalism which is unbeatable. I've never used the word \"better\" in this argument for pro-Yale. They all have their strengths and weaknesses I'm sure, but I cannot judge, for I am not a student who attended all the schools.<br>\"\"Princeton has programs Yale does not, a lot of the recruiting that goes on for the back office work is going to be direct out of those programs. Back office is different than what we're talking about anyway, but I thought I'd throw it in there.\"\"<br><br>\"A lot of recruiting...\" again, a blank statement which I'm guessing is again, based on assumption. So I'll throw it out.<br><br>I was not asking you to browse 50+ pages; I was making the point that no such source exists. None. No factual data, because it is all subjective. You've missed my point again, but I'm getting used to that, love. ;)<br><br>", "<b>Username: tetrishead</b><br><br>Sorry for the delay in excitement, I was wrapping up my essay. 1738 words. I was aiming for &lt;1400. There's not enough time for me to try and split it into two separate topics, and I had to go with satisfactorily. Very disappointing. Ah well, any school that won't read 1738 words isn't a school I would have gotten into anyway.<br><br>No, that's right, I'm not neutral. I like to think I have a well-informed opinion. But questioning the neutrality of an opinion is by proxy questioning the basis of that opinion. I am saying that the foundation for my thought was not faulty, or pre-determined by some bias. Yes, okay, we agree now.<br><br>No, actually, the back office thing isn't based on assumption. The prerequisite is work in CS or EE, and most (yes, not <i>all</i>, I apologize that I cannot make everything absolutely firm for you) of the people working in the back office are recruited out of college. A college with better EE and CS programs, therefore, is going to have better recruitment into these positions. If you want to argue that Yale is on-par with Princeton in CS and EE then that's a discussion you're going to have to have with yourself because it's going to end the same way this one did.<br><br>The resource exists. Almost every company in the business world has a page where it'll say what schools it either tries to directly recruit from or attends job fairs at, usually under the heading of job opportunities -> college students. Just because I'm not going to spend time quoting the target schools of every company doesn't mean these resources do not exist. With your logic, for all I know Paris Hilton doesn't exist because I haven't taken the time to fly to California and look at her in person.<br><br>", "<b>Username: Tami</b><br><br>I did search for it, but cannot find a single one that supports one school over Yale explicitly.<br><br>You do not have to make anything absolute, but how can you use words like \"most\" with no basis of said majority backing you up? I've only asked for one piece of objective evidence, but you have given me none! Not even one objective piece! :)<br><br>Oh, it's not based on assumption? What exactly IS IT based on that's actually valid?<br><br>", "<b>Username: tetrishead</b><br><br>You've backed me into a great corner. The correct response to your two statements, the first one being about recruitment and the second one being about back office work, both require I do things I can't or don't want to do. The first requires me to quantify the quality of undergraduate educations (which is effectively what this site is dedicated to), which to do completely is impossible beyond using rankings you consider irrelevant, and the second requires that I go through job listings and show you that most back-office work is at the entry-level and managerial positions are more focused on coordinating the back-office and middle/front, which is a lot less tech work and a lot more general management. You have to take my word for the second because I'm not going through that process for this, and we have to debate the first.<br><br>You've managed to reach the crux of the discussion--which is that qualifying certain programs at undergraduate institutions is impossible because there are too many variables, and it invalidates most of what happens on this board anyway. I commend you for that. You've effectively won this argument, and in the future I'll try to steer away from Wellesley women and back towards those from Mount Holyoke.<br><br>So, what do you think about the 1700 word problem?<br><br>", "<b>Username: Tami</b><br><br>*sigh* I do not consider it winning an argument. In fact, all I try to point out in all these \"better than\" \"worse than\" threads is that comparisons are pointles and only damage people's feelings. They are all wonderful instutions--HYPMS, Wharton...all golden apples which only a few blessed and lucky will get to taste. (And perhaps you will too, tetrishead).<br>\"\"In the future I'll try to steer away from Wellesley women and back towards those from Mount Holyoke.\"\"<br><br>That basically made my day. xD<br><br>", "<b>Username: CJinCH</b><br><br>Could someone compare Yale to Amherst and Williams for economics? Are these smaller liberal arts equally employable?<br><br>", "<b>Username: Remi10001</b><br><br>Keep in mind Tami that some people will inevitably have to choose which apple to bite into, and without comparisons from numbers or students, we may be plunking our teeth into an apple that has a skin as glorious as the rest but a core that doesn't quite agree with our stomach's preconceptions.<br><br>", "<b>Username: slipper1234</b><br><br>Once again CJinCH, these are two very different things. Econ credibility: Amherst/ Williams will get you into the best grad schools, at the same rate at the Ivies. When it comes to recruiting Williams does incredibly well, almost as well as Dartmouth or Princeton. Amherst a little worse, as well as say a Brown or Cornell.<br><br>", "<b>Username: kyzan</b><br><br>Tetrishead, didn't you get bashed enough in the \"Will Ivies Expand Class Size\" thread to figure out that you're wrong? Your statement that Claremont Colleges and UCB grads have better job placement than Yale grads is absolutely apocryphal. From your posts in both threads, you sound like a broken Yale reject who is trying to get into the Ivy-League but can't. Please spare me the ignorance. If you really know something about Wall Street, then you would also know that the top tier schools for bulge bracket firms, management consulting groups, Hedge Funds, etc. consists of (in no particular order) Harvard, Yale, Wharton, Princeton. To put Yale in the same league as Chicago and CMU just shows the degree of your stupidity. Please stop disseminating ********.<br><br>", "<b>Username: tetrishead</b><br><br>\"\"Tetrishead, didn't you get bashed enough in the \"Will Ivies Expand Class Size\" thread to figure out that you're wrong?\"\"<br>I got bashed in that thread? Really?<br>\"\"Your statement that Claremont Colleges and UCB grads have better job placement than Yale grads is absolutely apocryphal.\"\"<br>Claremont has a bonus by virtue of locale, so does Stanford. UCB has one of the best quantitative programs in the country, although at the undergraduate level it's really the same as any state university, which is to say that graduates are going to vary greatly in their skills.<br>\"\"From your posts in both threads, you sound like a broken Yale reject who is trying to get into the Ivy-League but can't.\"\"<br>Uh huh.<br>\"\"Please spare me the ignorance. If you really know something about Wall Street, then you would also know that the top tier schools for bulge bracket firms, management consulting groups, Hedge Funds, etc. consists of (in no particular order) Harvard, Yale, Wharton, Princeton. To put Yale in the same league as Chicago and CMU just shows the degree of your stupidity. Please stop disseminating ********.\"\"<br>Yeah, if you're leaving MIT and Williams out of that mix I'm going to go ahead and redirect the whole \"stupidity\" thing back to you, especially with the record Williams has in consulting. If you're talking about graduate placement too, and you seriously think Chicago is a tier below anyone out of GSB or the joint fin econ program, you're just wrong. If you \"really knew something about Wallstreet\" you'd know college graduates with &lt;2 years of work experience rarely if ever get recruited by hedge funds, so maybe you should stop disseminating ********?<br><br>", "<b>Username: kyzan</b><br><br>Whatever, I don't care much for your opinions because you are patently wrong. Yes you did get bashed, why don't we invite a few people from that thread over?<br><br>\"Claremont has a bonus by virtue of locale, so does Stanford. UCB has one of the best quantitative programs in the country, although at the undergraduate level it's really the same as any state university, which is to say that graduates are going to vary greatly in their skills.\"<br><br>You weaseled your way out of my accusation. Yale grads still have better job placement than both of them on average. Who's wrong now?<br><br>\"If you \"really knew something about Wallstreet\" you'd know college graduates with &lt;2 years of work experience rarely if ever get recruited by hedge funds, so maybe you should stop disseminating ********?\"<br><br>That doesn't mean that none will be recruited. I personally know a few who went straight into hedge funds right out of college. Just because you don't have the qualifications to work in such a high-profile industry doesn't mean others don't.<br><br>And yes I am leaving MIT and Williams out of the top tier because they churn out less bankers/consultants and aren't as prestigious as Harvard, Yale, Princeton, and Wharton on Wall Street.<br><br>Why don't you show some qualifications on the subject. Oh wait, you don't have any. When you get into one of these schools, then maybe you can talk.<br><br>", "<b>Username: tetrishead</b><br><br>\"\"Whatever, I don't care much for your opinions because you are patently wrong. Yes you did get bashed, why don't we invite a few people from that thread over?\"\"<br>It's good to know you're available for commentary. Are you going to send them e-vites or have something more professional hand-delivered? I'm not going to pay for it, but if you want to do it you feel free. Make sure you sign both our names, I don't want to look rude.<br>\"\"You weaseled your way out of my accusation. Yale grads still have better job placement than both of them on average. Who's wrong now?\"\"<br>What average is that?<br>\"\"That doesn't mean that none will be recruited. I personally know a few who went straight into hedge funds right out of college. Just because you don't have the qualifications to work in such a high-profile industry doesn't mean others don't.\"\"<br>Name three people from the graduating class of Yale (or Princeton, or anywhere else for that matter, as long as it's sale side or analysis work--ETF/intranet/whatever tech stuff isn't what we're talking about here) 2007 that went into hedge funds who didn't get their jobs as a result of (a) nepotism, (b) working for the companies during their undergraduate years. I'll wait.<br>\"\"And yes I am leaving MIT and Williams out of the top tier because they churn out less bankers/consultants and aren't as prestigious as Harvard, Yale, Princeton, and Wharton on Wall Street.\"\"<br>I'd like to see you do a sampling of the financials in the Northeast to get firm numbers on how many people you'll talk to will be from Stern or Columbia compared to... Well, pretty much any other school. It would be cute if you'd do the same thing on the West coast and see who's from the Claremonts, Stanford and the UC's. I think you'd be surprised by the results. And by surprised, I mean you have no idea what the results would be now, so basically whatever you found out would be a step in the right direction RE: knowledge.<br><br>Remember, knowledge is power. And only you can prevent forest fires.<br>\"\"Why don't you show some qualifications on the subject. Oh wait, you don't have any. When you get into one of these schools, then maybe you can talk.\"\"<br>What, precisely, would be your qualifications other than incredibly insightful forum commentary? I, too, am insightful, and I would like to be insightful with you. We could fight crime.<br><br>", "<b>Username: bmwdan13</b><br><br>This thread is getting ridiculous, just when it seemed that the conflict was at least agreed to have ended.<br><br>", "<b>Username: kyzan</b><br><br>\"Name three people from the graduating class of Yale (or Princeton, or anywhere else for that matter, as long as it's sale side or analysis work--ETF/intranet/whatever tech stuff isn't what we're talking about here) 2007 that went into hedge funds who didn't get their jobs as a result of (a) nepotism, (b) working for the companies during their undergraduate years. I'll wait.\"<br><br>You're right. They got their jobs due to connections and internships. However, that still proves me right when I clearly stated earlier that there are undergrads who go straight into hedge funds.<br><br>If you don't know your averages by now, I think you should go back to elementary school. But then again, maybe you are the one who should be training to prevent forest fires. We won't miss people like you in higher educational institutions. Really.<br><br>\"I'd like to see you do a sampling of the financials in the Northeast to get firm numbers on how many people you'll talk to will be from Stern or Columbia compared to... Well, pretty much any other school. It would be cute if you'd do the same thing on the West coast and see who's from the Claremonts, Stanford and the UC's. I think you'd be surprised by the results. And by surprised, I mean you have no idea what the results would be now, so basically whatever you found out would be a step in the right direction RE: knowledge.\"<br><br>Why don't you go right ahead? I'll give you a cookie when you're done to make you feel better when you realize that the average Stern grad places at a less prestigious investment bank than the average HYPWharton grad.<br><br>Then again, why don't you go to career services at HYP+Wharton. Maybe they can tell you how many people they send to bulge bracket firms.<br><br>\"What, precisely, would be your qualifications other than incredibly insightful forum commentary? I, too, am insightful, and I would like to be insightful with you. We could fight crime.\"<br><br>Not together we can't. You're counterintuitive and worst, just wrong sometimes. Look, I'm not usually arrogant, but if you keep on insisting that you schools such as Stern, UCB, Chicago, or Williams have better job placements than Yale, I'm going to go out of my way and stereotype you as someone who probably isn't getting into HYP and now is having to deal with a drastic inferiority complex. You, out of all people, as business inclined as you are, should realize that incessantly repeating incorrect statements doesn't make them true.<br><br>So, to bring my post to a reconciliatory note, I'm not saying that Stern, UCB, or Chicago or whatever have bad job placements. I agree that grads from those schools are rather fortunate in competing for jobs against just about every other tier of schools besides HYPSMWharton (and yes, Yale is included).<br>If your previous posts, you say that Yale's graduate econ department is relatively weak compared to HPMSChicago. I would agree. But grad econ rankings and undergrad job placement are completely irrelevant in what we are talking about.<br><br>", "<b>Username: tetrishead</b><br><br>\"\"You're right. They got their jobs due to connections and internships. However, that still proves me right when I clearly stated earlier that there are undergrads who go straight into hedge funds.\"\"<br>Oh, well... If they got their jobs due to internships, and hedge funds actively recruit college students in the same way the rest of the financial industry does, then I guess no one has ever gotten a job at UBS without an internship out of college? I mean, it's obviously the same thing, and it's not incredibly rare, and pretty much hedge funds are exactly the same as investment banks. Experience is good, but they love kids out of undergrad. I am glad you have cleared this up for me, because for some reason I used to falsely believe that it was incredibly rare for hedge funds to actively recruit students with no work experience they had no ties to.<br>\"\"If you don't know your averages by now, I think you should go back to elementary school. But then again, maybe you are the one who should be training to prevent forest fires. We won't miss people like you in higher educational institutions. Really.\"\"<br>What average? You have no average. You have no numbers. Where's the statistic for how much a Yale graduate in economics makes in the first three years out of school compared to a graduate from Chicago, or MIT, or Williams?<br><br>I'm pretty sure in elementary school when they teach basic arithmetic they don't say \"well, two times three is six. Why? Because.\" I love this Tami argument, it's so much better than mine was, I'm amazed I survived on sheer stubbornness as long as I did.<br><br>You have no numbers to prove anything you say. You have no rankings to prove anything you say (and, the only rankings we could use would be graduate rankings, where the Yale lags behind the rest--although I kind of think those graduate rankings are ******** anyway). You have no industry data to prove anything you say. So... Again, what we're left with is insight, and the two of us fighting crime.<br>\"\"Why don't you go right ahead? I'll give you a cookie when you're done to make you feel better when you realize that the average Stern grad places at a less prestigious investment bank than the average HYPWharton grad.\"\"<br>According to who? Where? What, when, why, how? What's the average? What's the sampling size you derived the average from?<br><br>Do you work in the financial industry? Are you a professional headhunter? Do you have your own HR company? Are the head of a career services department at a major university?<br>\"\"Not together we can't. You're counterintuitive and worst, just wrong sometimes. Look, I'm not usually arrogant, but if you keep on insisting that you schools such as Stern, UCB, Chicago, or Williams have better job placements than Yale, I'm going to go out of my way and stereotype you as someone who probably isn't getting into HYP and now is having to deal with a drastic inferiority complex. You, out of all people, as business inclined as you are, should realize that incessantly repeating incorrect statements doesn't make them true.\"\"<br>Actually, my initial claim was that Princeton has a better undergraduate economics program than Yale, and so do a few others (Harvard, Wharton, etc). The job placement claim was that Wharton has better job placement than just about anyone. The Stern/Columbia thing is a result of access, because their graduates are generally able to work during the year, even if it's just part-time, which is something very few other schools can match. I've never said UCB or Chicago have better job placement (and I think their undergraduate offerings are not nearly as strong as their amazing graduate programs), although I probably alluded to it with Williams. My rankings on page one were my personal views of a combination of job placement and overall quality of departments. Which is generally what people are looking for on this forum--opinions. I think it's why that chance subforum exists.<br>\"\"So, to bring my post to a reconciliatory note, I'm not saying that Stern, UCB, or Chicago or whatever have bad job placements. I agree that grads from those schools are rather fortunate in competing for jobs against just about every other tier of schools besides HYPSMWharton (and yes, Yale is included).<br>If your previous posts, you say that Yale's graduate econ department is relatively weak compared to HPMSChicago. I would agree. But grad econ rankings and undergrad job placement are completely irrelevant in what we are talking about.\"\"<br>I understand we're on page four so you're a little lost now. We're talking about, (1) in response to the OP: how does Yale's econ program compares to Harvard, (2) in response to the OP: Economics or Economics and Mathematics, which is better for one who wants to more econ and finance (I guess econ and math for finance if they do a lot of statistical analysis, presumably economics for economics), (3) from later posts: the job placement out of the undergraduate program, (4) from later posts: the quality of the undergraduate program.<br><br>This is still funny to me because I intend to go into an econ program and if I had to choose between any of these schools and Yale I would choose Yale, but I'm not enough of a fanboy to think that Yale would get me better job placement in the financial industry out of college than Wharton. We've come full-circle: first I was arguing on things that could not be measured (the quality of X undergraduate program compared to X undergraduate program), and now you're arguing the same thing while I'm saying you can't possibly know. This is bizarre.<br><br>", "<b>Username: bmwdan13</b><br><br>Truce, everyone?<br><br>", "<b>Username: tetrishead</b><br><br>^ Only if someone acknowledges my Yale v. Wharton Thunderdome analogy as being as funny as I thought it was.<br><br>", "<b>Username: pacificbreeze</b><br><br>I got my master degree from china and came to the states 20 years ago to pursue my PhD in a state university. I was pleasantly surprised by all the opportunities and resources the university offerred. You are all incredibly bright kids, any one of these top schools will lead you to a great future as long as you fully take advantage of it. If you have a luxury to choose among these top tiered schools, I would say the selection should be based on the school cultures. Which one you think you should be most happy to be there. A sucessful social life in the colleage is as important as a rigorous academic program. Therefore, I do not see any major point to compare yale and harvard or princeton academically. Instead, I do think one should think more about the school's culture and in which school you think you would be happier. Remember happiness can produce long-term satisfaction.<br><br>", "<b>Username: kyzan</b><br><br>\"Oh, well... If they got their jobs due to internships, and hedge funds actively recruit college students in the same way the rest of the financial industry does, then I guess no one has ever gotten a job at UBS without an internship out of college? I mean, it's obviously the same thing, and it's not incredibly rare, and pretty much hedge funds are exactly the same as investment banks. Experience is good, but they love kids out of undergrad. I am glad you have cleared this up for me, because for some reason I used to falsely believe that it was incredibly rare for hedge funds to actively recruit students with no work experience they had no ties to.\"<br><br>Wow, no matter how you twist your lies, I am still right. I stated there are undergrads who go straight to hedge funds. You said there wasn't. You are succinctly wrong. Please shut up because your pathetic sarcastic play doesn't make it better.<br><br>\"I've never said UCB or Chicago have better job placement (and I think their undergraduate offerings are not nearly as strong as their amazing graduate programs), although I probably alluded to it with Williams. My rankings on page one were my personal views of a combination of job placement and overall quality of departments.\"<br><br>Now to refute this argument. This is what you said on page 1 post 8.<br><br>\"Close, but no cigar. (my ranking is only based on job placement, though)<br>Quote:<br>1. Wharton, Harvard, Columbia, Princeton, MIT<br>2. Stanford, Dartmouth, Claremont Colleges, UCB<br>3. Northwestern, Chicago, CMU, Yale\"<br><br>Good work on lying to us. It doesn't get any more clear cut than this. I don't see you stating undergrad department quality here. But since you rely on your \"insight,\" whom I am to prove you wrong? Again we can't fight crime together because now you spew spurious statements.<br><br>I understand this is a thread for opinions, but your opinions are wrong, and the OP obviously wants to find the truth, not a deranged version of it.<br><br>\"We're talking about, (1) in response to the OP: how does Yale's econ program compares to Harvard, (2) in response to the OP: Economics or Economics and Mathematics, which is better for one who wants to more econ and finance (I guess econ and math for finance if they do a lot of statistical analysis, presumably economics for economics), (3) from later posts: the job placement out of the undergraduate program, (4) from later posts: the quality of the undergraduate program.\"<br><br>I think you are a little lost. I'm not responding to the OP. I am responding to the statements you made about Yale having worst job placement than, according to your little list, Stanford, Dartmouth, Claremont, and UCB, which is clearly ludicrous. Your insight or whatever else you want to call it is pathetic. You're one of those ignorant little kids who know nothing about investment banking, peruse a finance forum, and then act like an authority figure around here propagating misconceptions which you defend so readily with your \"insight.\" Spare us the bull-$****. Seriously. When you've actually worked in the finance industry and seen profiles of hedge fund managers or MDs of investment banks or PE principals, then maybe you can talk. Because I have. And no, I didn't get the job through connections. Maybe then you'll open your tiny eyes and see that in the high profile finance industry, HYPWharton are king.<br><br>Oh, one more thing. Your statement:<br><br>\"The job placement claim was that Wharton has better job placement than just about anyone.\"<br><br>is also incomplete. Where are your numbers? Did you just make this up because I'm pretty sure you did. Everyone knows that Havard grads have better placement with consulting firms. Look on MBB websites.<br><br>", "<b>Username: tetrishead</b><br><br>Hey, you're back! Exciting. (edit: ^^ thanks for editing in that last bit. And yes, you know, you just totally rocked my world on that Wharton thing. I forgot that consulting firms make up 95+% of the total workforce in anything that can be considered \"business.\" Boy do I feel stupid.)<br>\"\"Wow, no matter how you twist your lies, I am still right. I stated there are undergrads who go straight to hedge funds. You said there wasn't. You are succinctly wrong. Please shut up because your pathetic sarcastic play doesn't make it better.\"\"<br>No, you're not right. The reality is that any undergraduate can basically get into any facet of the financial industry without working for those companies directly beforehand, and without having nepotism play a role. That is the statement I made, that statement stands. Hedge funds are not the same, and you should know that since you're clearly a very experienced super professional who knows a lot more about the world than I, because unlike me, you don't... just post on forums... hmm...<br><br>When you can get back to me on naming three (hell, make it two. Not one though, I have to make allowances for Neo) graduates from any class of any school who went into hedge funds without working for them for years or having familial relations inside the funds you can call whatever I've said a lie. It's fine if they worked for other companies in the financial arena, just not the hedge fund directly. And no little tricks with taking some 35 year old guy who worked in finance for 10 years and went back to get his degree. Until then you can do that, are both wrong and full of **** on the hedge fund issue, which raises questions about your knowledge of anything else. Hedge funds don't actively recruit from ugrad like the rest of the financial industry.<br>\"\"Good work on lying to us. It doesn't get any more clear cut than this. I don't see you stating undergrad department quality here. But since you rely on your \"insight,\" whom I am to prove you wrong? Again we can't fight crime together because now you spew spurious statements.\"\"<br>Wow, you're right, I did say it was based on job placement. Okay, I'll go back to stubborn--I stick with my rankings.<br><br>Additionally, you can't refute them. That must be frustrating, huh? I mean you can refute them--but you have to do the same thing I do, which is just use opinion. You can't even get data from <i>biased</i> sources to back up anything you're saying.<br>\"\"I think you are a little lost. I'm not responding to the OP. I am responding to the statements you made about Yale having worst job placement than, according to your little list, Stanford, Dartmouth, Claremont, and UCB, which is clearly ludicrous.\"\"<br>Really, how is it ludicrous? Prove it's ludicrous. You have nothing to back up your statements. No statistics, no nothing. You say you have history in the industry, and while that doesn't mean you are at all familiar with the hiring process besides going through it I don't even believe you in that.<br>\"\"Your insight or whatever else you want to call it is pathetic. You're one of those ignorant little kids who know nothing about investment banking\"\"<br>What do you know about investment banking? What is an investment bank? What is the overall goal of an investment bank? How does it achieve that goal? What makes them different from a hedge fund? What are the various jobs people do in investment banks?<br>\"\"peruse a finance forum, and then act like an authority figure around here propagating misconceptions which you defend so readily with your \"insight.\" Spare us the bull-$****. Seriously. When you've actually worked in the finance industry and seen profiles of hedge fund managers or MDs of investment banks or PE principals, then maybe you can talk. Because I have. And no, I didn't get the job through connections. Maybe then you'll open your tiny eyes and see that in the high profile finance industry, HYPWharton are king.\"\"<br>Really? You've seen profiles of people? Me too. They're generally publicly available on corporate websites, no? You have what? You've seen profiles, or you've worked in the industry? For who? How long? Doing what?<br><br>Do you have those averages yet of what Yale graduates make? Do you have any firm numbers? Or are you just doing the same thing I'm doing--talking? Because, as I see it, the singular difference between you and me is that I'm willing to admit what I'm saying is an opinion, but you seem to believe you're a big shot with a tremendous amount of experience in the financial industry (which clearly lines up with someone who regularly posts on this internet forum, as I'm sure I just missed the subforum here primarily dedicated to competing with nuclearphynance) and therefore you know--KNOW--that Yale has a better undergraduate economics program than Stanford, Dartmouth and the Claremont's, you KNOW that Yale has better job placement in the financial industry, and you KNOW that they make more money.<br><br>I'm just trying to ascertain how you came to know all this.<br><br>", "<b>Username: kyzan</b><br><br>\"(edit: ^^ thanks for editing in that last bit. And yes, you know, you just totally rocked my world on that Wharton thing. I forgot that consulting firms make up 95+% of the total workforce in anything that can be considered \"business.\" Boy do I feel stupid.)\"<br><br>Did I say they did? Oh no I didn't. But thanks for putting lies into other people's mouths. You must be used to it by now.<br><br>\"When you can get back to me on naming three (hell, make it two. Not one though, I have to make allowances for Neo) graduates from any class of any school who went into hedge funds without working for them for years or having familial relations inside the funds you can call whatever I've said a lie.\"<br><br>Maybe you should take intro to math proofs 101. I know people who have gone straight into hedge funds from undergrad satisfying the requirements you have mentioned. You claim that no undergrad from all the colleges in the United States can break into a hedge fund without prior work experience or family connections. Why don't you go out there and prove me wrong? Maybe you should get out there and ask people. I guarantee a handful will say they have. Open your provincial eyes, my friend. Just because you don't think you can do it doesn't mean other people can't.<br><br>\"Wow, you're right, I did say it was based on job placement. Okay, I'll go back to stubborn--I stick with my rankings.\"<br><br>So you intentionally lie to us and then expect us to believe whatever else you say? What do you think this is, Jerry Springer? Give me a break, you just lost what little integrity you have over the internet.<br><br>\"Do you have those averages yet of what Yale graduates make? Do you have any firm numbers?\"<br><br>Why don't you go to career services at UCB or Claremont college and look at their numbers compared to Yale's if you want them so desperately. Do a little math--yes even with averages. If you can't, I totally understand. Daddy can be right there to guide you along the process.<br><br>\"What do you know about investment banking? What is an investment bank? What is the overall goal of an investment bank? How does it achieve that goal? What makes them different from a hedge fund? What are the various jobs people do in investment banks?\"<br><br>We both know this is a meaningless question. Even if I didn't know, I would easily just ask a friend or look at a variety of internet sources. I have industry experience. What experience do you have? I doubt we can even believe you given your tendency to lie.<br><br>\"Because, as I see it, the singular difference between you and me is that I'm willing to admit what I'm saying is an opinion, but you seem to believe you're a big shot with a tremendous amount of experience in the financial industry\"<br><br>Again, you are inclined to fabricate perceptions of other people. Did I ever say I was a big-shot? I'm simple telling you that you're wrong. Everybody has opinions. You can have an opinion that the Earth is flat. I am justified in indicating that you are incorrect.<br><br>Judging from you string of posts in the \"Depressed over Ivy League Rejection that has yet to come\" and your vehement arguments that Ivies have an obligation to the public to expand their class sizes in the \"Should Ivies Expand Class Size\" thread, I am going to console you. Don't worry, not everyone gets in super-selective colleges. I'm sorry that you got rejected from Yale or whatever, but please spare us your indignation. Just don't ask me to supersize my order combo whenever I'm ordering my Big Mac.<br><br>", "<b>Username: tetrishead</b><br><br>\"\"Did I say they did? Oh no I didn't. But thanks for putting lies into other people's mouths. You must be used to it by now.\"\"<br>You're offsetting my claim that Wharton has the best placement by saying that Harvard places better into consulting (while asking me to go visit websites and being unable to produce anything yourself). That's the equivalent of saying consulting is all there is, because if Wharton places better everywhere else then Harvard wouldn't actually place better, would they? I'm just extrapolating from your statements, since they're rather lacking in substance.<br>\"\"Maybe you should take intro to math proofs 101. I know people who have gone straight into hedge funds from undergrad satisfying the requirements you have mentioned.\"\"<br>One time I met Cuba Gooding Jr. in a mall. I didn't get his autograph and I don't have any picture of the two of us together, though, so you're just going to have to take my word on that.<br>\"\"You claim that no undergrad from all the colleges in the United States can break into a hedge fund without prior work experience or family connections. Why don't you go out there and prove me wrong?\"\"<br>How would I prove you wrong? I would... actively not have connections or prior work experience and then not get recruited by a hedge fund? That... Is probably something I can do, I guess? Can you wait here for 5 years until I come back and tell you what happened?<br>\"\"Maybe you should get out there and ask people. I guarantee a handful will say they have. Open your provincial eyes, my friend. Just because you don't think you can do it doesn't mean other people can't.\"\"<br>Well, I mean, you're guaranteeing me that a few people will say they have. You're also guaranteeing me that Stern and Columbia graduates don't place as well in the financial industry as Yale out of undergrad, that Yale has a better undergraduate program than Stanford, UCB, Claremont's, Columbia, Stern, Dartmouth, Chicago and... Am I forgetting someone? Probably. I don't think you guaranteed anything else, you certainly haven't guaranteed that you have work experience (or do you not? because that sentence was kind of convoluted) in the industry, I mean...<br><br>I don't know. I'm very trusting. I'm like a young child, and you have tickets to Hannah Montana. I guess I'll just have to get into your van.<br><br>...<br><br>Why are the windows covered with trash bags?<br>\"\"We both know this is a meaningless question. Even if I didn't know, I would easily just ask a friend or look at a variety of internet sources. I have industry experience. What experience do you have? I doubt we can even believe you given your tendency to lie.\"\"<br>It's so not a meaningless question. It was meaningless question<b>s</b>. There were more than one. You are minimizing my ability to be meaningless, and I don't appreciate that. Yes, I have lied about, uh, basing my personal rankings on quality and job placement when it was really just job placement... Also... I lied about... I lied about Yale getting sent to the desert wastes. You still can't answer anything I end with a question mark without either (a) dodging it or (b) trying to \"turn it around,\" and that's not really a good sign. That's just my opinion though. If I had to rank signs based on job placement, you'd be way down the list.<br>\"\"Judging from you string of posts in the \"Depressed over Ivy League Rejection that has yet to come\"\"\"<br>Did you read the posts? Because you know pretty much all of them were sarcastic and after the whole stupid drama had happened, right?<br>\"\"and your vehement arguments that Ivies have an obligation to the public to expand their class sizes in the \"Should Ivies Expand Class Size\" thread,\"\"<br>They have an obligation to the public because their existence is a result of tax exemptions, federal grants (from tax money) and in many cases authorization from state legislatures. Population grows, they too must grow at least slightly to help ease the burden the state schools they have so many more resources than will have to bear. You know who else agrees with me that they have an obligation to the public? They do. And the Senate does, and I think the House does too. Not too sure what the President's view on it is, though.<br>\"\"I am going to console you. Don't worry, not everyone gets in super-selective colleges. I'm sorry that you got rejected from Yale or whatever, but please spare us your indignation. Just don't ask me to supersize my order combo whenever I'm ordering my Big Mac.\"\"<br>Is this where I'm impressed that you're in an ivy league school you haven't yet mentioned being in? I would think, at the ivy league school you attend that you haven't yet mentioned being in, they would teach you to... I don't know, read **** or something? Just because you see a faulty correlation between my arguments in the ivy class thread and some non-existent insecurity (I'm guessing?) about getting into an ivy league school doesn't mean you're actually right. I think you were saying that above about me. Still waiting for numbers, by the way. On something. Anything. Give me the Play 4, I don't care.<br><br>", "<b>Username: bmwdan13</b><br><br>Hey, you should jump over to the toilet paper thread and blow off some steam there.<br><br>", "<b>Username: kyzan</b><br><br>I have to admit, even your grotesque sense of humor gives me a few chuckles. Kudos.<br><br>Nevertheless I proceed to prove you wrong.<br><br>\"You're offsetting my claim that Wharton has the best placement by saying that Harvard places better into consulting (while asking me to go visit websites and being unable to produce anything yourself).\"<br><br>But you extrapolated incorrectly. Had you said Wharton has the best placement for finance, I would have agreed. But you referred to all facets of business, and that is too broad for Wharton to reign supreme in.<br><br>\"One time I met Cuba Gooding Jr. in a mall. I didn't get his autograph and I don't have any picture of the two of us together, though, so you're just going to have to take my word on that.\"<br><br>Your logical inconsistency is surprising. You tried to repudiate my statement that no undergrads break into hedge funds satisfying the requirements you mentioned. Therefore, you are the one who has to provide evidence of that fact, not me.<br><br>\"How would I prove you wrong? I would... actively not have connections or prior work experience and then not get recruited by a hedge fund? That... Is probably something I can do, I guess? Can you wait here for 5 years until I come back and tell you what happened?\"<br><br>Don't worry, I'll still be in my van.<br><br>\"You're also guaranteeing me that Stern and Columbia graduates don't place as well in the financial industry as Yale out of undergrad, that Yale has a better undergraduate program than Stanford, UCB, Claremont's, Columbia, Stern, Dartmouth, Chicago and...\"<br><br>Wrong. I never said that Yale has a better undergrad program than Stanford, UCB, etc. What I did say was that Yale grads have more success getting recruited for jobs.<br><br>\"I don't know. I'm very trusting. I'm like a young child, and you have tickets to Hannah Montana. I guess I'll just have to get into your van.\"<br><br>You resort to dark humor to detract readers from thinking about your losing argument. How sad.<br><br>...<br><br>The trash bags, don't worry. They're full of toys.<br><br>", "<b>Username: kyzan</b><br><br>Tetrishead, editing your post number 65 to include more senseless lambasting is just sad.<br><br>Screw you and your communist policies. Private institutions are responsible to shareholders students, and alumni, not the general public. Harvard isn't going to say, oh well \"China's population has grown by 300 million since the 1950s,\" therefore we are obligated to expand to include more Chinese internationals in our student body.<br><br>\"They have an obligation to the public because their existence is a result of tax exemptions, federal grants (from tax money) and in many cases authorization from state legislatures.\"<br><br>Governmental institutions like the NIH regularly give funding to Ivy League schools because they produce results in research that benefit the general public. Why don't you convince the government to stop funding these schools? See what happens to America's technological supremacy in a few decades.<br><br>I don't care how much you whine. The reality is, private institutions answer to themselves when they are considering expansion, not to the general public. Have fun at community college XXX. I've already gotten accepted into Yale.<br><br>", "<b>Username: tetrishead</b><br><br>\"\"But you extrapolated incorrectly. Had you said Wharton has the best placement for finance, I would have agreed. But you referred to all facets of business, and that is too broad for Wharton to reign supreme in.\"\"<br>It's an average. You know, I don't have numbers to back up that average. Just like you don't have numbers to back up yours. Also, on average, I am 10x prettier than you are. Can I substantiate that? No, but you can't refute it, which is the problem with your arguments.<br>\"\"Your logical inconsistency is surprising. You tried to repudiate my statement that no undergrads break into hedge funds satisfying the requirements you mentioned. Therefore, you are the one who has to provide evidence of that fact, not me.\"\"<br>Let me make sure I understand your train of thought correctly.<br><br>(1) You make a statement with nothing to substantiate it.<br>(2) I refute your statement based on something generally considered common knowledge.<br>(3) Because I refuted your statement, the burden of proof falls on me to prove something that you cannot and did not initially?<br><br>I'm pretty sure you still have to prove the initial statement before the onus is on me to disprove it.<br>\"\"You resort to dark humor to detract readers from thinking about your losing argument. How sad.\"\"<br>I'd rather resort to dark humor than actively avoid answering things that could even remotely substantiate anything I've said. You haven't proved you've worked in the industry, you say you have. You claim Yale graduates get better jobs in finance on average, except you don't actually have an average to go by. You want trust when it comes to sampling the opinions and backgrounds of people on Wall Street, yet you can't even find <i>one</i> point of data to back up anything you've ever said at any time in this thread. I think you're kind of running out of that whole trust thing.<br>\"\"Tetrishead, editing your post number 65 to include more senseless lambasting is just sad.\"\"<br>It's nice to know it took you thirty minutes to write something that had essentially nothing of substance within it. For some reason I thought you post was done, because I like to quote parts and drop down to the quick reply to respond to them one at a time. I apologize for not responding to your entire post in a complete and prompt manner.<br>\"\"Screw you and your communist policies.\"\"<br>Tsk. A fundamental ignorance of the status of private universities in this country you say? No! <i>Shocking</i>. Something else you have no idea about. Truly, the hits keep on coming.<br>\"\"Private institutions are responsible to shareholders students, and alumni, not the general public.\"\"<br>Incorrect. Many private universities exist, as I alluded to before but you ignored because anything that requires a real response you tend to conveniently leave out of your replies to me, as a result of action by state legislatures or counties/towns. Communism is basically a structure in which private companies are run under common ownership, which effectively neutralizes capital assets. LTV is also stupid, but that's not really what we're talking about.<br><br>The problem is private educational institutions aren't the same as private companies. They, again, exist primarily as a result of action by the government. They derive a tremendous amount of their operating income from the government and tax money. They have tax exempt status and they are given territorial areas that they police independently. This is not a normal company, and this has nothing to do with Communism.<br>\"\"Harvard isn't going to say, oh well \"China's population has grown by 300 million since the 1950s,\" therefore we are obligated to expand to include more Chinese internationals in our student body.\"\"<br>China didn't create Harvard by an act of their government. China didn't give Harvard the money to stay afloat. Harvard doesn't derive much operating income from China. Harvard isn't based in China, and Harvard doesn't get their tax exempt status because of China. I know you like to go all faulty conclusion lies lies blah blah etc, so, I think you should probably apply that to this part of your post.<br>\"\"Governmental institutions like the NIH regularly give funding to Ivy League schools because they produce results in research that benefit the general public. Why don't you convince the government to stop funding these schools? See what happens to America's technological supremacy in a few decades.\"\"<br>Well, what would happen is the schools would effectively cease to exist, all the faculty would defect to programs with money and very little if nothing at all would happen to our (non-existent, we lost it a long time ago, I'm not sure where you've been) technological supremacy. I mean, if they're truly private institutions that owe nothing to the public and make billion dollar profits, then why not revoke their tax exempt status? Oh, what, someone already mentioned that? And then there was an immediate cascade of changes to financial aid policies at the richest schools? I guess they're not so independent after all.<br>\"\"I don't care how much you whine. The reality is, private institutions answer to themselves when they are considering expansion, not to the general public. Have fun at community college XXX.\"\"<br>It's cute that you think that when towns regularly tell private institutions what is and is not acceptable in expansion. Also, good shot with the community college thing. You're definitely not going to end up a know-nothing elitist who has nothing to be elitist about. I'd rather deal with 45 year old mothers of three who work in diners and go to community college at night than someone who lies as regularly as you do, who knows as little as you do, who has uninformed and flawed views like you do and who refuses to acknowledge that they, too, are effectively a stupid teenager like you do.<br>\"\"I've already gotten accepted into Yale.\"\"<br>Wait, so you're not even in the school yet? Meaning all your ******** is about something you haven't personally experienced? And you have such a strong connection to the financial industry, and experience in the financial industry, while you're still what... how young? Yeah, man, I can see why I should take you seriously. You're clearly not full of it.<br><br>", "<b>Username: kyzan</b><br><br>Tetrishead, you seem to have an insatiable desire to argue against the truth. You've already been bashed enough in the other threads.<br><br>\"Wait, so you're not even in the school yet? Meaning all your ******** is about something you haven't personally experienced? And you have such a strong connection to the financial industry, and experience in the financial industry, while you're still what... how young? Yeah, man, I can see why I should take you seriously. You're clearly not full of it.\"<br><br>Right...this is coming from the kid who hasn't gotten accepted anywhere yet. What makes you the expert to comment on how well the recruiting is at Yale or any other place? You're saying I'm full of it when you are a high school senior as well? What hypocritical bull-$****. Have fun collecting change at McDonald's in ten years.<br><br>\"Let me make sure I understand your train of thought correctly.<br><br>(1) You make a statement with nothing to substantiate it.<br>(2) I refute your statement based on something generally considered common knowledge.<br>(3) Because I refuted your statement, the burden of proof falls on me to prove something that you cannot and did not initially?<br><br>I'm pretty sure you still have to prove the initial statement before the onus is on me to disprove it.\"<br><br>See your first premise is wrong because I have something to substantiate my statement. And no, I am not going to give names of people I know over an internet forum. Your refutation based on common knowledge is wrong due to my evidence in part one. Plus who determined that your opinion is common knowledge. Why don't you go to HYPWharton and ask around. But no, you clearly refuse and decide instead to stay at home and try to convince people to believe your crap on an internet forum.<br><br>\"I'd rather resort to dark humor than actively avoid answering things that could even remotely substantiate anything I've said. You haven't proved you've worked in the industry, you say you have. You claim Yale graduates get better jobs in finance on average, except you don't actually have an average to go by. You want trust when it comes to sampling the opinions and backgrounds of people on Wall Street, yet you can't even find one point of data to back up anything you've ever said at any time in this thread. I think you're kind of running out of that whole trust thing.\"<br><br>Right, because dark humor just magically cures everything. We can solve crime together right? Not. Where are your facts? Show me that UCB or Claremont grads get better jobs than Yale grads. You couldn't pay people to make up statistics like that. You haven't proved that you're not a twelve year old little girl being sexually molested in a van, but I think we can assume you're not. Your arguments don't make sense. We're over an internet forum, how do you want me to prove things? Fax you my social security number? Give me a break.<br><br>I've found people to back up my opinions. Hint: read previous posts in this thread. The point is, you haven't and probably never will unless you go meet another deranged person quite like yourself.<br><br>I'm not even going to waste my time arguing about Ivy-class expanding. Anyone who wants to know why tetrishead is wrong, please just go read the replies to his posts in that particular thread, which is featured on CC. Nice job making a fool of yourself tetrishead. I hope you can count change correctly, because you actually need that skill.<br><br>", "<b>Username: Scipio</b><br><br>Whenever you see a thread where people are quoting posts and arguing on a line by line basis, it's time to head for the exits.<br><br>", "<b>Username: tetrishead</b><br><br>\"\"I'm not even going to waste my time arguing about Ivy-class expanding. Anyone who wants to know why tetrishead is wrong, please just go read the replies to his posts in that particular thread, which is featured on CC. Nice job making a fool of yourself tetrishead. I hope you can count change correctly, because you actually need that skill.\"\"<br>This is good. What I'm going to do is I'm going to let you simmer until you can prove even one of these five things that you've avoided this entire time, because otherwise everything you say is without substance and you can't even put together a coherent argument long enough to make your own train of thought without referencing other posters and other threads where someone apparently argued with me better than you have. Here they are:<br><br>(1) That you know, on a personal level, even one individual who works in anything that can be considered finance. It doesn't matter if they're a teller at a Wachovia.<br>(2) That you have ever been, at any time in your life, to any of the schools you've mentioned. Not even that you're attending--that you've even been in the neighborhood.<br>(3) That you have ever worked, at any time, in any way, in the financial industry. It doesn't matter if it's in the mail room, you still haven't done it.<br>(4) That you are actually <i>in</i> any college, whether it be a community college or HYP, and that you know anyone who has ever been recruited into any facet of the business world out of undergrad.<br>(5) That, other than some fluffy stuff on famous VC's and the like at portfolio.com, you know the \"profiles\" of more than 2 people who have, at any time, ever worked in the financial industry in any facet and any way.<br><br>", "<b>Username: kyzan</b><br><br>Tetrishead its laughable how your arguments come about. But sure, I'll go ahead and keep the humor going. How do you want me to prove these things? Shall I fax you a copy of my admittance letter? No better yet, I presume you want me to give you a portfolio of everything I've done in the past four years of my life. Probably a credit card number to go along with it? *Wink Wink* it expires in 01/08.<br><br>\"(1) That you know, on a personal level, even one individual who works in anything that can be considered finance. It doesn't matter if they're a teller at a Wachovia.\"<br><br>Sure I know. What do you want? Their names, telephone numbers, addresses, credit card numbers? If this is one of your pathetic schemes, please spare me the trouble. Do you really expect me to release such information?<br><br>\"(2) That you have ever been, at any time in your life, to any of the schools you've mentioned. Not even that you're attending--that you've even been in the neighborhood.\"<br><br>Refer to previous statements.<br><br>\"(3) That you have ever worked, at any time, in any way, in the financial industry. It doesn't matter if it's in the mail room, you still haven't done it.\"<br><br>Since you know nothing about me, this is an empty lie. It's analogous to me calling you a little molested girl without knowing who you are or what you do just because you posted a few sentences on the internet saying you are. Chill man, there's something called integrity, which you obviously don't have because you've already admitted to lying in one of your previous posts.<br><br>\"(4) That you are actually in any college, whether it be a community college or HYP, and that you know anyone who has ever been recruited into any facet of the business world out of undergrad.\"<br><br>Had you been accepted into Yale, you would have known something like BlueMarble in which you could have looked me up. But since you haven't please refrain from spasms of idiocracy.<br><br>\"(5) That, other than some fluffy stuff on famous VC's and the like at portfolio.com, you know the \"profiles\" of more than 2 people who have, at any time, ever worked in the financial industry in any facet and any way.\"<br><br>Again, refer to previous statements.<br><br>I have experience and more than that, research in the financial sector to back my claims. All you have is your hot-headed bigshot pride in thinking you know everything. Why don't you give me statistics that Yale's job placement is the same as CMU, or worse than UCB and Claremont. Clearly you're already on the wrong footing.<br><br>", "<b>Username: tetrishead</b><br><br>Still dodging the questions. A cute little dance, referring back to me to disprove statements you've never proved, like Yale having better job placement. When you can back up <i>one</i> out of five of those things you can pretend to have \"integrity.\"<br><br>Until then, obviously, you can't.<br><br>", "<b>Username: kyzan</b><br><br>If you want to proof so badly, why don't you go to career services at Yale and find out for yourself. Why don't you talk to employers on Wall Street.<br><br>\"When you can back up one out of five of those things you can pretend to have integrity.\"<br><br>Hypocritical aren't you? You proceed to attack me for integrity when a) you're the one who has clearly lied to us before and b) you don't have any facts yourself, nor do I believe you have seen evidence.<br><br>Until then, obviously, you can't prove me wrong.<br><br>", "<b>Username: mootpoint</b><br><br>@kyzan and tetrishead<br><br>Are you two male or female? I am having an awesome mental image of you two having an awesome girl on girl fight. If it does happen... make a youtube video or something.<br><br>", "<b>Username: dudemanimcool</b><br><br>Nobody cares if the education you receive at college X is better than that at college Y. It all matters about the name... and quite frankly Yale, Harvard, and Princeton are the most famous, but Wharton of course has the most famous undergrad business school and you will get the same opportunities if not better at those other schools. But it is actually harder to get the same job from Wharton than it is from HYP because you are competing against other Wharton students. These Yale vs Harvard threads are so pointless because they are the two most famous schools, even on the international level.<br><br>", "<b>Username: kyzan</b><br><br>@mootpoint, I'm glad you're having fun while reading our posts. Good luck with picturing that girl on girl fight XD<br><br>@dudemanimcool, thank you. I think you just proved my point, which is that the top tier schools for Wall Street type job placement are HYPWharton. I was simply refuting the notion Tetrishead stated quite a while back that Claremont College, UCB, and Dartmouth grads have better job options than Yale grads.<br><br>", "<b>Username: ibtelling</b><br><br>Wow tetrishead really needs an awakening... His arguments are really laughable. Thanks for the help kyzan and others.<br><br>Just because Yale's econ. program is inferior to some schools doesn't mean its job placement is also that. :D<br><br>", "<b>Username: tetrishead</b><br><br>\"\"If you want to proof so badly, why don't you go to career services at Yale and find out for yourself. Why don't you talk to employers on Wall Street.\"\"<br>Because you haven't done that. Because you've never worked in the industry, you haven't even graduated from college yet and for all I know you don't even go to Yale. What would be the point to actively trying to get a sampling of data when your claims already have a non-existent foundation?<br>\"\"Hypocritical aren't you? You proceed to attack me for integrity when a) you're the one who has clearly lied to us before and b) you don't have any facts yourself, nor do I believe you have seen evidence.\"\"<br>a) Yes, congratulations on catching me in the horrible lie of saying my rankings were based on two things when they were based on one. The world needs more hard-hitting investigative reporters like you. b) And there, we're on completely equal footing. So the integrity argument comes back to you knowing nothing and having no experience in the industry, which means that your opinion on Yale's job placement and economics program is about as informed as mine is.<br>\"\"Until then, obviously, you can't prove me wrong.\"\"<br>There's nothing to prove because your arguments are based on nothing. I could say Florida State University has an economics program that is superior to Yale and better job placement to boot and you'd only be able to use conjecture to argue against it. For all your grandstanding you can prove nothing about your background, and while I may very well be a 12 year old girl, you're probably a 15 year old living in his mother's basement as a junior in high school. Just like you only have conjecture to try and argue \"facts\" that do not exist, you try to use conjecture to claim you're somehow morally superior when you can provide just as much hard data to support your arguments as I can. We are equals, and if I withdraw all my applications and go to community college we'd still be equals, and if I started working at McDonalds I'd probably end up better then you because at least I'd know what work looks like.<br>\"\"Wow tetrishead really needs an awakening... His arguments are really laughable. Thanks for the help kyzan and others.<br><br>Just because Yale's econ. program is inferior to some schools doesn't mean its job placement is also that.:P\"\"<br>So... You're not at the school, and you had to post a thread to get opinions on whether Harvard or Yale has a better economics program and which would be more finance related, and now, 5 days later, you're an expert on the subject?<br><br>", "<b>Username: kyzan</b><br><br>Tetrishead, you should realize there is a reason no one else agrees with you.<br><br>\"Because you haven't done that. Because you've never worked in the industry, you haven't even graduated from college yet and for all I know you don't even go to Yale.\"<br><br>Well I guess you have to trust me don't you. I trust that you're not just an anti-Yale ****. Maybe I'm wrong. We're over an internet, so integrity plays a big deal. Like I said before, how would you want me to prove this again? I smell an identity theft.<br><br>\"a) Yes, congratulations on catching me in the horrible lie of saying my rankings were based on two things when they were based on one.\"<br><br>Are you an idiot? This is the whole point of our argument. While I admit Yale's econ program is a little weak compared to Chicago, Harvard, MIT, Princeton etc, I argue that Yale has better job placement. Your rankings in the previous posts as you've said, are \"solely based on job placement.\" When people started asking why you placed Yale below UCB, Claremont College, and Dartmouth, you started shifting your answers and lied to us saying that your original rankings were based on undergrad econ department quality and job placement.<br><br>I'm not debating about econ department quality. I'm debating about job placement, and yes I know I'm right when I say Yale has better recruiting than Claremont, UCB, Dartmouth, CMU, Northwestern, and whatever else you placed above it.<br><br>\"There's nothing to prove because your arguments are based on nothing. \"<br><br>My arguments are based on research and experience. Yours are based on talking to **** over an internet forum. Who's more reliable? Hmm doesn't take a rocket scientist to figure this one out.<br><br>\"and if I started working at McDonalds I'd probably end up better then you because at least I'd know what work looks like.\"<br><br>I sense an inferiority complex. Keep on dreaming.<br><br>", "<b>Username: ibtelling</b><br><br>\"So... You're not at the school, and you had to post a thread to get opinions on whether Harvard or Yale has a better economics program and which would be more finance related, and now, 5 days later, you're an expert on the subject?\"<br><br>After reading six pages of responses, I believe the information stated is fairly adequate. Don't make assumptions and say that I'm an expert. And are you at Yale?<br><br>", "<b>Username: tetrishead</b><br><br>\"\"Are you an idiot? This is the whole point of our argument. While I admit Yale's econ program is a little weak compared to Chicago, Harvard, MIT, Princeton etc, I argue that Yale has better job placement. Your rankings in the previous posts as you've said, are \"solely based on job placement.\" When people started asking why you placed Yale below UCB, Claremont College, and Dartmouth, you started shifting your answers and lied to us saying that your original rankings were based on undergrad econ department quality and job placement.\"\"<br>The quality of an education will undoubtedly correlate to job opportunities, just like the prestige of an institution will. Claremont and Stanford especially have access that other schools don't on the West Coast, just like Stern and Columbia have access other schools don't to 'traditional' Wall Street. You argue that Yale has better job placement, I argue they don't. Neither of us can bring anything to the table other than conjecture, so we're complete equals except for the fact that you believe your conjecture is somehow superior to my conjecture, which either makes you delusional in that you aren't aware that your argument has been substantiated as much as mine has, or arrogant because you think your baseless opinion is better than the baseless opinion of anyone else.<br>\"\"I'm not debating about econ department quality. I'm debating about job placement, and yes I know I'm right when I say Yale has better recruiting than Claremont, UCB, Dartmouth, CMU, Northwestern, and whatever else you placed above it.\"\"<br>You know you're right, and I know I'm right, and we both know we're right with the same amount of data on the opposite sides of the same issue. This is quite a pickle.<br>\"\"My arguments are based on research and experience. Yours are based on talking to **** over an internet forum. Who's more reliable? Hmm doesn't take a rocket scientist to figure this one out.\"\"<br>No, my arguments are based on research and experience--yours are based on being a **** over an internet forum.<br><br>See what I did there? I took what you said and turned it around because we have the exact same foundation to stand on. We can effectively substitute each others statements and they'd have the same level of credibility. You can say you have more credibility, and then I can say I have more credibility, and we'd both have the same amount of credibility. Unless your perception is based on the opinions of other posters on an internet forum, but you don't think internet forums are worth much, so it would invalidate that too.<br>\"\"<a rel=\"nofollow\" href=\"/profile/ibtelling\">ibtelling</a> wrote:\"\"<br>No. So we're on equal footing there, since your first year hasn't begun yet.<br><br>", "<b>Username: tetrishead</b><br><br>I actually just clicked through this again and for some reason I ignored it. I feel it's worth special mention.<br>\"\"\"and if I started working at McDonalds I'd probably end up better then you because at least I'd know what work looks like.\"<br><br>I sense an inferiority complex. Keep on dreaming.\"\"<br>How could you <i>possibly</i> be stupid enough to not know what an inferiority complex is? Is this some kind of meta-joke, or something?<br><br>An inferiority complex implies that someone would actually think they're inferior, or that they'd project their feelings of inferiority onto someone else (a superiority complex, which is the same thing with self-loathing replaced by pseudo egotism). My statement was the complete opposite of either: namely, I opened with the fact that we're equals, and then I went on to say that even if I were to end up as someone you'd consider a complete reject who gets accepted nowhere--which, admittedly, is technically impossible because of EA results--and lives in a trailer working at McDonalds, it would result my living a difficult life that would make me better than you are because you have some kind of awkward neurosis--narcissism?--that leads to you believing that on an equal footing with everyone else you are still somehow superior. If I was in a position different than I am now--the previously mentioned McDonalds thing--it would only cause you to inflate yourself further, which would only lower the opinion anyone could have of you as a human being.<br><br>Of course, by an equal footing, you probably know I'm insinuating that you and I have the exact same amount of experience in the financial industry. But while I'm open about my background you actively spend your free time falsely bolstering your background to try and support your already baseless opinion. This also goes against your previous 'knock' against my information coming from internet forums, because if you were in actuality someone who worked in this industry (which is rather time-consuming, as I'm sure you don't know) and you held the opinions you do about said forums you wouldn't have gone this far arguing this topic while being unable to present anything of substance, would you?<br><br>Presumably you'll carry these issues with you for the rest of your life if you don't actively take part in therapy, and if I had to choose between uneducated+well-adjusted or HYPSMCetc+misguided egotism, uh, I'd definitely go with the former.<br><br>", "<b>Username: rd31</b><br><br>Because you have admitted that both of you have \"baseless\" opinions, why should anyone believe anything either of you have to say? What the heck was the point of this argument? Insulting each other and everyone else who gets in the way (including the OP) of a \"baseless\" argument?<br><br>I doubt anyone really cares about your argument anymore, except for the two of you. You're obviously not helping the OP because now you're just pointlessly arguing about the usage of \"inferiority complex\". This is just sad.<br><br>", "<b>Username: slipper1234</b><br><br>What is the C in HYPSMC? In no way is it Columbia; Columbia doesn't do better than its other middle Ivies (particularly Dartmouth) at all in terms of grad placement or recruiting.<br><br>", "<b>Username: posterX</b><br><br>HYPMC is the correct acronym, HYP MIT and Caltech.<br><br>", "<b>Username: tokenadult</b><br><br>I think the information value of this thread for the OP was exhausted a while ago, so it is now locked. Please review the Terms of Service.<br><br><url>http://talk.collegeconfidential.com/faq.php?faq=vb_faq#faq_new_faq_item</url><br><br>If one of you sees a problem post, feel free to report it via the \"Report Problem Post\" link that appears on each post on College Confidential.<br><br>Calm down. It's hard to wait for admission results, but be patient.<br><br>"]}