{"title": "harvard vs uc berkeley", "comments": ["<b>Username: dark ninja</b><br><br>i know its common sense that harvard is better....but what do you think?<br><br>", "<b>Username: Phead128</b><br><br>I can ask my friend who have taken math classes both at Harvard and Berkeley to get some opinion.<br><br>This is a dumb thread btw. Duke wins. :)<br><br>", "<b>Username: Brown man1987</b><br><br>Yes Duke is better.<br><br>", "<b>Username: dark ninja</b><br><br>no...c'mon people...lets debate this<br><br>", "<b>Username: coolman123</b><br><br>dark ninja, do you go to harvard?<br><br>", "<b>Username: Phead128</b><br><br>UCB graduate program wise probably beats Harvard or is on par with Harvard on a lot of levels. Both located in ultra liberal cities, infamous Berkeley, and the People's Republic of Cambridge (PRC). erghhh, I'd still pick UMichigan over Duke anyday of the week though.haha<br><br>", "<b>Username: dark ninja</b><br><br>hhaha...and i'd pick emory over johns hopkins any day of the week as well.<br><br>", "<b>Username: coolman123</b><br><br>^ I would too. So, do you go to Harvard??<br><br>", "<b>Username: dark ninja</b><br><br>and harvard is much better than berkeley...no question...when i was in london...i told a guy that i went to harvard...he was like \"wow\"...then my friend next to me told him he went to ucb...and the guy was like...hmm never heard of that place....well...i'm sure its okay...but its no harvard hahah...<br><br>", "<b>Username: 20LEGEND</b><br><br>You might want to read post 13 again. :)<br><br>", "<b>Username: DunninLA</b><br><br>Ph.D. programs? Berkeley is much stronger.<br><br>Undergrad? The actual instruction is probably on par, but the reputation of H trumps all.<br><br>", "<b>Username: molliebatmit</b><br><br>Please remember that discussion of moderator actions is not allowed under CC's Terms of Service. If you are fuzzy on the terms of the TOS, you may review them in the \"Help and Rules\" category on the left sidebar.<br><br>I have deleted posts discussing moderator action (and will continue to do so), but there is no problem with this thread so long as it remains a civil discussion of the relative merits of the two schools.<br><br>", "<b>Username: kwu</b><br><br>It's not \"common sense\" that one school is \"better\" than the other.<br>Common sense more accurately describes not shoving one's head into an oven.<br><br>", "<b>Username: Begoner</b><br><br>It's an inherently subjective question of personal opinion; some may prefer one while others may prefer the other. By objective measures, such as undergraduate teaching quality, they're roughly equal.<br><br>", "<b>Username: Bescraze</b><br><br>Haha Harvard is 10x better. End of story. Its not subjective<br><br>", "<b>Username: noobcake</b><br><br>Berkeley Engineering<br><br>", "<b>Username: Saxonthebeach6</b><br><br>Harvard's got the $ and the student body. Both have the faculty. Berkeley's got the tree sitters =P<br><br>", "<b>Username: Begoner</b><br><br>Personally, I'm more partial to Berkeley's student body than Harvard's; alongside the geographic location, that pushes Berkeley over the top for me when compared to Harvard.<br><br>", "<b>Username: bearsayswoof</b><br><br>\"And, two, the Socal weather, which a very pleasant weather all year round.\"<br><br>Cal is not in socal.<br><br>", "<b>Username: rftd</b><br><br>I go to Berkeley, so I'm probably biased. That being said, here's how I see it:<br><br>- Harvard's reputation definitely trumps Berkeley, hands-down. This is not to say that Berkeley doesn't have a good reputation (because it does), but, for lack of a better way of putting it, Harvard is Harvard. If you tell any person you went to Harvard, they'll know what you're talking about. Most people will know Berkeley, but still not as famous or well-reputed as Harvard.<br><br>- Harvard also wins in terms of prestige.<br><br>-As far as the level of instruction goes at the undergraduate level, I would say both are more or less the same. But, to be more specific, you have to break it down be program. I would say Berkeley has much better programs in Engineering, Computer Science, Chemistry, Biology, and Physics (if you look at Berkeley's track record on these, you'd agree with me). I would say Harvard is a lot better for English, History, Economics, Languages, Law, and other non-science subjects.<br><br>- For graduate education, you also have to break it down by program. I think Harvard easily takes the cake for professional degrees such as Law and Business (Although, it can be argued that the Haas School of Business is on par with Harvard). For Science-related graduate programs, it is generally no contest: Berkeley wins (once again, look at Berkeley's track record. Especially for chemistry and physics). As far as other graduate programs, I'd say its a bit of a toss up.<br><br>- Another way to look at is Nobel Prizes: Harvard has 75 affiliated Nobel Laureates Compared to Berkeley's 61.<br><br>Overall, I'd say Harvard does have the edge, but that is mostly thanks to its reputation. I think were the Harvard degree really helps is in networking. However, Berkeley is beginning to catch-up in that respect. Also, I wouldn't pay too much attention to University Rankings because those are mostly ********.<br><br>So, that my opinion. Even though I'm at Berkeley I think i've been pretty fair to both sides.<br><br>", "<b>Username: rftd</b><br><br>Also, Harvard has a lot more money. Which is a HUGE deal regardless of what others may tell you. (e.g. more money for research grants, etc.)<br><br>", "<b>Username: rjkofnovi</b><br><br>Harvard is the most prestigious university in this country. End of discussion.<br><br>", "<b>Username: rftd</b><br><br>agreed, it is the most prestigious... BY FAR. But there are other factors to consider<br><br>", "<b>Username: DunninLA</b><br><br>rjkofnovi -- OP did not ask which is more prestigious. OP asked which is better.<br><br>Regarding prestige, I believe this link says Berkeley is more prestigious at the Ph.D. level in 4 of the 5 main areas (which are comprised of 41 disciplines). The ranking is based on \"faculty quality and effectiveness of program\".<br><br><a href=\"http://www.stat.tamu.edu/~jnewton/nrc_rankings/nrc1.html#RANKBYAREA\" rel=\"nofollow\">NRC Rankings</a><br><br>Harvard takes the lead in the professional schools of Medicine, Law and Business, though in these areas Berkeley is behind Harvard about as far as Harvard is behind Berkeley in the 41 Ph.D. areas. In the popular culture, professional school superiority will have a much higher weighting than will have the 41 non professional Ph.D. areas.<br><br>", "<b>Username: rjkofnovi</b><br><br>OK DunninLA, Harvard is better. ;-)<br><br>", "<b>Username: dark ninja</b><br><br>yep harvard is better than little puny ucb...<br><br>", "<b>Username: danielhstennis08</b><br><br>wow, people WAYYYY overrate berkeley undergrad which really IS NOT that good... harvard is (arguably) the BEST OVERALL undergraduate institution in the country.... yes, in engineering, berkeley would be better though cause harvard engineering is a joke...<br><br>in terms of grad school, they are MUCH closer with Harvard still having an edge over UCB OVERALL....<br><br>", "<b>Username: DunninLA</b><br><br>danielstennis08 --<br><br>how is Harvard at the graduate level better than Berkeley? Per the link I posted in #26 above, Berkeley is the #1 Ph.D. university. It is ranked #1, and Harvard #4 (by simply aggregating the ranking number in the 5 main areas, lowest number wins -- with a slight bonus for having a ranking in all 5 areas). In the three professional schools, Harvard on average is #1 and Berkeley #4 or #5.<br><br>I assume you are making a qualitative judgement that the three professional schools together have more weight than the 41 Ph.D. disciplines? i.e. that vocational training trumps research. Is that correct?<br><br>", "<b>Username: Bourne</b><br><br>Why is UCSF considered Berkeley's Med school. Is there a literal affiliation?<br><br>", "<b>Username: DunninLA</b><br><br>When there was only one UC -- Berkeley, which was the lone UC until 1919 with the founding of the Southern Branch (UCLA), the Regents established a health Sciences graduate school.<br><br>It didn't fit at Berkeley for practical reasons, so they put it in San Francisco where the patients were. So, in the ensuing years, while some of the other UC campuses established medical colleges as part of their mission (most notably UCLA), UC Berkeley did not add a second medical school, since UCSF functioned as the \"UC medical school\" just as Berkeley functioned as \"the UC\" until 1919. They operated on opposite sides of the Bay from each other for almost 50 years before UCLA was founded.<br><br>I have always said UCSF is Berkeley's \"de facto\" med school, as this was the situation from its founding.<br><br>", "<b>Username: Bourne</b><br><br>So Berk has two top professional schools -- Boalt and Haas.<br><br>", "<b>Username: DunninLA</b><br><br>Bourne -- different take : The University of California until 1919 had two schools: Berkeley for everything except health sciences grad school, and UCSF, the health sciences grad school.<br><br>As UCSF does not have undergrad, it conceptually was and is the Med school for UC Berkeley.<br><br>", "<b>Username: hampster</b><br><br>In addition to having top notch ph.d programs, the quality of Stanford's professional schools and undergraduate student body are alot closer to Harvard's than Berkeley's.<br><br>For undergrad. it seems Berkeley's more on par with the other top publics.<br><br>", "<b>Username: DunninLA</b><br><br>Bourne -- I found a formal link between the two campuses:<br><br>The MD/MS Joint Medical Program<br><br>The UC Berkeley-UC San Francisco Joint Medical Program (JMP) is a unique five-year medical education program dedicated to training physician-leaders in the human, sociocultural, and bioethical contexts of health and disease. The first three years of study take place on the UC Berkeley campus, a short distance away across the San Francisco Bay, blending an innovative preclinical medical curriculum with rigorous research training. Students may take their graduate work in a wide array of subject areas well represented on the UC Berkeley campus  selecting thesis topics in the historical, social, ethical, epidemiological, or policy aspects of human health and disease. JMP students then transfer to UCSF for their last two years of study in the clinical core, joining the traditional track UCSF medical students. The JMP combines graduate and medical curricula leading to both MD and MS degrees. For detailed information, visit the UCB-UCSF Joint Medical Program site.<br><br>Applicants to the UCB-UCSF Joint Medical Program must meet all of the requirements of the UCSF School of Medicine and should apply through the regular admissions process. Applicants who pass a preliminary review will be approved for a secondary application from UCSF that will provide information on application to the Joint Medical Program. Each year 12 highly qualified students are accepted on the basis of motivation, background, and aptitude for an in-depth research experience and suitability for case-based, problem-oriented small group learning. While prior research experience is not mandatory, most applicants have had experience in the development of an independent or creative project. We highly recommend that students have completed an introductory course in statistics.<br><br>Contact:<br>Student Affairs Office<br>University of California<br>Health and Medical Sciences<br>570 University Hall #1190<br>Berkeley, CA 94720-1190<br>(510) 642-5671<br>Email: <a rel=\"nofollow\" href=\"/cdn-cgi/l/email-protection#771d1a07371512051c121b120e59121302\"><span class=\"__cf_email__\" data-cfemail=\"543e3924143631263f3138312d7a313021\">[emailprotected]</span></a><br>Web Site: <a href=\"http://jmp.berkeley.edu/\" rel=\"nofollow\">JMP - Main Home Page</a><br><br>", "<b>Username: rftd</b><br><br>Keep in mind that I'm a UCB student:<br><br>I know my classmates wouldn't like me to say this, but Harvard is better overall (remember, this is coming from a Berkeley student). The only universities in the entire world that really rival Harvard are Oxford, Cambridge, and (maybe) Yale. Other than those three, there aren't any other fair comparisons to Harvard.<br><br>That being said, you have to remember that Berkeley is no joke (and far from it). Berkeley gets a lot of **** b/c its the poorest of the 'elite' schools in the country. However, I do feel that Berkeley does deserve to be put into the 'elite' class. I argue this for a number of reasons:<br><br>1) Berkeley's graduate and doctorate programs are as good as any available in the world.<br>2) Berkeley is top notch for various academic disciplines: it is the undoubted world leader in chemistry, and tied for the best in physics, engineering, computer science, mathematics.<br>3) Berkeley is a far better public school than some of the other top public schools (e.g. UCLA, UM: Ann Arbor). As such, it attracts some of the best and the brightest students from across the country and around the world<br>4) Though, not that same as that of Harvard, Berkeley has a terrific reputation.<br><br>As I said earlier, my argument here is not to establish Berkeley's superiority over Harvard because HARVARD IS BETTER. However, I feel as though some people in this thread are discounting Berkeley as being less than it is.<br><br>", "<b>Username: amciw</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/RTFD\">RTFD</a> wrote:\"\"<br><br>This statement is wrong.<br><br>", "<b>Username: kwu</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/danielhstennis08\">danielhstennis08</a> wrote:\"\"<br><br>This statement is wrong too.<br><br>", "<b>Username: Nightmarerec0n</b><br><br>In depends, do you want to study science and engineering or anything else?<br><br>", "<b>Username: Phead128</b><br><br>Engineering at Harvard is muck. Truly poopy. Thats why they are investing like a billion dollars expanding into the Allston region and trying to pump up its engineering program. As of it right now, it sucks.<br><br>", "<b>Username: Bourne</b><br><br>\"\"Bourne -- I found a formal link between the two campuses\"\"<br><br>Hehe, So what should I infer from this?<br>\"\"Rice/Baylor College of Medicine Medical Scholars Program<br>The Medical Scholars Program (MSP) promotes the education of students who are scientifically competent, compassionate, and socially conscious. It is the hope of Rice University and Baylor College of Medicine that these students will apply insight from the extensive study of liberal arts and other disciplines to the study of modern medical science.<br><br>The MSP students explore the entire range of Rice University undergraduate programs to the extent that their interests allow. After graduation, they begin their medical education at Baylor College of Medicine.<br><br>Each year, Rice and Baylor admit up to 14 incoming undergraduates into the program. The scholars complete the traditional four years at Rice followed by four years at Baylor for a medical degree.<br>\"\"<br><br>", "<b>Username: DunninLA</b><br><br>bourne - yes, there are other such programs. that was just another data point to supplement the fact that for over 50 years, UC *at* Berkeley, and UC *at* San Francisco was the same, one and only UC.<br><br>", "<b>Username: Nightmarerec0n</b><br><br>Phead128, I saw that as well...They got there nice new building up too.<br>Luckily Harvard is next to MIT and you can enroll in MIT classes.<br><br>", "<b>Username: dark ninja</b><br><br>but regardless: harvard/yale/princeton>duke/penn/columbia>brown/dartmouth/cornell>wash u/johns hopkins/northwestern>ucb/umich/emory<br><br>all of this is prestige wise<br><br>", "<b>Username: dark ninja</b><br><br>oh yeah add mit and stanford and cal tech with hyp<br><br>", "<b>Username: Bescraze</b><br><br>\"\"but regardless: harvard/yale/princeton>duke/penn/columbia>brown/dartmouth/cornell>wash u/johns hopkins/northwestern>ucb/umich/emory<br><br>all of this is prestige wise\"\"<br><br>Exactly....thats what it is. I would personally put cornell one spot down but otherwise looks good. Its funny how many people here reject these rankings, buts thats the perception.<br><br>", "<b>Username: dark ninja</b><br><br>thanks....now i got the prestige rankings correct:<br><br>1. HYPMS, Caltech<br>2. Duke, Penn, Columbia<br>3. Brown, Dartmouth<br>4. Wash U, JHU, Cornell, Northwestern, UCB<br>5. Michigan, UVA, Emory, Rice<br>6. UNC, Vanderbilt...<br><br>Don't argue!<br><br>", "<b>Username: flyzeggs</b><br><br>Your ranking is ridiculous:<br><br>I just computed these scores based on the THES (recruiter scores/peer ranks/alumni success), HEEACT (research impact (international)), US News (selectivity etc...), Top American Research Universities Ranking (national research impact/output) each worth 25%:<br><br>Harvard 98/100<br>Yale 84/100<br>Penn 82/100<br>Princeton 77/100<br>Berkeley 77/100<br>Cornell 73/100<br>Brown 59/100<br>Dartmouth 51/100<br><br>", "<b>Username: flyzeggs</b><br><br>****, I left out Columbia:<br><br>Harvard 98/100<br>Yale 84/100<br>Columbia 83/100<br>Penn 82/100<br>Princeton 77/100<br>Berkeley 77/100<br>Cornell 73/100<br>Brown 59/100<br>Dartmouth 51/100<br><br>", "<b>Username: UCBChemEGrad</b><br><br>^ looks good to me...at least you left out \"The Farm\"...:p<br><br>", "<b>Username: vc08</b><br><br>Berkeley is harder to graduate from, the grading scale is much more severe, and you're forced to be more independent. Harvard has a bigger name at the undergrad level, but Berkeley is slightly stronger at the grad level. But this is a pretty stupid argument, esp. on this site, bc those who attend elite private schools are going to say Harvard bc the classes are smaller, it's more \"prestigious,\" etc., while those who attend elite public schools will argue that Cal is just as good because you aren't held by the hand and are forced to find your own way, thus becoming a more independent thinker. So, to each his own I suppose. There are valid arguments on both sides.<br><br>", "<b>Username: dark ninja</b><br><br>sry but duke is up there and on par with columbia<br><br>", "<b>Username: flyzeggs</b><br><br>I was only ranking Berkeley vs. Ivies<br><br>I'm not gonna sit down and do the calculations for every university in the US, but I think this is a fair ranking 1/2 international + national selectivity/prestige, 1/2 inter + national research ouput/impact :) I might do a few more later tonight.<br><br>", "<b>Username: dark ninja</b><br><br>so how does duke fit into ur ranking<br><br>", "<b>Username: flyzeggs</b><br><br>Harvard 98/100<br>Yale 84/100<br>Columbia 83/100<br>Stanford 83/100<br>MIT 83/100<br>Penn 82/100<br>Johns Hopkins 80/100<br>Duke 80/100<br>Princeton 77/100<br>Berkeley 77/100<br>Caltech 74/100<br>Cornell 73/100<br>Brown 59/100<br>Dartmouth 51/100<br><br>:)<br><br>", "<b>Username: thevidrohi</b><br><br>What about Rice?<br><br>", "<b>Username: GoNavyXC</b><br><br>I like to break down colleges by categories:<br><br>Academics:<br><br><a href=\"http://www.ordoludus.com/academics_details.php?sort=NAM&amp;dir=up#data\" rel=\"nofollow\">College Rankings - Home</a><br><a href=\"http://www.ordoludus.com/academics_details.php?sort=Acc&amp;dir=up#data\" rel=\"nofollow\">College Rankings - Home</a><br><br>Overall Average Ranking (w/other categories):<br><br><a href=\"http://www.ordoludus.com/index.old\" rel=\"nofollow\">College Rankings - Home</a><br><br>", "<b>Username: flyzeggs</b><br><br>Harvard 98/100<br>Yale 84/100<br>Columbia 83/100<br>Stanford 83/100<br>MIT 83/100<br>Penn 82/100<br>Johns Hopkins 80/100<br>Duke 80/100<br>Princeton 77/100<br>Berkeley 77/100<br>Caltech 74/100<br>Cornell 73/100<br>Brown 59/100<br>Emory 52/100<br>Dartmouth 51/100<br>Rice 43/100<br><br>I added Rice and Emory. I should stress though it's not the most accurate methodology and there's an emphasis on scientific research. Some schools, like Princeton, might have just not performed as well as they usually do, in the year 2007, it's a ranking that would greatly fluctuate from year to year.<br>+ There will no doubt be many (top 25 USNews) schools below Rice, don't pay too close attention to the numbers.<br><br>", "<b>Username: CWalker</b><br><br>\"I know my classmates wouldn't like me to say this, but Harvard is better overall (remember, this is coming from a Berkeley student). The only universities in the entire world that really rival Harvard are Oxford, Cambridge, and (maybe) Yale. Other than those three, there aren't any other fair comparisons to Harvard.\"<br><br>I think that Oxford and Yale don't rival Harvard...maybe I feel this way because I place more emphasis on scientific research...who knows. Stanford and Cambridge seem like comparable schools to Harvard (though still a half-notch below).<br><br>", "<b>Username: flyzeggs</b><br><br>CWalker, As much as I hate to admit it no university in the world rivals Harvard in terms of scientific research, I'd say the one that comes the closest is Columbia. In IF, Oxford and Cambridge place only in the 15-20th category internationally.<br><br>", "<b>Username: Bourne</b><br><br>Columbia?<br><br>...<br><br>", "<b>Username: katliamom</b><br><br>This is a silly argument. There is no university in the world that carries greater recognition than Harvard with the possible exception of Oxbridge. This Cal grad says, between Berkeley and Harvard, there is no competition for OVERALL prestige: it's the big H, hands down.<br><br>(Now ask me where I would go if I could do it all over again. I'd still choose Cal. Because there is more to life than prestige. And Cal has way better weather &amp; better looking people ;) )<br><br>", "<b>Username: CWalker</b><br><br>Not that the Times rankings prove anything but neither of the science-specific rankings list Columbia near the top...<br><br><a href=\"http://www.topuniversities.com/worlduniversityrankings/results/2007/subject_rankings/life_sciences_biomedicine/\" rel=\"nofollow\">QS Top Universities: University rankings in Life Sciences and Biomedicine</a><br><br><a href=\"http://www.topuniversities.com/worlduniversityrankings/results/2007/subject_rankings/natural_sciences/\" rel=\"nofollow\">QS Top Universities: University rankings in the Natural Sciences</a><br><br>", "<b>Username: COlsen573</b><br><br>harvard by a landslide.<br><br>berkeley is all treehugging liberals ...also the entire town of berkeley shuts down at like 8pm.<br><br>", "<b>Username: itsthemendy16</b><br><br>Harvard is full of elitist white snobs. Just because the city of Berkeley is liberal doesn't mean the school is worse. I hope your kidding.<br><br>", "<b>Username: juillet</b><br><br>Ugh, why is the OP so obsessed with this question of prestige? It's getting really old.<br><br>There's no question that Harvard has more prestige than Berkeley. It's the most prestigious university in the world; it's more well-known than Berkeley and most other schools, even Oxford and Cambridge. (And I don't know WHERE flyzeggs got the idea that those two British schools only place 15-20 internationally -- that is NOT true. Oxbridge routinely places in the top 5.)<br><br>However, as already been pointed out that prestige doesn't mean everything. At the graduate level, hiring committees are not concerned about what the general public thinks about schools -- they are concerned about in-field rankings. Harvard's name may get you far if you are planning to teach law school, but a Berkeley graduate degree is better for someone looking to be a professor in the natural sciences and engineering. Also, it depends a lot on geographical area, as well. Besides, the most important aspect about a school for undergrad is fit!<br><br>Also, darkninja, no one really cares that you go to Harvard, so you can stop making threads about it.<br><br>", "<b>Username: CWalker</b><br><br>Amen. Well said.<br><br>", "<b>Username: kwu</b><br><br>What? He goes to Harvard?<br><br>", "<b>Username: Firecube2426</b><br><br>and harvard is much better than berkeley...no question...when i was in london...i told a guy that i went to harvard...he was like \"wow\"...then my friend next to me told him he went to ucb...and the guy was like...hmm never heard of that place....well...i'm sure its okay...but its no harvard hahah...<br><br>So what Dark Ninja said is that Harvard is better at pleasing and impressing people. Hey well that's a reason to go to Harvard right?<br><br>", "<b>Username: Phead128</b><br><br>I thought he was a Duke BME '12.<br><br>", "<b>Username: CWalker</b><br><br>The OP isn't really helping to alleviate the white elitist snob tag applied to Harvard students by a previous poster is he?<br><br>", "<b>Username: flyzeggs</b><br><br>Yes Columbia... Don't bother with the THES, go look @ the TARU, Columbia is #1 (although this is data that reflects funding of scientific projects more than anything) and has consistently ranked #1 in the country in many measures of research output, scientific patents etc...<br><br>", "<b>Username: dark ninja</b><br><br>ok let me clear the mess:<br><br>I, dark ninja, am Harvard Class of 2012 majoring in chemistry<br>My brother who uses my account only to write in duke forum is Class of 2012 duke bme<br><br>understand...kapeessh?<br><br>who do u like better lol...my brother or me...<br><br>", "<b>Username: dark ninja</b><br><br>and thus i am better than my brother...<br><br>harvard>duke...haahaahah<br><br>", "<b>Username: MrPrez</b><br><br>dark ninja lol<br>ridiculous.<br><br>", "<b>Username: DunninLA</b><br><br>butchokoy wrote: \"Harvard is better than Berkeley. I don't think there's any school on earth that is better than Harvard.\"<br><br>better ... in what?<br><br>Leaving all issue of \"fit\" aside (weather, size, geography, etc.)<br><br>- In the three professional schools? Yes, Harvard is \"better\" per most rankings.<br>- In the 41 Ph.D. disciplines? No, at least not in 32 of 41 of them, where Berkeley is ranked higher by peer faculties.<br><br>So you've got Berkeley \"better\" in the great majority of Ph.D. disciplines, and Harvard better in the three professional schools. You've got Harvard ranked higher as an overall undergraduate school (how is this relevant unless you are planning to complete all 50+ majors?), but behind Berkeley is many undergraduate majors.<br><br>So you see, it depends.<br><br>", "<b>Username: flyzeggs</b><br><br>juillet: The keyword is RESEARCH -> IF = impact factor. Go look @ the last HEEACT rankings/data from 2007. In terms of research impact yes they place very frequently in the 15-20 category (in terms of peer rankings they often make it in the top 5, which seems a bit contradictory (like THES), but I assure you that will change dramatically in less than 10 years). Ask any person who has moved on to either one of the schools from any top tier American univ. and they will tell you how overrated these two schools, and even more so most top UK universities are (in terms of research).<br><br>There are plenty of threads on this subject in this forum, just look around. They're known for their academic rigour (- engineering programs) much more than for their research. Oxbridge are still top research universities, definitely not top 5 though, sorry.<br><br>", "<b>Username: flyzeggs</b><br><br>\"- In the 41 Ph.D. disciplines? No, at least not in 32 of 41 of them, where Berkeley is ranked higher by peer faculties.\"<br><br>I would really like to see the source for this.<br><br>", "<b>Username: CWalker</b><br><br>flyzeggs,<br><br>I moved on to one of those school from a top tier American university and I'd say that Oxbridge is on par. They may not have the money of Harvard, but neither does Berkeley and they get by just fine...actually better than Harvard as many have been arguing in this thread. As much as you would like to believe it, Harvard is not in a world of its own. I agree that THES is seriously flawed, but Oxbridge performs well in the Shanghai rankings too (which are RESEARCH based)<br><br><url>http://www.arwu.org/rank/2007/ARWU2007_Top100.htm</url><br><br>I can certainly live with Cambridge behind Harvard, Stanford, and Berkeley<br><br>", "<b>Username: CWalker</b><br><br>I just looked over the HEEACT rankings and they are no better than any other ranking system...maybe worse. First of all, scientific research and publishing isn't everything. Secondly, do you really think that Caltech is the 32nd best university based on scientific research? The reason they are is because the HEEAT awards larger universities with larger faculties which in turn churn out more papers. It would take me a while to sort out what faculty # the HEEAT uses for each university, but I would bet that Harvard has a larger faculty than Cambridge which in turn is larger than Caltech.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"\"- In the 41 Ph.D. disciplines? No, at least not in 32 of 41 of them, where Berkeley is ranked higher by peer faculties.\"<br><br>I would really like to see the source for this.\"\"<br><br><a href=\"http://www.stat.tamu.edu/~jnewton/nrc_rankings/nrc41.html\" rel=\"nofollow\">NRC Rankings in Each of 41 Areas</a><br><br>New NRC rankings are due soon.<br><br>", "<b>Username: flyzeggs</b><br><br>The Shanghai rankings are a joke, 50% of the score is for Nobel Prizes and publications in Nature and Science, and it's barely corrected for size.<br><br>THES > Shanghai. I consider peer assesment scores, recruiter scores, alumni success etc... a much better indicator of a university's performance, and prestige, even though the process ia a bit mysterious and it's very hard to use the same method for every country. I'm not denying Oxbridge are great, I think 15-20 in research (which as you mentioned isn't everything) seems pretty right considering how many great American research universities there are...<br><br>Your right though, at least 6 of the categories used by the HEEACT are related to size and that can possibly account for why there are so many public American univ.s in the top 25 (And the University of Toronto -> 74000+ students)<br><br>I would also think Harvard has a much larger faculty.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"THES > Shanghai\"\"<br><br>The THES rankings change drastically from year to year... which really destroys any credibility they had.<br><br>", "<b>Username: flyzeggs</b><br><br>But I should add those categories only account for 20%.<br><br>\"research productivity (accounts for 20%), research impact (30%), and research excellence (50%)\"<br><br>80% impact and \"excellence\" vs. 50% nobel prizes and publications in two (albeit the most important) journals in the natural sciences. Shanghai looks much more flawed.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"80% impact and \"excellence\" vs. 50% nobel prizes and publications in two (albeit the most important) journals in the natural sciences. Shanghai looks much more flawed.\"\"<br><br>I think it's more accurate to say that the Shanghai ranking has left itself open for the <i>possibility</i> for flaws; in other words, there's more opportunity for error to pop up in their rankings. However, you'd be surprised how highly correlated Nobel Prizes/publications and impact/excellence are. Thus, the rankings will be similar.<br><br>", "<b>Username: flyzeggs</b><br><br>Also the numbers don't add up correctly...<br><br>", "<b>Username: flyzeggs</b><br><br>Also the very stupid thing about Shanghai's Nobel Prize ranking is that it awards points to an institution if the laureate is a member of the faculty in the univ. at the time of winning the prize, rather than rewarding universities where the Nobel prize winning research took place. Pulications in N and S are also closely related to the size of the university.<br><br>", "<b>Username: danielhstennis08</b><br><br>remember dark knight? i think that he and dark ninja are both ****....<br><br>", "<b>Username: Tyler09</b><br><br>I'm from illinois,<br><br>If it wasn't for CC I honestly wouldn't think Cal was a big deal. Outside of california i don't think a debate about whether Cal was better than Harvard, even Duke, and probably even John Hopkins or Notre Dame, would even occur.<br><br>UVA, UMich, and UCLA are all considered peer schools of Cal. And in my opinion I would attend UMich then UCLA over Cal, and I would guess a lot of people share my sentiment.<br><br>Just some perspective to keep in mind.<br><br>", "<b>Username: danielhstennis08</b><br><br>yea, bottom line... all you Cal undergrads OVERRATE it so much... if you're are an OOS Cal undergrad, you were definitely an accomplished high schooler... good job on getting there...<br><br>Cal is known for its grad school while Harvard is just all around great...<br><br>", "<b>Username: kyledavid80</b><br><br>^^ I too am from Illinois, and while even there I wouldn't consider Cal better than Harvard, I could see arguments made about Cal being better than Duke, JHU, or ND. This is purely from its reputation; I honestly wouldn't see much point in arguing about that, since each has its strengths and none is better than the other.<br>\"\"UVA, UMich, and UCLA are all considered peer schools of Cal. And in my opinion I would attend UMich then UCLA over Cal, and I would guess a lot of people share my sentiment.\"\"<br><br>And a lot more wouldn't. Cal, I believe, is generally preferred over UMich and UCLA, if you look at the revealed preference rankings, which are flawed, though.<br>\"\"all you Cal undergrads OVERRATE it so much... if you're are an OOS Cal undergrad, you were definitely an accomplished high schooler... good job on getting there...\"\"<br><br>I'm not even a Cal undergrad and I don't think that those here are \"overrating\" it. Harvard, while being an amazing school, doesn't have that much of an advantage over schools like Columbia, Berkeley, etc. at the undergrad level. I would say that Harvard overall is better than Berkeley overall (with Berkeley being stronger for grad school, Harvard for undergrad).<br><br>Either way, why would you say \"good job\" to those who get in OOS? Getting into Berkeley period--in-state, too--is pretty amazing. The acceptance rate is very very low, roughly 1 in 5, for in-state.<br>\"\"Cal is known for its grad school while Harvard is just all around great...\"\"<br><br>Some would say that Harvard also suffers from the same problem Cal does: a lack of undergrad focus. Of course, it would be to a much lesser extent, but you get my point.<br><br>", "<b>Username: danielhstennis08</b><br><br>ok, UCBChemEGrad..... obviously you are biased... but anyways, berkeley is NOT a better graduate school overall than harvard... let's be serious... it may very well be top 5 in the nation though which IS amazing... the students in state that get accepted to UCB are \"pretty amazing\" according to you?!? i mean... that's a matter of opinion i suppose, but considering that the average SAT score of UCB is barely over 1300, and it is known to be MUCH easier to get into in state, one would think that the in state students aren't all that great on average... then again, i'm sure many are....<br><br>Harvard does focus more on grad school, for that is where the prestige lies... but it is still consistently ranked as one of the top undergraduate schools in the world...<br><br>and i don't consider UCB undergrad a peer to Duke and JHU (maybe ND)... those two are overall better undergraduate institutions, while UCB is an overall better graduate institution...<br><br>i really don't think this is all that complicated...<br><br>", "<b>Username: Bourne</b><br><br>Duck And Run People!! Duck And Run!<br><br>", "<b>Username: DunninLA</b><br><br>danielstennis08 -- again, it depends on the discipline.<br><br>For the 3 professional schools (which I gather is all that most posters here care about), H is #1, Berkeley is #4.<br><br>For the 41 Ph.D. disciplines grouped into 5 major areas, Berkeley is #1 and H is #4.<br><br>There are two answers to which is better for grad school.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"but anyways, berkeley is NOT a better graduate school overall than harvard\"\"<br><br>Uh, I'd say it is. Berkeley was ranked in the top 10 in 35 disciplines, compared to Harvard's 25. In the US News rankings, Berkeley was ranked in the top 10 in all of them.<br>\"\"that the in state students aren't all that great on average\"\"<br><br>I'm sorry that CC has corrupted your mind so much that you consider top students like those at Berkeley to be \"not all that great.\"<br>\"\"those two are overall better undergraduate institutions, while UCB is an overall better graduate institution...\"\"<br><br>I can see why you think that. FWIW, I'd easily choose Cal over JHU and Duke even if they are \"better\" for undergrad (because, in my opinion, there are more important things than the % classes under 20 and the alumni giving rates).<br><br>", "<b>Username: ourlady.peace</b><br><br>\"\"UC schools are a joke. the UC schools system is designed for retards. look at their exit exams - designed for an 8th grader. all of the kids entering the UC's are practically retarded.\"\"<br>Just because you pass the exit exam, doesn't mean you can get into a UC. You're probably confusing the UC system with the CSU one, only because the requirements for those schools are generally lower. Either way, at least students who pass the exit exam can usually form coherent paragraphs.<br>\"\"they forget that a Harvard grad vs a Cal grad with the same grades = Harvard getting the job every time.\"\"<br>Not when you take into account experience, field of study, and the assholishness of the applicant.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/danieltennis\">danieltennis</a> wrote:\"\"<br>For some majors and disciplines, yes, that is true - particularly in the grossly limiting major of biomedical engineering. For other majors and disciplines, Cal is stronger than Duke and JHU.<br><br>", "<b>Username: danielhstennis08</b><br><br>i've never heard BME referred to as \"grossly limiting,\" but yea, they do kick Cal's ass in that area plus many many more....<br><br>", "<b>Username: kyledavid80</b><br><br>^^ BME is often referred to as \"limiting,\" because it boxes you in and narrows your focus, harming marketability. Many recommend a more traditional engineering path.<br><br>It's hard to say that they \"kick Cal's ass\" in BME when Berkeley is also ranked in the top 10. Please tell me what other (\"many many\") areas that Duke and JHU beat Cal in. Then I can tell you all the areas that Cal beats Duke and JHU in. :)<br><br>(All of Berkeley's programs are consistently ranked in the top 10. Duke/JHU can only claim a handful. In fact, in the five main areas, no other university has the breadth and depth that Cal has, but a few come close. In world rankings of the main areas of study, Harvard and Berkeley ranked at the top. Duke and JHU didn't even come close.)<br><br>", "<b>Username: danielhstennis08</b><br><br>in undergraduate ranking, berkeley doesn't come close to duke, jhu, and especially not harvard... deal with it<br><br>", "<b>Username: danielhstennis08</b><br><br>read what berkeley students say... that should tell you enough about cal's undergrad...<br><br><a href=\"http://www.google.com/search?hl=en&amp;safe=off&amp;client=firefox-a&amp;rls=org.mozilla:en-US:official&amp;hs=sPl&amp;pwst=1&amp;sa=X&amp;oi=spell&amp;resnum=0&amp;ct=result&amp;cd=1&amp;q=berkeley+sucks+for+an+undergraduate+education&amp;spell=1\" rel=\"nofollow\">berkeley sucks for an undergraduate education - Google Search</a><br><br>first site that pops up...<br><br>", "<b>Username: UCBChemEGrad</b><br><br>^ USNews <i>undergraduate</i> rankings in business and engineering have Berkeley at No. 3 and No. 2, respectively... deal with it.<br><br>", "<b>Username: amb3r</b><br><br>Don't let this board represent the attitude of Harvard students.. I don't think most/any of these posters actually attend. Most of us realize that Harvard is not tops in every field, anyway. There's also the issue of regional bias. On the east coast people usually have wayyyy lower interest in Cal or UCLA than on the west (I'm from the east.) I had no idea Cal and UCLA were prestigious until I came on CC. But if you live in California it's a different story. Anyway, what's the point of this thread? For someone to brag about getting into Harvard?<br><br>", "<b>Username: danielhstennis08</b><br><br>USNEWS UNDERGRADUATE RANKINGS<br><br>Overall:<br><br>Berkeley: 21st<br><br>that's all folks :)<br><br>", "<b>Username: danielhstennis08</b><br><br>\"\"Don't let this board represent the attitude of Harvard students\"\"<br><br>i'm not a harvard student... all i'm saying is that you can't say berkeley is overall as good as harvard... ESPECIALLY at the undergraduate level... not in everything, but overall....<br><br>and that whole thing about east vs. west is very true... i live on the east coast and many people have no clue what berkeley is...<br><br>", "<b>Username: thisdude415</b><br><br>There's something to be said for attending school at the worlds second largest non-profit organization (behind only the Bill and Melina Gates Foundation).<br><br>There's also a certain something to be said for being able to say, \"I went to Harvard,\" and ANYONE ANYWHERE will know the exact school you're talking about.<br><br>Let me just say they're both fine schools in academics, and probably little difference exists. So you must turn to what's different between the two. I've just given fine examples of two.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>\"\"all i'm saying is that you can't say berkeley is overall as good as harvard... ESPECIALLY at the undergraduate level\"\"<br>I don't think anyone on this thread said Berkeley undergrad overall is better than Harvard.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"in undergraduate ranking, berkeley doesn't come close to duke, jhu, and especially not harvard... deal with it\"\"<br><br>Berkelely's only ranked a few spots behind JHU. Considering that there are some 4,200 colleges, you're talking about the difference between being better than 99.8% of colleges and being better than 99.5% of colleges. It's petty to see such incremental differences.<br><br>Or, if you like parallelism, in quality of programs and faculty, Duke and JHU don't even come close to Berkeley... deal with it. :]<br>\"\"all i'm saying is that you can't say berkeley is overall as good as harvard\"\"<br><br>Who said it was? I don't think even the Berkeley cheerleaders would try to make such a bold claim.<br><br>Oh, and:<br><br><a href=\"http://www.google.com/search?hl=en&amp;safe=off&amp;client=firefox-a&amp;rls=org.mozilla%3Aen-US%3Aofficial&amp;q=harvard+sucks+for+an+undergraduate+education&amp;btnG=Search\" rel=\"nofollow\">harvard sucks for an undergraduate education - Google Search</a><br><br>First result. And third.<br><br>", "<b>Username: danielhstennis08</b><br><br>no one has said those thing? open your eyes and read the posts<br><br>", "<b>Username: tomtom6</b><br><br>By the first result do you mean the crimson one? Have you read that one?<br><br>\"100 HARVARD STUDENTS COMPLAIN TOO MUCH\"<br><br>It was sarcastic.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"no one has said those thing? open your eyes and read the posts\"\"<br><br>What thing?<br>\"\"By the first result do you mean the crimson one? Have you read that one?<br><br>\"100 HARVARD STUDENTS COMPLAIN TOO MUCH\"<br><br>It was sarcastic.\"\"<br><br>I'm aware, but I assumed you could see the element of truth in some of the items on the list.<br><br>", "<b>Username: flyzeggs</b><br><br>I'm sorry but one BS USNews ranking (which I can tell it really is just by looking at the neuroscience rankings) is not enough justification to say that Berkeley grad is better than Harvard. Berkeley's star is fading, in many areas it has been eclipsed by UCLA (overall Cal >>>>>>>>>>>>UCLA). And don't get me wrong, I have a lot of respect for Cal but it's foolish to deny certain realities and I'm not saying that other public research oriented universities don't have their share of problems.<br><br>Cal students from California are (for the most part) in the top 10% of their class, which isn't exactly Harvard, but it's not at all as bad as some of you make it. My suggestion though to anyone who has studied or worked in Berkeley is to check other \"top\" dept.'s facilities because it is not at all well funded for a university of its size (UMich has a much higher endowment and spends nearly twice as much annually on research, 15,000 vs. 10,000 postgrads). But one thing is for sure, at the grad level Berkeley attracts some of the best students in the country and I really like the fact that they look for people who are into their fields and doing research more than anything (this is the impression I got while working there during the summer) it gives a person like me (who doesn't have the greatest marks in the world) hope that all his \"passion\" and research experience might actually amount to something.<br><br>", "<b>Username: Bacchanalia</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/butchokoy\">butchokoy</a> wrote:\"\"<br>Who determines what school deserves to be top 10 in the world? Berkeley isn't even top 20 in the United States, let alone the world. Its undergraduate program is far weaker than those of Notre Dame, JHU or Duke.<br>\"\"<a rel=\"nofollow\" href=\"/profile/kyledavid80\">kyledavid80</a> wrote:\"\"<br>Two can play that game buddy. Duke kills Berkeley in every conceivable measure of undergraduate quality: student body strength, advising, faculty resources, job placement, med school acceptance rate, law school acceptance rate, financial resources per student, grants/stipends for study abroad/civic engagement, alumni satisfaction, student preference, etc.<br><br>Duke is a top 10 undergraduate institution, arguably top 5. JHU is a solid top 15 school. Berkeley is top 25 at best. It doesn't have nearly the cachet that people on this site think it does.<br><br>", "<b>Username: CWalker</b><br><br>\"I'm sorry but one BS USNews ranking (which I can tell it really is just by looking at the neuroscience rankings) is not enough justification to say that Berkeley grad is better than Harvard.\"<br><br>What's wrong with the neuroscience ranking? You're school not at the top?<br><br><a href=\"http://grad-schools.usnews.rankingsandreviews.com/grad/bio/neurosciences\" rel=\"nofollow\">Neuroscience/Neurobiology - Biological Sciences - Best Graduate Schools - Education - US News and World Report</a><br><br>", "<b>Username: Brown man1987</b><br><br>\"\"Two can play that game buddy. Duke kills Berkeley in every conceivable measure of undergraduate quality: student body strength, advising, faculty resources, job placement, med school acceptance rate, law school acceptance rate, financial resources per student, grants/stipends for study abroad/civic engagement, alumni satisfaction, student preference, etc.\"\"<br><br>Do we have another evil asian dictator on our hands?<br>\"\"med school acceptance rate, law school acceptance rate,\"\"<br><br>Maybe if they actually released those numbers rather than releasing some bullcrap inflated numbers, we could actually legitimately compare the two schools in this category.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/danielhstennis\">danielhstennis</a> wrote:\"\"<br><br>oh by the way- Berkeley does not superscore its SATs while most other schools do so I think you have to be very careful in comparing its scores with those of other schools. Its SAT scores come from one sitting while those of other schools come from the best you did on each section after taking the SATs in multiple sittings.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>\"\"in many areas it has been eclipsed by UCLA\"\"<br>Oh really? In what fields? IMO, UCLA's reputation has declined. It used to be stellar for engineering and other fields...now, not so much.<br>\"\"Duke kills Berkeley in every conceivable measure of undergraduate quality: student body strength, advising, faculty resources, job placement, med school acceptance rate, law school acceptance rate, financial resources per student, grants/stipends for study abroad/civic engagement, alumni satisfaction, student preference, etc.\"\"<br>You mean Duke student body on average has higher SAT scores, smaller class sizes, and larger endowment per undergraduate student. Advising, grants/stipends for study abroad/civic engagement and alumni satisfaction...I need to see more proof.<br><br>I wouldn't choose Duke because it doesn't have a chemical engineering program. So much for being a \"top 10 undergraduate\" institution...<br><br>", "<b>Username: Bacchanalia</b><br><br>^See, that's a valid reason for going to a place like Cal over a top 10 school. If it doesn't have the major you're interested in...<br><br>Alumni satisfaction can be seen by extremely high alumni giving rate that Duke has yearly. This year it is #2 I believe behind Princeton.<br><br>Also, Duke has launched the most ambitious service-learning program of any college in the country recently: <a href=\"http://dukeengage.duke.edu/\" rel=\"nofollow\">DukeEngage | Home</a><br><br>", "<b>Username: Brown man1987</b><br><br>\"\"Alumni satisfaction can be seen by extremely high alumni giving rate that Duke has yearly. This year it is #2 I believe behind Princeton.\"\"<br><br>Nope Dartmouth is.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"Berkeley's star is fading, in many areas it has been eclipsed by UCLA (overall Cal >>>>>>>>>>>>UCLA)\"\"<br><br>I daresay Berkeley has maintained its dominance in its quality of programs. It goes out of its way to maintain themwhether in top faculty, top facilities, broad library holdings, etc. In the last NRC ranking, UCLA beat Cal in only a small handful of disciplines, and in those Cal was also ranked in the top 10 (so not much difference). And in all the rest? Cal eclipsed UCLA.<br>\"\"Berkeley is to check other \"top\" dept.'s facilities because it is not at all well funded for a university of its size\"\"<br><br>Do you want to substantiate that claim? Berkeley spends over $500 million on non-medical research; if you count UCSFs spending on research (to make comparisons more equal), it spends more on research than any other university, including JHU. And thats not even counting the research funding at the labs that Berkeley manages.<br><br>Believe me: Berkeleys facilities are constantly being added to and upgraded. Theyre probably on par with other top departments facilities, more likely than not. (In some cases, betterBerkeleys phonology lab leaves most top ones in the dust, etc.) These facilities, by the way, are often, if not usually, available to undergrads.<br>\"\"UMich has a much higher endowment and spends nearly twice as much annually on research, 15,000 vs. 10,000 postgrads\"\"<br><br>Really? Whered you get that figure?<br>\"\"Berkeley isn't even top 20 in the United States, let alone the world.\"\"<br><br>You criticize the precious US News rankings, yet you say this? Hmm, I smell some hypocrisy<br>\"\"Its undergraduate program is far weaker than those of Notre Dame, JHU or Duke.\"\"<br><br>If you want to use US News rankings, then lets look at Notre Dames place for undergrad quality: its at #19 most recently, two spots behind Berkeley at #21. And werent you criticizing me and others for stratifying among the top 10, yet here you are doing that for a difference in <i>two spots<i>? That smell is getting stronger<br><br></i></i><br>\"\"Duke kills Berkeley in every conceivable measure of undergraduate quality: student body strength, advising, faculty resources, job placement, med school acceptance rate, law school acceptance rate, financial resources per student, grants/stipends for study abroad/civic engagement, alumni satisfaction, student preference, etc.\"\"<br><br>What UCBChemEGrad said<br>\"\"Duke is a top 10 undergraduate institution, arguably top 5.\"\"<br><br>Lather, rinse, and repeat. ;)<br>\"\"Do we have another evil asian dictator on our hands?\"\"<br><br>I think so. Which leads me to believe that this thread too should be ended, as it will go nowhere with a brick wall in the way.<br>\"\"Also, Duke has launched the most ambitious service-learning program of any college in the country recently\"\"<br><br>How is that the most ambitious? How is it any better than the programs at Stanford or other schools? And what does this have to do with anything? (EAD indeed)<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"(EAD indeed)\"\"<br><br>Haha so true.<br><br>\"\"Duke is a top 10 undergraduate institution, arguably top 5. JHU is a solid top 15 school. Berkeley is top 25 at best. It doesn't have nearly the cachet that people on this site think it does.\"\"<br>\"\"Duke kills Berkeley in every conceivable measure of undergraduate quality: student body strength, advising, faculty resources, job placement, med school acceptance rate, law school acceptance rate, financial resources per student, grants/stipends for study abroad/civic engagement, alumni satisfaction, student preference, etc.\"\"<br><br>Here is the Duke syndrome again. Yet another Duke alum that needs to try to bolster the rep of his school by claiming it's better than it actually is and proceeding to belittle other schools to feel better about himself and his school.<br><br>Guys, if Duke is so great then why do you need to convince us? I don't see MIT alums parading around this forum stating \"MIT is arguably a top five institution, whereas Caltech is a solid top 10 school, and Berkeley isn't even close. MIT is better than your school\" or \"MIT kills Berkeley in every conceivable measure of undergraduate quality.\"<br><br>Why? Because it is obviously understood that MIT is great. Duke on the other hand... I always see Duke alums playing up their school and putting down others. If you guys are secure about your school's status as an elite institution, and really think Duke is as great as you all make it out to be, putting down other schools is not necessary.<br><br>", "<b>Username: Bescraze</b><br><br>Ok I have no affiliation with Duke or interest in attending. Yet, you people continually deride anyone who says anything complimentary toward Duke and then in the height of hypocrisy make Berkeley out to be a top 5/10 undergrad university.<br>\"\"Guys, if Duke is so great then why do you need to convince us?\"\"<br>I could say the same about Berkeley?<br><br>Berkeley is a great school, but it is not nearly as good as Harvard or Duke. Is it comparable to JHU....maybe, but anywhere outside the west coast Berkeley is just considered a top state school.....not a top top university (like HYPSM or even the next tier).<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"I could say the same about Berkeley?<br><br>Berkeley is a great school, but it is not nearly as good as Harvard or Duke. Is it comparable to JHU....maybe, but anywhere outside the west coast Berkeley is just considered a top state school.....not a top top university (like HYPSM or even the next tier).\"\"<br><br>It's okay to say Duke is an awesome school and be proud of your school if you are a Duke alum. But if Duke students are really secure about their schools reputation as a top university, it's not necessary to parade these forums and say Duke is better than schools X, Y, and Z. It should just be obvious. Students from other elite schools don't go around doing this so there has to be something wrong with the select Duke students that do this. For instance, everyone knows Harvard is a great school, but do you see its alums parading these forums stating \"Harvard is better than Berkeley in every conceivable measure of undergraduate quality?\"<br><br>Berkeley students don't parade these forums and claim that their school is better than other people's schools. Duke students do, and Berkeley students are just defending their own school.<br><br>I have no affiliation with either school but I am sick and tired of Duke kids/alums going around and stating things like \"Duke kills Berkeley in every conceivable measure of undergraduate quality.\" If you all really think your school is so great, its reputation should speak for itself. Otherwise, all I see is insecurity.<br><br>", "<b>Username: Bacchanalia</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/kyledavid80\">kyledavid80</a> wrote:\"\"<br>Too bad I'm not talking about the USNews rankings. When did I ever say that? With regards to the proper measures of undergraduate quality, which I don't think USNews fully measures, there are 20 schools I can think of that are better than Berkeley. Once again you make invalid assumptions.<br>\"\"<a rel=\"nofollow\" href=\"/profile/kyledavid80\">kyledavid80</a> wrote:\"\"<br>I don't give a crap about USNews and its latest rankings. From what I know of both schools, ND has the edge over Berkeley with regards to the quality of the undergraduate education.<br>\"\"<a rel=\"nofollow\" href=\"/profile/kyledavid80\">kyledavid80</a> wrote:\"\"<br>No other school, including Stanford, has launched such a detailed and formal program for civic engagment. I only presented it because UCBChem said he needed proof that Duke does indeed have a focus in the service learning area. What's an EAD?<br>\"\"<a rel=\"nofollow\" href=\"/profile/Brown%20man1987\">Brown man1987</a> wrote:\"\"<br>Haha the \"Duke Syndrome\"? What you have detailed is present at every non-HYP Ivy almost tenfold in comparison to other top schools like Duke and Stanford. I'm not \"bolstering\" the rep of my school. The undergraduate focus of schools like Duke, Northwestern, ND,etc. is greater than Berkeley's. I always thought this was universally acknowledged and not a statement of conflict. I'm not \"putting down\" any school. Berkeley's a fantastic school.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"Yet, you people continually deride anyone who says anything complimentary toward Duke and then in the height of hypocrisy make Berkeley out to be a top 5/10 undergrad university.\"\"<br><br>The difference here, Bescraze, is: Berkeley and Harvard are the subject of this thread. Duke is not.<br><br>And I don't see anyone trying to claim that Berkeley is on par with HYPSM for undergrad... or other top-10 schools.<br>\"\"Berkeley is a great school, but it is not nearly as good as Harvard or Duke.\"\"<br><br>I can agree with that, for undergrad. At the same time, that statement seems to imply, Berkeley is mediocre for undergrad, which is untrue. For overall university strength, I wouldn't say Duke > Berkeley at all.<br>\"\"Too bad I'm not talking about the USNews rankings. When did I ever say that? With regards to the proper measures of undergraduate quality, which I don't think USNews fully measures, there are 20 schools I can think of that are better than Berkeley. Once again you make invalid assumptions.\"\"<br><br>Right--nice cover up.<br>\"\"No other school, including Stanford, has launched such a detailed and formal program for civic engagment.\"\"<br><br>I daresay Stanford's is more established, elaborate, and significant, and will probably continue to be so. Stanford emphasizes service learning in all its descriptions of the education it gives. (In fact, Stanford requires its undergrads to take ethics courses, in following Leland Stanford's idea that undergrads should be trained to be helpful citizens--again alluding to service learning.)<br><br>", "<b>Username: Bacchanalia</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/Brown%20man1987\">Brown man1987</a> wrote:\"\"<br>\"\"<a rel=\"nofollow\" href=\"/profile/Berkeley%20supporter\">Berkeley supporter</a> wrote:\"\"<br><br>Let's not even talk about datalook who thinks Yale's graduate programs are \"weak\".;)<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"Why don't you call out the Berkeley students in this discussion who have resorted to using sophomoric remarks to elevate Berkeley above other schools?\"\"<br><br>Berkeley students don't elevate their school over others, Duke students do.They are the ones defending their schools against Duke grads like you who try to put their schools down. When have you ever seen a Berkeley student parading these forums claiming Berkeley is better than another school in \"every conceivable measure of undergraduate quality\" like you and many other Duke students? Answer this please. Berkeley students don't parade these forums and claim that their school is better than other people's schools. Duke students do, and Berkeley students are just defending their own school.<br><br>I only see alums from Duke such as yourself saying things like \"Duke is better than your school every conceivable measure of undergraduate quality.\" And this happens quite often on these boards.<br><br>", "<b>Username: Bacchanalia</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/Brown%20man1987\">Brown man1987</a> wrote:\"\"<br>If you switch \"undergraduate quality\" with \"graduate quality\", then yes I seem to find Berkeley supporters proclaiming it all the time. You would think Berkeley was as good as Harvard by just glancing at these forums. I was just responding to butchokoy who thinks that UVa undergrad is on the same level as Duke undergrad and Cal is a notch above both. I was just trying to show how false he was. I don't see why you're arguing with me.<br><br>", "<b>Username: danielhstennis08</b><br><br>i'm starting to wonder if Bacchanalia is another one of the many anti-duke **** that give all of you such a bad impressions of my school... some of the stuff he says is ridiculous<br><br>", "<b>Username: sofla951</b><br><br>Duke and Berkeley are peers. Duke students want to think otherwise because they are spending up to 4 times more than the average Berk student, ofcourse they'll want to think that Duke is better. I am from FL and Duke is respected but so is Berkeley but also alot of ppl around where I am from think Duke is just a bunch of rich kids who payed their way into the school. Berkeley is also seen by alot as just a hippie school. Neither rep is really acurate. I will be the first to admit Berkeley is not on the level of HYSPM, in general public opinion in the US, but neither is Duke. Berkeley is making significant efforts to increase alumni participation and giving. Its a public school and does not have the tradition of giving...yet. This year the student call center surpassed last year's net total in donations by over 33%, and thats during a rough economic period. Also this year athletics raised over ten million.... less than five years ago it was only around 4 million. And isn't this thread about Harvard vs Berkeley. UG rep Harvard>>Berkeley Grad rep Harvard=Berkeley UG quality probably Harvard but I have talked to a couple grad students at Berk who did UG at Harvard and said it was unsupportive and cold.......jeez I wonder what they would think of Berkeley...and we don't complain.<br><br>", "<b>Username: dark ninja</b><br><br>duke is better than berkeley especially in sports.<br><br>", "<b>Username: Chairman Meow</b><br><br>Duke<br><br>Total NCAA Team Championships: 9<br>men's championships: 4<br>women's championships: 5<br>coed championships: 0<br><br>Breakdown by Sport:<br>men's basketball: 3<br>women's golf: 5<br>men's soccer: 1<br><br>California<br><br>Total NCAA Team Championships: 26<br>men's championships: 23<br>women's championships: 3<br>coed championships: 0<br><br>Breakdown by Sport:<br>men's baseball: 2<br>men's basketball: 1<br>men's golf: 1<br>men's gymnastics: 4<br>women's rowing: 2<br>women's softball: 1<br>men's swimming &amp; diving: 2<br>men's outdoor track &amp; field: 1<br>men's water polo: 12<br><br>", "<b>Username: CalBear2009</b><br><br>Wasn't this originally a Harvard/Berkeley topic?<br><br>", "<b>Username: kyledavid80</b><br><br>^^ every thread is a Duke thread. :rolleyes:<br><br>", "<b>Username: CalBear2009</b><br><br>lol (10 char)<br><br>", "<b>Username: Bescraze</b><br><br>whats the point of a harvard berkeley thread when everyone knows Harvard is better and more prestigious. Ok topic over<br><br>", "<b>Username: CalBear2009</b><br><br>I'm not disagreeing with you at all. I go to Cal and I know that we mostly have regional prestige. But it's interesting to see people trying to either justify or disprove it. What can I say... it's the off-season.<br><br>", "<b>Username: z-score</b><br><br>Basketball, hockey, lacrosse, baseball and football are the only sports that really matter for a college's reputation. Water Polo? Gymnastics? Come on.<br><br>", "<b>Username: z-score</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/butchokoy\">butchokoy</a> wrote:\"\"<br>It's spelled \"pales\" first of all. You don't think that besides HYPSM, there are any other schools that are better than Berkeley at the undergrad level? That's a pretty ridiculous assertion. Berkeley's not even ranked in the top 20 in USNews and trails in essentially every measure of undergraduate quality in comparison to the top 10 schools(HYPS, MIT, Penn, Duke, Caltech, Chicago and Columbia).<br><br>At the graduate level, people are only focusing on one area of study so I don't even see the point of considering \"overall\" graduate and professional strength. If Wisconsin is ranked higher than Berkeley in one thing and Berkeley is better than Wisco in every other area of study, then the person who is interested in that one thing should still go to Wisconsin. If I'm interested in attending law school, then why do I care what the top medical schools are or which universities are ranked higher in art history at the graduate level? People just focus on ONE THING after undergrad.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/z-score\">z-score</a> wrote:\"\"<br><br>Wow.... is this EAD once again after being banned twice?<br><br>", "<b>Username: danielhstennis08</b><br><br>maybe not every measure of undergraduate quality... but berkeley is no where near a top 10 undergrad school... but a great grad school, no doubt<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"I don't believe there's any evidence to suggest Cal professors are any better than profs at any top private schools or LACs.\"\"<br><br>You're right, there isn't. But there's no way to measure teaching quality. If there were, US News would be using it. So, what do you look at when you look at professors? Curriculum vitae, essentially. And most of Berkeley's professors are very accomplished, leaders in their field, who publish influential books and articles highly cited in journals and such. That's why Berkeley is known for its academic quality. Teaching? Hit or miss. The same as at any school.<br><br>By the way, for class sizes:<br><br>Berkeley: 62% under 20, 14% over 50<br>Harvard: 69% under 20, 11% over 50<br><br>Not very different.<br>\"\"When it comes to job placement in say Wall Street though, schools that don't have a lot of \"academic cachet\" like Dartmouth and Duke solidly destroy Berkeley in recruitment because of their overall prestige.\"\"<br><br>I won't criticize your thought process there because you're a new poster, but the reason that Dartmouth and Duke \"destroy\" Berkeley is not because of their prestige (to recruiters, they hold no more prestige than Berkeley); it's because of their location. Wall Street is on the East Coast, as are Dartmouth and Duke.<br><br>Now let's look at Dartmouth's and Duke's placement into top companies in Silicon Valley. Guess what? Berkeley destroys them. And it probably does in LA, SF, and all over the West Coast. (One thing to note about Berkeley: it has maintained high-quality academics while also educating many people, a relation which is often negative correlated. Because of this, Berkeley's grads stretch its prestige, as they populate--if not dominate--academia, and high-paying companies as well. Berkeley's grads are everywhere in esteem.)<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"Well, Silicon Valley is a prime location for engineers.\"\"<br><br>Not just engineers. Computer scientists (yes, this is often separated from engineering), including software developers, as well as consultants and a lively finance scene.<br>\"\"I don't think Berkeley engineers would be favored by Google or Microsoft in any case over engineers from say MIT or Duke. It's just that less apply for positions in that region than Berkeley grads.\"\"<br><br>And recruiters don't favor MIT and Duke (for Wall Street, for example) over Berkeley grads. It's just that they apply less for positions in that region. Why go to the East Coast when there are plenty of opportunities where they are?<br>\"\"However, recruiters actively favor grads from HYPSM, Duke, Dartmouth, etc. over Berkeley grads.\"\"<br><br>Want to give a source for that? In all my time on CC and many explorations of such recruiting, never have I heard such a claim made seriously. The general wisdom is that they do not \"actively favor\" those grads. And if they do, then companies in SV will favor Berkeley over grads from Duke, Dartmouth, HYP, etc.<br><br>Really, it's commonly known that it isn't your alma mater that gets you the job. In some cases, it might help you get an interview. However, it's the applicant qualifications--his experience, his knowledge, his skills--that get him the job.<br>\"\"If someone from Berkeley applies for an analyst postition at GS, then someone from Harvard, Wharton, Duke, etc. will most likely get the job over this person if all things are more or less equal.\"\"<br><br>No. Things are never that equal. It's going to depend on the applicant.<br>\"\"Check out some IBanking forums if you don't believe me.\"\"<br><br>I have extensively, thanks, and most of what you're claiming is the same that newbies to the field claim.<br>\"\"but it is not considered a solid target for the top investment banking and consulting firms.\"\"<br><br>At WS, perhaps--but they aren't going to really target a school 3,000 miles away. Notice that Stanford doesn't do as well, either, and guess what? It's 3,000 miles away as well.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"Harvard, Wharton, Duke,\"\"<br><br>One is different from the others. Which one doesn't belong?<br><br>", "<b>Username: Techie1988</b><br><br>Companies will hire those who do well in interviews. The well-informed recruiter will go to those schools with excellent programs in whatever fields they're looking for, regardless of their overall undergraduate rankings in USNWR. In engineering other than biomedical, it means that colleges like MIT, Stanford, Berkeley, Illinois, Michigan, and Carnegie-Mellon are looked at more favorably than Duke.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"Quote:<br>Harvard, Wharton, Duke,<br>One is different from the others. Which one doesn't belong?\"\"<br><br>Harvard, obviously...<br><br>", "<b>Username: Techie1988</b><br><br>\"berkeley is no where near a top 10 undergrad school...\"<br><br>Since when is the #20-21 undergraduate school \"nowhere near\" the T10 school.<br>And in what area? Alumni giving? Class size (especially in intro courses)? Maybe. But surely not in peer assessment; that's right, in the opinion of those who KNOW higher education, Berkeley is tops.<br><br>", "<b>Username: Bourne</b><br><br>\"\"But surely not in peer assessment; that's right, in the opinion of those who KNOW higher education, Berkeley <b>GRAD</b> is tops.\"\"<br><br>There, I finished that for you.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>^ Berkeley undergrad is tops too...<br><br>USNWR <i>undergrad</i> program rankings in engineering and business have Berkeley at #2 (tied with your 'furd) and #3, respectively.<br><br>", "<b>Username: z7xfla</b><br><br>Harvard = more prestige<br>Berkeley = better deal for your money (if you're in-state)<br><br>", "<b>Username: White_Rabbit</b><br><br>\"Harvard = more prestige<br>Berkeley = better deal for your money (if you're in-state)\"<br><br>hahahaha that's a joke I hope. As a in-state California resident who was accepted to both schools this year, I can PROMISE you that unless your family makes over $150,000+ Harvard is a cheaper school. My family income is under $100,000 and Harvard ended up being about $18,000-$20,000 cheaper a year then Berkeley.<br><br>", "<b>Username: rd31</b><br><br>was EAD really banned? how would anyone know this? [sorry off topic]<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"As a in-state California resident who was accepted to both schools this year, I can PROMISE you that unless your family makes over $150,000+ Harvard is a cheaper school. My family income is under $100,000 and Harvard ended up being about $18,000-$20,000 cheaper a year then Berkeley.\"\"<br><br>Yes, because your own personal case is the only one, right?<br><br>(Harvard made you pay as little as $5,000 dollars at an income of sub-100k?)<br><br>", "<b>Username: rd31</b><br><br>\"\"Harvard made you pay as little as $5,000 dollars at an income of sub-100k?\"\"<br><br>That actually sounds about right. The new financial aid initiatives at the top privates are phenomenal.<br><br>", "<b>Username: White_Rabbit</b><br><br>Harvard required my family to pay about $6,000 on a slightly under $100,000 income. They also required me to have a part time summer job.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"That actually sounds about right. The new financial aid initiatives at the top privates are phenomenal.\"\"<br><br>That's true, but I don't think that's terribly common. I know quite a few who made about 100k and Harvard required them to pay more (this past year). Of course, finaid is a complicated business, so I'm willing to bet that it can vary a considerable amount for cases like these.<br><br>Notably, Harvard's initiatives have expanded the most for families making up to $180k. Even Stanford, even with its expanded financial aid, typically gives free tuition to those making up to $100k, meaning they have to pay for room/board, etc. (effectively making it cheaper than a UC).<br><br>", "<b>Username: COlsen573</b><br><br>Harvard is 1000000 times better than Berkeley in every single way<br><br>", "<b>Username: White_Rabbit</b><br><br>I hope my post didn't come off as hating Berkeley. Both of my best friends attend Berkeley. I stayed with one for about 6 days during spring semester. Berkeley has it's advantages: great coffee shops and bookstores, famous professors, great sports teams, etc. However, I was a little disappointed when I attended three philosophy class and the number of kids in them were very large ( i.e 50, 100+, 250+). I was merely pointing out in my post that even for in-state students, Berkeley is often not a cheaper school.<br><br>", "<b>Username: DunninLA</b><br><br>Berkeley, UCLA, and the other UC schools are much more expensive for a CA resident making under $150,000 than Harvard, Princeton, Stanford, and many other private universties --- who this year started using their endownments to make educations for upper middle income families almost free.<br><br>", "<b>Username: Bescraze</b><br><br>butchokoy is simply a poster boy for berkeley. Does anyone here actually consider Berkeley to be a top 10 undergrad school? I understand location matters, but Stanford grads do very well in job placement all over the country (wallstreet, LA .....). When a school is that uniformly respected, I doubt the fact that its in California (5 hour flight) is really that much of a hurdle to getting jobs elsewhere. If people had to name the top 10 schools I bet it would be some variation of HYPSM, Penn, Columbia,CAL Tech Duke, then you can throw in some others....but Berkeley is not even there let alone the number 5 school ...<br><br>", "<b>Username: kwu</b><br><br>\"\"<br><blockquote class=\"Quote UserQuote\"><br><div class=\"QuoteText\">Harvard made you pay as little as $5,000 dollars at an income of sub-100k?\"\"<br>That actually sounds about right. The new financial aid initiatives at the top privates are phenomenal.</div><br></blockquote><br><br>Wow, that's great... my parents only make ~40,000, and my \"top private\" college is making us pay 21,000 a year!<br><br>Screw prestige, what a great value!<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"butchokoy is simply a poster boy for berkeley...\"\"<br><br>I believe Butchoky is actually a double legacy at Stanford.<br>\"\"Does anyone here actually consider Berkeley to be a top 10 undergrad school?\"\"<br><br>I do.<br><br>", "<b>Username: Phead128</b><br><br>\"\"Does anyone here actually consider Berkeley to be a top 10 undergrad school?\"\"<br><br>Why not... I do.<br><br>", "<b>Username: middsmith</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/Proconsul\">Proconsul</a> wrote:\"\"<br>Penn, Duke, Dartmouth, Brown, Columbia, and Chicago.<br>I think Berkeley should be in the top 10, if not top 5.<br><br>", "<b>Username: kingofqueens</b><br><br>I would say Berkeley is a top 10 school overall, but not top 10 undergraduate.<br><br>", "<b>Username: Bescraze</b><br><br>thats a joke....Berkeley superior in undergraduate education to Penn, Duke, Dartmouth, Brown, Columbia, and Chicago? How would you rate that prestige, acceptance rate, sat scores, class size....I mean there is really no way to substantiate that. I doubt you can even show that Berkeley is better for undergrad than Northwestern, Cornell, Wash U, and Hopkins....it is a really good top 20/25 school..For grad that is another story, but were not talking about that.<br><br>", "<b>Username: Nesquik</b><br><br>\"\"thats a joke....Berkeley superior in undergraduate education to Penn, Duke, Dartmouth, Brown, Columbia, and Chicago?\"\"<br>Berkeley is superior in Computer Science, Chemistry, Engineering .......<br>Berkeley beats those schools in PA score .......<br><br>Bescraze ... I think you tend to focus too much on selectivity .... a ranking you posted in the \"15 most prestigious schools\" thread ranked schools almost exactly by average SAT score<br><br>", "<b>Username: Bourne</b><br><br>Stop acting like Berkeley undergrad is completely responsible for it's PA score.<br><br>", "<b>Username: Techie1988</b><br><br>The academic quality of undergraduate programs is typically close to their graduate programs. I haven't seen too many published undergraduate program rankings, but this is one of them (for Michigan engineering):<br><br><a href=\"http://www.engin.umich.edu/about/rankings.html\" rel=\"nofollow\">Michigan Engineering | Rankings</a><br><br>Undergraduates are not taught by a separate faculty but by the same people (including graduate students for discussion sessions) who do the award-winning research that makes the graduate school of, e.g. Berkeley, so successful. As far as academics are concerned, Berkeley is ranked up there. What brings its overall undergrad ranking down a bit are things like class size, average SAT scores (it's a public university), and alumni giving.<br><br>", "<b>Username: Techie1988</b><br><br><a href=\"http://www.topuniversities.com/worlduniversityrankings/results/2007/criteria/employer_review/\" rel=\"nofollow\">QS Top Universities: University rankings by indicator - employer review</a><br><br>Berkeley doesn't do too badly either. I guess recruiters are not as \"awestruck\" as some of the posters here with the top private schools, assuming private = better.<br><br>", "<b>Username: vc08</b><br><br>\"\"thats a joke....Berkeley superior in undergraduate education to Penn, Duke, Dartmouth, Brown, Columbia, and Chicago? How would you rate that prestige, acceptance rate, sat scores, class size....I mean there is really no way to substantiate that. I doubt you can even show that Berkeley is better for undergrad than Northwestern, Cornell, Wash U, and Hopkins....it is a really good top 20/25 school..For grad that is another story, but were not talking about that.\"\"<br><br>Well, since UCB brilliantly recently concluded that SAT scores are NOT an accurate projection of future college success (honestly, what took us so long to see that??), your rant about higher SAT scores is pretty unfounded and ridiculous. Do you honestly think the top 25% of students (assuming that the top 25% are the most motivated, driven students at the school) at Hopkins, Chicago, Dartmouth, etc., are *that* much smarter than the top 25% at UCB, UCLA, Michigan, UNC, UVA, etc?<br><br>", "<b>Username: S Luka Lawrence</b><br><br>ya, harvard is maybe more known worldwide but berkeley offers much more<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"That's correct, but that's not the very reason why I believe Stanford is superior to Berkeley as a whole, and Harvard is superior to Stanford, in general.<br><br>I agree to most of the posters here that undergrad is different from postgrad. However, since there's no specific data available that clearly separates the two academic levels, it is therefore imprudent to base our conclusion on mere assumption.<br><br>In other words, undergrad students at Berkeley are using the same facilities that the graduate students use. The undergads are handled by the same faculty that handle grad students. The teaching instructions are still rigid. The level of research is still top-class, and so on. The same can be said for the rest of great universities in American such as Stanford, Harvard, MIT, Caltech, Princeton, Columbia, Cornell, Chicago, Michigan, Northwestern and the like.<br><br>According to USNews, Berkeley's graduate engineering education is a solid top 3. When the same ranking institution assessed the undergrad, they came up with very similar finding  top 3. I, too, believe that there is little difference between postgrad school and undergrad school at Berkeley. In the same manner that I do believe that there is very little difference that separates undergrad quality from postgrad quality in other great universities such as at Stanford, Harvard, MIT, Caltech, Yale and Princeton.<br><br>Again, when it comes to academic quality, the HSMPY (or HYPSM) are the kings. Behind them are Caltech, UPenn, Berkeley, Columbia, Chicago, Cornell, JHU, Michigan and Northwestern. However, some of these schools (probably Berkeley, Cornell and Michigan) may not offer a convenient college environment as some of the schools in the top 25 (of the USNews Ranking) do. To some high school students, especially those who come from elite private high schools, schools that offer the better college environment is more desirable to choose than the schools that are more academic quality-oriented.<br><br>Thus, if youd ask me which between Berkeley and Duke would rank higher in USNews, I would answer Duke because USNews is a measure of convenience. In the same manner that Chicago would rank higher than Northwestern or WUSL would rank higher than Vanderbilt or Princeton would rank higher than MIT. But as to whether Duke has higher academic standards than Berkeley has, thats not likely going to be a yes. In the same manner that Princeton does not have a higher academic standard as MIT has or WUSL has got a higher academic standard than Vanderbilt has.\"\"<br><br>I agree with you 110%.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"This is why strength of student body, class sizes, financial resources per student, faculty resources, advising and alumni giving. These are the best data points available to measure undergraduate focus.\"\"<br><br>Counterexample:<br><br>Harvard has an incredibly strong student body, immense amount of resources per student, the best faculty resources in the world, and a high alumni giving rate. Many would say they have no undergraduate focus. Hence these characteristics don't necessarily measure undergraduate focus.<br><br>", "<b>Username: Bescraze</b><br><br>Yes, but Brownman most would argue that they are still the best undergraduate school in the nation. Thus is it really that relevant that the top professors may be predominantly taken up by grad students? Also Butchoky I agree with a lot of what you said, except I do not think a simple \"academic quality\" assessment is sufficient in determining, which schools are better than others. It is important, but not absolute. There is no question that Berkeley has contributed greatly through its research to our society, but as a prospective college student that really is not much of an incentive to attend a school. It is nice, but it in no way will change a college experience unless it translates into better job opportunities. I think you also make a good point about USNWR measuring convenience, but I also think you need to realize that this point only extends so far. I doubt you can argue that WUSTL is of a lesser academic quality than Vanderbilt, or that Princeton is less than MIT.....it is really a mix of everything that goes into the rankings. Thats why when rating colleges, much more than simply the strength of their academics have to be considered. Since, I think a lot of people would agree that in any of the top 50 schools the education you receive is nearly identical---the same things being taught in the same classes. So as a result other measurements come into play, such as the strength of the student body, financial resources of the school, prestige ect...<br><br>This was a great post by Proconsul on this<br>\"\"Proconsul<br>New Member<br><br>Join Date: Aug 2008<br>Threads: 0<br>Posts: 7<br><br>Most college students don't go on to pursue academic graduate study and instead go on to law, med and biz school or get a job right from graduation. Very few college students are intent on getting a PhD in a subject. So, it doesn't matter if a school like Berkeley has a better Chemistry, English, History, Cultural Anthropology or whatever than another top school because most kids who major in these subjects go on to pursue careers that have nothing to do with what they majored in content wise. Engineering is the exception to this. However, I doubt Berkeley engineering attracts more recruiters than Cornell Engineering. Companies will recruit from schools that have high-quality student bodies. They could care less or might not even know about how high the departments at these schools are ranked. Harvard Engineering might be bad but Google, Microsoft, Cisco, etc. will still pick up the Harvard kids because they know they are the cream of the crop and will adapt to the workplace challenges and excel in no time.<br><br>I'm not implying that the only thing that matters is a college's prestige though. The learning environment that colleges create for students is the biggest influence on their development and success during the college years. This is why strength of student body, class sizes, financial resources per student, faculty resources, advising and alumni giving. These are the best data points available to measure undergraduate focus. On a more secondary level, prestige and job placement are important as well. The higher recruitment of students from the top 10 schools into top financial firms and grad schools are a clear indication of the undergraduate prestige and prowess of these places. Connections are the most important factor in getting a job. The Ivies, Chicago, Duke, etc. provide these connections.<br><br>There is no objective measure that shows Berkeley to be better than any top 10 school.\"\"<br><br>", "<b>Username: rd31</b><br><br>Harvard may not have a good \"undergraduate focus\" because it is so powerful in graduate departments (I know it sounds weird). The professors are so distinguished and absorbed in their research, that they perhaps don't have time to devote to undergrads. I've experienced the same thing with a noble laureate as one of my molecular biology professors (although I'm at a different institution).<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"Yes, but Brownman most would argue that they are still the best undergraduate school in the nation.\"\"<br><br>Most prestigious? Yes. Best undergraduate school in the nation? Probably not.<br><br>Notice that proconsul claimed that a medium to measure undergraduate focus was measuring strength of student body, class sizes, financial resources per student, faculty resources, advising and alumni giving. I was simply refuting his claim, and I'm pretty sure I succeeded in doing so.<br><br>I would argue the best undergraduate school in the nation depends on fit. For me, it would have been either Yale or Princeton, because I would simply fit better there. For you, it may be Harvard because you are obsessed with prestige and selectivity. When you get to HYPSM level, they're all about equally good. There is no point drawing distinctions between them. Everyone's different.<br><br>", "<b>Username: swimguy112</b><br><br>Students at Harvard can cross-register for classes at MIT...<br><br><br>sooo technically,<br><br>Harvard Student's engineering education > Berkeley's<br><br>", "<b>Username: Bescraze</b><br><br>\"\"I would argue the best undergraduate school in the nation depends on fit. For me, it would have been either Yale or Princeton, because I would simply fit better there. For you, it may be Harvard because you are obsessed with prestige and selectivity. When you get to HYPSM level, they're all about equally good. There is no point drawing distinctions between them. Everyone's different.\"\"<br><br>Actually for me it would be between Yale, Stanford and Harvard....I recognize that they are all equally good, even if Harvard is Harvard. I never said that fit doesn't matter, when schools that are peers are being compared. My only point is that Berkeley is not a peer. O and butchokoy who really cares about research output? Honestly, out of every single criteria I can think of for choosing a school that would be the most negligible. It has no impact on your experience there, your education, your job recruitment.....<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"O and butchokoy who really cares about research output? Honestly, out of every single criteria I can think of for choosing a school that would be the most negligible.\"\"<br><br>Why are your views always so narrow? Just because <i>you</i> don't find it important, obviously no one else cares?<br><br>I for one find it important. I wanted to go (and do go) to a school that has heavy research output. That was a big consideration in my applying to schools and was also part of the reason I didn't apply to any LACs.<br>\"\"It has no impact on your experience there, your education, your job recruitment\"\"<br><br>That alone shows how very little you know.<br><br>When there's lots of research going on, you can get involved in the research. That directly affects your experience--you surround yourself with elite intellectuals, creating new knowledge, in a new environment (often an expensive one, at that). Your education is obviously affected as well; you must master the subject of inquiry in order to find the answers to the questions still remaining in said subject. It may or may not affect job recruitment. It would help in grad school admissions.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"It has no impact on your experience there, your education, your job recruitment.....\"\"<br><br>Going to a big-time research institutions means more research opportunities. More research opportunities = better grad school = better job.<br><br>", "<b>Username: swimguy112</b><br><br>\"\"swimguy112,<br><br>Harvard would trounce every single university on the face of the earth when it comes to academi prestige. In fact, all major international league tables have said that. Harvard is Harvard. Even in countries that do not speak English would know that Harvard is the most famous school on earth. It is even well-known in countries where English is not spoken. However, I'm not sure if Harvard would be a major consideration for those students who would really like to become an engineer. I guess this is where Harvard would fall behind MIT, Stanford, Princeton, and to some extent, Caltech and Berkeley.\"\"<br><br>Yeah I know. After visiting harvard, it sickens me to say that I absolutely loved it, and I am not even one of those typical people here who will die if they don't get into HYP.<br><br>Harvard has a crap engineering program<br><br>", "<b>Username: DunninLA</b><br><br>it sounds like if bescraze could simply skip college altogether, and simply use some connection to get his associate postion at a bulge bracket, he would be completely satisfied with that.<br><br><br>College IS research. College is not supposed to be a trade school.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"it sounds like if bescraze could simply skip college altogether, and simply use some connection to get his associate postion at a bulge bracket, he would be completely satisfied with that.<br><br><br>College IS research. College is not supposed to be a trade school.\"\"<br><br>Why'd you remove the wanker comment? lol<br><br>", "<b>Username: Bescraze</b><br><br>I simply meant research is not that important, every school has it and has those opportunities. No one says you cannot have great professors, if you don't have a tremendous output of research (LACs anyone?), which is more focused on the math and sciences usually anyway. In other words, Michigan is not a better school than Williams or any other xyz school just because it has more research. This is mostly because its a gigantic state school like Berkeley. Its not all that important.....some kids want to do research, but overall it does not have the same effect as many other objective measurements. O and btw college is fun, the education is great and I think you grow as a person....yet I also think its impact on your future is extremely important. Forgive me, if I recognize that there is more to my life after 4 years in college.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/butchokoy\">butchokoy</a> wrote:\"\"<br><br>^Good stuff.<br><br>", "<b>Username: kwu</b><br><br>Exactly. Quality of, and focus on, the undergraduate education is completely irrelevant when gauging the overall rankings of our national universities. It's all about research output and publishing. Now, if one wanted to have a superior undergraduate experience, the clear choice would be a liberal arts college.<br><br>:3<br><br>", "<b>Username: Bourne</b><br><br>\"\"Like I said, USNews measures convenience. Lets get real. It is neither a measure of ACADEMIC PRESTIGE nor a measure of ACADEMIC STANDARDS. I urge you to review the criteria  theyre more of less a measure of convenience. USNews doesnt have data about the following:<br><br>1. quality of instructions<br>2. quality of materials used by the students and instructors<br>3. quality of facilities of the universities<br>4. quality of products (graduates)<br>5. Research output<br><br>All these are essential to rate UNIVERSITITES. However, USNews thinks that universities are Liberal Arts Colleges. Thats stupid. Universities are not Liberal Arts Colleges. USNews staff are confused. Its ridiculous.\"\"<br><br>I do agree with some of this, but this is partly what Faculty Resources/Total Endowment/Endowment per Student is supposed to measure. Of course they're crappy tools of measurement but yeah...<br><br>", "<b>Username: rd31</b><br><br>and some would prefer a balance of the two, like Dartmouth for instance.<br><br>", "<b>Username: Brown man1987</b><br><br>Dartmouth is not that much of a balance... it's more on the LAC side. Princeton seems to be a great balance- it has LAC size combined with great research opportunities.<br><br>", "<b>Username: Bourne</b><br><br>I think Yale is actually the perfect balance -- less engineering of course.<br><br>Princeton is still a bit to LAC-ish.<br><br>", "<b>Username: kyledavid80</b><br><br>I've always thought Stanford had the perfect balance between grad/undergrad.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"Berkeley has great faculty members and facilities but they also have 3x times as many students competing for these resources.\"\"<br><br>And there are 3x as many resources. ;)<br><br>", "<b>Username: Bourne</b><br><br>^^ Not so much.<br><br>", "<b>Username: kyledavid80</b><br><br>^^ I would say that Berkeley has many more resources. Its biggest problem is connecting the students to these resources; this inevitably happens with a university of its size. One way--the best one, probably--to help connect them is through advising, but it's exorbitantly expensive to staff a university so large in the way that, say, Dartmouth would be staffed. Because of that, students often aren't aware of the resources available to them, or they don't have the help to succeed in getting to them. That's why they always say that Berkeley doesn't \"hold your hand\"--you have to seek most things out on your own.<br><br>In short, the biggest problem that Berkeley's undergrad has (there are others, but they're minor) is guidance. Some, though, prefer that there not be too much \"hand-holding.\"<br><br>", "<b>Username: Bourne</b><br><br>Haha, I don't think Berkeley has a proportionate amount of resources to accommodate much of its student body -- when compared to schools like Dartmouth. Advising is obviously a problem; I'd also assume that Berks students are more tiered achievement wise -- yet the fact remains that they can't proportionally match the opportunities available at schools like Dartmouth or Columbia.<br><br>To cover up the former with the latter explanation seems irresponsible.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"Advising is obviously a problem; I'd also assume that Berks students are more tiered achievement wise -- yet the fact remains that they can't proportionally match the opportunities available at schools like Dartmouth or Columbia.\"\"<br><br>Columbia has 25,000 students, undergrad and undergrad. They don't give a crap about their undergrads.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"Otherwise, the \"incredible resources\" that Berkeley has to offer are for naught.\"\"<br><br>No, they aren't. For one, Berkeley does manage to staff the university better than most universities--just not to the point where students are assigned ten different advisers. However, it is not mandatory for students to utilize their services; students can, however, seek them out to get a hold of the resources they want and need. For another, many other students are able to guide themselves to the resources without the help of a person--either through departmental literature, online resources, etc.<br>\"\"I don't think Berkeley has a proportionate amount of resources to accommodate much of its student body\"\"<br><br>I don't think either you or I can really measure the resources available. Or anyone, for that matter.<br><br>I can offer my own knowledge of them, but that is purely anecdotal.<br>\"\"I'd also assume that Berks students are more tiered achievement wise\"\"<br><br>\"Tiered\"? You could say the same of students at Stanford, even.<br><br>", "<b>Username: Bourne</b><br><br>\"\"Columbia has 25,000 students, undergrad and undergrad. They don't give a crap about their undergrads.\"\"<br><br><br>What kind of logic is this?<br><br>Oh you meant, UG and grad?<br><br>Still makes little sense.<br><br>Of course it's anecdotal. I'm being a bit presumptuous by asserting the common \"large public school\" stereotypes... I still think most would agree with me.<br>\"\"\"Tiered\"? You could say the same of students at Stanford, even.\"\"<br><br>Of course I could. I could say it about any school. The use here though, seems appropriate -- probably because the tiers would be a bit larger than the ones that would exist at the top privates.<br>\"\"Some, though, prefer that there not be too much \"hand-holding.\"\"\"<br><br>^^ That would appear to imply that you semi-agree with me.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"What kind of logic is this?<br><br>Oh you meant, UG and grad?<br><br>Still makes little sense.<br><br>Of course it's anecdotal. I'm being a bit presumptuous by asserting the common \"large public school\" stereotypes... I still think most would agree with me.\"\"<br><br>Resources are spread thin at Columbia as well, similar to Berk. There are 20,000 grads at C, 5,000 UG at C. Opportunities at C are probably similar to opportunities at Berk, in terms of resources- unlike what you claimed. Dartmouth? Yes. Columbia? no. Columbia is the largest Ivy in terms of total population, and is very grad focused- similar to Berk in this manner.<br><br>", "<b>Username: Bourne</b><br><br>I was just giving examples of Privates with big endowments + less students vs Berkeley.<br><br>And btw, Stanford has 20k UG + Grad. Harvard too -- Approx. Where the hell is the magic number?<br><br>Here we go with these terms, UG and Grad focused -- this is turning into another \"correlation/causality\" phrase -- What does that imply? Would you consider schools like Stanford and Harvard to be \"Grad focused?\"...<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"And btw, Stanford has 20k UG + Grad. Harvard too -- Approx. Where the hell is the magic number?\"\"<br><br>Both have much bigger endowments and much more resources than Columbia.<br><br>", "<b>Username: Bourne</b><br><br>And the same can be said when comparing Dartmouth and Columbia to Berkeley -- especially per capita.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"Here we go with these terms, UG and Grad focused -- this is turning into another \"correlation/causality\" phrase -- What does that imply? Would you consider schools like Stanford and Harvard to be \"Grad focused?\"\"\"<br><br>Don't you think Columbia's grad programs are far better known than it's ugrad program? Columbia business school, Columbia Law, are a few that come to mind. If a school's graduate programs are reputed better than it's ugrad programs, it's probably safe to say it's a grad focused school.<br><br>", "<b>Username: Bourne</b><br><br>It's the comparison... If that's the case, why on earth do I care about Berkeley Undergrad?<br><br>If you want, I shall replace Columbia.<br><br>", "<b>Username: Brown man1987</b><br><br>Yes, that is what I was getting at lol.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"Of course it's anecdotal. I'm being a bit presumptuous by asserting the common \"large public school\" stereotypes... I still think most would agree with me.\"\"<br><br>So you admit that it's anecdotal, say you're being presumptuous, and then resort to an ad populum argument? Nice. ;)<br>\"\"probably because the tiers would be a bit larger than the ones that would exist at the top privates.\"\"<br><br>Too hard to say, IMO.<br>\"\"^^ That would appear to imply that you semi-agree with me.\"\"<br><br>I never disagreed re: hand-holding.<br>\"\"And btw, Stanford has 20k UG + Grad. Harvard too -- Approx. Where the hell is the magic number?\"\"<br><br>I'll add it's the same for Cornell and Penn.<br><br>", "<b>Username: Bourne</b><br><br>Lol, Nvm. I was saying that Berk Grad is more \"oppressive\" than Columbia Grad.<br><br>", "<b>Username: Bourne</b><br><br>\"\"So you admit that it's anecdotal, say you're being presumptuous, and then resort to an ad populum argument? Nice.\"\"<br><br>Of course. While I'm sure you've never made an assertion without having a comprehensive factual understanding of the situation to support your views... I have. Educated guesses. I make them all the time -- in subjective matters where the prevalent opinion is prevalent for a reason...<br><br><br>No one is doubting Berkeley's excellence -- I'm just curious as to why you saw fit to equate the amount of resources per capita to a top Private -- i.e Dartmouth. And since you've so humbly agreed that neither of is well equipped to make a call like that...<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"Educated guesses. I make them all the time.\"\"<br><br>There's a difference between \"educated\" and \"presumptuous.\" Or \"susceptible to common stereotypes and misconceptions.\" ;)<br>\"\"to why you saw fit to equate the amount of resources per capita to a top Private -- i.e Dartmouth.\"\"<br><br>I used Dartmouth as an extreme example. Dartmouth is very much like an LAC (without actually being grouped with LACs), so I found it fitting to use that for contrast.<br><br>", "<b>Username: Bourne</b><br><br>\"\"There's a difference between \"educated\" and \"presumptuous.\" Or \"susceptible to common stereotypes and misconceptions.\"\"\"<br><br>So shall we always assume nothing until it can be proved through factual means? Especially topics like these where it's rather difficult to quantify \"opportunities/resources available\"? Or shall we make an \"educated\" guess based on a number of factors -- Large public, decent endowment(Compared to top privates)... -- and the \"common stereotypes\" that trail -- in this specific case -- Berkeley.<br><br>I'm sure you have an opinion. I'm also just as sure your opinion is based on your own anecdotal gatherings. Because you choose not to share it is no less noble than what I've done.<br><br>", "<b>Username: kyledavid80</b><br><br>I'm not talking about anecdotal evidence alone. I'm talking about your use of an ad populum argument to justify your anecdotal evidence and presumptuous claims (both of which you admitted to committing).<br><br>", "<b>Username: Bourne</b><br><br>No no, I've never once said my agreement with popular opinion made me or anyone who shares said opinion right.<br><br>You also admitted your claims were anecdotal.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"I still think most would agree with me.\"\"<br><br>That seems to advocate popular opinion... the way you said it, as well, seemed like a follow-up to your previous claims, as though you were using it as support. I don't see why else you'd include it.<br><br>", "<b>Username: Bourne</b><br><br>I simply stated something. Nothing to read into at all.<br><br>And btw -- since you're on a witchhunt -- Ad populum arguments while generally fallacious, aren't always completely useless. I'm by no means advocating usage, but in the rare cases of completely subjective subjects, it is not always fallacy to rely on a prevalent opinion in hopes of showing a similar paradigm of thinking.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>^ ooooh...two 'furd students bickering...<br><br>*gets popcorn*<br><br>:D<br><br>", "<b>Username: cookiemon90</b><br><br>ok, i think that its common for people to take what comes easy for granted. yes, cal is much easier to get into than HYPSM. that's a given. therefore, the avg. sat's will be lower because more diverse (academically) people get in. but berkeley shouldn't be criticized for giving more students a chance to study at an internationally-recognized school. sure harvard is harvard, that'll continue for a long time to come. but harvard is also like 200-300 years older than berkeley, harvard has more opportunities for grads because of the amazing contacts an undergrad can get. give cal a break. as for trashing cal, calling it a school for losers or whatever it was, that's just pretty lame. i mean if those are the type of people who go to the so-called \"elite schools\" then i'm happy with my decision to go to cal. you'd be surprised to learn about some of the students that go there and their potential, i was. there are some amazing people that go to cal, people that are comparable to ivy-leaguers. its just that cal has more people than just these \"ivy-leaguers\". as for being in-state, i consider myself lucky for having such a solid public university system. even though i had the choice of going to some other, more \"prestigious\" institutions (for a whole lot more $$), i didn't just rule out cal because it was cheaper or it was easy for me to get in. is that such a bad thing? i wouldn't say so.<br><br>as for not getting as much in donations as these other school, none of the uc's give such a noticeable preference to legacies as other schools (where you can have upto 2x a better chance of getting in). wow, well thanks cal for giving me a fair shot<br><br>", "<b>Username: cookiemon90</b><br><br>i think the other thing is that at cal, you have to work really, really hard for something you want unlike harvard or other privates that will spoonfeed you the whole way (i concur with butchokoy). i would think that it prepares you better for whatever you might choose to pursue because the best students have to be truly amazing to be the best. academically, i would think that Harvard and Cal are comparable, but i can't say that for sure since i haven't attended both institutions. Cal's atmosphere weeds a whole lot of people out (such as the people who didn't get in anywhere more selective than Berkeley) and i think that whole experience is an education in itself<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"Ad populum arguments while generally fallacious, aren't always completely useless. I'm by no means advocating usage, but in the rare cases of completely subjective subjects, it is not always fallacy to rely on a prevalent opinion in hopes of showing a similar paradigm of thinking.\"\"<br><br>Agreed. There are some cases where it's acceptable, if not necessary--deciding what is acceptable in standard language, for example.<br><br>This is not one of them. ;)<br><br>At any rate, I see what you're getting at, etc.<br><br>", "<b>Username: Bescraze</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/butchokoy\">butchokoy</a> wrote:\"\"<br><br>Hmm interesting, you need to study at a school to effectively judge it.<br>\"\"<a rel=\"nofollow\" href=\"/profile/butchokoy\">butchokoy</a> wrote:\"\"<br><br>Thus by your own logic, your whole point is irrelevant because you can't judge duke's education, because you never studied there? May I just ask one question in that case, where do you get this info that Berkeley grads earn more than Duke grads? How do you know what employers think, since by your own logic if you haven't \"worked there then you can't really judge it\". Its all rumor, and rumor is not admissible.<br><br>", "<b>Username: Bescraze</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/butchokoy\">butchokoy</a> wrote:\"\"<br><br>Actually most people would say USNWR top 15 are better than Berkeley. I bet that would be the general consensus of the educated/wealthy/employers ect. Thats where we differ, you want to cut it off after HYPSM, and I and I think most people would say not even school from there to number 25 is equally good.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"Actually most people would say USNWR top 15 are better than Berkeley.\"\"<br><br>a) unsubstantiated assumption, b) ad populum argument<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/kyledavid\">kyledavid</a> wrote:\"\"<br><br>You love debunking ad populum arguments lol.<br><br>", "<b>Username: kyledavid80</b><br><br>\"\"You love debunking ad populum arguments lol.\"\"<br><br>They're one of the most popular kind, actually, along with appeal to authority, correlation/causation, and general idiocy.<br><br>", "<b>Username: d_galin09</b><br><br>Harvard is definetly better academically. However I will say that I used to live in California and I went to Berkeley a lot and it's an awesome, diverse campus.<br><br>", "<b>Username: Nesquik</b><br><br>\"\"Duke is a solid target for most investment banking/consulting/private equity firms while Berkeley is a semi-target.\"\"<br>Any basis at all for making that statement?<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"Any basis at all for making that statement?\"\"<br><br>Of course not!<br>\"\"The Duke grads that seek to join lucrative careers don't get paid less than Berkeley grads. In fact, they probably get paid more\"\"<br><br>Really? Any basis? Data? Is this just another empty assertion of yours? Of course!<br>\"\"Why does everything have to be about money anyway?\"\"<br><br>Of course, when Duke loses the argument, he states this. I am sure if Duke grads made more, he would be rubbing this data in Butchokoy's face.<br><br>", "<b>Username: Bescraze</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/Brown%20man1987\">Brown man1987</a> wrote:\"\"<br><br>Haha thats what I was thinking as well.<br><br>", "<b>Username: beefs</b><br><br>Do you people ever sleep?<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"Are you saying that schools like Duke, Penn and Harvard have relaxed learning environments, lower academic standards, and faculty members who have lower morals in comparison to Berkeley and Caltech? Are you out of you mind? Top-notch private schools can afford to be more \"caring\" because they have far fewer students to deal with and can give all these students the resources and advising they need to graduate from school.\"\"<br><br>Penn has 20,000 students total. Harvard has 21,000 students total. That's really a small number of students to deal with, right?<br>\"\"Do you people ever sleep?\"\"<br><br>Nope.<br><br>", "<b>Username: rd31</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/Proconsul\">Proconsul</a> wrote:\"\"<br><br>I actually strongly agree with this, based on personal experience with a nobel laureate professor. I think we place too much emphasis on graduate strength to rate the undergraduate experience.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"If everyone believes in a lie, then does the truth really matter? I think not.\"\"<br><br>What the hell kind of logic is this?<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"I actually strongly agree with this, based on personal experience with a nobel laureate professor. I think we place too much emphasis on graduate strength to rate the undergraduate experience.\"\"<br><br>The problem is that everyone has a different opinion on what the ideal undergraduate experience is.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"Faculty caliber, research quality and facilities matter a LOT, LOT more at the graduate level.\"\"<br><br>That doesn't mean that they don't matter at the undergrad level. They can matter a lot at the undergrad level and still matter a lot, lot more at the graduate level.<br><br>", "<b>Username: Bescraze</b><br><br>Brown Man if your going to assess Penn and Harvard as a total university (20k students)...then its only fair if you do that with Berkeley as well. Its not really fair or relevant for either, since the schools are fairly segregated and have independent resources.<br><br>", "<b>Username: Phead128</b><br><br>\"Faculty caliber, research quality and facilities matter a LOT, LOT more at the graduate level.\"<br><br>It matters at the undergraduate levels too. At certain universities, and especially among the top 15, undergrads conduct a lot of research, and a significant portion have research experience. Most of the time, say if you are a premed, and you are associated with a respectable med school, its much easier for undergrads to get research positions at their medical school and get access to their top notch equipment and facult and staff than at their respective home campuses (which is no where near the quality of the graduate school facilities and etc, ie. equipement no where as new and cutting edge, equipment sometimes outdated, lab space not world class, etc..)<br><br>Therefore the link between graduate and undegraduate research quality and facilities cannot be cut. They are in fact very highly linked and intertwined.<br><br>You don't have to be a graduate student to take advantages of research jobs and research facilities, labs, and faculty researchers.<br><br>You have tons of chances to do that an undergrad as well. In fact, having a graduate program is definitely a plus since undergrads depending on the field they are in have an opportunity to connect and get exclusive research jobs that only undergrads at their respective school can only get.<br><br>Conclusion, Faculty Caliber, resaerch quality and facilities matter a lot at both the graduate and undergraudate levels.<br><br>", "<b>Username: Brown man1987</b><br><br>\"\"Brown Man if your going to assess Penn and Harvard as a total university (20k students)...then its only fair if you do that with Berkeley as well. Its not really fair or relevant for either, since the schools are fairly segregated and have independent resources.\"\"<br><br>I was just trying to refute Proconsul's point that Penn and Harvard can do a lot of \"hand-holding\" with their undergrads. They really can't because they're big. After you get past a certain size, it doesn't matter whether you have 20,000 students or 40,000 students- your university is big regardless and there won't be \"hand-holding\" as Proconsul claims.<br><br>", "<b>Username: hawkette</b><br><br>butch,<br>You do realize that the Payscale data does not adjust for the Cost of Living in various regions of the country, right? Obviously, this has large implications for the reported salary levels and unquestionably understates the \"real earnings level\" of colleges in the South and the Midwest.<br><br>I think any reasonable observer would agree that students from both Duke and UC Berkeley will have a wide variety of job options after graduation and that large numbers graduates of each go on to highly successful careers.<br><br>Carry on...:)<br><br>", "<b>Username: hawkette</b><br><br>butch,<br>My impression is that the schools with a large engineering component have an outsized benefit in the numbers for starting salaries and several schools that you wouldn't normally associate with the top ranks score very well (Worcester, Stevens Institute, etc). This effect moderates over time.<br><br>As for Duke, they do well at the beginning even with about a third of their students coming from the South. I think it is commonly accepted that Duke grads place well in high income areas like NYC, but it's not like the whole class is going to NYC. LOL. I would expect a meaningful percentage to stay in the lower wage South (25%?) or return to the Midwest (10%?), not to mention the mid-Atlantic area (20%?) and even the West (10%?). Statistically, this would likely lower their average starting salaries and their mid-career numbers.<br><br>And Dartmouth's wages are easy to understand. Virtually none of their grads stay in low-salary New Hampshire after graduation. I would expect a large majority (60%+?) to stay in the Northeast, mostly in NYC and Boston.<br><br>Finally, Notre Dame. Hey, I have long claimed that the school is hugely underappreciated on CC and much appreciated by employers. Despite having nearly 65% of their students coming from lower wage areas like the Midwest, South and Southwest, ND competes very well in this national comparison. Sort of makes that 3.9 PA score look pretty irrelevant and pretty out of touch with reality.<br><br>", "<b>Username: DunninLA</b><br><br>Hawkette -- I disagreee with your take on Notre Dame. High salaries are not evidence of a great undergraduate education.<br><br>I view these salaries as being correlated to the degree of \"pre-professional\" focus of the institution, combine with the % of engineering graduates.<br><br>Now, a person who *is* more interested in choosing a college more as a feeder to the interview room for business/engineering jobs right out of college would probably find a lot of value in that salary survey.<br><br>It seems in reading this board that a majority of the posters view the college experience to be primarily focused on acquiring skills and connections appropriate to getting interviewing slots for high paying jobs (a means to an end), and less as a time to shape critical thinking that prepares a person to make a difference in various life pursuits (academic, public service, business, etc.).<br><br>", "<b>Username: Bescraze</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/butchokoy\">butchokoy</a> wrote:\"\"<br><br>For the first question, yes without a doubt.<br>For the second question if you factor out engineering Penn is probably a better place for you, but since you really can't MIT would probably be superior. It is hard to tell, since MIT is a very focused school.<br><br>Also to answer your question, I do think these schools undeniably make up the top top schools in the nation.<br><br>1. Princeton University (NJ)<br>2. Harvard University (MA)<br>3. Yale University(CT)<br>4. Stanford University(CA)<br>5. University of Pennsylvania<br>5. California Institute of Technology<br>7. Massachusetts Institute of Technology<br>8. Duke University(NC)<br>9. Columbia University(NY)<br>9. University of Chicago<br>11. Dartmouth College(NH)<br>12. Washington University in St. Louis<br>12. Cornell University(NY)<br>14. Brown University(RI)<br>14. Northwestern University(IL)<br>14. Johns Hopkins University(MD)<br><br>", "<b>Username: hawkette</b><br><br>dunnin,<br>I agree with your characterization of ND and that goes to the value sets of the students. I also agree with your assessment of how many on CC, and probably most in the college application process, view positively the value of a survey like Payscale (while hopefully understanding the pitfalls therein). I know that this also probably pains you. And sorry as well to add to your pain as you surely know that I sympathize with the views of those who have a strong interest in the financial outcomes for students of various schools.<br><br>As for the relationship between the post-graduate financial outcome and a great undergraduate education, I don't automatically dismiss pre-professional programs as being lousy undergrad educations nor do I automatically assign a higher quality to the path you support. Just because someone is very interested in their post-graduate employment prospects does not have to translate into someone who can't also develop strong critical thinking skills and/or an interest in areas beyond the for profit world. I can see value in each, depending on the individual and his/her interests and needs. However, I think that those in either camp frequently don't assign equal value to the perspectives of their opposites. This is most evident in the USNWR rankings and their PA scores which certainly don't attempt to reflect the views and values of those interested in the for profit world.<br><br>", "<b>Username: Phead128</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/butchokoy\">butchokoy</a> wrote:\"\"<br><br>Averages of USNWR ranking between 1987 through 2007<br><br><u>Harvard University___________________ 1.7<br>Princeton University__________________2.1<br>Yale University______________________ 2.4<br>Stanford University ___________________4.3<br>MIT _______________________________5.5<br>Duke University______________________ 6.3<br>Caltech____________________________ 6.5<br>Dartmouth College____________________8.4<br>University of Pennsylvania_____________10.1<br>Columbia University___________________10.4<br>University of Chicago_________________ 10.6<br>Cornell University_____________________11.9<br>Brown University_____________________ 13.0<br>Northwestern University_______________ 13.4<br>Johns Hopkins University_______________14.1<br>Rice University_______________________ 14.5<br><br>Washington University in St. Louis_______16.8<br>University of California at Berkeley________18.3<br>Emory University______________________18.7<br>University of Notre Dame_______________ 19.2<br>Vanderbilt University___________________20.2<br>University of Virginia____________________20.9<br>Georgetown University__________________21.6<br>University of Michigan at Ann Arbor_______ 21.9<br>Carnegie Mellon University_______________22.3<br>UNC at Chapel Hill______________________23.8<br>University of California at Los Angeles_____ 24.3<br>Tufts University_______________________ 26.5<br>University of Southern California__________ 35.7<br></u><br><br>Does that answer your question? You can't deliberate based on a single years worth of data. Stretch out your mind and broaden your senses. Some 20 years of data is pretty good info in fact to accurate depict where each school actually lies, beyond the annual fluctuations and yearly \"oohs and ahhs\" lol :)<br><br>", "<b>Username: rocketDA</b><br><br>You are obviously not a scientist/engineer. Just because you base your argument on the accruement of data from USNWR does not mean that any of it has any validity. The only way you can prove that your interpretation of rankings has any validity would require proving that the kernel methods of USNWR are objectively unbiased and conform to the strictest standards of the criterion for \"success\", if there is such an objectification.<br><br>Garbage In, Garbage Out.<br><br>", "<b>Username: kyledavid80</b><br><br>Can't we just... let this die?<br><br>", "<b>Username: noobcake</b><br><br>No, this is CC's greatest joy<br><br>", "<b>Username: CalBear2009</b><br><br>In order of personal preference:<br><br>1) The American Scholar<br>2) The New Yorker<br>3) CC's Harvard vs. UC Berkeley thread<br><br>lol<br><br>", "<b>Username: katliamom</b><br><br>there are also some infamous berkeley vs. stanford threads... makes for some great eye rolling.<br><br>", "<b>Username: seangrusd</b><br><br>Person who said UC Berkeley undergraduate is overrated does't know what they are talking about. If anything, it is underrated<br><br>", "<b>Username: everary</b><br><br>Nice thread resurrection. Care to explain your reasoning? I'm a prospective student for Cal and I've only heard that the academics there (at least for some subjects) are intensely challenging, with only a certain % of people allowed to get As in some classes.<br><br>Harvard and UC Berkeley are worlds apart, in my opinion. It's almost impossible to argue about any two colleges being better than the other (unless you solely count objective factors such as ranking or number of Nobel-winning alumnis), but simply because one college is objectively determined to be better than another (in this case probably Harvard, at least for certain undergraduate programs--but maybe Harvard is only 'better' because they're more selective and accept less students--who knows), that does not mean the college is more recommended for people to attend. One may wow employers with a Harvard degree over a Cal degree, but in a case where one would have been happier--and therefore a better learner--at Cal than Harvard (not because it's a better school, but the location, people, etc.), one would be more equipped to deal with what job he or she eventually lands (assuming that the job is related to his/her major).<br><br>Another thing is financial aid (then again, I skipped the last 17 pages, so maybe someone's already brought this up). If I got accepted into both Harvard and Cal, I'd go against everything I said in my last paragraph (even though I admire the proximity of Cambridge to Boston and other things about Harvard over Cal) because, given my family income, I wouldn't have to worry about undergraduate-school debts if I somehow magically got into HYP....very magically, as I'm not even applying to those schools. But that would be phenomenal.<br><br>", "<b>Username: UCBChemEGrad</b><br><br>Ah memories... :)<br><br>", "<b>Username: $KingsElite$</b><br><br>@noobcake<br><br>Absolutely. Everybody loves to talk about things they THINK they know and then ignore the ones that actually do. Yay.<br><br>", "<b>Username: TheSaiyans666</b><br><br>Just saying, I'm not a fan of comparing/debunking universities.<br>Yeah, so.<br>Anyone from California? I don't know about east coast people, but talk to any high school student--random people in California, and they won't really put Berkeley up on a pedestal. So many countless people in our family and friends I'm acquainted with have gotten into Berkeley and many have turned it down to go elsewhere (As a subjective note, I don't recall seeing a lot of Facebook statuses saying \"OMG I got Berkeley!\" as opposed to \"OMG I GOT HARVARD B!**CH\").<br>Up in California, Berkeley doesn't seem to have the \"prestige\" and \"high class look\" as Stanford carries. Berkeley is kinda seen as the place to get drugs and \"hippie-liberal sitters\" or w/e.<br>\"\"<a rel=\"nofollow\" href=\"/profile/Proconsul\">Proconsul</a> wrote:\"\"<br>I do subjectively agree. These universities (With the addition of MIT and Caltech, might I add?) are for the most part considered a a stronger achievement than getting into Berkeley. At least thats how it is in California.<br><br>", "<b>Username: TheSaiyans666</b><br><br>Also, my grandfather works as a professor at UCLA. Search for Prof \"Eri Srivatsan.\"<br>He told me that education in UCs are pretty much the same at the undergrad level. Whether it be UC Davis to Irvine to Berkeley...they're all great institutions. I'm not sure how credible his statement is, but since he's a prof...<br>He also admits that Berkeley is a bit overrated in the name due to it being the oldest :rolleyes: UC. But ehh.<br><br>", "<b>Username: YeloPen</b><br><br>Completely agree with TheSaiyan666.<br><br>I have argued this point quite a bit on CC :)<br><br>", "<b>Username: $KingsElite$</b><br><br>@TheSaiyans666<br><br>My grandpa was the Dean of Veterinary Medicine at UC Davis for 29 years and was apart of other UC related things like the committee to pick the first chancellor of UC San Diego. Anyway, he actually said he didn't like Berkeley's undergraduate system and didn't recommend me to go there. Maybe he's a little bit biased, but take it for what it is. I'M NOT SAYING BERKELEY IS BAD, but it's just a person's opinion. We can sit here and argue prestige all day long, but it doesn't matter. Harvard will always win. But I will say to east coast people that on the west coast, places like Johns Hopkins aren't as well known, so just something to point out. What some random people you hang out with think of a university never seems to hurt or strengthen their programs too much. Since I haven't attended classes at either Harvard or Berkeley, I can't say which one is better. All I can do is go on a college rankings website and find that Harvard is better.<br><br>", "<b>Username: bagelsbagels</b><br><br>i would pick berkeley ANY DAY<br><br>there is no other place on earth like that<br><br>", "<b>Username: Ambrosiana</b><br><br>I look into academic and research rankings a lot about Top universities. Seriously, Berkeley's research is Absolutely Top 5 in this world. The only true competition Berkeley might have when it comes to the international rankings is Harvard. Not only ARWU ranks Berkeley Top 3 internationally, Times higher also ranks Berkeley's Academic and Research Top 5 almost in every field among different subjects.<br><br>In the USA universities like Duke and Dart could be a little more famous, but like I said, Berkeley is internationally much more famous than Duke in other countries and research institutions all over the world. Say, in China we all know Berkeley is ranked just 21 in the USA but when we look into its research and Nobel prize plus Turing and Fields Medal, which accounts to its real academic level, Berkeley beats every university in this world.<br><br>From an international perspective, Berkeley is always regarded a Top 10 all over the world while Duke and Dart are not. I must admit Duke is harder to get into and probably much better in undergraduate education, but most Top scholars like academy of science and engineering would go to Berkeley since there is where Real Academic is.<br><br>Finally I give my suggestion: for undergrad, pick Duke and Harvard. for grad, Berkeley is home to Top scholars in every field.<br><br>"]}