{"title": "ucla vs uci vs ucr", "comments": ["<b>Username: confused13</b><br><br>I want to major in bio and do pre-med. At the moment I don't really care what med school I end up at as long as it is in the country. I do like what I've seen of Loma Linda so far, so that seems like a good option.<br><br>", "<b>Username: Listenkid</b><br><br>You fool. You got into UCB and UCLA and Johns Hopkins and you are even thinking about going to UCR? Listen, I know they say \"pick a college you love\" but really you gotta be a tiny bit realistic. Like for real rankings are not THAT important but when one school is ranked 15th and the other is ranked 89th........<br>Let me be honest with you. Go to UCLA or UCB if you cant go to Johns Hopkins financially. This is life for you. In the long run you may get a med school scholarship if you go to UCLA, UCB, or JH instead of UCR<br><br>Everyone you talk to will tell you UCR, they are ********ing you, they are sentimental, idealistic, fools.<br>Telling a person that going to UCR over UCLA is like telling an 400 pound ugly chick that only shallow stupid guys will care about her looks. In honesty, everyone cares a significant amount.<br><br>", "<b>Username: GoldShadow</b><br><br>\"\"In the long run you may get a med school scholarship if you go to UCLA, UCB, or JH instead of UCR\"\"<br>What on earth are you talking about?<br><br>Listen kid, you should probably spend a little bit of time around here figuring out how things really work before giving people advice on life decisions.<br><br>", "<b>Username: Entadus</b><br><br>Riverside is ridiculously hot. I'd say the choice is between UCI or UCLA. Both are great schools.<br><br>I grew up in Irvine, and I can tell you that it's a pretty boring city. Personally I'd pick LA.<br><br>", "<b>Username: Listenkid</b><br><br>Yah and whats you suggestion golden?<br><br>", "<b>Username: confused13</b><br><br>Entadus, what's the hottest it gets at UCI?<br><br>I'm curious about how much better UCI is than UCR, and how much better UCLA is than UCI. Can't exactly quantify it aside from subjective rankings, but how do the differences (UCI to UCR and UCLA to UCI) compare?<br><br>Is JHU really that amazing? I don't want to move across the country if I can get a somewhat equivalent education in-state.<br>Not to mention I've heard it's more about what you do than where you go, at least for pre-med. And just looking at doctors I know, where you went for undergrad isn't the biggest deal once you do well and get a job.<br><br>I also got into Claremont McKenna but its specialty is social sciences, not bio, and it's a bit too small for my liking.<br><br>Oh yeah, and I was afraid including UCR in the title would make people go crazy. It's only up there because of its convenient location, so please try to address UCLA vs. UCI if you can.<br><br>", "<b>Username: Listenkid</b><br><br>For premed i would say UCI has a pretty good program (not as good as UCLA) but since you say social sciences I would recommend UCLA even more. undergrad is not important when you are a doc but it does effect the med school you go to and that is improtant as a doc.<br><br>Waits for people to begin BSing that med schools are completely blind to your undergrad college<br><br>", "<b>Username: GoldShadow</b><br><br>Nobody says that undergrad doesn't matter at all. But the effect is, for all intents and purposes, negligible. You shouldn't consider it as a factor when trying to decide what college to attend.<br>\"\"it does effect the med school you go to and that is improtant as a doc.\"\"<br>Not really, unless you're looking at a career in academic medicine (and even then, it can depend).<br><br>", "<b>Username: confused13</b><br><br>I didn't say I want to do social sciences...<br><br>I've heard horrible things about UCR, and I'm wondering if it's really so awful that its graduates go nowhere in life/don't get accepted to any med schools?<br>I mean it is a UC which makes it better than many Cal States and better than most other states' public school systems.<br><br>UCLA publishes their med school acceptance rates, UCI and UCR don't but I'll email them.<br><br>", "<b>Username: GoldShadow</b><br><br>Medical school acceptance rates are not important in considering where to attend.<br><br>", "<b>Username: Listenkid</b><br><br>Absolutely incorrect. Some UC's like Merced dont even have all there courses fully accredited!!! When people say UCs are good they generally refer to UCLA UCBerekely UCD and UCSD<br><br>", "<b>Username: confused13</b><br><br>^Not UCI???<br>Most rankings I've read place UCI and UCD really close.<br><br>", "<b>Username: Listenkid</b><br><br>UCI is also somewhat okay compared to UCD. But then when you compare UCI its is somewhat okay to UCR.<br>Hoewver, when you go down this path of saying, Well UCB is like JH U. Then UCLA is like UCB. Then UCLA is like UCSD. Then UCSD is like UCD. You slowly deviate.<br><br>If I could graph these schools it would look like the graph of the square root of X.<br>the differences at the low levels are huge<br>UCI is WAY better than UCR<br>UCD is way better than UCI<br><br>UCLA is somewhat better than UCSD<br><br>when you begin to compare UCLA, UCB and JH U they begin to look the same.<br><br>heres the thing. If housing and economics are a huge problem for you I cant argue with it. But you cant say that due to class sizes UCR is in anyway comparable to UCLA. Regardless of how big UCLA is or whatnot its still better the UCR. When people critize UCLA, they critisize it in context to a good school.<br><br>For a good school, it does have its weeknesses. UCR does have its strength<br>However, comparing the two is like comparing a high school senior who somewhat sucks at math to a middle school kid who is in an advanced math class. The two are in different leagues.<br><br>", "<b>Username: Listenkid</b><br><br>UCLA has amazing TA's who help in the very large classes. These TA's are amazing. UCLA actually is actualy not that cutthroat compared to UCB and John Hopkins. Many people who go to UCLA got into \"better\" schools but go there for the fun environment.<br><br>", "<b>Username: somemom</b><br><br>I have a family member who is a prof in sciences at UCR, I have a DD who got a bio degree at UCI and one doing the same at UCB and family member alum of UCLA<br><br>IMHO, UCB and UCLA are more likely to give you the big school, 'real' 4 year college experience. UCI/UCD/UCSB/UCSD are all excellent schools. UCR is lower on the reputation food chain. UCI has a tough tough bio program.<br><br>You have an opportunity to work with amazing profs at UCLA &amp; UCB- I would go there.<br><br>In part I feel this way because I grew up in OC and UCI did not feel like a special experience, but also because it is a commuter school, the experience is just different.<br><br>On the other hand if the regent's is giving you a ton of money and you are full pay at UCB/UCLA, that $25k x 4 years would pay a good deal of med school tuition- assuming you still go- remember a huge percentage of freshman premeds never apply to med schools as seniors<br><br>", "<b>Username: Listenkid</b><br><br>Getting into med school is no joke. 50 percent of students will be rejected from EVERY med school they apply to. Many choose never to apply to med school once looking at their stats. Some people estimate that only about 10 percent of premeds will ever become doctors. Medical Schools are MUCH harder than udnergraduate, How hard you ask? Well harvard undergraduate is barely under 10 percent acceptance rate. Harvard medical school is just under 3 percent.<br>There are only 130 medical schools in the US with very small class sizes. With undergraduate college we like to think we will get into atleast somewhere. With Medical school, its a different story.<br><br>", "<b>Username: confused13</b><br><br>The price isn't a big problem, but I don't want to waste money unnecessarily.<br><br>UCI will cost a lot more than UCR because of housing (I have Regents at both), but UCI is a much better school than UCR.<br><br>UCI with Regents will be cheaper than UCLA but maybe UCLA is truly worth the extra money.<br><br><br>BUT at UCI I will be in the Honors program and a Regents scholar (which has some non-monetary perks as well), while at UCLA I will be neither.<br>Keep in mind I'm doing Bio, which UCI is good for (of course so is UCLA).<br><br>And housing is a big deal. I am considering getting an apartment at UCLA if the alternative is a triple (as long as the price isn't ridiculous). I don't think it's unnecessary because it will really influence my whole experience and I really really like my privacy. Does UCI give freshmen singles?<br><br>Oh yeah, I'd probably come home every weekend from UCI and most weekends from UCLA. So the commuter school stigma shouldn't be a problem.<br><br>", "<b>Username: Listenkid</b><br><br>If you can afford it go to UCLA. Don't go to UCI for the sake of being thrifty. What you need to realize is that when so many of yours peers sacrifice education for money it is because they HAVE to.<br><br>", "<b>Username: confused13</b><br><br>Good point. I just wanted to know if LA is that much better (without Regents and Honors).<br><br>Hmm, so I've been reading that JHU has amazing med school acceptance rates, and excellent research opportunities that UCs are too crowded to offer. I really don't want to move so far. If I do things right, I CAN do research and get into med school from Irvine or LA, right?<br><br>", "<b>Username: Listenkid</b><br><br>I just suggested UCLA cause you were concerned about the cost and competition. If you can afford it JH U is the best choice by FAR. UCB is second best to UCLA but very competitive. JHU gives amazing intern and research options. UCLA and UCB are the same on opportunites. Schools like UCI are a stretch.<br><br>", "<b>Username: theslowclap</b><br><br>Listen kid, I have a few questions for you.<br><br>1. Have you been to any of these schools and actually studied there as a student?<br>2. Are you even in college?<br>3. Rate yourself on how objective you think your statements are.<br><br>I'm probably not going to read your answers so be as snide as your kiddie heart desires. I just wanted you to answer these in case some poor boy or girl decides the next four years based on some misinformation. Good luck to the OP.<br><br>I agree with the Senior members who gave you a response here previously: go where you think you will do your best. The effects of the college you attend in itself is negligible. By the way, so you don't think I'm saying that because I go to a \"lesser ranked\" school, I attend an Ivy League.<br><br>", "<b>Username: Listenkid</b><br><br>Let me tell you a personal story.<br>I was sitting in the office scrambling to finish writing the addresses of my colleges down on my envelopes that I was handing to my counselor for recommendations. Suddenly, I blanked. Was it Boston College or Boston University that was the good one. I looked up and quickly asked my counselor. \"Real quick which is the good one Boston College or Boston University?\" Instead of giving me the real answer which I needed at the time she told me \"Whichever one is right for you.\" She flat out refused to give me an answer due to her stubborn mindset that she had to stick to that collleges were not \"better\" but rather \"different.\"<br><br>I know you go to a Ivy, most of you here go to Ivy's. Wanna know something more? I got rejected from the schools you guys applied to. I am going to either USC or UC Davis which is far below either of your schools (ranking wise.)<br><br>So why am I saying this? It is because its easier for YOU guys to be saying this from the top of the ladder. Its like asking an incredibly rich person \"Does how rich you are born effect how much money you will make in the long run?\" Guess what, the rich typically say. (Pssst, its no)<br><br>Is it just a coincidence that all of you here who are talking about \"picking the school that feels right for you?\" go to Ivys?<br><br>This guy here wants real, solid advice. Not a fair tale about going where you heart tells me. I am the father that if my son told me he wanted to be a painter, Id tell him to go get a real job. I know with your own son many of you guys would do the same, but when it comes to the internet and you are dealing with someone who's future is unimportant to you, it is easy to spew self-satisfying garbage realizing that this guy will be looking at himself 4 years down the line among a row of graduates who he never fit in with cause most of them were 3.0 students back in high school and wishing he went to a respected place.<br><br>Let me give you my creditials in judging this situation. My mother is a Teacher, My father is a doctor, and my brother went to berkley and JH (For a non-medical grad). I personally have been accepted to davis, irvine, and riverside. I have studied the issue extensively.<br><br>When someone asks you to compare schools and you simply answer \"Well whatever feels right\" you aren't helping. This man wants an answer, give it to him, and please dont feed him a fairy tale. I am not accusing you of being in knowledge, I am telling you that you need to be honest and realistic with the guy.<br><br>Here's some DATA for you to look at. It comes from a reputable source, (The AAMC they are the ones who govern the MCAT and much of the medical school process)<br>It will tell you exactly how many kids each college sends to medical school.<br><br>Oh wait, what do you know. It shows numbers from dozens of universities but apparently UCR and UCI did not have enough applicants to even get on the list.<br><br>Lets be real here, UCLA, UCB, and JH U produce ten times the number of medical school students that Riverside does and you are telling me that you \"shouldn't look at that.\"<br><br><br>P.S. Being a **** on the forum for years and posting a link to your sticky each time someone asks a question as opposed to actually answering it does NOT make you into a \"senior member.\"<br><br>", "<b>Username: GoldShadow</b><br><br>\"\"Lets be real here, UCLA, UCB, and JH U produce ten times the number of medical school students that Riverside does and you are telling me that you \"shouldn't look at that.\"\"\"<br>Top students get into medical schools. There are larger numbers of top students at higher-ranked undergraduate universities. Therefore, higher ranked universities will have more students that go on to medical school. You haven't stumbled on some secret or come to some great conclusion, you've simply stated the obvious.<br>\"\"P.S. Being a **** on the forum for years and posting a link to your sticky each time someone asks a question as opposed to actually answering it does NOT make you into a \"senior member.\"\"\"<br>Not the definition of a ****. We post links to stickies and other threads because these exact same questions have been asked a thousand times. That it's \"my sticky\" is irrelevant, I compiled that list as a helpful resource for people that come in here and ask the same questions over and over (and for the great and knowledgeable members who answer them time and time again). It's meant to be helpful for both new members or people with questions (since 95% of them are answered in those threads) and the people who provide answers (since they don't have to repeat their answer for the 800th time).<br><br>", "<b>Username: bluedevilmike</b><br><br>1.) The reality is that the OP doesn't really have any good choices among this list. I've said all along that the UC's are terrible choices, and Hopkins is a pretty tough environment itself.<br><br>2.) GS makes three points, which he probably could have stated more fully for clarification.<br>(A) The direct effect of \"name-branding\" on medical school admissions is small. Probably detectable, but small in comparison to other aspects.<br>(B) It is not particularly important to go to a top-brand medical school, since that doesn't matter to most doctors' careers anyway.<br>(C) Because schools can easily manipulate their admissions percentages through a variety of tricks, this is not a very useful measure of their quality. Other measures are much better indicators.<br><br>These are all true statements.<br><br>For the record, my preferred indicator is average GPA of students admitted to medical school; the lower the better.<br><br>3.) With that said, you should pick the school that feels right for you -- within a loose definition of quality. Unfortunately, Riverside probably doesn't fall into this category. Feeling right is a good reason to choose LA over Berkeley, or vice-versa. Unless you have some kind of crucial family issue (e.g. sick parent or orphaned siblings), I would strongly recommend against Riverside.<br><br>If you do choose Riverside, the game is by no means over, however.<br><br>4.) You will notice that none of the posters here actually endorsed Riverside. What they objected to was the overstatement seen in posts 2, 11, and 13.<br><br>5.) Sometimes (Riverside vs. say, Penn) there is indeed a right answer. Usually most students who are asking for help understand this and have already restricted their choices in this light.<br><br>Therefore, the answer, \"whichever school feels right to you\" is absolutely correct, since most of the easy answers have already been taken off the table.<br><br>", "<b>Username: Listenkid</b><br><br>So what would you suggest. I understand it is the OP's personal choice that he needs to make. But since hes asking for suggestion, what schools would you endorse, or would you just answer the question in an open-ended format.<br><br>", "<b>Username: bluedevilmike</b><br><br>My personal recommendation would probably be one of the \"some others,\" but it's hard to say without knowing what they are.<br><br>As for his preference for staying in California, I can tell him that I fully understand -- I applied ED to my local school as well. When I didn't get in, I was devastated to have to go to a place which was culturally and socially very foreign to me...<br><br>...and it did wonders for my personal growth, independence, and community ties. I loved my four years there and would not trade it for anything. Seeing as much of the country as possible is a healthy part of growth, and in fact it's probably one of the most important things I gained from college.<br><br>", "<b>Username: confused13</b><br><br>\"The reality is that the OP doesn't really have any good choices among this list. I've said all along that the UC's are terrible choices, and Hopkins is a pretty tough environment itself\"<br><br>What is wrong with the UCs, and what do you consider a \"good choice\"?<br><br>edit: I got into UCR, UCI, UCSD, UCB, UCLA, UofToronto, JHU, and CMC so far. Waiting on 2 ivies. Waitlisted at Caltech and Pomona.<br><br>About seeing other parts of the country/world... I've lived in different countries and traveled a great deal throughout America and the world in general. I understand the appeal of moving far away and \"broadening one's horizons\" for people who have spent all their lives in one place, but as someone who travels frequently/has lived in different places I don't think moving far for college is the only way to achieve that growth.<br><br>", "<b>Username: bluedevilmike</b><br><br>I think Pomona would be an excellent choice, actually. CMC is probably fine as well, although their orientation is very government-focused. And then the Ivies are all excellent programs as well, although Penn's my favorite of the eight.<br><br>As for traveling, I have two separate points which I didn't do a very good job of separating.<br><br>1.) Live somewhere culturally very different from your background. In fact, I'd deliberately seek out a place which is culturally very different.<br><br>For example, I'm a Chinese guy. So if I hypothetically had lived in Beijing, Hong Kong, Singapore, Tokyo, and San Francisco, applying ED to Stanford (which I really did) would still mean that I had an extremely limited perspective on the world. (Which I also really did.) I would urge a kid like that to apply to Rice and Duke and WUSTL and Northwestern. If someone had lived in London, Paris, and NYC, I'd urge the kid to apply to Stanford and Pomona. If someone had lived in Dallas and Des Moines and Juneau, I'd urge him to consider Columbia. International living is fine, and vacations are fine, but they don't replace a really culturally diverse experience within the US.<br><br>2.) It's important to move far away for the purpose of independence and personal growth and plugging into the community. I know that had I gotten into Stanford (I live about eighty minutes away), I'd have been home for all the minor holidays; things would have been very different, socially, for me. The sense of being-on-your-own is very irreplaceable, and I always -- always always always -- urge kids to put faraway schools higher on their list than local schools.<br><br>Always.<br><br>", "<b>Username: bluedevilmike</b><br><br>Re: UC's:<br>\"\"<b>bluedevilmike</b>: They're large, competitive schools with literally nonexistent advising, a disproportionately premedical student body, and in UCB's case, no nearby academic clinical facilities for patient exposure. Research at those places is phenomenal but hard for premeds to access relative to a smaller school. Add to that that students there tend to be obsessed with remaining in the highly selective UC system for medical school.\"\"<br>\"\"<b>norcalguy</b>: UCLA's acceptance rate to med school is under 50%. Berkeley is a little better at around 60%.\"\"<br><br>Admissions % isn't a good metric, but gaps <i>this large</i> indicate something.<br>\"\"<b>bluedevilmike</b>: UCB reports on only about 20% of their premedical student body. So you know that 12% of their premeds get in someplace, 8% get in noplace, and 80% don't tell UCB. I'm guessing quite confidently that the actual number is much lower than 60%, since it seems to me that UCB is more likely to hear from the kids who got in someplace.\"\"<br>\"\"<b>norcalguy: </b>let's examine the stats shall we? <a href=\"http://career.berkeley.edu/MedStats/top20.stm\" rel=\"nofollow\">Career Center - Medical School Statistics</a><br><br>Absolutely pathetic numbers. Duke might beat out Berkeley even on absolute numbers.<br><br><a href=\"http://career.berkeley.edu/MedStats/national.stm\" rel=\"nofollow\">Career Center - Medical School Statistics</a><br><a href=\"http://career.ucla.edu/GraduateSchool&amp;PreProfessionalServices/UCLAFourYrMedSchoolAdmissionsHistory.asp\" rel=\"nofollow\">The page cannot be found</a><br><br>49-62% compared with Duke's 85%.\"\"<br>\"\"<b>bluedevilmike: </b>For top-ten admissions, we [Duke] not only beat them absolutely, we more than triple them absolutely (65 in 5 years vs. 44 in 2005, or 13:44). Remove state residency from the equation -- i.e. remove UCSF -- and Duke quintuples UCB per year (8:42).\"\"<br>Don't forget that Berkeley is six times bigger, so a 5x number is really a 30x ratio. Duke is an excellent program, but it's not particularly better than an awful lot of other places.<br>\"\"<b>phillysaser06: </b>When nationally about half of all those are who apply to med school are rejected from all schools to which they apply, and given the overestimation of self-reporting by the uc schools, UCLA and UCB may actually be at or BELOW the national rate. How on earth can it be rationalized that these are good places to be premed when schools like Duke, Penn, Cornell, Columbia, etc. churn out rates well in excess of 80% or 90% in getting students of similar ability (in UCB's case) into med school?\"\"<br><br>", "<b>Username: confused13</b><br><br>How do they know that the Duke, Penn, Cornell, Columbia etc. admitted med students are of \"similar ability\" to the UC ones?<br><a href=\"http://career.ucla.edu/Students/GradProfSchCounseling/MedicalSchoolStatisticsForUCLAGraduates.aspx\" rel=\"nofollow\">UCLA Career Center</a><br>This chart shows UCLA grads' med school acceptances as based on GPA and MCAT scores. Do the other schools you mentioned have this data? That would be very useful to look at.<br><br>Oh yeah, and I would be happy attending Loma Linda for med school as long as I could get in and get a career with that. So what are my chances of getting in there after going to a UC (LA or I)?<br><br>", "<b>Username: bluedevilmike</b><br><br>NCG was probably using incoming SAT scores and GPA to assess that conclusion.<br><br>You can see that more than half -- and probably a lot more than half -- of UCB premeds who actually get to applying do not make it into any school, including Loma Linda. (Which, if you know it, has an extremely particular curriculum which does not fit everybody.) And this is after an extensive weed-out process between hypercompetitive classes, an unsupportive environment, and other negative attributes.<br><br>I don't know of any charts that provide that information; Duke used to publish theirs but no longer does so.<br><br>", "<b>Username: confused13</b><br><br>hm, maybe it's better for me to just go to La Sierra University because of its connection to Loma Linda. Even though it's not as \"prestigious\" or highly-ranked as many others.<br><br>", "<b>Username: bluedevilmike</b><br><br>Aiming specifically for any one medical school is a recipe for failure. When admissions rates are as low as they are, there's too much randomness in the system for this to be a reasonable strategy.<br><br>And besides all that, seriously, are you a Seventh Day Adventist? Loma Linda's open to others, of course, but their curriculum is relatively particular to this worldview.<br><br>", "<b>Username: norcalguy</b><br><br>It's rather alarming to see schools like Berkeley, Emory, and UCLA with acceptance rates near the national average despite having very above average freshman. I don't think it's the students' ability that's in question here but some other factor.<br><br>From my own experiences and from seeing Berkeley's acceptance data to top med schools (MIT and Princeton also released similar data and their applicants did a lot better), I just don't think Northeast med schools really give UC's their due. Despite the fact UCLA and Berkeley are among the top 3 or 4 colleges in the country in producing med school applicants, I saw virtually no Berkeley or UCLA interviewees on my interviews. I went on a lot of interviews and they were just filled with Ivy League, Stanford, Duke, JHU, and WashU applicants but outside of my Michigan interview, I saw maybe 3-4 interviewees from UCLA and Berkeley combined. You can forget about any other UC's. I think the UC's do fine with UC Med schools. I just don't think an out of state med school really knows the difference between UC Davis vs. UC Irvine vs. UC Riverside. I don't even think Harvard Med or any other top Northeast med school gives a crap about Berkeley or UCLA.<br><br>I do think the school name can make a difference, when it's Harvard vs. Berkeley. I just don't think most med schools know that much about the UC's. UC Berkeley and UCLA's acceptance rates that are near the national average is a testament to that. So, in response to this post specifically, I would encourage the person to choose the school that's best for him. If the decision were Berkeley vs. Duke, I'd encourage him to go to Duke, all things being equal.<br><br>", "<b>Username: Listenkid</b><br><br>Now that we got such a good discussion going on. Can I throw in USC, NYU, and UCD. Everyone wanna give me their speel on those.<br><br>", "<b>Username: bluedevilmike</b><br><br>I don't like the UC's and don't know anything about USC or NYU.<br><br>", "<b>Username: somemom</b><br><br>One comment on earlier ratings of UCs; I think they are seen like this:<br><br>UCB/UCLA- these are well known across the US &amp; world<br><br>UCSD- this and below are well known in CA, not so much in the US<br><br>UCI/UCD/UCSB- these are really similarly ranked now &amp; historically<br><br>UCSC- these three are less respected in CA, but still better than most CSUs<br>UCR<br><br>UCM<br><br>I think BDM is not liking the UCs for med school admissions, not for life, so since ya'll are posting on this site take it that way. And he is right, you only get a cookie cutter advising, here is a piece of paper- take the courses on this list!!<br><br>", "<b>Username: somemom</b><br><br>USC &amp; NYU from what I have seen are very similar. If you plan to stay in SoCal, USC is the way to go for future contacts!<br><br>", "<b>Username: bluedevilmike</b><br><br>\"\"I think BDM is not liking the UCs for med school admissions, not for life\"\"<br>Somemom is, of course, correct -- although I also happen to find the city of Berkeley and the greater Los Angeles area absolutely intolerable as well.<br><br>There are many things the UC's do very well. Obviously for careers in engineering or computer science, they're relatively strong schools. In particular, if you are considering a PhD in the hard sciences, Berkeley might be an excellent place to go for undergrad. In other words, the UC's lend themselves well to any of several careers...<br><br>...but medicine is not one of them.<br><br>", "<b>Username: shades_children</b><br><br>I think NYU does fine, med-school-wise. I mean, I turned out okay. I will say I missed the boat in terms of the best timing for applying for medical school, and I'm not sure if that's my fault for not knowing or NYU advising's fault for not telling me. They got my transcripts and committee letters out on time, though.<br><br>", "<b>Username: somemom</b><br><br>And I will let you know how med school apps go for my DD who is at Berkeley and did not plan to be pre-med when she started and has had virtually no Berkeley advising, at least any worth taking ;) Thank you, CC, BDM, NorcalGuy, etc for being here!<br><br>I can say that I do not think my Dd would have done any better at any lesser UC. Her grades get better and better as she moved higher, finds her niche, finds profs &amp; classes she loves, etc. The more inspired she is by higher level teaching, the better she does, so a 'lesser' UC may not have motivated that!!!<br><br>", "<b>Username: confused13</b><br><br>Everyone is talking about northeastern med schools looking down on UCs.<br>I'm not particularly aiming for those schools. I simply want to get into <i>a</i> medical school in this country, and if it's in California (where they do know about UCs), that's great too.<br>So is it really true (this is what I'm getting from the posts) that no one from UCI or UCLA gets into a med school and becomes a doctor?<br><br>", "<b>Username: Listenkid</b><br><br>Its not true, what they are saying is you get lost in the crowd. The student to teacher ratio in UC's is twice what it is in a private university.<br><br>John Hopkins will be competitive, so is life, but there will be good academic adviser and such. The close relations may counterbalance (somewhat) the academic pressure. If I could steal you admission by murdering you, I would. Lets leave it at that.<br><br>", "<b>Username: daman11</b><br><br>that is why premeds scare people<br><br>", "<b>Username: madamebovary</b><br><br>O dear, this thread has really gotten out of control.<br>\"\"So is it really true (this is what I'm getting from the posts) that no one from UCI or UCLA gets into a med school and becomes a doctor?\"\"<br>you must have misread what people have wrote on this board<br><br><b>First, please for goodness sake visit each school you got admitted. </b> You dont want to end up at school where you feel you dont fit in. For ex: if you went to a school where you ended up being the only guy studying while everyone is partying day and night, how would you feel about it?<br><b>Second, take some time to introspect </b> and think about how competitive you will be relative to your peers. You dont want to end up as last place at a super competitive place.<br><b>if you just want to be a doctor and dont care where,</b> i think any of those schools will be fine. Obviously each of us have our own preferences, but as long as you stay above the curve, score MCAT well, and like the place you are at, you should get into a medical school.<br><br>", "<b>Username: bluedevilmike</b><br><br>\"\"is it really true (this is what I'm getting from the posts) that no one from UCI or UCLA gets into a med school and becomes a doctor?\"\"<br><br>Nobody has said this. Don't set up a straw man.<br><br>", "<b>Username: confused13</b><br><br>\"if you just want to be a doctor and dont care where, i think any of those schools will be fine. Obviously each of us have our own preferences, but as long as you stay above the curve, score MCAT well, and like the place you are at, you should get into a medical school.\"<br><br>THANK YOU!!! That's all I wanted to hear but everyone was contradicting each other about how much your school's name matters.<br><br>", "<b>Username: confused13</b><br><br>Well just when I was becoming more sure of UCLA, I got into Dartmouth.<br><br>Based on what I know it has a great environment for me. The housing is great, the students are easy to get along with, the food is perfect. But it is in the middle of nowhere and hard to get to, unlike LA.<br>I don't know many specifics about the academics particularly premed.<br><br>", "<b>Username: bluedevilmike</b><br><br>School's <i>name</i> doesn't matter very much. The schools themselves, however, can sometimes matter a great deal.<br><br>", "<b>Username: Jason2009</b><br><br>Actually UCR is ranked higher than UCI and Its really improving now. Plus They'll have a school of Medicine by 2013 and have a joint program with UCLA<br><br>", "<b>Username: somemom</b><br><br>Just curious, who is now ranking UCR above UCI- I have never seen that any where<br><br>"]}