{"title": "cornell vs upenn vs brown", "comments": ["<b>Username: Viviolay</b><br><br>I need help choosing. I'll be visiting both Cornell and Penn within a few weeks, but wanted other people's insights as well. I'm mainly torn between Penn and Cornell. I always thought Penn was my first choice until I got my likely letter a few weeks before the official notifications from Cornell. It kinda got Cornell in my head early on, and the fact they thought I'd make a great fit for the school makes me thing I might be as well. I'm planning to be an english major while being pre-med and possibly minoring in art. I just got off a web chat with Cornell students and now I went from leaning to Penn to in the middle/leaning to Cornell.<br><br>", "<b>Username: bjomountsi09</b><br><br>Wow, I was in the exact same position. I was all UPenn my sophomore and junior years of high school. Cornell and Brown were definitely lingering in my head around #2 and #3. I visited all 3 and I really just didn't get the lure of Brown at all. That said, I was torn between applying early decision to Cornell or UPenn. Something about Cornell pulled me in that direction eventually and thats where I will be going next year. Both are awesome they are still my 2 favorite schools... there's just something about Cornell thats alluring<br><br>", "<b>Username: Viviolay</b><br><br>Yea. I can't put my finger on that Cornell allure either. I thought I was getting a message to go to Penn last thursday because I met a Penn alum who absolutely loved it and made me really excited about Penn. Then I went on the web chat today and I don't know, I got pulled the other way.<br>The only huge turn off for me about Cornell is the cold, because I deal badly with cold weather. But, I figure I can wear a heavy coat and dealt...And just stay inside.<br><br>", "<b>Username: fudgemaster</b><br><br>The weather is going to be cold at all three schools. I would just choose based on your personal preferences. For me, I chose Cornell over UPenn.<br><br>", "<b>Username: CayugaRed2005</b><br><br>It sounds like Brown is out of consideration, for now.<br><br>And frankly, I don't think there will be much of a difference, academically speaking, between the experience of a pre-med English major at Penn and a pre-med English major at Cornell. Both schools have very strong English and pre-med programs, although Cornell might be a bit stronger when it comes to creative writing.<br><br>So your decision should probably boil down to whether or not you would like to attend a laid-back school in a rural setting or a pre-professional school in an urban setting. The choice is yours!<br><br>Let me know if we can help answer any questions you may have about Cornell. The winters will be marginally worse in Ithaca, but I don't think it should be a game changer.<br><br>", "<b>Username: ilovebagels</b><br><br>Ignore Cornell's mind-games! :P<br><br>Penn is a stronger school, with statistically stronger students. (But who cares, they're all pretty smart :))<br><br>Philadelphia has milder weather (spring will come a month earlier), and offers vastly more to do. Philadelphia has world-class museums, restaurants, shopping, bars, entertainment, and company opportunities. And yet Penn also has a real, complete campus with a tremendous social scene with something for everyone. It may be the only top school that has a balanced and rich on and off-campus life. There are no limits at Penn.<br><br>Heck you can even go to NYC, DC, and Atlantic City--all of which are close by because you're right in the middle of the northeast corridor--the most historic and densely populated region of the United States.<br><br>Plus we get mocked as \"the crappy Ivy\" a good deal less than Cornell ;)<br><br>If you have any questions about Penn and its awesomeness, PM me!<br><br>", "<b>Username: fudgemaster</b><br><br>At least people don't confuse our school with Penn State.<br><br>Out of your list of schools, I would actually choose Brown. Anyway, good luck choosing a school.<br><br>", "<b>Username: chendrix</b><br><br>lol gotta love how insecure Penn State students are about their own (Mental) Institution.<br><br>", "<b>Username: Collegebunny</b><br><br>I was thinking of being an english major while being pre-med as well. They're creative writing program is really interesting:<br><a href=\"http://www.arts.cornell.edu/english/creative/\" rel=\"nofollow\">Department of English at Cornell University | Creative Writing</a><br><br>I am stuck between Cornell and Brown. Even though I already visited, I'm going to visit both one more time and try desperately to find a way to stay overnight before I make my decision. I think you should do the same!<br><br>", "<b>Username: EATYOURCEREAL</b><br><br>It really says something about Penn when someone defending it has to pull out the Crappy Ivy argument (which comes up considerably less than \"Penn=Penn State\") and the \"Cornell students have worse stats\" argument (which is not true in A&amp;S, which is the school the original poster would be in).<br><br>", "<b>Username: MyOpinion</b><br><br>Interesting you are torn between the two least selective schools of the ivy league with the highest admit rate......<br><br>", "<b>Username: Doby</b><br><br>Congratulations on three wonderful acceptances. All three schools are fantastic and you are going to receive a phenomenal education wherever you end up. This is a can't-lose situation, so have some fun choosing. Tens of thousands of exceptional folks would love to be in your shoes!<br><br>", "<b>Username: IHATECEREAL</b><br><br>Cornelians, don't worry, I'll try not to think any less of you from my impression of EATYOURCEREAL. I understand he does not reflect Cornell :)!<br><br>", "<b>Username: Viviolay</b><br><br>Thanks Everyone.<br>I guess I should have added more background info about me. I'm already living in NYC, so I'm used to an urban environment. I really wanted a campus with grass, different than the concrete I'm used to, which both campuses have. I like that Philly is a distinct city, different from NY, but that Penn also has it's own really great campus. However, I like that Cornell is it's own bubble in Ithaca...(I found out Ithaca has a mall in the web chat! So I can live without a ton of other stores.)<br><br>Brown isn't really out of consideration. It's just I really don't know much about it. I'm going to try to visit it before I make my final decision. I'm also visiting both Cornell and Penn back to back overnight, so I hope to make up my mind by then.<br><br>@Doby Thank you =)! I'm really grateful to be able to choose. I appreciate your congratulations.<br>@MyOpinion I don't really care about selectivity since that doesn't indicate what level of education I'll receive. They're both great schools. I'm just trying to figure out which will fit me best.<br>@Everyone else Thanks for your input!<br><br>", "<b>Username: EATYOURCEREAL</b><br><br>IHATECEREAL has an eerily similar username to mine<br><br>he's probably my demented half-brother that we keep in the attic<br><br>", "<b>Username: playhacker</b><br><br>I wouldn't recommend going to UPENN.<br>First, I live in Philly, and the Neighborhood in West Philly is not perfect. The Campus is only 5 blocks in all directions to high crime areas.<br>I wouldn't recommend ever stepping out of your dorm.<br><br>Second, I heard from UPenn Alumnis that they don't pay much attention/devotion to their undergraduate classes. What I mean is, they just teach out of the book and that's it. UPENN is much better if you were a graduate.<br><br>On the light note, Philly isn't a horrible place if you don't visit West/North Philly. Nightlife is great and the weather is moderate throughout all seasons.<br><br>For Brown, I have a friend who is going there. Seems content, but not that happy. Dunno why.<br><br>For Cornell, well, I don't know about it yet, just that it has a lot of majors to choose from, and a mid size college town is more welcoming.<br><br>", "<b>Username: applejack</b><br><br>My experience with many people from Penn (not all) is that the culture there is one that tends to carry a lot more of that machismo swagger and highlight ultimately shallow, meaningless things as if they define oneself (note the earlier post and the general pre-professional angle on the school). There's just something different about Cornell - perhaps the allure to which you alluded.<br><br>You can't go wrong with any of your choices, but based on your posts I'd recommend Cornell for two reasons:<br><br>1. You already live in NYC. You know what city life is and you'll probably go back to it after college. Cornell provides the quintessential \"college\" experience with the large quads and the prominence of the school in Ithaca, as well as the funky, quirky, artsy city of Ithaca itself.<br><br>The natural beauty of the gorges and waterfalls in and around campus provides an environment where you can truly experience something completely different than what you're used to in NYC in a way that can define your college years as a unique and separate period in your life. In the end, cities are cities. Philly and NYC are somewhat different, but the same things you do in NYC you'll do in Philly.<br><br>2. I've found Cornellians are a rather unique bunch, perhaps attributing to Cornell's unique purpose and structure amongst its peers. While you can get everything you want to study at any of those schools, Cornell has always struck me as a place where it's part of the culture to mix seemingly incongruent disciplines and is a place where people meld the practical with the liberal arts rather comfortably.<br><br>But, again, I went there so I can't speak objectively. Just my opinion based on my experience.<br><br>", "<b>Username: dcircle</b><br><br>for what it's worth...<br><br>of the three schools brown is the hardest to get into by a significant margin and most students who have the choice, choose brown over cornell and penn<br><br>more substantive advantages exist for each school and you'll probably have a better guy idea of where you want to be after visiting. in brown's case, you will have one of the best english and art departments (along with the ability to take classes at RISD -- the most prestigious art school in the world), combined with the flexibility to be pre-med at the same time in a low stress environment.<br><br>", "<b>Username: applejack</b><br><br>^^<br>By that logic the College of the Ozarks should be a far superior school to all of them since it has the lowest acceptance rate and the University of Chicago or Northwestern should be joke schools because they have a significantly higher acceptance rate.<br><br>Brown's a great school, but just know that a lot of Cornell's programs are very specialized so they will naturally attract fewer applicants and more acceptances for each individual program.<br><br>It's dangerous to base one's decision on acceptance rates, especially when there's a 2% difference between Penn and Cornell and a fundamentally different mission and purpose for existing between Brown and Cornell. You really can't compare the two.<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"It may be the only top school that has a balanced and rich on and off-campus life.\"\"<br><br>Northwestern? Cal? Virginia? Michigan? Cornell?<br>\"\"Plus we get mocked as \"the crappy Ivy\" a good deal less than Cornell.\"\"<br><br>Wow. So I guess Penn is a bit bitter about their inability to field a decent basketball team over the last couple of years.<br><br>Stay classy, Quakers. Stay classy.<br><br>", "<b>Username: Tboonepickens</b><br><br>\"\"Plus we get mocked as \"the crappy Ivy\" a good deal less than Cornell ;)\"\"<br><br>...Maybe that is because most people don't think that Penn in an Ivy<br><br>", "<b>Username: EATYOURCEREAL</b><br><br>^^^^ post of the year<br><br>", "<b>Username: Cornellian2011</b><br><br>\"\"...Maybe that is because most people don't think that Penn in an Ivy\"\"<br><br>OUCH! That's gotta hurt<br><br>", "<b>Username: grantortue</b><br><br>oh snap ... def the most ballin' reply i've seen<br><br>", "<b>Username: IHATECEREAL</b><br><br>\"^^^^ post of the year \" someone's feeling a bit insecure of himself and his school...<br><br>", "<b>Username: IHATECEREAL</b><br><br>As for the OP, most people these days do not recognize Cornell as a reputable school. Any leftover reputation is just remnants back from the days that Cornell was worth it. The school has been following a downward trajectory for quite some years.<br><br>", "<b>Username: monydad</b><br><br>That's a hoot, however april fool's is over.<br><br>don't be a hater.<br><br>", "<b>Username: Tboonepickens</b><br><br>^^ agreed. I think the Cornell glory days have passed. I think we took a wrong turn when we started teaching agriculture here, I mean geeze, it starts with Corn, then before you know it, you have a FARM in your IVY LEAGUE CAMPUS. What'll they think of next, educating women and the colored folk, not in my lifetime.... [sarcasm off]<br><br>", "<b>Username: kat41911</b><br><br>Speaking of downward trajectories, IHATECEREAL, was it Cornell's acceptance rate or Penn's that *GASP* went UP this year??<br>I'm pretty sure it wasn't Cornell.<br><br>", "<b>Username: chendrix</b><br><br>oh man, and you know? Now their acceptance rates are only 2% apart.<br><br>I wonder sometimes about the mass seppuku that would take place on the Penn campus if we ever had a lower admit rate than them.<br><br>", "<b>Username: monydad</b><br><br>Guess what, when I was applying to colleges, Cornell was, as a matter of fact, more selective than Penn, and had a lower admit rate.<br><br>", "<b>Username: EATYOURCEREAL</b><br><br>and then penn started admitting obscene portions of their class ED<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"and then penn started admitting obscene portions of their class ED\"\"<br><br>Bingo. We have a winner.<br><br>But for what it is worth, admissions rates tell you nothing about the quality of the student body or the caliber of the undergraduate experience.<br><br>", "<b>Username: NJBkitty</b><br><br>Haha I love the whole EATYOURCEREAL and IHATECEREAL name thing... xD<br><br>Anyways I remember you from the chat, Viviolay! I'm almost in the same situation as you (except that my third school is Vassar instead of Brown), and I still have no idea what to do. However, I am spending almost all of next week staying over at all three schools so I get a feel for each one. I <i>really</i> hope that staying over helps, because if not... *sigh*<br><br>Does anyone know if there's a significant difference in the way employers view \"University of Pennsylvania\" vs how they see \"Cornell\"? As in, does one name hold more weight than the other, or are they basically viewed as the same in terms of prestige?<br><br>", "<b>Username: Cornellian2011</b><br><br>It depends what college you're enrolled in at each university. Cornell's engineering program is far more reputed among employers than Penn's, but Penn's Wharton School of Business can't be beat. If you're not considering either of these two colleges at the aforementioned universities, then the prestige difference is negligible. The arts and sciences schools at both colleges, and the remaining colleges at Cornell hold about the same prestige in employers' eyes.<br><br>", "<b>Username: muerteapablo</b><br><br>\"\"Guess what, when I was applying to colleges, Cornell was, as a matter of fact, more selective than Penn, and had a lower admit rate.\"\"<br><br>Brown was known as the worst Ivy until the 70's, and Columbia's admit rate was the same as Cornell's in 1995.<br><br>So what? The only thing that matters is contemporary perception, which is generally based on overall selectivity, US News and World Report, and - if you're from Europe - the THES (Times higher education ranking).<br><br>In all of those, Penn defeats Cornell (and, in fact, Brown and Dartmouth) by a significant margin. The only school with any actual chance at matching us is Columbia.<br><br>Students statistically prefer Penn or Brown to Cornell - between Brown and Penn, the breakdown is 50/50. Yes, that could swing in Brown's favor after this admissions season, but that's unlikely due to their dismal USNWR rank (16th compared to 6th - not really a competition).<br><br>True, Cornell's engineering school is outrageously good, and attracts students even over schools like Yale and Princeton, not to mention Brown and Penn - but the rest of Cornell's colleges are merely on par or far worse than their Ivy League counterparts. It's true that A&amp;S at Cornell compares totally with the equivalent programs at Brown, Penn, Columbia and Dartmouth - but few people would deign to choose it, simply because of the unwanted association with the other, far less prestigious schools at Cornell.<br><br>For proof of this, one need not look further than Ann Coulter's recent invective against Keith Olbermann.<br><br>So, EATYOURCEREAL - you're in A&amp;S, and I consider ourselves peers to the extent of our education and quality of institutions. But you must admit that your fellow Hotelies, ILRies, Hum Ec, and CALS students are generally of lower intellectual wherewithal. I don't see why one would settle for this negative association when they could go to a school that has comparatively little - namely, Penn or Brown.<br><br>The last thing I would look at is Freshman Retention rate. Penn students are generally very happy with their location, and only 180 leave on average after freshman year, while Cornell loses around 550. These numbers are very telling I think; although Cornell students are generally happy, there are a number of complaints they use to describe the school: rigid, unforgiving, etc., whereas Penn students love the flexibility and interdisciplinary nature of their education.<br><br>", "<b>Username: Viviolay</b><br><br>Thanks again to everyone for the replies.<br><br>I'm probably not going to be employed right after college, since I'm going to med school. Are all three schools about equal in the eyes of the top med school admissions? I figure what matters most is that I can go wherever I want to go from any of those three schools.<br><br>I think the fact Cornell is out in Ithaca is part of the allure for me. I do want that classic campus bubble experience without city distraction. But then, I really just loved Penn's campus as well. I happened to visit during fall, and I got to experience the leaves falling during a stroll down Locust Walk. I guess it's a matter of which student body and campus I'll end up liking a bit more.<br><br>I'm not too worried about selectivity. I know Brown's more selective of the three, but I haven't actually been on campus to get a feel for it. I hope to be visiting though, but I have to break out the research on Brown till then.<br><br>@NJBKitty Haha, you were in the chat too =] Lemme know how you decisions go. I might PM you to see what your views are so far.<br><br>Right now, I'm just kinda stressed out. I checked My Penn Plan financial aid, and according to the site, I get a 5k fed loan only...I'm hoping that's a mistake, but if not, I think my decision's been made for me =[....<br><br>", "<b>Username: Endicott</b><br><br>Definitely Penn. Or Brown.<br><br>", "<b>Username: 3togo</b><br><br>3 great choices ... congrats ... you really can't go wrong.<br><br>It sounds like you're truely undecided ... Penn and Cornell are pretty similar as schools however for most I would think the differences in location and feel of students would yield a clear favorite after visits but it seems you're still undecided ... to me this means the choices are very-very close and either probably would be fine.<br><br>Which takes us to an old CC suggestion for situations where someone is truely undecided. Flip a coin to choose ... heads is Penn and tails is Cornell ... flip a coin and the be aware of your reaction to the results. If you're excited by the result the flip probably pointed at your true preference ... if you hesitate at the result then the the flip probably missed your true preference.<br><br>", "<b>Username: dcircle</b><br><br>incidentally, brown also does the best among the three in percentage of students accepted to medical school<br><br>", "<b>Username: ResurgamBell</b><br><br>\"Penn sucks so does Brown...\"<br><br>:D<br><br>", "<b>Username: ResurgamBell</b><br><br>\"\"english major while being pre-med and possibly minoring in art\"\"<br><br>being pre-med are you interested in just the core basic requirements? b/c any school will do just fine for that...<br><br>as far as english i would see what field of english interests you and look at the professors CVs to see which look more interesting (same thing for art)<br><br>some professors dwell in nihilism others in gender studies...<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"The last thing I would look at is Freshman Retention rate. Penn students are generally very happy with their location, and only 180 leave on average after freshman year, while Cornell loses around 550.\"\"<br><br>While most of Muerte's inflammatory statements have been dealt with extensively in the past (see for instance, this thread, <url>http://talk.collegeconfidential.com/cornell-university/581958-upenn-vs-cornell.html?highlight=upenn+cornell+muerte</url>), it's interesting to note that she still can't get her facts straight. Cornell has an entering class size of 3,050 students and a freshman retention rate of 96 percent -- which means that roughly 120 students don't return to East Hill after their freshman year after.<br><br>My only suspicion is that muerte must still be reeling from a) Penn's frustrating basketball season, or b) the fact that FOUR students from the school with \"lower intellectual wherewithal\" were awarded Goldwater scholarships this year (the most -- tied with MIT, and two from CALS, to boot) while Penn students were awarded zero.<br>\"\"I guess it's a matter of which student body and campus I'll end up liking a bit more.\"\"<br><br>I really think that this should be your only consideration. Please let us know if you have any questions on Cornell's student body or campus culture.<br><br>", "<b>Username: monydad</b><br><br>As for \"your fellow Hotelies, ILRies, Hum Ec, and CALS students\"...<br><br>The truth is, as I sit here, an old guy, some of the most successful people of my cohort at Cornell graduated from these schools. There is a guy who owns &amp; manages several of NYC's most successful restaurants; a number of partners in major Wall Street law firms; professors of Biology, doctors, veterinarians,even Keith Obermann- all graduates of these schools, and quite successful.<br><br>These colleges are quite selective in their own right; they are hardly the village idiots, even as an aggregate. But moreover, every distribution contains not just a mean, but also a standard deviation. There are a good number of people at these schools who are in the upper tier of the whole university. In fact, they are so smart that they got themselves a top-flight education for considerably less money.<br><br>Each of these colleges is the very best place of its kind to pursue studies in its respective area. And good students from these colleges do as well as anybody for post-graduate studies. Colleague's kid is just graduating Hum Ec, next stop: med school. 30% of ILR class goes on to law school. And the presence of these colleges enhances what is available to be learned at Cornell in aggegate.<br><br>And provides good ice cream, and a good hotel on campus.<br><br>Some people prefer a more homogeneous environment, some people prefer diversity and more social and academic options. To each their own.<br><br>I know my best friend at Cornell, an engineer, was not much harmed by the presence of the Hum Ec shool. Where his wife-to-be was studying. And I am appreciative of the three excellent courses I took in CALS. And regret not fitting in HDFS with Bronfenbrennner, and wine tasting, among others.<br><br>", "<b>Username: veryscary</b><br><br>What is your religious affiliation? You should select the school that best represents your cultural/faith background.<br><br>", "<b>Username: monydad</b><br><br>That possibly would be a greater point of distinguishment if one was choosing between Notre Dame, Bob Jones University, Brigham Young, and Yeshiva.<br><br>", "<b>Username: CayugaRed2005</b><br><br>Especially considering that two of the institutions were both nonsectarian universities founded by Quakers.<br><br>", "<b>Username: EATYOURCEREAL</b><br><br>\"Brown was known as the worst Ivy until the 70's\"<br><br>No, Penn was definitely the worst Ivy when my parents and aunts and uncles were applying to school.<br><br>I also find it interesting how muerteapablo decided where she wanted to go to college based on a marginal difference between Cornell's and Penn's subsections that SHE WAS NOT EVEN PART OF. So, basically, she didn't like Cornell because she thought the people in the other schools were \"dumb,\" and she went to Penn because the people in Wharton are \"smart,\" despite not being in either of these schools herself. And, on top of that, she somehow believes this will impact how others view her, when in fact employers view A&amp;S at both schools as exactly the same, and to the average simpleton, Cornell is a more prestigious name than Penn.<br><br>So why did I choose Cornell over Penn? I see (and everyone else sees) A&amp;S as equal at both institutions, I preferred Cornell's rural campus to Penn's urban campus, I didn't like the attitudes of many people at Penn, and Cornell hockey>the disaster that Penn basketball has become.<br><br>", "<b>Username: brown2009</b><br><br>But I still think brown is best. I gave<br>Brown 100 points<br>UPENN 70<br>CORNELL 50<br><br>I do not think UPENN , CORNELL should belong to IVYs, they are more like DUKE, WUSL, NW..<br>than HYP, COLUMBIA, DARTMOUTH, BROWN.<br><br>", "<b>Username: EATYOURCEREAL</b><br><br>I gave<br>DARTMOUTH 5000 POINTS<br>COrneLL 48566 POINTS<br>PENN -135 points<br>HOGWARTS 55664300 POINTs<br><br>I AM THE SCOREKEEPER of all the IVYs and deteRMINE WHICH are MORE LIKE DUKE AND wustl AND WHICH are more LIKE HARVARD. BROWN should Not belong to IVYs, and yes, \"IVYs\" is a single entity that owns A FEW PRESTIGIOUS institutions. I ALSO capItALIZE random LETTERS<br><br>", "<b>Username: applejack</b><br><br>^^<br>lol<br>\"\"But I still think brown is best. I gave<br>Brown 100 points<br>UPENN 70<br>CORNELL 50<br><br>I do not think UPENN , CORNELL should belong to IVYs, they are more like DUKE, WUSL, NW..<br>than HYP, COLUMBIA, DARTMOUTH, BROWN.\"\"<br><br>1. The Ivy League is an athletic conference.<br><br>2. Unless you're talking about liberal art \"style\" of the school instead of substance, you can't really make the argument that they don't belong when UPenn and Cornell are consistently ranked higher than Brown.<br><br><br><br><br>I think it's hilarious that Muerte cited Ann Coulter. Says it all right there. It'd be nice if she'd just move on and embrace her new life rather than coming back to reinforce her belief that she transferred to a better school. But, I suspect that the closer their admit rates get, the more we will see of her trying to draw a distinction.<br><br>", "<b>Username: nsrjsyt</b><br><br>applejack,<br><br>good comments.<br><br>thanks<br><br>", "<b>Username: Tboonepickens</b><br><br>Dear OP, I am sorry that this has turned into a cornell V penn war that has NOTHING to do with your interests in either school. That being said, it was the penn students who came on the Cornell board to bash cornell, and used weak arguments to support their school. I am not going to say that the penn students here are indicative of the type of students that penn admits, but I will say that the Penn students here would actually have dissuaded me from choosing penn. I actually think that you should chose Brown because you are pre med. I love cornell, and I think you would too, but Brown has a much higher med school acceptance rate than Cornell does and in the end, you want to be a doctor. Brown is known for grade inflation, and that will help BIG TIME in med school admissions. All of the dick measuring aside, I advise you go to Brown.<br><br>", "<b>Username: Cornellian2011</b><br><br>As Tbone mentioned above, if you're premed, Brown is the way to go. They don't give grades lower than a C and you can take any class you want to pass/fail. It's probably very easy to get a 3.7+ at Brown and this will help you dearly in med school admissions.<br><br>To Muerteapablo and Ilovebagels: You have no right to brag or put down other schools coming from Penn's CAS. Transfer to Penn's real crown jewel, Wharton, and then come back and talk trash... maybe I'll put up with your crap then. Maybe.<br><br>", "<b>Username: ResurgamBell</b><br><br>what are those penn's kid's majors?<br><br>", "<b>Username: Tboonepickens</b><br><br>Last I hear, muerte was linguistics, I dunno what Ilovebagles is.<br><br>", "<b>Username: Viviolay</b><br><br>Again, Id like to thank everyone who contributed.<br><br>@3togo  I might try that flip a coin-see your reaction thing. Ill see how the visits go first.. Thanks!<br><br>@ResurgamBell  Thats a good suggestion. I havent really found one area that I like more than another areaI know some like the classicsothers American lit...I just like taking apart a book or piece and analyzing the language. I appreciate the art of writing and love to pick out the different rhetorical elements and see how they can enhance the content of the piece. Maybe in college, when Im exposed to more areas, Ill find a favorite.<br><br>@Tboonepickens  Its alright. Im a bit sad my thread turned into a mini-war, but I know both are great schools and am not taking the little things into mind.<br><br>@Cornellian2011  Im not sure if I want to go to Brown just for that reason. I like that the system Brown has set up encourages curiosity in different areas, but Id like to believe that I could get a good GPA anywhere I go if I worked hard enough.<br><br>One thing I am somewhat worried is the supposed grade deflation at Cornell, especially since I know I need a great GPA for med school. Is it fact or myth? And if it is fact, to what extent? Is it reasonable and fair grade deflation where you need to really work for an A and not just do the bare minimum or is it the type of deflation where students who deserve a good grade wont receive it? I dont mind working hard to get that A, but I also would like to have a life outside of classes too. Could a current Cornellian or recent alum shed some light on this for me?<br><br><br>Anyway, besides all that, my parents are going to talk to the fin.aid offices at Penn tomorrow. Hopefully, they made a mistake with my fin.aid or it might just be down to Brown or Cornell...=\\<br><br>I guess I should mention, since I let you guys know I am premed, that I got into Johns Hopkins as well. I haven't really considered it too much (and left it out of the first post) due to the cutthroat reputation. I'm not sure that's the type of environment I want in my undergrad years...But it might just be myth. My friends have been discouraging me, but I'm visiting Hopkins anyway.<br><br>", "<b>Username: xSteven</b><br><br>I'd choose Brown over the other two.<br><br>", "<b>Username: Tboonepickens</b><br><br>Cornell does not have near the grade deflation they claim to. They have fairly average grades. I think CAS median is like, 3.2 or something like that. And if you get above a 3.85, which a number of people on this board have, you are almost guaranteed acceptance to a top 25 med school. Regardless, Brown does have inflation, and that helps a lot with med admissions. I would STRONGLY consider brown if you like the hippy habitat there. You would end up working less at brown for the same GPA at cornell. (and this is coming from a kid who hates brown)<br><br>", "<b>Username: Viviolay</b><br><br>Reflecting on my view of Hopkins...How friendly/competitive are students at each school (Brown, Cornell, UPenn, and (if you know) Hopkins)?<br><br>@Tboone I'll keep that in mind,thanks. I'm not really hippy...I'm pretty much in the middle with my views.<br><br>General question: Are med schools aware about the difficulty at different colleges...or is a GPA just a GPA regardless of your school?<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"I dont mind working hard to get that A, but I also would like to have a life outside of classes too. Could a current Cornellian or recent alum shed some light on this for me?\"\"<br><br>There really isn't any grade deflation at Cornell for premeds. You are expected to study hard and to learn the material, but none of the professors are set to hand out Cs just because of spite. Norcalguy can speak extensively on this subject.<br><br>I also think you are right to look beyond the medical school acceptance rates at each institution. In the end, the only acceptance rate that is going to matter is yours, and that will either be a 0 or 1. And I can tell you that school differences between Penn, Brown, and Cornell play a very minor role (if any) in influencing your med school process relative to your own personal characteristics.<br><br>The other thing to note is that these med school admit statistics are notoriously self-reported and incomparable across schools. Some schools may or may not include recent graduates who have also applied to med school. Other schools may or may not include admissions to D.O. programs.<br><br>Let's put it this way: I don't know anybody from Cornell who I felt was qualified to attend medical school who didn't get into medical school. And very few of these individuals I now know in medical school spent their Friday and Saturday nights in the library.<br><br>Also, it appears that the vast majority of the pre-med courses appear to have a B or B+ median. And the English courses tend to have an A- median.<br><br><url>http://registrar.sas.cornell.edu/Grades/MedianGradeFA08.pdf</url><br><br>", "<b>Username: Tboonepickens</b><br><br>GPA is GPA regardless of whether you got it a Uchicago (severe deflation) or brown (severe inflation). I think the competition parts of each school are way overplayed. None of the students at any of these schools will try to sabotage your senior thesis or whatever, even at Hopkins. As a matter of fact, I would say that probably students at ALL of these schools will be friendly. Brown has the least competitive environment.<br><br>About the hippy nature of brown, it is considered the pot head school of the ivy league, much as cornell is considered the agriculture school of the ivy league, and harvard is considered the ****** bag school of the ivy league. Its a stereotype that may or not be true, but it does exist for a reason. There will be a ton of kids with shaggy dark hear that wear tight jeans, flannel shirts moccasins, and smoke cigarettes, if not weed. If you want to know what type of thing Brown students do for fun, look up \"brown SexPowerGod\" on google.<br><br>", "<b>Username: muerteapablo</b><br><br>EATYOURCEREAL, you did not \"choose\" Cornell over Penn. You were never accepted to Penn.<br><br>Also, Brown was indeed considered the worst Ivy League school until the late 60s. Read this, Monydad originally posted it:<br>\" The story of how Brown has come to attract ambitious self-starters as<br>applicants is well-told in Bill Mayher's 1998 book, The College Admissions<br>Mystique. In 1969, Brown's new admissions director James Rogers decided that<br>he ought to be able to exploit the Magaziner-Maxwell curriculum to pull<br>Brown out from underneath the doormat of the Ivy League. And underneath the<br>doormat is where it was.<br><br>When I was applying to colleges at that time, Brown was all but<br>invisible to the college placement office of my prep school. Between Brown<br>and the other Ivies in the pecking order there lay twenty schools, including<br>most of the Seven Sisters, Wesleyan, Haverford, Bowdoin, the service<br>academies, Reed and other top regional schools, and perhaps five top state<br>universities. In New England, Brown was considered better than Trinity and<br>Brandeis, but only barely better. The favorite backup college choices at my<br>prep school were North Carolina, Wesleyan, Penn, and, believe it or not,<br>Stanford (which accepted the bottom-ranked person in my class).<br><br>In the mid-1960s Wesleyan was enjoying a real vogue. It had got rich<br>all of a sudden (Xerox stock), had published Norman O. Brown's Life Against<br>Death, and was helping invent minority recruitment. Because Middletown is<br>close to Providence, Wesleyan has always shared its applicant pool with<br>Brown, and in those days, as Ron Medley may wi****lly recall, Wesleyan was<br>unquestionably the harder place to get into.<br><br>So in 1969, James Rogers of Brown considered his situation and hit on a<br>plan which is now legendary among admissions officers. He hired members of<br>the classes of 1970 and 1971 and sent them out on the road to pitch the<br>Brown Curriculum. Their instructions were to look for students in the second<br>quintile who were lively interviewees and who showed iconoclastic<br>tendencies. The Young Turks of the admissions office made a hit wherever<br>they went and applications rose almost immediately. Rogers was then in a<br>position to implement phase two. He began rejecting students in the top<br>quintile who had made Brown their third choice. Word quickly went round the<br>secondary school placement offices that Brown was no longer easy.<br><br>There was another component of the Rogers strategy, one that Bill<br>Mayher's book misses. Rogers was a preppy from Taft and understood that it<br>is preppies who put elite colleges in fashion. Rogers made Brown<br>prep-friendly. He began to accept twenty and thirty people a year from<br>Andover, Exeter, Choate, St. Paul's, and Harvard-Westlake. He made Brown the<br>first backup choice at the leading schools, and by the mid-1970s, New York,<br>Los Angeles, and the exurbs of America had gotten the message. The seal of<br>approval was given in a 1975 article in the Sunday New York Times, titled<br>\"Everybody Wants to Go to Brown.\" (There have been many such articles since,<br>culminating in a perverse extravaganza in last February's Vanity Fair,<br>titled \"School for Glamour.\") \"<br><br>", "<b>Username: Colm</b><br><br>\"\"EATYOURCEREAL, you did not \"choose\" Cornell over Penn. You were never accepted to Penn.\"\"<br><br>I recall reading EATYOURCEREAL write that he did not apply to Penn, because he already knew that it was not his cup of tea (to put it mildly). He chose to apply to Cornell. I'd call that a clear cut choice.<br><br>", "<b>Username: muerteapablo</b><br><br>It's choice, but it is not \"choosing one school over the other.\"<br><br>For example, if I decided to apply ED to Vanderbilt instead of Harvard, I would not say that I had \"chosen Vanderbilt over Harvard.\" That's misleading, to say the least.<br><br>What EATYOURCEREAL should say is that he chose to APPLY to Cornell over Penn. Of course, that wouldn't allow him bragging rights and it sounds ridiculous, which is why he phrases things differently.<br><br><br>Anyway, I think I'm going to leave this thread now. It's pretty foolish for anyone currently in college to think that Cornell and Penn are on par with each other in any college besides engineering (where admittedly Cornell destroys Penn).<br><br>Sure, their acceptance rates are 2.5% apart, but they still inhabit entirely different planes of the hierarchy. Selectivity is more about SATs and GPA than acceptance rate, and in this regard Penn still easily ranks among Dartmouth, Brown and Columbia, and no this is not all Wharton. Wharton's SAT average is only 14 points higher than CAS, this according to Lee Stetson just before his departure. It's documented in the book From Wharton to Wall Street, which you can look up online.<br><br>People keep telling me that Cornell A&amp;S has the same SAT average as Columbia, Dartmouth, Penn et al, but has this actually been documented? I'd be interested to see it.<br><br>", "<b>Username: Tboonepickens</b><br><br>^ more like 1.89 percent different (according to ivygateblog.com). That is within the margin of error too lol.<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"It's pretty foolish for anyone currently in college to think that Cornell and Penn are on par with each other in any college besides engineering\"\"<br><br>You're right. By academic reputation alone Cornell is a better place to study biology, physics, chemistry, astronomy, classics, sociology, creative writing, English, German, comparative literature, Russian, East Asian studies, landscape design, South Asian studies, labor relations, horticulture, nutrition, food science, human development, plant science, architecture, mathematics, statistics, and hotel management.<br><br>Oh, and basketball too, now, apparently. Keep on having fun in an empty Palestra.<br><br>", "<b>Username: Cornellian2011</b><br><br>\"\"Sure, their acceptance rates are 2.5% apart, but they still inhabit entirely different planes of the hierarchy. Selectivity is more about SATs and GPA than acceptance rate, and in this regard Penn still easily ranks among Dartmouth, Brown and Columbia, and no this is not all Wharton. Wharton's SAT average is only 14 points higher than CAS, this according to Lee Stetson just before his departure. It's documented in the book From Wharton to Wall Street, which you can look up online.\"\"<br><br>You know what? Not that it matters, but it wasn't too long ago that Upenn had nearly a 50% acceptance rate:<br>\"\"As recently as 1992, acceptance rates ranged from 16% for Harvard to 47% for the University of Pennsylvania\"\"<br><br><a href=\"http://www.fact-archive.com/encyclopedia/Ivy_League\" rel=\"nofollow\">Online Encyclopedia and Dictionary - Ivy League</a><br><br>Penn never was all that selective, and even today, relatively speaking, non-Wharton Penn (or Cornell for that matter) is not ultra-selective, but Wharton is.<br><br>For the sake of your psychological health, I would advise you to transfer to Wharton, but it's too bad that you can't... you're an external transfer student at Penn. Apparently, Wharton doesn't permit external transfers to internally transfer into Wharton, since they clearly don't want people backdooring into their school since Wharton is obviously a notch above the rest of Penn:<br>\"\"<a rel=\"nofollow\" href=\"/profile/Penn%20Website\">Penn Website</a> wrote:\"\"<br><br><a href=\"http://www.admissionsug.upenn.edu/applying/transwharton.php\" rel=\"nofollow\">Penn Admissions: Transferring into the Wharton School</a><br><br>", "<b>Username: Tboonepickens</b><br><br>STOP STOP STOP STOP<br><br>we already went through this on the penn v cornell thread,<br>according the the NRC rankings, Cornell and Penn are TIED (cornell outranks penn the same number of times penn outranks cornell)<br><br>THEY ARE ****ING TIED, quit *****ing, they are both great schools, blah blah blah.<br><br>", "<b>Username: Colm</b><br><br>\"\"It's choice, but it is not \"choosing one school over the other.\"\"\"<br><br>If EATYOURCEREAL gave due consideration to both schools, and then applied only to Cornell because he much preferred Cornell for his interests, then he did choose \"over\" Penn. Your parsing here is pointless.<br><br>", "<b>Username: muerteapablo</b><br><br>Cornell is technically WAY better than Dartmouth and Brown for grad school - that's all NRC is though.<br><br>You can't use it to compare undergraduate quality.<br><br>Here are the SAT ranges: <a href=\"http://collegeapps.about.com/od/sat/a/sat_side_x_side.htm\" rel=\"nofollow\">Ivy League SAT Scores - Compare SAT Scores for Ivy League Schools</a><br><br>Notice that Penn/Columbia/Dart/Brown are all far above Cornell, but within range of each other. And as I've said before - Wharton DOES NOT skew the SAT average more than about 4 points - it only makes up 19% of the school, and has only about 10 points higher average.<br><br>Sorry guys, you lose.<br><br>", "<b>Username: IHATECEREAL</b><br><br>Think what you may, but EATYOURCEREAL told me in confidence yesterday that she did apply to Penn and was REJECTED (who saw that coming??). How do I know this you may be asking--well, I am ashamed to say that we are actually long lost Cereal Sisters. Go GIRL! my cereal brings all the boys to the yard...and they're like it's better than yours..<br><br>", "<b>Username: Colm</b><br><br>IHATECEREAL = muerteapablo<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"Notice that Penn/Columbia/Dart/Brown are all far above Cornell, but within range of each other.\"\"<br><br>No. We've been through this before. And your abillity to keep on lying through your teeth and against all documented facts is a rather remarkable quality.<br><br>Notice how the schools at Cornell comparable to Penn/Columbia/Dart/Brown -- CAS and Engineering -- have exactly the same SAT ranges as these schools?<br><br><url>http://dpb.cornell.edu/documents/1000176.pdf</url><br><br>Let me know when Penn or Brown decide to start educating students in horticulture or hospitality. Then we'll be able to compare more apples to apples.<br><br>", "<b>Username: Cornellian2011</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/muerteapablo\">muerteapablo</a> wrote:\"\"<br><br>Wait a second, Penn and Cornell's SAT scores are virtually identical according to the link you posted...<br><br>Cornell's Math Range: 660-770<br>Penn's Math Range: 680-770<br><br>Cornell's Reading Range: 630-730<br>Penn's Reading Range: 650-750<br><br><br>Is that the best you could do? Come on now.... And that's not even accounting for drop in scores caused by the specialty programs that Cornell has. Remove those, and Cornell's would be even higher than Penn's.<br><br>If you would like to provide constructive advice to the OP, the please do so. Otherwise, refrain from making stupid, immature comments and leave. Remember that you represent your school on this forum, and that prospective students may be turned away from Penn due to your idiocy.<br><br>advice to the OP -- it is silly to choose schools based on admissions statistics -- choose the school that you think \"fits\" you best.<br><br>", "<b>Username: Viviolay</b><br><br>@CayugaRed Thank you, that's a relief =] I don't want to go to college feeling I have to overcome some unfair deflation system. I want to go to college to work hard and have fun.<br><br>@Tboone- Alright, thanks =] I'm gonna try to give Hopkins a fair chance and visit for a day too. And I will definitely google \"brown SexPowerGod\".<br><br>@Cornellian - Will do. I'm looking for fit at this point =]<br><br>I'd like to ask everyone who isn't really adding anything to the thread to stop bashing other schools. It's really bumming me out and not really helping. I think all these schools are great, no one has to convince me. I mean, regardless of which one might rank higher in one area or another, they're all pretty much in the top 20 and in the ivy league, so it kinda doesn't matter much at that point...<br><br>What I do like to know is what you feel makes the school special to you. Maybe a personal anecdote about your school or your own unique experience there. Friends, campus, ECs, classes, professors, anything...Something that makes you feel your school is great. Or not, up to you. I understand if you guys are tired of this thread since it kinda took an odd turn...<br><br>", "<b>Username: kartrider360</b><br><br>muertea made a new account I see<br><br>", "<b>Username: EATYOURCEREAL</b><br><br>I did choose Cornell over Penn- I chose to apply ED to Cornell instead of Penn largely because of the attitude of many Penn students that muerteapablo has so perfectly exemplified on these forums.<br><br>", "<b>Username: norcalguy</b><br><br>Can we somehow ban Cornell vs. Penn threads? Always the same old bickering over 2% difference in acceptance rate and 20 points difference in SAT scores. Pathetic.<br><br>", "<b>Username: applejack</b><br><br>...there's something about Duke and UPenn students. It's a remarkably consistent attitude in both real life and on these forums. Likewise, I've always appreciated the way Cornell students seem to keep it all in a little better perspective (just my own observation).<br><br>Viviolay - When I was there, academics aside, I used to love going out to my professor's organic farm for weekend parties and go on wine tours and hike the gorges and see my friends perform on stage in various ways. I also enjoyed having friends from truly divergent backgrounds - from urban poor to farmers to Long Island preppy to NYC / LA chic... Really was an interesting exposure that drove us all to find our common ground.<br><br>I found the breadth of fields Cornell offers precisely what I needed for my personal needs. I would have been miserable at a place like Penn - not because it's in any way a bad school, but just not suited to my interests or needs.<br><br>Like I said before, you've lived the city life. I think it would behouve you to at least consider something different.<br><br>", "<b>Username: Doby</b><br><br>For me, and looking back, it was the friendships that I made at Cornell that mean the most to me today. Because of Cornells (relatively) large size, it took me a little longer than I originally hoped to create strong relationships. But I think for this same reason, when I did find my niche, the friendships I forged were strong and genuine, and made of all the right stuff. And all of my fond memories involve these friends: road trips (spring breaks in Florida, white-water rafting in the Adirondacks, weekend trips to NYC where the drive was half the fun, at least on the way there), getting jobs in the same dining hall so we could spend time together, and dinners that stretched out to past closing time (we had really important things to say, I guess).<br><br>I will admit there were several times that I berated myself for not having chosen a school in a bigger city (my other acceptances were Columbia and Penn). But every year since I graduated, as I moved from one big city to another, my appreciation for the time that I spent in little Ithaca grew. In every new city I moved to, there was some form of Cornell connection, either through direct friends, or friends of. It was awesome when I was working overseas and I was able to host friends I hadnt seen since our days at Cornell. One day were walking across the magnificent arts quad breathing that clean Ithaca air; next thing you know were in a dive bar in Asia poisoning ourselves with dirty air and fun-drinks and reminiscing about our college days.<br><br>At the end of the day, in terms of quality of education, I dont think its going to make a difference which school you choose, especially as I feel that you have exactly the open, analytical, and pragmatic mind that will take you far in life. And I feel that Brown, Penn, and Johns Hopkins are all wonderful schools, and all schools that you would be immensely happy with. I just speak from my own experience, and given a chance to do it all over again, my choice would not change.<br><br>But again, have some fun making your decision. It is not often in life that you will be able to choose from such a wonderful array of opportunities. =) Good luck Viviolay!<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"Can we somehow ban Cornell vs. Penn threads? Always the same old bickering over 2% difference in acceptance rate and 20 points difference in SAT scores. Pathetic.\"\"<br><br>Norcalguy -- Did you see the questions about pre-med grades at Cornell? Thought you might be useful there.<br><br>We should really just write a book about all of these questions that come up over and over again.<br><br>", "<b>Username: dewdrop87</b><br><br>I would be on board with that<br><br>", "<b>Username: NJBkitty</b><br><br>Doby, your post was really helpful. Like I said earlier, I'm also on the fence about Penn v Cornell, and the main thing that's getting to me is that I can't decide what type of environment I want: urban or rural. Being that I live in NYC, I wonder if I'll regret moving to a place that seems so far removed from the hustle and bustle of the type city life I grew up with, but it's comforting to know that you shared the same doubts and came out feeling good about your decision to attend Cornell.<br><br>And I was wondering: is Penn really a party school? What about Cornell? Because I've never been a \"party\" kind of person; I've always enjoyed hanging out with a small group of friends more. Does this mean Cornell would be a better fit?<br><br>Anyway I'm looking forward to visiting the schools next week. Are you staying over at both, Viviolay? You might have said something but I don't remember... haha<br><br>", "<b>Username: muerteapablo</b><br><br>They're both schools where people like to party, although the fraternity life is certainly more widespread at Cornell. Not as much as Dartmouth, but still quite strong.<br><br>Nevertheless, there are plenty of people at both schools who hate partying. You can always find your group or niche; don't let the general perceptions of a school dictate how you act.<br><br>", "<b>Username: CayugaRed2005</b><br><br>^ Uh, could you please stop spamming the threads?<br><br>", "<b>Username: Doby</b><br><br>NJBkitty,<br><br>You will be fine wherever you go. Cornells undergraduate population is large enough that you will find your niche. I have never visited Penn, but given its undergraduate size and diverse academic offerings, Im inclined to say that you will find your comfort zone at Penn as well. There is a place for every person at these schools, its just a matter of finding that place.<br><br>Regarding your potentially missing the NYC speed; I really enjoy city life myself, and for now, I would not want to live in any other setting. Regardless of which school you choose, statistically you will probably end up back in the city following graduation anyway. While I probably will not choose to live in a small city like Ithaca again, I am grateful that I can say that at one point in my life, for what now feels like a very short period, I was given the opportunity to live in a beautiful small-city setting without the stress of big-city life.<br><br>", "<b>Username: Viviolay</b><br><br>Yea NJBKitty. I'm going to Cornell for their diversity weekend and then penn for 3 days as well.<br><br>I'm sad to say I don't think Penn might be an option for me anymore...Their financial aid wasn't a mistake. Apparently, I don't qualify for need-based financial aid at Penn...My family's assets put me out of the running...I was actually crying about it earlier. I guess I don't understand, since other schools were able to give me like 30k in grant money, since my family's income isn't that great even with the assets. (i guess after you take away paying back the utilities and payments and stuff for those assets...I don't know financial aid business is over my head.) So, unless something changes, I don't think I'm going to Penn...I'm actually pretty upset about it. I don't know if it's because I did want to go to it more or because I feel like I got my choice taken away from me...But I shouldn't be sad. I know I should be grateful no matter what because I'm still in a great position..So I'll only be sad for a minute....=]<br><br>Anyways, applejack and Doby, thank you for sharing your posts with me =]. They really helped when I read them last night. I was going to post a thank you last night, but I was dozing off. So thank you =]. I am kinda worried about forging strong friendships at such a big school, but my high school is huge for its size as well...so I definitely know it's possible. And you're right. It won't be often in my life where I won't be in a city. (I'm used to it. I can't imagine living forever not in a city.) But I appreciate time away from concrete and city noise. I'm looking forward to visiting Ithaca.<br><br>", "<b>Username: stargazerlilies</b><br><br>oh god, another Cornell vs Penn thread? Perhaps it would be better to talk about something less controversial, like abortion or religion or politics...<br><br>", "<b>Username: ilovebagels</b><br><br>Sorry to hear Penn screwed you on FinAid. But Cornell is an amazing school and you will have a wonderful and enriching time there, and be well on your way to a promising career in, well, as Ezra said, \"any study\"<br><br>", "<b>Username: hcvops</b><br><br>when you appealed the FA decision, did you show them your packages from other peer schools??<br><br>", "<b>Username: Viviolay</b><br><br>I'm appealing tomorrow. I'm going to send Penn my fin.aid letters from Hopkins, Cornell, and Carnegie Mellon (got in there too...). CMU was the most generous.<br>I figure if Penn sees three other schools with a drastically different aid package (all gave me around 30k),they'll see there maybe was a miscalculation in my aid package. My mom told me they mistook the total value of all our assets as the value of just one asset....(Everybody makes mistakes?)<br>I'm also going to see if I can ask Cornell to consider matching CMU's offer. Worse they can say is no =].<br><br>", "<b>Username: CayugaRed2005</b><br><br>I suspect that CMU's offer was in part a merit-scholarship, in which case neither Penn nor Cornell would be able to match.<br><br>", "<b>Username: Viviolay</b><br><br>Should I not bother to ask then?<br>I know it's kinda normal for students to try to negotiate their fin.aid packages, but the idea of calling the fin.aid tomorrow scares me. I'm not much of a negotiator and don't want to bug them....<br>But then if I don't, I'll wonder if maybe they would've considered it...@<span class=\"__cf_email__\" data-cfemail=\"184758\">[emailprotected]</span> CMU's 37k excluding fed.work study(They said it was a grant, but maybe it was based on merit?). Hopkins is about 33k with fed work study. Cornells was about 31k with the work study. Penn was just that 5k loan.....<br>I figure it's not that much more over the other offers, but if asking could relieve a bit of financial strain, it might be worth it.<br><br>", "<b>Username: NJBkitty</b><br><br>You might as well ask. That's too huge a difference in aid packages. And I thought Penn didn't calculate loans into their packages anyway?<br><br>Besides, if Cornell gave you that much, then Penn must've miscalculated something (since neither school can give merit-based aid). It's worth a shot! :) Good luck.<br><br>", "<b>Username: AstonMartin</b><br><br>Definitely try for Penn<br><br>Penn and Columbia are not on the same level as Cornell, Brown, and Dartmouth<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"Penn and Columbia are not on the same level as Cornell, Brown, and Dartmouth\"\"<br><br>Especially if you want to study Applied Math at Brown or Physics (or Asian Studies or Engineering or Food Science or Architecture) at Cornell. Not at the same level. At all.<br><br>Give me a break.<br><br>", "<b>Username: ilovebagels</b><br><br>To clarify AstonMartin's statement:<br><br>Penn and Columbia are a distinct notch above Cornell, Brown, and Dartmouth for RESEARCH OUTPUT in most NON-ENGINEERING FIELDS.<br><br>For undergrads, they are going to be the same. For engineering, Cornell is going to dominate.<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"Penn and Columbia are a distinct notch above Cornell, Brown, and Dartmouth for RESEARCH OUTPUT in most NON-ENGINEERING FIELDS.\"\"<br><br>Give me another break. Not only are you putting words into AstonMartin's mouth when none were there, but Cornell, Penn, and Columbia are all major comprehensive research universities. Any distinction between those three in aggregate research caliber is slight.<br><br>", "<b>Username: monydad</b><br><br>At Cornell, I took classes in Physics and Chemistry from future Nobel Prize winners, it would seem that their research output was not judged too negatively.<br>There were numerous other departments considered quite strong, in the liberal arts as well as the physical sciences.<br>My recollection is that it was among the \"top ten\" in more areas of graduate research than all but a scant few other universities.<br><br>If someone really wants to delve into this, I found this link, knock yourselves out. I imagine you'll find that which is a \"notch above\" will vary by field, and not necessarily in the direction the poster intended; and more often than not, no \"notch\" is evident.<br><a href=\"http://www.stat.tamu.edu/~jnewton/nrc_rankings/nrc1.html#RANKBYAREA\" rel=\"nofollow\">NRC Rankings</a><br><br>", "<b>Username: Tboonepickens</b><br><br>Once again, to clarify the NRC ranking debate. On the Upenn V Cornell thread about 3 months ago, I looked through the rankings in an attempt to see which school out \"NRC ranks\" the other. I counted the number of times that Penn outranked cornell, and the number of times that Cornell outranked penn and the scores were tied with something like 19 for each and 3 where neither was ranked.<br><br>", "<b>Username: LightBright</b><br><br>My friend got into Penn.<br>I got into Cornell.<br><br>My friend got 5k in loans for fin.aid from Penn.<br><br>I got a 39k grant from Cornell.<br><br>Our income/assets are pretty much the same. He has a sibling, I'm an only child.<br><br>Yeah...<br><br>I would say that Penn just doesn't have the money. But the OP should still appeal. Who knows?<br><br>", "<b>Username: Viviolay</b><br><br>That's a huge difference o.o I don't know what's up. I'll post when/if my fin.aid package changes.<br>Anyway, I'm off to my bus to Cornell in 12 minutes. Hoping for a good time =]<br><br>I came back from Hopkins yesterday,and all my preconceptions were false. A lot of the students were pretty nice. Especially the guys...*smiles* Two held the door open and two more offered to walk me back to my dorm (since it was pretty late) after housing me for a bit when I couldn't find/reach my host. The campus is nice, though I'm not sure it's my style.<br><br>Anyway, off to Cornell.<br><br>", "<b>Username: Gabester</b><br><br>Brown in a heartbeat.<br><br>", "<b>Username: suzystumpjumper</b><br><br>@muertewhatever and others of a like mind---- I was accepted at Penn and Cornell. I chose Cornell, because I've met plenty of Penn students living in Philadelphia the last few years. not impressed. Granted, they were undergrads and I am not, but they were scary in many ways.<br>oh, and i think there's like a 50/50 chance of getting raped @ Penn. seriously though, west philly is not a welcoming/safe environment. Your brand of \"school spirit\" aka \"dear god i hope i made the right decision\" aka \"my self esteem is connected to meaningless lists and rankings\" is really sad.<br>They're all great schools, cornell was just better in my field (MA in CRP-historic preservation) and had more resources.<br><br>", "<b>Username: AstonMartin</b><br><br>Meh...Penn is ranked 8 places higher. You can debate it but it seems like a pretty significant difference.<br><br>", "<b>Username: Colm</b><br><br><a href=\"http://www.arwu.org/rank2008/ARWU2008_A(EN).htm\" rel=\"nofollow\">Academic Ranking of World Universities</a><br><br>Meh...Cornell is 3 places higher. Funny about rankings, Aston, they don't always do what you say.<br><br>", "<b>Username: muerteapablo</b><br><br>Yeah, and Columbia's ranked ahead of Oxford, Yale and Princeton; real convincing.<br><br>", "<b>Username: chendrix</b><br><br>lol and he-she strikes again!<br><br>I knew the **** bait would be too irresistible to pass up.<br><br>", "<b>Username: Tboonepickens</b><br><br>^, its a she, on *********.com, she requested that someone suckle on her engorged clitoris (female anatomy, in case this get edited by a mod)<br><br>", "<b>Username: ilovebagels</b><br><br>\"\"oh, and i think there's like a 50/50 chance of getting raped @ Penn\"\"<br><br>would be impressive if 5000 undergraduates got raped in a single year...<br><br>", "<b>Username: bjomountsi09</b><br><br>lol, UPenn vs Cornell fights... GO BIG RED!<br><br>", "<b>Username: Tboonepickens</b><br><br>according to the NRC rankings, Cornell and Penn are tied, cornell scored higher then penn 19 times, penn scored higher than cornell 19 times, and they were both not counted in 3 categories.<br><br>", "<b>Username: Tboonepickens</b><br><br>And regardless of how they are ranked, no one thinks that penn is as high on the \"ivy list\" as columbia, or right behind HYP or any of that BS you guys spout so much.<br><br>", "<b>Username: muerteapablo</b><br><br>I'm so famous.<br><br>", "<b>Username: chendrix</b><br><br>more like <i>in</i>famous<br><br>", "<b>Username: Colm</b><br><br>^ <i><b>In</b></i>famous. (also gender inconclusive) Ha ...<br><br>", "<b>Username: LightBright</b><br><br>Hate to burst your bubble, muerteapablo, but most people I talk to don't even know U-Penn is an Ivy. They also often confuse it with Penn State.<br><br>Burns, doesn't it?<br><br><br>EDIT: In addition, I don't understand this whole HYP thing. Doesn't it depend on what you're studying? When you think of Yale or Princeton, for instance, the words \"engineering\" don't spring to mind. At all. I didn't even know Yale had an engineering school. :x<br><br>The same goes for Harvard. I'm not saying that they provide subpar educations (I'm sure no matter what you study, you're guaranteed a complete education), they just don't seem as strong as Cornell in those areas.<br><br>At the same time, when I think of Cornell, I don't think \"law school.\" Maybe I think labor relations, but certainly not law school.<br><br>", "<b>Username: Colm</b><br><br>Cornell Law is actually a pretty strong graduate program. <i>The National Law Journal</i> cited Cornell Law as being 6th best in placing graduates to top-50 law firms.<br><br>Also, see <a href=\"http://www.lawschool100.com/\" rel=\"nofollow\">Law School 100</a> where Cornell is right there in the top ten.<br><br>", "<b>Username: IHATECEREAL</b><br><br>\"\"most people I talk to don't even know U-Penn is an Ivy\"\"<br><br>haha, and i bet that one person in your social sphere represents the whole world...<br><br>", "<b>Username: muerteapablo</b><br><br>It's a shame that your friends' ignorance didn't equate to an acceptance letter for you.<br><br>", "<b>Username: Tboonepickens</b><br><br>^ and its a shame that you didn't get into Harvard because your GC screwed up and thee kids ahead of you in rank got accepted. But you know, we all move on... hopefully.<br><br>", "<b>Username: chendrix</b><br><br>It's a shame your endless whoring for prestige will get you nowhere :)<br><br>Remember, you're still only at UPenn. You won't be able to get anywhere in life unless you are at HYP. I mean, random people on the STREET might not know how good USNWR thinks UPenn is. Oh man, and your oblivious dinner guests might not be impressed when you drop the name bomb!<br><br>So sad. Seriously, it's HYP or public seppuku.<br><br>", "<b>Username: ChandlerBing</b><br><br>^ Hahahaha I laughed out loud at that, you're so right ;)<br><br>Honestly.... Cornell, Penn, and Brown are all fantastic. Just pick whichever fits you best.<br>Oh wait, never mind, transfer to HYP or FAIL.<br>lmao<br><br>", "<b>Username: bjomountsi09</b><br><br>hahahaha...<br><br>", "<b>Username: rookie33</b><br><br>everything about this thread reminds me of the kinds of squabbles going on forever between schools, like the UTexas, Austin and Texas A&amp;M thing. A&amp;M has always thought of itself as the premier tech/eng program - but even if it is, who cares. they're still a bunch of farmers (aggies!) out in left field. more important things about a school than how many sharp pencils in your pocket protector. so keep your chicken and sheep studies all to yourselves. philly ain't austin, but ithaca sure resembles college station<br><br>", "<b>Username: ResurgamBell</b><br><br>ithaca does not resemble collegestation...<br><br>our students are more diverse than anything UTAustin has too (:<br><br>", "<b>Username: ChandlerBing</b><br><br>From what I've heard up here in the Northeast, UT Austin is MUCH better than Texas A&amp;M. Frankly, A&amp;M scares the living daylights out of me.<br><br>", "<b>Username: ResurgamBell</b><br><br>i think UTAustin is much better only for the business school, engineering, and planII honors (which are very competitive) but unless you're in these...<br><br>", "<b>Username: LightBright</b><br><br>\"\"<a rel=\"nofollow\" href=\"/profile/IHATECEREAL\">IHATECEREAL</a> wrote:\"\"<br>I said PEOPLE, not PERSON.<br><br>And most, which implies, a MAJORITY.<br><br>Where did you learn to read?<br><br>Oh wait, lemme guess...<br>U-Penn.<br><br>", "<b>Username: muerteapablo</b><br><br>Actually, it's pretty likely he learned how to read well before going to Penn.<br><br>Dumba$$.<br><br>", "<b>Username: Viviolay</b><br><br>If you can't contribute anything positive, then please don't post or bicker =\\...<br><br>Anyways, I'm at Penn with NJBKitty now. We met up at Cornell, had a blast, and met a lot of good people. The campus was awe-inspiring (the weather was surprisingly very good even though the students mentioned it snowed two days before). And honestly, I very much liked it and did not want to leave.<br><br>It's raining now at Penn, though normally I know the campus is beautiful. I think though, I miss the wide open space of Ithaca. I miss the secludedness. But, my mom showed Penn my Cornell financial aid letter with the appeal. Penn basically kicked Cornell's financial aid to the door. I talked with the director of fin.aid yesterday and he worked some magic and surpassed Cornell's financial aid by.....ALOT. They used a huge grant making my parent's contribution 7.5k a year versus Cornell's 18k-ish. Honestly, even if I liked Cornell more, that's hard to say no too. But I'm a bit sad because I think I did like Ithaca more...maybe it was just unusual weather or the amount of fun I had with friends I made there. But I'm really grateful that Penn was so generous, I wasn't expecting that at all.<br><br>Anyway, just an update. Letting everyone know what's going on. Chilling at Penn, thinking alot about big decisions.<br><br>", "<b>Username: Cornellian2011</b><br><br>Well, if you really liked Cornell that much, you can still fax Penn's new offer to Cornell's financial aid offer, and more than likely, they will reduce your contribution drastically. I was in the same situation as you and Cornell beat Penn's offer by $5000 per year after I had already appealed to Penn for more money. I saved $5000 per year( which equates to $20,000 dollars over four years) by sending that appeal letter to Cornell.<br><br>", "<b>Username: Beachlax91</b><br><br>u do realize that u could now appeal to cornell to get the same lower parental contribution, if u tell them that u really would rather go to cornell i bet they would be very accommodating<br><br>", "<b>Username: Cornellian2011</b><br><br>\"\"u do realize that u could now appeal to cornell to get the same lower parental contribution, if u tell them that u really would rather go to cornell i bet they would be very accommodating\"\"<br><br>My point exactly. The folks at Cornell's financial aid office will probably beat Penn's financial aid offer now, in turn saving you even more money. Fax your financial aid offer from Penn to Cornell's financial aid office if you want to pay less to go to college.<br><br>", "<b>Username: muerteapablo</b><br><br>I'm intrigued that you enjoyed the seclusion. Do you also love the frat culture? Because the combination of those two factors make it one of your only options for social release.<br><br>It's supposed to be 70 and sunny today - take that opportunity to fall in love with the beautiful campus.<br><br>Is weather an issue for you? It rains at Cornell all the time. I biked a lot last year, and I would be wet coming to class at least half of the time. There is, compared to places like NY, Philly or Boston, a lot of precipitation. Especially because the hill that Cornell sits on seems to trap storm clouds. Blech.<br><br>You should also realize that it's going to be about 8 degrees warmer in Philadelphia on any given day during the school year. Definitely makes it an easier place to winter.<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"Do you also love the frat culture? Because the combination of those two factors make it one of your only options for social release.\"\"<br><br>Considering two-thirds of the student body aren't in the Greek system, there are plenty of other options for social release.<br>\"\"It rains at Cornell all the time. I biked a lot last year, and I would be wet coming to class at least half of the time. There is, compared to places like NY, Philly or Boston, a lot of precipitation.\"\"<br><br>Really, now? Is this why Philly experiences five more inches of precipitation a year than Ithaca, mostly in the winter months?<br><br><a href=\"http://www.weatherbase.com/weather/weather.php3?s=080427&amp;refer=\" rel=\"nofollow\">Weatherbase: Historical Weather for Philadelphia, Pennsylvania, United States of America</a><br><a href=\"http://www.weatherbase.com/weather/weather.php3?s=471403&amp;refer=\" rel=\"nofollow\">Weatherbase: Historical Weather for Ithaca - Cornell University, New York, United States of America</a><br><br>", "<b>Username: dontno</b><br><br>\"\"Really, now? Is this why Philly experiences five more inches of precipitation a year than Ithaca, mostly in the winter months?<br><br>Weatherbase: Historical Weather for Philadelphia, Pennsylvania, United States of America\"\"<br><br>OK that's just straight pwnage.<br><br>Ithaca weather is not as bad as everyone says. I actually quite like walking up Libe Slope covered in bright white snow, sun coming up over Olin Library. Yes it snows, but minimally more than other Northeastern cities. Is it a little windy? Yea probably, but I'd rather have a crisp wind than smog and bums. (Short anecdote: My friend went to UPenn and one night he got drunk and gave a bum a beer. The bum showed up for a week every morning on his porch asking for more alcohol.)<br><br>", "<b>Username: ResurgamBell</b><br><br>a nurse practicioner (MDs back off) told me that ithaca is the 2nd cloudiest city in america...<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"a nurse practicioner (MDs back off) told me that ithaca is the 2nd cloudiest city in america...\"\"<br><br>That's great, Resurgam. Instead of doing your homework and actually discovering the facts about things you resort to heresy and rumors.<br><br>It doesn't take much googling to figure out that virtually all of the major cities in the Pacific Northwest have significantly more cloudy days than Upstate New York.<br><br>", "<b>Username: Colm</b><br><br>\"\"a nurse practicioner (MDs back off) told me that ithaca is the 2nd cloudiest city in america...\"\"<br><br>Your nurse practitioner needs to take a class or two in meteorology, lol. Ithaca is actually 18th on the list. Cities like Seattle, Portland -- and many others -- actually have more cloudy days:<br><br><a href=\"http://www.123syracuse.com/cloudycities.html\" rel=\"nofollow\">Cloudiest Cities</a><br><br>", "<b>Username: ResurgamBell</b><br><br>point is that philly isnt on that list...<br><br>now i'm not here to support upenn over cornell...but the facts are there...<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"point is that philly isnt on that list...\"\"<br><br>Philly has 160 cloudy days a year. Or roughly 3 more cloudy days a month, on average.<br><br>I can think of a lot more important things to base one's college decision than 3 more cloudy days a month.<br><br>", "<b>Username: Colm</b><br><br>@Resurgam - The \"point\" is that you posted, in this case, data that is significantly wide of the mark. Also, Cayuga reads the actual data perfectly above.<br><br>", "<b>Username: hopingdad</b><br><br>Rainy Days (huge difference!):<br>Philly = 117 Rainy Days<br>Ithaca = 67.6 Rainy Days<br>(<a href=\"http://www.weatherbase.com/weather/weather.php3?s=56937&amp;refer=\" rel=\"nofollow\">Weatherbase: Historical Weather for Ithaca, New York, United States of America</a>)<br><br>Precipitation (Philly has 16% more precipitation):<br>Philly = 40.9 inches<br>Ithaca = 35.3 inches<br><br>", "<b>Username: Colm</b><br><br>^Thanks, Hopingdad, for digging deeper and giving us some very enlightening weather statistics!<br><br>", "<b>Username: Viviolay</b><br><br>Just wondering how my mom should go about negotiating with Cornell fin.aid office. When I visited, the fin.aid lady flat out said \"We don't match other schools\" which I know is a lie because NJBkitty was standing with me in that room and already got them to raise her fin.aid close to Penns..<br>Should my mom ask to talk to like a fin.aid assistant director or something? (My mom will be calling them. I'm traveling again.)<br>And will a printout of my online Penn financial aid revision be enough? They just changed it so I don't expect a revision letter in the mail for a while.<br><br>", "<b>Username: Cornellian2011</b><br><br>\"\"Just wondering how my mom should go about negotiating with Cornell fin.aid office. When I visited, the fin.aid lady flat out said \"We don't match other schools\" which I know is a lie because NJBkitty was standing with me in that room and already got them to raise her fin.aid close to Penns..<br>Should my mom ask to talk to like a fin.aid assistant director or something? (My mom will be calling them. I'm traveling again.)<br>And will a printout of my online Penn financial aid revision be enough? They just changed it so I don't expect a revision letter in the mail for a while.\"\"<br><br>Yes, they definitely do match need-based financial aid offers from other schools. That is why I am at Cornell right now and not Penn.<br><br>I faxed the official Penn financial aid offer to the Cornell financial aid office and they basically gave me wayyyy more money than Penn. I don't know what you should do in your situation though... I'm not sure if a printout of your online Penn financial aid revision will be enough. Definitely call them, and tell them about your situation. They should be understanding. Best of luck!<br><br>", "<b>Username: muerteapablo</b><br><br>\"\"Really, now? Is this why Philly experiences five more inches of precipitation a year than Ithaca, mostly in the winter months?\"\"<br><br>Are you all completely stoned? Either that, or you're just extremely poor with data extraction.<br><br>Penn has more rain because it's WARMER.<br><br>Cornell has almost as much rain, and WAY MORE SNOW!<br><br>Check it out:<br>Philly average snowfall: 20.8 inches<br>Ithaca average snowfall: 66 inches<br><br><a href=\"http://www.weatherbase.com/weather/weather.php3?s=080427&amp;refer=\" rel=\"nofollow\">Weatherbase: Historical Weather for Philadelphia, Pennsylvania, United States of America</a><br><a href=\"http://www.weatherbase.com/weather/weather.php3?s=471403&amp;refer=\" rel=\"nofollow\">Weatherbase: Historical Weather for Ithaca - Cornell University, New York, United States of America</a><br><br>That's a whopping 300% difference there, folks. Kind of makes the rain difference seem, I don't know... completely insignificant?<br><br>", "<b>Username: muerteapablo</b><br><br>Honestly, your stupidity makes me want to throw up. Especially since your wording was so self-righteous.<br><br>I'm truly aghast that you missed such a giant step in your analysis. Snow is what keeps the roads wet and slick for so much of the winter at Cornell! In Philadelphia, that's 70% less of a problem.<br><br>I really can't believe you tried to seriously argue that you had better weather.<br><br>Dear god almighty.<br><br>", "<b>Username: muerteapablo</b><br><br>Yes, I realize that I specified rain, but what I meant was wetness - what makes pedestrians and bikers wet, need not only be rain. Snow is also made out of water.<br><br>I still can't believe that you overlooked SNOWFALL of all things.<br><br>And just so you know: the only reason that Philly has 5 inches more rain that Cornell, is because it's actually WARM enough here to rain - that stuff would come down as snow in Ithaca, where it's 8 degrees colder. That temperature difference goes a long way when it's 38 and raining and Philly, and 30 and snowing hard in Ithaca.<br><br>", "<b>Username: Colm</b><br><br>^To paraphrase the Bard: \"The inconclusive lady-or-man doth protest too much.\"<br><br>", "<b>Username: muerteapablo</b><br><br>\"\"^To paraphrase the Bard: \"The inconclusive lady-or-man doth protest too much.\"\"\"<br><br>This is a meaningless statement. Do you think I'm trying to cover something up? What? That you guys are buffoons who are utterly incapable of cogent argument?<br><br>The data is all on the weather sites that Cayuga2005 or whoever posted.<br><br>All you have to do is look at the 40 inch-difference in snowfall, and you realize how idiotic he was to write that.<br><br>", "<b>Username: Colm</b><br><br>Why did you first list yourself as a guy, and then list yourself as a girl, on these boards? This fact seems to say something about your trustworthiness right up front.<br><br>", "<b>Username: CayugaRed2005</b><br><br>\"\"I'm truly aghast that you missed such a giant step in your analysis. Snow is what keeps the roads wet and slick for so much of the winter at Cornell! In Philadelphia, that's 70% less of a problem.<br><br>I really can't believe you tried to seriously argue that you had better weather.\"\"<br><br>I actually think its your analysis that is a bit shoddy, muerte. Anybody vaguely familiar with meteorological principals realizes that precipitation includes both snow and rain. To control for the differing moisture content of snow and rain, meteorologists melt the snow to determine the amount of water that has come down from on high.<br><br>So, yes, Ithaca gets absolutely less wet stuff falling from the sky than Philadelphia.<br><br>Beyond this, there is the fact that I think most people would agree with me that they would much rather experience 25 degrees and snowing than 35 degrees and raining. There is nothing worse than a cold, drenching rain. Snow just brushes right off, and actually serves as a heat insulator, believe it or not.<br><br>", "<b>Username: NJBkitty</b><br><br>Going back a little in the conversation... about the finaid, is it true that Cornell usually <i>beats</i> other offers? Because for me, they just barely matched Penn. Actually, Cornell still ends up being a bit more expensive... :/<br><br>", "<b>Username: dontno</b><br><br>This Penn vs Cornell (and Brown and Dartmouth) feud is ridiculous. I went into Cornell thinking it was a top 5 school. I was wrong, it isn't, and neither is Penn (I don't care what US News says). Just accept it. Cornell and Penn are not at the same level as HYP. They're just not.<br><br>Comparing Cornell and Penn is splitting hairs. Most people confuse Penn with Penn State (I know this b/c I've personally seen it happen to one of my friends). Most people consider Corenll the Ivy League safety (but we're catching up Penn, with a much bigger size even!!) or the Ivy League public school. It's dumb. They both offer great educations and while there are plenty of dummies at both places, many students are capable and if they're not, at least they try hard and care about academics. Neither of this schools will be Harvard or Princeton, so get over it. No amount of message board snickering will change that.<br><br>", "<b>Username: muerteapablo</b><br><br>Dude, no one thinks Cornell is top 5, and Penn isn't HYP either, but you have to admit that, TRUE OR NOT (and the distinction is hazy, I'll be the first to say it), Columbia, Penn Brown and Dartmouth are considered by the vast majority of kids applying to college to be a tier above Cornell.<br><br>What effect does this have on education? 0. So who cares? Stop arguing about it.<br><br>", "<b>Username: dontno</b><br><br>\"\"Columbia, Penn Brown and Dartmouth are considered by the vast majority of kids applying to college to be a tier above Cornell.\"\"<br><br>I'm honeslty not sure. I wouldn't completely rule that out. However, I do know that the average person on the street will be impressed equally by Columbia, Dartmouth, Brown, and Cornell. You'll only garner a 'wow' if it's HYP.<br><br>", "<b>Username: muerteapablo</b><br><br>Actually, you'll never garner a \"wow\", because most people have enough self-respect to not trip over themselves when they meet people who have/had more connections than they do. And from my experience, all of the Ivies - including Cornell - get that \"wow\" that you're talking about.<br><br>", "<b>Username: applejack</b><br><br>While obviously in general Cornell doesn't match HYP, for many fields it is the absolute top or in the top 5.<br><br>I've studied at both Harvard and Cornell and found Cornell's vast resources and breadth of fields to offer a far superior education for me personally.<br><br>Again, though, reputation-wise, obviously no one is confusing the two. Cornell's the Ivy that gets its hands dirty so it will never win a game of \"prestige\" from people indoctrinated into the elite prep school culture and all the values that go along with it.<br><br>", "<b>Username: Colm</b><br><br>\"\"Cornell's the Ivy that gets its hands dirty so it will never win a game of \"prestige\" from people indoctrinated into the elite prep school culture and all the values that go along with it.\"\"<br><br>Applejack, this is true even for one of the programs that Cornell is generally considered number one in  architecture. It is telling that Rand Hall, the building that until recently housed most of the architectural students studio activities, is joked about for being a bit ragged at the edges. They have known how to get their hands dirty for over a century ... hope this vibe doesnt change too much after Milstein Hall gets built, along with its periphery renovations.<br><br>", "<b>Username: applejack</b><br><br>I always envied the Architecture students.<br><br>Their mission is so singular and they spent so many endless hours locked away in their studios in Rand. They created their own little subculture and would always put signs in those dirty windows of that ratty old building full of so much character.<br><br>It's clearly an intense but rewarding experience that I never had given my more diffuse academic pursuits.<br><br>I also hope the new facilities foster such an experience for them.<br><br>", "<b>Username: cmburns14</b><br><br>about Cornell or Penn not being HYP, top 5:<br><br>if you think HYP is better than you, HYP is better than you.<br><br>it's all perception, have some self respect. These two schools, Upenn and Cornell, get trashed a lot because they are the biggest in the ivy league- the more seats you have, the more seats you need to fill, hence the average SAT over 2,300 or 3,300 students respectively will be a bit lower than Princeton with a class size of 1,150. The top 20-25% at Penn and Cornell score over 2250, so that is still about 600 kids at Penn and probably 800 kids at Cornell...<br><br>when I was an undergrad at Oxford I didn't spend that much time wondering what my life would be like at Cambridge. My friends who were at Imperial, Durham, LSE, etc. didn't care about Oxbridge at all, they had better things to do.<br><br>who is paid more in the job market? a chemical engineer from Cornell or a history major from Yale?<br><br>", "<b>Username: Colm</b><br><br>\"\"it's all perception, have some self respect.\"\"<br><br>Perception is only half the battle, the other half has to due with more factual and functional attributes of a university. Also, the vast majority of Cornellian's have their well earned share of self respect, thank you very much.<br>\"\"These two schools, Upenn and Cornell, get trashed a lot...\"\"<br><br>They do not get trashed a lot, but rather just a bit more than is fair (in certain quarters). <i>All</i> schools get some degree of negative spin by partisans in competing institutions -- even HYP.<br><br>", "<b>Username: Helicio</b><br><br>Duke, Stanford, MIT, Caltech, and all the ivies get WOWS. No use arguing over it.<br><br>", "<b>Username: alvie.singer</b><br><br>Do Penn and Cornell really get trashed a lot? I haven't experienced much negativity.<br><br>I got into Penn, Dartmouth, Columbia, et al., and I chose Penn. I'm from NYC, though, which is very pro-penn. I dunno.<br><br>I think Cornell is good too, although I have heard the whole, \"easiest to get into, hardest to graduate from,\" thing a few times. They're all excellent schools.<br><br>I looked over this thread, and I think you guys are taking some of the comments incorrectly. The argument was about undergraduate student quality and selectivity, not the academic excellence of each department - obviously, Cornell has some of the best departments in the country in many fields. However, the undergraduate colleges are often denigrated - stupidly - due to the whole \"state-school\" stigma.<br><br>", "<b>Username: Colm</b><br><br>Cornell has no more \"state school\" stigma than Penn does (Penn is often confused with Penn State by ignoramuses). This is because almost all people who matter -- that is potential employers, post-grad admissions reviewers, and educated people in general -- clearly know that both these Ivy League schools are private ... that a few of Cornell's colleges are partially state supported does not alter their status as private institutions.<br><br>", "<b>Username: fudgemaster</b><br><br>Actually, probably the most frequent comment I get about Cornell is the high suicide rate.<br><br>", "<b>Username: Colm</b><br><br>^ You mean the occasional completely <i>false</i> allegations spread by the ignorant and/or ill-intentioned competition, right?<br><br>"]}